#Область ПрограммныйИнтерфейс    

#КонецОбласти

#Область ПроцедурыИФункцииБазовые

// Функция, вызываемая перед началом работы системы.
//
Функция ПередНачаломРаботыСистемы() Экспорт
	
	Если глПодключаемоеОборудование = Неопределено Тогда
		глПодключаемоеОборудование = Новый Структура();
		глПодключаемоеОборудование.Вставить("ДрайвераПодключаемогоОборудования", Новый Соответствие());
		глПодключаемоеОборудование.Вставить("ПараметрыПодключенияПО"           , Новый Массив());
		глПодключаемоеОборудование.Вставить("ПоследнийСлипЧек"                 , "");
		глПодключаемоеОборудование.Вставить("ЗавершениеРаботыСистемы"          , Ложь);
	КонецЕсли;
	
КонецФункции

// Функция, вызываемая при начале работы системы.
//
Функция ПриНачалеРаботыСистемы() Экспорт
	
#Если Не ВебКлиент Тогда
	ПереустановитьПомеченныеДрайверы();
#КонецЕсли

КонецФункции

// Функция, вызываемая при начале работы системы.
// Выполняет подготовку данных механизма.
Функция ПередЗавершениемРаботыСистемы() Экспорт
	
	НачатьОтключениеВсегоОборудования();
	
КонецФункции

// Выполнить настройку оборудования.
// 
Процедура ВыполнитьНастройкуОборудования(Идентификатор, ОповещениеПриЗавершении = Неопределено) Экспорт

	Результат = Истина;
	
	ДанныеУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьДанныеУстройства(Идентификатор);
	ПараметрыФормы = Новый Структура("ПараметрыОборудования", ДанныеУстройства.Параметры);
	ПараметрыФормы.Вставить("Идентификатор", Идентификатор);
	ПараметрыФормы.Вставить("ДрайверОборудования", ДанныеУстройства.ДрайверОборудования);
	
	ФормаНастройки = "ФормаНастройкиУниверсальныйДрайвер";
	
	ОбработчикДрайвера = МенеджерОборудованияКлиентПовтИсп.ПолучитьОбработчикДрайвера(ДанныеУстройства.ОбработчикДрайвера, Не ДанныеУстройства.ВСоставеКонфигурации, ДанныеУстройства.ТипОборудованияИмя);
		
	Если Не ОбработчикДрайвера = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент 
		И Не ОбработчикДрайвера = ПодключаемоеОборудованиеУниверсальныйДрайверАсинхронноКлиент Тогда
			ФормаНастройки = СтрЗаменить(ДанныеУстройства.ОбработчикДрайвераИмя, "Обработчик", "ФормаНастройки");
	КонецЕсли;
		
	Если НЕ ПустаяСтрока(ФормаНастройки) Тогда
		ПараметрыКоманды = Новый Структура("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
		Обработчик = Новый ОписаниеОповещения("ВыполнитьНастройкуОборудования_Завершение", ЭтотОбъект, ПараметрыКоманды);
		ОткрытьФорму("ОбщаяФорма." + ФормаНастройки, ПараметрыФормы,,,  ,, Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Произошла ошибка инициализации формы настройки драйвера.'")); 
	КонецЕсли;
	
КонецПроцедуры

// Завершение настройки оборудования.
// 
// Параметры:
// 	Результат - Структура - где:
//  * Идентификатор - СправочникСсылка.ПодключаемоеОборудование - экземпляр подключаемого оборудования.
// 	* ПараметрыОборудования - Структура - структура параметров.
// 	Параметры - Структура - структура параметров выполнения операции.
//
Процедура ВыполнитьНастройкуОборудования_Завершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		РезультатЗавершения = Ложь;
		Если Результат.Свойство("Идентификатор") И Результат.Свойство("ПараметрыОборудования") Тогда
			РезультатЗавершения = МенеджерОборудованияВызовСервера.СохранитьПараметрыУстройства(Результат.Идентификатор, Результат.ПараметрыОборудования);
		КонецЕсли;
		
		Если РезультатЗавершения Тогда 
			ОбновитьПовторноИспользуемыеЗначения();
		Иначе
			СообщениеОбОшибке = НСтр("ru='Не удалось сохранить параметры устройства.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
		КонецЕсли;
		
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатЗавершения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Сохраняет пользовательские настройки подключаемого оборудования.
//
Процедура СохранитьПользовательскиеНастройкиПодключаемогоОборудования(СписокНастроек) Экспорт
	
	МенеджерОборудованияВызовСервера.СохранитьПользовательскиеНастройкиПодключаемогоОборудования(СписокНастроек);
	
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

// Открытие формы списка рабочих мест.
//
Процедура ОткрытьРабочиеМеста(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ОбновитьРабочееМестоКлиента();
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.РабочиеМеста.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

// Процедура для выбора рабочего места текущего сеанса.
//
Процедура ВыбратьРМТекущегоСеанса(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("ПредложитьВыборРабочегоМестаЗавершение", ЭтотОбъект);
	ПредложитьВыборРабочегоМеста(Оповещение);
	
КонецПроцедуры

// Открытие формы подключаемого Оборудования.
//
Процедура ОткрытьПодключаемоеОборудование(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ОбновитьРабочееМестоКлиента();
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

// Функция предоставляет диалог выбора рабочего места.
// 
Процедура ПредложитьВыборРабочегоМеста(ОбработкаОповещения, ИдентификаторКлиента = "") Экспорт

	Результат = Ложь;
	РабочееМесто = "";
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ИдентификаторКлиента", ИдентификаторКлиента);
	
	ОткрытьФорму("Справочник.ПодключаемоеОборудование.Форма.ФормаВыбораРабочегоМеста", ПараметрыФормы,,,  ,, ОбработкаОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

// Завершение выбора рабочего места.
//
Процедура ПредложитьВыборРабочегоМестаЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("РабочееМесто") Тогда 
		УстановитьРабочееМесто(Результат.РабочееМесто);
	КонецЕсли;
		
КонецПроцедуры

// Функция устанавливает рабочее место.
// 
Процедура УстановитьРабочееМесто(РабочееМесто) Экспорт
	
	МенеджерОборудованияВызовСервера.УстановитьРабочееМестоКлиента(РабочееМесто);
	Оповестить("ИзмененоРабочееМестоТекущегоСеанса", РабочееМесто);
	
КонецПроцедуры

// Выполняет обновление имени компьютера в параметре сеанса "РабочееМестоКлиента".
//
Функция ОбновитьРабочееМестоКлиента() Экспорт
	
	Результат = Истина;
	
	РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
	
	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда
		СистемнаяИнформация = Новый СистемнаяИнформация();
		
		МассивРабочихМест = МенеджерОборудованияКлиентПовтИсп.НайтиРабочиеМестаПоИД(ВРег(СистемнаяИнформация.ИдентификаторКлиента));
		Если МассивРабочихМест.Количество() = 0 Тогда
			Параметры = Новый Структура;
			Параметры.Вставить("ИмяКомпьютера");
			Параметры.Вставить("ИдентификаторКлиента");
			
			#Если Не ВебКлиент Тогда
				Параметры.ИмяКомпьютера = ИмяКомпьютера();
			#КонецЕсли
			
			Параметры.ИдентификаторКлиента = ВРег(СистемнаяИнформация.ИдентификаторКлиента);
			РабочееМесто = МенеджерОборудованияВызовСервера.СоздатьРабочееМестоКлиента(Параметры);
		Иначе
			РабочееМесто = МассивРабочихМест[0];
		КонецЕсли;
		
	КонецЕсли;
	
	Если Результат
		И РабочееМесто <> МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента() Тогда
		МенеджерОборудованияВызовСервера.УстановитьРабочееМестоКлиента(РабочееМесто);
		Оповестить("ИзмененоРабочееМестоТекущегоСеанса", РабочееМесто);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет структуру выполнения операции на Оборудовании.
// 
Функция ПараметрыВыполненияОперацииНаОборудовании(Результат = Ложь, ОписаниеОшибки = Неопределено, ИдентификаторУстройства = Неопределено) Экспорт; 
	
	РезультатВыполнения = Новый Структура();
	РезультатВыполнения.Вставить("Результат"              , Результат);
	РезультатВыполнения.Вставить("ОписаниеОшибки"         , ОписаниеОшибки);
	РезультатВыполнения.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	РезультатВыполнения.Вставить("ВыходныеПараметры"      , Неопределено);
	Возврат РезультатВыполнения;
	
КонецФункции

// Процедура выбора устройства из доступных, привязанных к текущему рабочему месту.
//
Процедура ПредложитьВыбратьУстройство(ОповещениеВыбора, ТипОборудования, ТекстЗаголовкаВыбора, 
	СообщениеНеПодключен = "", СообщениеНеВыбран = "", БезСообщений = Ложь, ТекстСообщения = "",Пробить=Ложь) Экспорт
	
	Если Не ОбновитьРабочееМестоКлиента() Тогда
		ТекстСообщения = НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");
		Если Не БезСообщений Тогда
		      ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СписокДоступныхУстройств =  МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(ТипОборудования);
	
	Если СписокДоступныхУстройств.Количество() = 0 Тогда
		Если Не ПустаяСтрока(СообщениеНеПодключен) Тогда
			Если БезСообщений Тогда
				ТекстСообщения = СообщениеНеПодключен;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеНеПодключен);
			КонецЕсли;
		КонецЕсли;
		ВыполнитьОбработкуОповещения(ОповещениеВыбора, Неопределено);
	Иначе
		СписокУстройств = Новый СписокЗначений();
		Найдено = Ложь;
		Для Каждого Устройства Из СписокДоступныхУстройств Цикл 
			Если омг_WebKassa.ПроверкаУстройстваВебкасса(Устройства.Ссылка) и Пробить Тогда 
				Найдено = Истина;
				Идентификатор = Устройства.Ссылка;
				ВыполнитьОбработкуОповещения(ОповещениеВыбора, Идентификатор);
				Прервать;
			КонецЕсли;	
			СписокУстройств.Добавить(Устройства.Ссылка, Устройства.Наименование);
		КонецЦикла;
		Если Найдено = Ложь Тогда  
			Если СписокУстройств.Количество() = 1 Тогда
				Идентификатор = СписокУстройств[0].Значение;
				ВыполнитьОбработкуОповещения(ОповещениеВыбора, Идентификатор); 
			Иначе
				Контекст = Новый Структура;
				Контекст.Вставить("СледующееОповещение", ОповещениеВыбора);
				Контекст.Вставить("СообщениеНеВыбран"  , ?(ПустаяСтрока(СообщениеНеВыбран), СообщениеНеПодключен, СообщениеНеВыбран));
				Контекст.Вставить("БезСообщений"       , БезСообщений);
				ОписаниеОповещения = Новый ОписаниеОповещения("ПредложитьВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
				СписокУстройств.ПоказатьВыборЭлемента(ОписаниеОповещения, ТекстЗаголовкаВыбора);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПредложитьВыбратьУстройствоЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено И НЕ Параметры.БезСообщений И Не ПустаяСтрока(Параметры.СообщениеНеВыбран) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Параметры.СообщениеНеВыбран);
	КонецЕсли;
	
	Если Параметры.СледующееОповещение <> Неопределено Тогда
		Идентификатор = ?(Результат = Неопределено, Неопределено, Результат.Значение);
		ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, Идентификатор);
	КонецЕсли;
	
КонецПроцедуры

// Функция начинает выбор файла драйвера для последующей загрузки.
//
Процедура НачатьВыборФайлаДрайвера(ОповещениеПриВыборе) Экспорт 
	
	Результат = Ложь;
	ПолноеИмяФайла = "";
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл драйвера'");
	ДиалогОткрытияФайла.Фильтр = НСтр("ru='Файл драйвера'") + ?(МенеджерОборудованияКлиентПовтИсп.ЭтоLinuxКлиент(), "(*.zip)|*.zip", "(*.zip, *.exe)| *.zip; *.exe");  
	
	Параметры = Новый Структура("СледующееОповещение", ОповещениеПриВыборе);
	Оповещение = Новый ОписаниеОповещения("ВыборФайлаДрайвераЗавершение", ЭтотОбъект, Параметры);
	
	ДиалогОткрытияФайла.Показать(Оповещение);
	
КонецПроцедуры

// Завершение выбора файла драйвера.
//
Процедура ВыборФайлаДрайвераЗавершение(ВыбранныеФайлы, Параметры) Экспорт
	
	Если ТипЗнч(ВыбранныеФайлы) = Тип("Массив") И ВыбранныеФайлы.Количество() > 0  Тогда
		Если Параметры.СледующееОповещение <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, ВыбранныеФайлы[0]);
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

// Завершение выбора файла
//
Процедура НачатьВыборФайлаРасширенияЗавершение(Установлено, ДополнительныеПараметры) Экспорт
	
	Если Установлено Тогда
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла[ДополнительныеПараметры.РежимДиалогаВыбораФайла]);
		Диалог.МножественныйВыбор = Ложь;
		Диалог.ПолноеИмяФайла = ДополнительныеПараметры.ИмяФайла;
		Диалог.Показать(ДополнительныеПараметры.ОповещениеПриВыборе);
	КонецЕсли;
	
КонецПроцедуры
 
// Функция начинает выбор файла.
//
Процедура НачатьВыборФайла(ОповещениеПриВыборе, Знач ИмяФайла, РежимДиалогаВыбораФайла = "Открытие") Экспорт
	
	ПараметрыКоманды = Новый Структура("ОповещениеПриВыборе, ИмяФайла, РежимДиалогаВыбораФайла", ОповещениеПриВыборе, ИмяФайла, РежимДиалогаВыбораФайла);
	Оповещение = Новый ОписаниеОповещения("НачатьВыборФайлаРасширенияЗавершение", ЭтотОбъект, ПараметрыКоманды);
	ПроверитьДоступностьРасширенияРаботыСФайлами(Оповещение);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

// Процедура формирует задержку указанной длительности.
//
// Параметры:
//  Время - <Число>
//        - Длительность задержки в секундах.
//
Процедура Пауза(Время) Экспорт

	ВремяЗавершения = ТекущаяДата() + Время;
	Пока ТекущаяДата() < ВремяЗавершения Цикл
	КонецЦикла;

КонецПроцедуры

// Преобразовать список строкой в массив.
//
Функция ПреобразоватьСписокСтрокойВМассив(Источник) Экспорт
	
	ПромежуточнаяСтруктура = Новый Структура(Источник);
	Приемник = Новый Массив;
	
	Для Каждого КлючИЗначение Из ПромежуточнаяСтруктура Цикл
		Приемник.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	Возврат Приемник;
	
КонецФункции

// Выводит текст в панель состояния.
//
Процедура СостояниеПроцесса(ТекстСообщения, Прогресс = Неопределено, Пояснение = Неопределено) Экспорт
	
#Если НЕ МобильныйКлиент Тогда
	Состояние(ТекстСообщения, Прогресс);
#КонецЕсли 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииПодключениеОборудованияАсинхронно

// Производит подключение доступного оборудования по списку типов ПО
//
Процедура НачатьПодключениеОборудованиеПоТипу(ОповещениеПриПодключении, ИдентификаторКлиента, ТипыПО) Экспорт
	
	СтруктураТиповПО = Новый Структура();
	Если ТипЗнч(ТипыПО) = Тип("Массив") Тогда
		Для Каждого ТипПО Из ТипыПО Цикл
			СтруктураТиповПО.Вставить(ТипПО);
		КонецЦикла;
	Иначе
		СтруктураТиповПО.Вставить(ТипыПО);
	КонецЕсли;
	
	НачатьПодключениеОборудования(ОповещениеПриПодключении, ИдентификаторКлиента, СтруктураТиповПО);
	 
 КонецПроцедуры

// Начать подключать одиночный экземпляр устройства определяемый идентификатором.
//
Процедура НачатьПодключениеОборудованиеПоИдентификатору(ОповещениеПриПодключении, ИдентификаторКлиента, ИдентификаторУстройства) Экспорт
	
	НачатьПодключениеОборудования(ОповещениеПриПодключении, ИдентификаторКлиента, , ИдентификаторУстройства);
	
КонецПроцедуры

// Начать подключения устройства.
// 
Процедура НачатьПодключениеОборудования(ОповещениеПриПодключении, ИдентификаторКлиента, ТипыПО = Неопределено, ИдентификаторУстройства = Неопределено) Экспорт
	   
	ОбъектДрайвера = Неопределено;
	
	Результат = ОбновитьРабочееМестоКлиента();
	Если Не Результат Тогда
		Если ОповещениеПриПодключении <> Неопределено Тогда
			ОписаниеОшибки = НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");
			РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Результат, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(ОповещениеПриПодключении, РезультатВыполнения);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СписокОборудования = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрамWebKassa(ТипыПО, ИдентификаторУстройства);
	
	Если СписокОборудования.Количество() > 0 Тогда
		Для Каждого Устройство Из СписокОборудования Цикл
			
			// Проверим, не подключено ли устройство ранее.
			//ПодключенноеУстройство = ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО, Устройство.Ссылка);
			
			ПодключенноеУстройство = Неопределено;
			
			Если ПодключенноеУстройство = Неопределено Тогда // Если устройство не было подключено ранее.
				
				ОбработчикДрайвераМодуль = МенеджерОборудованияКлиентПовтИсп.ПолучитьОбработчикДрайвера(Устройство.ОбработчикДрайвера, Не Устройство.ВСоставеКонфигурации, Устройство.ТипОборудованияИмя);
				
				НовоеПодключение = Новый Структура();
				НовоеПодключение.Вставить("Клиенты"                 , Новый Массив());
				НовоеПодключение.Клиенты.Добавить(ИдентификаторКлиента);
				НовоеПодключение.Вставить("Ссылка"                  , Устройство.Ссылка);
				НовоеПодключение.Вставить("ИдентификаторУстройства" , Устройство.ИдентификаторУстройства);
				НовоеПодключение.Вставить("ОбработчикДрайвера"      , Устройство.ОбработчикДрайвера);
				НовоеПодключение.Вставить("Наименование"            , Устройство.Наименование);
				НовоеПодключение.Вставить("ТипОборудования"         , Устройство.ТипОборудования);
				НовоеПодключение.Вставить("ТипОборудованияИмя"      , Устройство.ТипОборудованияИмя);
				НовоеПодключение.Вставить("ДрайверОборудования"     , Устройство.ДрайверОборудования);
				НовоеПодключение.Вставить("ВСоставеКонфигурации"    , Устройство.ВСоставеКонфигурации);
				НовоеПодключение.Вставить("ИдентификаторОбъекта"    , Устройство.ИдентификаторОбъекта);
				НовоеПодключение.Вставить("ИмяМакетаДрайвера"       , Устройство.ИмяМакетаДрайвера);
				НовоеПодключение.Вставить("ИмяФайлаДрайвера"        , Устройство.ИмяФайлаДрайвера);
				НовоеПодключение.Вставить("РабочееМесто"            , Устройство.РабочееМесто);
				НовоеПодключение.Вставить("ИмяКомпьютера"           , Устройство.ИмяКомпьютера);
				НовоеПодключение.Вставить("Параметры"               , Устройство.Параметры);
				НовоеПодключение.Вставить("ПараметрыРегистрации"    , Устройство.ПараметрыРегистрации);
				НовоеПодключение.Вставить("КоличествоПодключенных"  , 1);
				НовоеПодключение.Вставить("ПараметрыПодключения"    , Новый Структура());
				НовоеПодключение.Вставить("ОбъектДрайвера"          , Неопределено);
				НовоеПодключение.Вставить("ОбработчикДрайвераМодуль", ОбработчикДрайвераМодуль);
				НовоеПодключение.ПараметрыПодключения.Вставить("ТипОборудования"     , Устройство.ТипОборудованияИмя);
				НовоеПодключение.ПараметрыПодключения.Вставить("ПараметрыРегистрации", Устройство.ПараметрыРегистрации);
				
				Если ОбработчикДрайвераМодуль = Неопределено Тогда
					// Сообщить об ошибке, что не удалось подключить обработчик.
					Если ОповещениеПриПодключении <> Неопределено Тогда
						ОписаниеОшибки = НСтр("ru='Не удалось подключить обработчик драйвера.'");
						РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
						ВыполнитьОбработкуОповещения(ОповещениеПриПодключении, РезультатВыполнения);
					КонецЕсли;
					Продолжить;
				Иначе
					
					// Разделение на асинхронные и синхронные вызовы.
					Если ОбработчикДрайвераМодуль.ПоддержкаАсинхронногоРежима() Тогда
						// Асинхронные вызовы
						ПараметрыКоманды = Новый Структура("НовоеПодключение, ОповещениеПриПодключении, ОбработчикДрайвераМодуль", НовоеПодключение, ОповещениеПриПодключении, ОбработчикДрайвераМодуль);
						Оповещение = Новый ОписаниеОповещения("НачатьПодключениеОборудования_ПолучениеОбъектаДрайвераЗавершение", ЭтотОбъект, ПараметрыКоманды);
						НачатьПолучениеОбъектаДрайвера(Оповещение, Устройство);
					Иначе
						// Синхронные  
						//Если Устройство.Свойство("ДрайверОборудования")  Тогда
						//ОбъектДрайвера = ПолучитьОбъектДрайвера(Устройство.ДрайверОборудования);	
						//Иначе	
						ОбъектДрайвера = ПолучитьОбъектДрайвера(Устройство); 
						//КонецЕсли;
						Если ОбъектДрайвера = Неопределено Тогда
							Если ОповещениеПриПодключении <> Неопределено Тогда
								// Сообщить об ошибке, что не удалось загрузить драйвер.
								ОписаниеОшибки = НСтр("ru='%Наименование%: Не удалось загрузить драйвер устройства.
													|Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
								ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%",НовоеПодключение.Наименование);
								РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
								ВыполнитьОбработкуОповещения(ОповещениеПриПодключении, РезультатВыполнения);
							КонецЕсли;
							Продолжить;
						Иначе
							ВыходныеПараметры = Неопределено;
							Результат = ОбработчикДрайвераМодуль.ПодключитьУстройство(ОбъектДрайвера, НовоеПодключение.Параметры, НовоеПодключение.ПараметрыПодключения, ВыходныеПараметры);
							
							Если Результат Тогда
								
								Если ВыходныеПараметры.Количество() >= 2 Тогда
									НовоеПодключение.Вставить("ИсточникСобытия", ВыходныеПараметры[0]);
									НовоеПодключение.Вставить("ИменаСобытий",    ВыходныеПараметры[1]);
								Иначе
									НовоеПодключение.Вставить("ИсточникСобытия", "");
									НовоеПодключение.Вставить("ИменаСобытий",    Неопределено);
								КонецЕсли;
								НовоеПодключение.ОбъектДрайвера = ОбъектДрайвера;
								МассивПараметровПодключения = глПодключаемоеОборудование.ПараметрыПодключенияПО; //Массив - 
								МассивПараметровПодключения.Добавить(НовоеПодключение);
								
								Если ОповещениеПриПодключении <> Неопределено Тогда
									ОписаниеОшибки = НСтр("ru='Ошибок нет.'");
									РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ПараметрыПодключения", Истина, ОписаниеОшибки, НовоеПодключение.ПараметрыПодключения);
									ВыполнитьОбработкуОповещения(ОповещениеПриПодключении, РезультатВыполнения);
								КонецЕсли;
								
							Иначе
								// Сообщим пользователю о том, что не удалось подключить устройство.
								Если ОповещениеПриПодключении <> Неопределено Тогда
									ОписаниеОшибки = НСтр("ru='Не удалось подключить устройство ""%Наименование%"": %ОписаниеОшибки% (%КодОшибки%)'");
									ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%"  , НовоеПодключение.Наименование);
									ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
									ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%КодОшибки%"     , ВыходныеПараметры[0]);
									РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
									ВыполнитьОбработкуОповещения(ОповещениеПриПодключении, РезультатВыполнения);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
			
			Иначе // Устройство было подключено ранее.
				// Увеличим количество пользователей данного соединения.
				МассивКлиентов = ПодключенноеУстройство.Клиенты; //Массив - 
				МассивКлиентов.Добавить(ИдентификаторКлиента);
				ПодключенноеУстройство.КоличествоПодключенных = ПодключенноеУстройство.КоличествоПодключенных + 1;
				Если ОповещениеПриПодключении <> Неопределено Тогда
					ОписаниеОшибки = НСтр("ru='Ошибок нет.'");
					РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ПараметрыПодключения", Истина, ОписаниеОшибки, ПодключенноеУстройство.ПараметрыПодключения);
					ВыполнитьОбработкуОповещения(ОповещениеПриПодключении, РезультатВыполнения);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли ИдентификаторУстройства <> Неопределено И ОповещениеПриПодключении <> Неопределено Тогда
		ОписаниеОшибки =  НСтр("ru='Выбранное устройство не может использоваться для подключения. Укажите другое устройство.'");
		РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
		ВыполнитьОбработкуОповещения(ОповещениеПриПодключении, РезультатВыполнения);
	ИначеЕсли ТипыПО = Неопределено И ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОшибки =  НСтр("ru='Нет доступного оборудования для подключения.'");
		РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
		ВыполнитьОбработкуОповещения(ОповещениеПриПодключении, РезультатВыполнения);
	КонецЕсли;

КонецПроцедуры

Процедура НачатьПодключениеОборудования_ПолучениеОбъектаДрайвераЗавершение(ОбъектДрайвера, Параметры) Экспорт
	
	Если ОбъектДрайвера = Неопределено Тогда
		
		Если Параметры.ОповещениеПриПодключении <> Неопределено Тогда
			// Сообщить об ошибке, что не удалось загрузить драйвер.
			ОписаниеОшибки = НСтр("ru='%Наименование%: Не удалось загрузить драйвер устройства.
										|Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", Параметры.НовоеПодключение.Наименование);
			РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриПодключении, РезультатВыполнения);
		КонецЕсли;
		
	Иначе
		Параметры.НовоеПодключение.ОбъектДрайвера = ОбъектДрайвера;
		Оповещение = Новый ОписаниеОповещения("НачатьПодключениеОборудования_Завершение", ЭтотОбъект, Параметры);
		Параметры.ОбработчикДрайвераМодуль.НачатьПодключениеУстройства(Оповещение, ОбъектДрайвера, 
			 Параметры.НовоеПодключение.Параметры,  Параметры.НовоеПодключение.ПараметрыПодключения, Параметры);
	КонецЕсли;
	
КонецПроцедуры

// НачинаетПодключениеОборудования.
// 
// Параметры:
// 	РезультатВыполнения - Структура - результат выполнения операции.
// 	Параметры - Структура - где:
// 	*НовоеПодключение - Структура - где:
// 	**Наименование - Строка - .
// 	
Процедура НачатьПодключениеОборудования_Завершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		Если РезультатВыполнения.ВыходныеПараметры.Количество() >= 2 Тогда
			Параметры.НовоеПодключение.Вставить("ИсточникСобытия", Параметры.ВыходныеПараметры[0]);
			Параметры.НовоеПодключение.Вставить("ИменаСобытий",    Параметры.ВыходныеПараметры[1]);
		Иначе
			Параметры.НовоеПодключение.Вставить("ИсточникСобытия", "");
			Параметры.НовоеПодключение.Вставить("ИменаСобытий",    Неопределено);
		КонецЕсли;
		глПодключаемоеОборудование.ПараметрыПодключенияПО.Добавить(Параметры.НовоеПодключение);
		Если Параметры.ОповещениеПриПодключении <> Неопределено Тогда
			ОписаниеОшибки = НСтр("ru='Ошибок нет.'");
			РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ПараметрыПодключения", Истина, ОписаниеОшибки, Параметры.НовоеПодключение.ПараметрыПодключения);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриПодключении, РезультатВыполнения);
		КонецЕсли;
	Иначе
		// Сообщим пользователю о том, что не удалось подключить устройство.
		Если Параметры.ОповещениеПриПодключении <> Неопределено Тогда
			ОписаниеОшибки = НСтр("ru='Не удалось подключить устройство ""%Наименование%"": %ОписаниеОшибки%'");
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%"  , Параметры.НовоеПодключение.Наименование);
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", РезультатВыполнения.ВыходныеПараметры[1]);
			РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриПодключении, РезультатВыполнения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Начать отключение устройств по типу оборудования.
//
Процедура НачатьОтключениеОборудованиеПоТипу(ОповещениеПриОтключении, ИдентификаторКлиента, ТипыПО) Экспорт
	
	НачатьОтключениеОборудование(ОповещениеПриОтключении, ИдентификаторКлиента, ТипыПО, );
	
КонецПроцедуры

// Начать отключать устройства определенное идентификатором.
//
Процедура НачатьОтключениеОборудованиеПоИдентификатору(ОповещениеПриОтключении, ИдентификаторКлиента, ИдентификаторУстройства) Экспорт
	
	НачатьОтключениеОборудование(ОповещениеПриОтключении, ИдентификаторКлиента, , ИдентификаторУстройства);
	
КонецПроцедуры

// Функция подключает устройства по типу оборудования.
// 
Процедура НачатьОтключениеОборудование(ОповещениеПриОтключении, ИдентификаторКлиента, ТипыПО = Неопределено, ИдентификаторУстройства = Неопределено)
	
	Если глПодключаемоеОборудование.ПараметрыПодключенияПО <> Неопределено Тогда
		КоличествоУстройств = глПодключаемоеОборудование.ПараметрыПодключенияПО.Количество();
		Для Индекс = 1 По КоличествоУстройств Цикл
			
			ПодключенноеУстройство = глПодключаемоеОборудование.ПараметрыПодключенияПО[КоличествоУстройств - Индекс]; //СправочникСсылка.ПодключаемоеОборудование - .
			КлиентПодключения = ПодключенноеУстройство.Клиенты.Найти(ИдентификаторКлиента);
			
			Если КлиентПодключения <> Неопределено  И (ТипыПО = Неопределено Или ТипыПО.Найти(ПодключенноеУстройство.ТипОборудованияИмя) <> Неопределено)
			   И (ИдентификаторУстройства = Неопределено  Или ПодключенноеУстройство.Ссылка = ИдентификаторУстройства) Тогда
				
				Если ПодключенноеУстройство.КоличествоПодключенных = 1 Тогда
					
					ОбработчикДрайвераМодуль = ПодключенноеУстройство.ОбработчикДрайвераМодуль;
					ОбъектДрайвера = ПодключенноеУстройство.ОбъектДрайвера;
					
					Если ОбработчикДрайвераМодуль = Неопределено Тогда
						// Сообщить об ошибке, что не удалось подключить обработчик.
						Если ОповещениеПриОтключении <> Неопределено Тогда
							ОписаниеОшибки = НСтр("ru='Не удалось подключить обработчик драйвера.'");
							РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
							ВыполнитьОбработкуОповещения(ОповещениеПриОтключении, РезультатВыполнения);
						КонецЕсли;
					Иначе
						
						Если ОбъектДрайвера = Неопределено Тогда
							Если ОповещениеПриОтключении <> Неопределено Тогда
								// Сообщить об ошибке, что не удалось загрузить драйвер.
								ОписаниеОшибки = НСтр("ru='%Наименование%: Не удалось загрузить драйвер устройства.
													|Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
								ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", ПодключенноеУстройство.Наименование);
								РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
								ВыполнитьОбработкуОповещения(ОповещениеПриОтключении, РезультатВыполнения);
							КонецЕсли;
						Иначе
							
							ВыходныеПараметры = Неопределено;
							           
							// Разделение на асинхронные и синхронные вызовы.
							Если ОбработчикДрайвераМодуль.ПоддержкаАсинхронногоРежима() Тогда
								
								ПараметрыКоманды = Новый Структура("ПодключенноеУстройство, ОповещениеПриОтключении", ПодключенноеУстройство, ОповещениеПриОтключении);
								Оповещение = Новый ОписаниеОповещения("НачатьОтключениеОборудование_Завершение", ЭтотОбъект, ПараметрыКоманды);
								ОбработчикДрайвераМодуль.НачатьОтключениеУстройства(Оповещение, ОбъектДрайвера, 
									ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения, ВыходныеПараметры);
							Иначе
								Результат = ОбработчикДрайвераМодуль.ОтключитьУстройство(ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения, ВыходныеПараметры);
								Если НЕ Результат Тогда
									// Сообщим пользователю о том, что не удалось подключить устройство.
									Если ОповещениеПриОтключении <> Неопределено Тогда
										ОписаниеОшибки = НСтр("ru='При отключении устройства ""%Наименование%"" произошла ошибка: %ОписаниеОшибки%'");
										ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%"  , ПодключенноеУстройство.Наименование);
										ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
										РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
										ВыполнитьОбработкуОповещения(ОповещениеПриОтключении, РезультатВыполнения);
									КонецЕсли;
								Иначе
									ПодключенноеУстройство.КоличествоПодключенных = 0;
								КонецЕсли;
								
								НомерСтрокиМассива = глПодключаемоеОборудование.ПараметрыПодключенияПО.Найти(ПодключенноеУстройство);
								Если НомерСтрокиМассива <> Неопределено Тогда
									глПодключаемоеОборудование.ПараметрыПодключенияПО.Удалить(НомерСтрокиМассива);
								КонецЕсли;
								
								Если ОповещениеПриОтключении <> Неопределено Тогда
									ОписаниеОшибки = НСтр("ru='Ошибок нет.'");
									РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки", Истина, ОписаниеОшибки);
									ВыполнитьОбработкуОповещения(ОповещениеПриОтключении, РезультатВыполнения);
								КонецЕсли;
							КонецЕсли;
							
						КонецЕсли;
					КонецЕсли;
				Иначе
					ПодключенноеУстройство.КоличествоПодключенных = ПодключенноеУстройство.КоличествоПодключенных - 1;
					ПодключенноеУстройство.Клиенты.Удалить(КлиентПодключения);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры  

// Отключает оборудование.
// 
// Параметры:
// 	РезультатВыполнения - Структура - структура результата выполнения операции.
// 	Параметры - Структура - где:
// 	*ПодключенноеУстройство - СправочникСсылка.ПодключаемоеОборудование - .
Процедура НачатьОтключениеОборудование_Завершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		Параметры.ПодключенноеУстройство.КоличествоПодключенных = 0;
		
		НомерСтрокиМассива = глПодключаемоеОборудование.ПараметрыПодключенияПО.Найти(Параметры.ПодключенноеУстройство);
		Если НомерСтрокиМассива <> Неопределено Тогда
			глПодключаемоеОборудование.ПараметрыПодключенияПО.Удалить(НомерСтрокиМассива);
		КонецЕсли;
		Если Параметры.ОповещениеПриОтключении <> Неопределено Тогда
			ОписаниеОшибки = НСтр("ru='Ошибок нет.'");
			РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Истина, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриОтключении, РезультатВыполнения);
		КонецЕсли;
	Иначе
		// Сообщим пользователю о том, что не удалось подключить устройство.
		Если Параметры.ОповещениеПриОтключении <> Неопределено Тогда
			ОписаниеОшибки = НСтр("ru='При отключении устройства ""%Наименование%"" произошла ошибка.'");
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%"  , Параметры.ПодключенноеУстройство.Наименование);
			РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриОтключении, РезультатВыполнения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Производит принудительное отключение всего подключенного оборудования,
// независимо от числа ссылок на подключение.
Процедура НачатьОтключениеВсегоОборудования(ОповещениеПриОтключении = Неопределено) Экспорт
	
	КонечныйРезультат = Истина;
	Результат         = Истина;
	
	ПодключенноеОборудование = глПодключаемоеОборудование.ПараметрыПодключенияПО; //Массив Из Структура, где: *Параметры - Структура - .
	
	Для Каждого ПодключенноеУстройство Из ПодключенноеОборудование Цикл
		
		Если ПодключенноеУстройство.ОбъектДрайвера = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ВыходныеПараметры = Неопределено;
		ОбработчикДрайвераМодуль = ПодключенноеУстройство.ОбработчикДрайвераМодуль;
		Если ОбработчикДрайвераМодуль.ПоддержкаАсинхронногоРежима() Тогда
			Оповещение = Новый ОписаниеОповещения("НачатьОтключениеВсегоОборудованияЗавершение", МенеджерОборудованияКлиент);
			ОбработчикДрайвераМодуль.НачатьОтключениеУстройства(Оповещение, ПодключенноеУстройство.ОбъектДрайвера, ПодключенноеУстройство.Параметры, 
				ПодключенноеУстройство.ПараметрыПодключения, ВыходныеПараметры);
			ПодключенноеУстройство.КоличествоПодключенных = 0;
			Результат = Истина;
		Иначе
			Результат = ОбработчикДрайвераМодуль.ОтключитьУстройство(ПодключенноеУстройство.ОбъектДрайвера, ПодключенноеУстройство.Параметры, 
				ПодключенноеУстройство.ПараметрыПодключения, ВыходныеПараметры);
			Если Результат Тогда
				ПодключенноеУстройство.КоличествоПодключенных = 0;
			КонецЕсли;
		КонецЕсли;
		КонечныйРезультат = КонечныйРезультат И Результат;
		
	КонецЦикла;
	
	КоличествоПодключенныхКлиентов = 0;
	Для Каждого ПодключенноеУстройство Из глПодключаемоеОборудование.ПараметрыПодключенияПО Цикл
		КоличествоПодключенныхКлиентов = КоличествоПодключенныхКлиентов + ПодключенноеУстройство.КоличествоПодключенных;
	КонецЦикла;
	
	глПодключаемоеОборудование.ПараметрыПодключенияПО.Очистить();
	
КонецПроцедуры

Процедура НачатьОтключениеВсегоОборудованияЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru='При отключении оборудования произошла ошибка: ""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  

#Область ПроцедурыИФункцииПодключениеОборудованияСинхронноУстарели

// Подключает одиночный экземпляр устройства определяемый идентификатором.
//
Функция ПодключитьОборудованиеПоИдентификатору(ИдентификаторКлиента, ИдентификаторУстройства, ОписаниеОшибки = "") Экспорт
	
	Возврат ПодключитьОборудование(ИдентификаторКлиента, , ИдентификаторУстройства, ОписаниеОшибки);
	
КонецФункции

// Функция подключает устройства по типу оборудования.
// Возвращает результат выполнения функции.
//
Функция ПодключитьОборудование(ИдентификаторКлиента, ТипыПО = Неопределено, ИдентификаторУстройства = Неопределено, ОписаниеОшибки = "") Экспорт
	   
	КонечныйРезультат = Истина;
	Результат         = Истина;
	
	ОбъектДрайвера    = Неопределено;
	ОписаниеОшибки    = "";
	ОписаниеОшибкиУстройства = "";

	Результат = ОбновитьРабочееМестоКлиента();
	Если Не Результат Тогда
		ОписаниеОшибки = НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");
		Возврат Ложь;
	КонецЕсли;
	
	СписокОборудования = МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(ТипыПО, ИдентификаторУстройства);
	
	Если СписокОборудования.Количество() > 0 Тогда
		Для Каждого Устройство Из СписокОборудования Цикл
			
			// Проверим, не подключено ли устройство ранее.
			ПодключенноеУстройство = ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО, Устройство.Ссылка);
			
			Если ПодключенноеУстройство = Неопределено Тогда // Если устройство не было подключено ранее.
				ОбъектДрайвера = ПолучитьОбъектДрайвера(Устройство);
				Если ОбъектДрайвера = Неопределено Тогда
					// Сообщить об ошибке, что не удалось загрузить драйвер.
					ОписаниеОшибки = ОписаниеОшибки + ?(ПустаяСтрока(ОписаниеОшибки), "", Символы.ПС)
								   + НСтр("ru='%Наименование%: Не удалось загрузить драйвер устройства.
									 |Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", Устройство.Наименование);
					КонечныйРезультат = Ложь;
					Продолжить;
				КонецЕсли;
				
				НовоеПодключение = Новый Структура();
				НовоеПодключение.Вставить("Клиенты"               , Новый Массив());
				НовоеПодключение.Клиенты.Добавить(ИдентификаторКлиента);
				НовоеПодключение.Вставить("Ссылка"                  , Устройство.Ссылка);
				НовоеПодключение.Вставить("ИдентификаторУстройства" , Устройство.ИдентификаторУстройства);
				НовоеПодключение.Вставить("ОбработчикДрайвера"      , Устройство.ОбработчикДрайвера);
				НовоеПодключение.Вставить("Наименование"            , Устройство.Наименование);
				НовоеПодключение.Вставить("ТипОборудования"         , Устройство.ТипОборудования);
				НовоеПодключение.Вставить("ТипОборудованияИмя"      , Устройство.ТипОборудованияИмя);
				НовоеПодключение.Вставить("ДрайверОборудования"     , Устройство.ДрайверОборудования);
				НовоеПодключение.Вставить("ВСоставеКонфигурации"    , Устройство.ВСоставеКонфигурации);
				НовоеПодключение.Вставить("ИдентификаторОбъекта"    , Устройство.ИдентификаторОбъекта);
				НовоеПодключение.Вставить("ИмяМакетаДрайвера"       , Устройство.ИмяМакетаДрайвера);
				НовоеПодключение.Вставить("ИмяФайлаДрайвера"        , Устройство.ИмяФайлаДрайвера);
				НовоеПодключение.Вставить("РабочееМесто"            , Устройство.РабочееМесто);
				НовоеПодключение.Вставить("ИмяКомпьютера"           , Устройство.ИмяКомпьютера);
				НовоеПодключение.Вставить("Параметры"               , Устройство.Параметры);
				НовоеПодключение.Вставить("КоличествоПодключенных"  , 1);
				НовоеПодключение.Вставить("ПараметрыПодключения"    , Новый Структура());
				НовоеПодключение.ПараметрыПодключения.Вставить("ТипОборудования", Устройство.ТипОборудованияИмя);
				
				ВыходныеПараметры = Неопределено;
				   
				ОбработчикДрайвераМодуль = МенеджерОборудованияКлиентПовтИсп.ПолучитьОбработчикДрайвера(НовоеПодключение.ОбработчикДрайвера, Не НовоеПодключение.ВСоставеКонфигурации, Устройство.ТипОборудованияИмя);
				
				Если ОбработчикДрайвераМодуль = Неопределено Тогда
					// Сообщить об ошибке, что не удалось загрузить драйвер.
					ОписаниеОшибки = ОписаниеОшибки +  НСтр("ru='Не удалось подключить обработчик драйвера.'");
					КонечныйРезультат = Ложь;
					Продолжить;
				Иначе
					#Если ВебКлиент Тогда
					// Принудительно заменяем асинхронный обработчик на синхронный, так как работам в синхронном режиме.
					Если ОбработчикДрайвераМодуль = ПодключаемоеОборудованиеУниверсальныйДрайверАсинхронноКлиент Тогда
						ОбработчикДрайвераМодуль = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
					КонецЕсли;
					#КонецЕсли
					Результат = ОбработчикДрайвераМодуль.ПодключитьУстройство(ОбъектДрайвера, НовоеПодключение.Параметры, 
						НовоеПодключение.ПараметрыПодключения, ВыходныеПараметры);
				КонецЕсли;
				
				Если Результат Тогда
					Если ВыходныеПараметры.Количество() >= 2 Тогда
						НовоеПодключение.Вставить("ИсточникСобытия", ВыходныеПараметры[0]);
						НовоеПодключение.Вставить("ИменаСобытий",    ВыходныеПараметры[1]);
					Иначе
						НовоеПодключение.Вставить("ИсточникСобытия", "");
						НовоеПодключение.Вставить("ИменаСобытий",    Неопределено);
					КонецЕсли;
					НовоеПодключение.Вставить("ОбъектДрайвера"          , ОбъектДрайвера);
					НовоеПодключение.Вставить("ОбработчикДрайвераМодуль", ОбработчикДрайвераМодуль);
					МассивПараметровПодключения = глПодключаемоеОборудование.ПараметрыПодключенияПО; //Массив - 
					МассивПараметровПодключения.Добавить(НовоеПодключение);
				Иначе
					// Сообщим пользователю о том, что не удалось подключить устройство.
					ОписаниеОшибки = ОписаниеОшибки + ?(ПустаяСтрока(ОписаниеОшибки), "", Символы.ПС)
								   + НСтр("ru='Не удалось подключить устройство ""%Наименование%"": %ОписаниеОшибки% (%КодОшибки%)'");
					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%"  , Устройство.Наименование);
					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
					ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%КодОшибки%"     , ВыходныеПараметры[0]);
				КонецЕсли;
			Иначе // Устройство было подключено ранее.
				// Увеличим количество пользователей данного соединения.
				МассивКлиентов = ПодключенноеУстройство.Клиенты; //Массив - 
				МассивКлиентов.Добавить(ИдентификаторКлиента);
				ПодключенноеУстройство.КоличествоПодключенных = ПодключенноеУстройство.КоличествоПодключенных + 1;
			КонецЕсли;
			
			КонечныйРезультат = КонечныйРезультат И Результат;
		КонецЦикла;
		
	ИначеЕсли ИдентификаторУстройства <> Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='Выбранное устройство не может использоваться для подключения.
		|Укажите другое устройство.'");
		КонечныйРезультат = Ложь;
	ИначеЕсли ТипыПО = Неопределено И ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='Нет доступного оборудования для подключения.'");
		КонечныйРезультат = Ложь;
	КонецЕсли;
	
	Возврат КонечныйРезультат;
	
КонецФункции

// Отключает устройство, определенное идентификатором.
//
Функция ОтключитьОборудованиеПоИдентификатору(ИдентификаторКлиента, ИдентификаторУстройства, ОписаниеОшибки = "") Экспорт
	
	Возврат ОтключитьОборудование(ИдентификаторКлиента, , ИдентификаторУстройства, ОписаниеОшибки);
	
КонецФункции

// Функция подключает устройства по типу оборудования.
// 
Функция ОтключитьОборудование(ИдентификаторКлиента, ТипыПО = Неопределено, ИдентификаторУстройства = Неопределено, ОписаниеОшибки = "") Экспорт
	
	КонечныйРезультат = Истина;
	Результат         = Истина;
	
	ВыходноеОписаниеОшибки = "";
	
	Если глПодключаемоеОборудование.ПараметрыПодключенияПО <> Неопределено Тогда
		КоличествоУстройств = глПодключаемоеОборудование.ПараметрыПодключенияПО.Количество();
		Для Индекс = 1 По КоличествоУстройств Цикл
			
			ПодключенноеУстройство = глПодключаемоеОборудование.ПараметрыПодключенияПО[КоличествоУстройств - Индекс]; //СправочникСсылка.ПодключаемоеОборудование - 
			КлиентПодключения = ПодключенноеУстройство.Клиенты.Найти(ИдентификаторКлиента);
			
			Если КлиентПодключения <> Неопределено  И (ТипыПО = Неопределено Или ТипыПО.Найти(ПодключенноеУстройство.ТипОборудованияИмя) <> Неопределено)
			   И (ИдентификаторУстройства = Неопределено  Или ПодключенноеУстройство.Ссылка = ИдентификаторУстройства)Тогда
				 
				 Если ПодключенноеУстройство.КоличествоПодключенных = 1 Тогда
					 
					Если ПодключенноеУстройство.ОбъектДрайвера = Неопределено Тогда
						// Сообщить об ошибке, что не удалось загрузить драйвер.
						ОписаниеОшибки = НСтр("ru='""%Наименование%"": Не удалось загрузить драйвер устройства.
													|Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
						ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", ПодключенноеУстройство.Наименование);
						КонечныйРезультат = Ложь;
						Продолжить;
					КонецЕсли;
					
					ОбработчикДрайвераМодуль = ПодключенноеУстройство.ОбработчикДрайвераМодуль;
					#Если ВебКлиент Тогда
					// Принудительно заменяем асинхронный обработчик на синхронный, так как работам в синхронном режиме.
					Если ОбработчикДрайвераМодуль = ПодключаемоеОборудованиеУниверсальныйДрайверАсинхронноКлиент Тогда
						ОбработчикДрайвераМодуль = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
					КонецЕсли;
					#КонецЕсли
					
					ВыходныеПараметры = Неопределено;
					Результат = ОбработчикДрайвераМодуль.ОтключитьУстройство(ПодключенноеУстройство.ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения, ВыходныеПараметры);
					Если НЕ Результат Тогда
						ОписаниеОшибки = ОписаниеОшибки + ?(ПустаяСтрока(ОписаниеОшибки), "", Символы.ПС)
									   + НСтр("ru='При отключении устройства ""%Наименование%"" произошла ошибка: %ОписаниеОшибки% (%КодОшибки%)'");
						ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", ПодключенноеУстройство.Наименование);
						ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", ВыходныеПараметры[1]);
						ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%КодОшибки%", ВыходныеПараметры[0]);
					Иначе
						ПодключенноеУстройство.КоличествоПодключенных = 0;
					КонецЕсли;
					
					НомерСтрокиМассива = глПодключаемоеОборудование.ПараметрыПодключенияПО.Найти(ПодключенноеУстройство);
					Если НомерСтрокиМассива <> Неопределено Тогда
						глПодключаемоеОборудование.ПараметрыПодключенияПО.Удалить(НомерСтрокиМассива);
					КонецЕсли;
				Иначе
					ПодключенноеУстройство.КоличествоПодключенных = ПодключенноеУстройство.КоличествоПодключенных - 1;
					ПодключенноеУстройство.Клиенты.Удалить(КлиентПодключения);
				КонецЕсли;
			КонецЕсли;
			
			КонечныйРезультат = КонечныйРезультат И Результат;
		КонецЦикла;
	КонецЕсли;
	
	Возврат КонечныйРезультат;
	
КонецФункции  

Функция ВыполнитьКоманду(Идентификатор, Команда, ВходныеПараметры, ВыходныеПараметры, Таймаут = -1) Экспорт
	
	Результат = Ложь;
	
	// Поиск подключенного устройства.
	ПодключенноеУстройство = ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО, Идентификатор);
	
	Если ПодключенноеУстройство <> Неопределено Тогда
		
		ОбработчикДрайвераМодуль = ПодключенноеУстройство.ОбработчикДрайвераМодуль;
		ОбъектДрайвера = ПодключенноеУстройство.ОбъектДрайвера;
		
		Если ОбъектДрайвера = Неопределено Тогда
			// Сообщить об ошибке, что не удалось загрузить драйвер.
			ОписаниеОшибки = НСтр("ru='""%Наименование%"": Не удалось загрузить драйвер устройства.
										|Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%Наименование%", ПодключенноеУстройство.Наименование);
			ВыходныеПараметры = Новый Массив();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ОписаниеОшибки);
		Иначе
			Параметры            = ПодключенноеУстройство.Параметры;
			ПараметрыПодключения = ПодключенноеУстройство.ПараметрыПодключения;
			Если ОбработчикДрайвераМодуль = Неопределено Тогда
				ТекстСообщения = НСтр("ru='Не удалось подключить обработчик драйвера.'");
				ВыходныеПараметры = Новый Массив();
				ВыходныеПараметры.Добавить(999);
				ВыходныеПараметры.Добавить(ТекстСообщения);
				ВыходныеПараметры.Добавить(НСтр("ru='Не установлен'"));
			Иначе
				#Если ВебКлиент Тогда
				// Принудительно заменяем асинхронный обработчик на синхронный, так как работам в синхронном режиме.
				Если ОбработчикДрайвераМодуль = ПодключаемоеОборудованиеУниверсальныйДрайверАсинхронноКлиент Тогда
					ОбработчикДрайвераМодуль = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
				КонецЕсли;
				#КонецЕсли
				// Вызов метода выполнения команды у обработчика.
				Результат = ОбработчикДрайвераМодуль.ВыполнитьКоманду(Команда, ВходныеПараметры, ВыходныеПараметры, 
																ОбъектДрайвера, Параметры, ПараметрыПодключения); 
			КонецЕсли
		КонецЕсли;
	Иначе
		// Сообщить об ошибке, что устройство не подключено.
		ВыходныеПараметры = Новый Массив();
		ТекстСообщения = НСтр("ru='Устройство не подключено. Перед выполнением операции устройство должно быть подключено.'");
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ТекстСообщения);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляРаботыСПодключаемымОборудованием

// Выполняет дополнительную команду к драйверу, не требующую предварительного подключения устройства в системе.
// 
//  Параметры:
// 	Команда - Строка - наименование команды.
// 	ВходныеПараметры - Массив - массив входных параметров.
// 	ВыходныеПараметры - Массив - массив выходных параметров.
// 	Идентификатор - СправочникСсылка.ПодключаемоеОборудование - .
// 	Параметры - Структура - параметры выполнения операции.
// Возвращаемое значение:
// 	Булево - Описание
Функция ВыполнитьДополнительнуюКоманду(Команда, ВходныеПараметры, ВыходныеПараметры, Идентификатор, Параметры) Экспорт
	
	Результат = Ложь;
	
	// Поиск подключенного устройства.
	ПодключенноеУстройство = ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО, Идентификатор);
	
	Если ПодключенноеУстройство = Неопределено Тогда
		
		ДанныеОборудования = МенеджерОборудованияВызовСервера.ПолучитьДанныеУстройства(Идентификатор);
		
		времПараметрыПодключения = Новый Структура();
		времПараметрыПодключения.Вставить("ТипОборудования", ДанныеОборудования.ТипОборудованияИмя);
		
		ОбъектДрайвера = ПолучитьОбъектДрайвера(ДанныеОборудования);
		Если ОбъектДрайвера = Неопределено Тогда
			// Сообщить об ошибке, что не удалось загрузить драйвер.
			ТекстСообщения = НСтр("ru='Не удалось загрузить драйвер устройства.
										|Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
			ВыходныеПараметры = Новый Массив();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ТекстСообщения);
			ВыходныеПараметры.Добавить(НСтр("ru='Не установлен'"));
			
		Иначе
			ОбработчикДрайвераМодуль = МенеджерОборудованияКлиентПовтИсп.ПолучитьОбработчикДрайвера(ДанныеОборудования.ОбработчикДрайвера, Не ДанныеОборудования.ВСоставеКонфигурации, ДанныеОборудования.ТипОборудованияИмя);
			Если ОбработчикДрайвераМодуль = Неопределено Тогда
				// Сообщить об ошибке, что не удалось загрузить драйвер.
				ТекстСообщения = НСтр("ru='Не удалось подключить обработчик драйвера.'");
				ВыходныеПараметры = Новый Массив();
				ВыходныеПараметры.Добавить(999);
				ВыходныеПараметры.Добавить(ТекстСообщения);
				ВыходныеПараметры.Добавить(НСтр("ru='Не установлен'"));
			Иначе
				#Если ВебКлиент Тогда
				// Принудительно заменяем асинхронный обработчик на синхронный, так как работам в синхронном режиме.
				Если ОбработчикДрайвераМодуль = ПодключаемоеОборудованиеУниверсальныйДрайверАсинхронноКлиент Тогда
					ОбработчикДрайвераМодуль = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
				КонецЕсли;
				#КонецЕсли
				
				Результат = ОбработчикДрайвераМодуль.ВыполнитьКоманду(Команда, ВходныеПараметры, ВыходныеПараметры, ОбъектДрайвера, Параметры, времПараметрыПодключения);
				Если Не Результат Тогда
					ВыходныеПараметры = Новый Массив();
					ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
				КонецЕсли;
			КонецЕсли
		КонецЕсли;
	Иначе
		// Сообщить об ошибке, что устройство подключено.
		ТекстСообщения = НСтр("ru='Устройство подключено. Перед выполнением операции устройство должно быть отключено.'");
		ВыходныеПараметры = Новый Массив();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ТекстСообщения);
		ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Выполняет команду обработчика драйвера, не требующую предварительного подключения устройства в системе.
//
Функция ВыполнитьКомандуОбработчикаДрайвера(Команда, ВходныеПараметры, ВыходныеПараметры, Идентификатор, Параметры, ПоддержкаАсинхронногоРежима) Экспорт
	
	Результат = Ложь;
	
	Если Идентификатор <> Неопределено Тогда
		ДанныеОборудования = МенеджерОборудованияВызовСервера.ПолучитьДанныеУстройства(Идентификатор);
		ОбработчикДрайвераМодуль = МенеджерОборудованияКлиентПовтИсп.ПолучитьОбработчикДрайвера(ДанныеОборудования.ОбработчикДрайвера, Не ДанныеОборудования.ВСоставеКонфигурации, ДанныеОборудования.ТипОборудованияИмя);
		Если ОбработчикДрайвераМодуль <> Неопределено Тогда
			Результат = ОбработчикДрайвераМодуль.ВыполнитьКоманду(Команда, ВходныеПараметры, ВыходныеПараметры, Неопределено, Параметры, Неопределено);
			ПоддержкаАсинхронногоРежима = ОбработчикДрайвераМодуль.ПоддержкаАсинхронногоРежима();
		КонецЕсли;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти  

#Область ПроцедурыИФункцииПодключенияОтключенияОборудованияВФорме

// Начать подключение необходимых типов оборудования при открытии формы.
//
// Параметры:
//	Форма - ФормаКлиентскогоПриложения
//	ПоддерживаемыеТипыПодключаемогоОборудования - Строка
//		Содержит перечень типов подключаемого оборудования, разделенных запятыми.
//
Процедура НачатьПодключениеОборудованиеПриОткрытииФормы(ОповещениеПриПодключении, Форма, ПоддерживаемыеТипыПодключаемогоОборудования) Экспорт
	
	Форма.ПоддерживаемыеТипыПодключаемогоОборудования = ПоддерживаемыеТипыПодключаемогоОборудования;
	
	Если Форма.ИспользоватьПодключаемоеОборудование Тогда
			
	Если ОповещениеПриПодключении = Неопределено Тогда
		ОповещениеПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершениеПоУмолчанию", МенеджерОборудованияКлиент);
	КонецЕсли;
		НачатьПодключениеОборудованиеПоТипу(ОповещениеПриПодключении, Форма.УникальныйИдентификатор,
											ПреобразоватьСписокСтрокойВМассив(Форма.ПоддерживаемыеТипыПодключаемогоОборудования));
	КонецЕсли;
	
КонецПроцедуры

// Обработчик оповещения по умолчанию
//
Процедура ПодключитьОборудованиеЗавершениеПоУмолчанию(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru='При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// Начать отключать оборудование по типу при закрытии формы.
//
Процедура НачатьОтключениеОборудованиеПриЗакрытииФормы(ОповещениеПриОтключении, Форма) Экспорт
	
	Если ОповещениеПриОтключении = Неопределено Тогда
		ОповещениеПриОтключении = Новый ОписаниеОповещения("ОтключитьОборудованиеЗавершениеПоУмолчанию", МенеджерОборудованияКлиент);
	КонецЕсли;
	
	НачатьОтключениеОборудованиеПоТипу(ОповещениеПриОтключении, Форма.УникальныйИдентификатор, ПреобразоватьСписокСтрокойВМассив(Форма.ПоддерживаемыеТипыПодключаемогоОборудования));
	
КонецПроцедуры

Процедура ОтключитьОборудованиеЗавершениеПоУмолчанию(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru='При отключении оборудования произошла ошибка: ""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// Подключение необходимых типов оборудования при открытии формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - открываемая форма.
// 
// Возвращаемое значение:
//   Массив из см. МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании.
// 
Асинх Функция ПодключитьОборудованиеПриОткрытииФормыАсинх(Форма) Экспорт
	
	РезультатыПодключения = Новый Массив();
	
	ПодключаемоеОборудование = ПодключаемоеОборудованиеНаФорме(Форма);
	Если ПодключаемоеОборудование <> Неопределено Тогда
		
		РезультатыПодключения = Ждать ПодключениеОборудованияАсинх(
			Форма.УникальныйИдентификатор,
			ПодключаемоеОборудование.СписокОборудования);
			
		Форма.ПодключаемоеОборудованиеБПО.СписокОборудования = Неопределено;
		СписокОборудования = Новый Массив();
		Для Каждого Результат Из РезультатыПодключения Цикл
			Если Результат.Результат Тогда
				ПараметрыПодключения = МенеджерОборудованияКлиентСервер.ПараметрыПодключения(Результат.ПодключенноеУстройство);
				ПараметрыПодключения.Удалить("ШаблонЛокализации");
				СписокОборудования.Добавить(Новый ФиксированнаяСтруктура(ПараметрыПодключения));
			КонецЕсли;
		КонецЦикла;
		Форма.ПодключаемоеОборудованиеБПО.СписокОборудования = Новый ФиксированныйМассив(СписокОборудования);
		
		Если СуществуютРеквизитыНаФорме(Форма, "ПоддерживаемыеТипыПодключаемогоОборудования") Тогда
			ЗаполнитьПоддерживаемыеТипыПодключаемогоОборудованияНаФорме(Форма, ПодключаемоеОборудование.ТипыПО);
		КонецЕсли;
		Если СуществуютРеквизитыНаФорме(Форма, "ИспользоватьПодключаемоеОборудование") Тогда
			Форма.ИспользоватьПодключаемоеОборудование = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатыПодключения;
	
	
КонецФункции

// Отключение оборудования при закрытии формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - закрываемая форма.
//
// Возвращаемое значение:
//   Массив из см. МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании.
// 
Асинх Функция ОтключитьОборудованиеПриЗакрытииФормыАсинх(Форма) Экспорт
	
	// Замер производительности
	КлючеваяОперация = "ОбщийМодуль.МенеджерОборудованияКлиент.ОтключениеОборудованиеПриЗакрытииФормы";
	УИДЗамера = ОбщегоНазначенияБПОКлиент.ЗамерВремениБПО(КлючеваяОперация);
	
	Результат = Новый Массив();
	ПодключаемоеОборудование = ПодключаемоеОборудованиеНаФорме(Форма);
	Если ПодключаемоеОборудование <> Неопределено Тогда
		Результат = Ждать ОтключениеОборудованияАсинх(Форма.УникальныйИдентификатор);
	КонецЕсли;
	
	#Если Не МобильноеПриложениеКлиент Тогда 
	ОбщегоНазначенияБПОКлиент.ЗавершитьЗамерВремениБПО(УИДЗамера);
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииДляРаботыСДрайвером

// Проверяет установлен ли драйвер.
//
Функция ДрайверУстановлен(Идентификатор) Экспорт
	
	ДанныеОборудования = МенеджерОборудованияВызовСервера.ПолучитьДанныеУстройства(Идентификатор);
	ОбъектДрайвера = ПолучитьОбъектДрайвера(ДанныеОборудования);
	
	Возврат ОбъектДрайвера <> Неопределено;
	
КонецФункции

#Если Не ВебКлиент Тогда

// Установить или переустановить драйверы помеченные флагами.
//
Процедура ПереустановитьПомеченныеДрайверы() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация();
	МассивРабочихМест = МенеджерОборудованияКлиентПовтИсп.НайтиРабочиеМестаПоИД(ВРег(СистемнаяИнформация.ИдентификаторКлиента));
	Если МассивРабочихМест.Количество() = 0 Тогда
		РабочееМесто = Неопределено
	Иначе
		РабочееМесто = МассивРабочихМест[0];
	КонецЕсли;
	
	// Переустановить драйверы помеченные флагом для переустановки.
	Если ЗначениеЗаполнено(РабочееМесто) Тогда
		СписокОборудования = МенеджерОборудованияВызовСервера.ДрайвераДляПереустановки(РабочееМесто);
		Для Каждого Оборудование Из СписокОборудования Цикл
			Если Оборудование.ДанныеДрайвера.ВСоставеКонфигурации И НЕ Оборудование.ДанныеДрайвера.ПоставляетсяДистрибутивом Тогда
				НачатьУстановкуВнешнейКомпоненты(, "ОбщийМакет." + Оборудование.ДанныеДрайвера.ИмяМакетаДрайвера);
			КонецЕсли;
			МенеджерОборудованияВызовСервера.УстановитьПризнакПереустановкиДрайвера(РабочееМесто, Оборудование.ДрайверОборудования, Ложь); 
		КонецЦикла;
	КонецЕсли;
	
	// Установить драйверы помеченные флагом для установки.
	Если ЗначениеЗаполнено(РабочееМесто) Тогда
		СписокОборудования = МенеджерОборудованияВызовСервера.ДрайвераДляУстановки(РабочееМесто);
		Для Каждого Оборудование Из СписокОборудования Цикл
			Если Оборудование.ДанныеДрайвера.ВСоставеКонфигурации И НЕ Оборудование.ДанныеДрайвера.ПоставляетсяДистрибутивом Тогда
				ОбъектДрайвера = ПолучитьОбъектДрайвера(Оборудование.ДанныеДрайвера);
				Если ОбъектДрайвера = Неопределено Тогда
					НачатьУстановкуВнешнейКомпоненты(, "ОбщийМакет." + Оборудование.ДанныеДрайвера.ИмяМакетаДрайвера);
				Иначе
					ОтключитьОбъектДрайвера(Оборудование.ДанныеДрайвера);
				КонецЕсли;
			КонецЕсли;
			МенеджерОборудованияВызовСервера.УстановитьПризнакУстановкиДрайвера(РабочееМесто, Оборудование.ДрайверОборудования, Ложь); 
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Устарела: больше не используется.
// Установить или переустановить драйверы помеченные флагами.
//
Процедура ПереустановитьПомеченныеПоставляемыеДрайверы() Экспорт
	
	ПараметрыРаботыКлиента = ИнтеграцияПодсистемБПОКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	
	ОборудованиеДляПереустановки = Новый Массив;
	Для Каждого ИмяМакетаДрайвера Из ПараметрыРаботыКлиента.ОборудованиеДляПереустановки Цикл
		ОборудованиеДляПереустановки.Добавить(ИмяМакетаДрайвера);
	КонецЦикла;

	ВнешниеКомпонентыБПОКлиент.ПереустановитьКомпоненты(ОборудованиеДляПереустановки);
	
КонецПроцедуры

// Устарела: следует использовать ОбщегоНазначенияБПОКлиент.ПрочитатьКорневойЭлементXML.
// Читает корневой элемент XML.
//
// Параметры:
//  СтрокаXML - Строка - XML строка.
//
// Возвращаемое значение:
//  Структура.
//
Функция ПрочитатьКорневойЭлементXML(СтрокаXML) Экспорт
	
	Возврат ОбщегоНазначенияБПОКлиент.ПрочитатьКорневойЭлементXML(СтрокаXML);
	
КонецФункции

#Иначе

Процедура НачатьУстановкуРасширенияРаботыСФайламиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		НачатьУстановкуРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПодключениеРасширенияРаботыСФайламиЗавершение(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Не Подключено И ДополнительныеПараметры.ПредлагатьУстановку Тогда
		Оповещение = Новый ОписаниеОповещения("НачатьУстановкуРасширенияРаботыСФайламиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ТекстСообщения = НСтр("ru='Для продолжении работы необходимо установить расширение для веб-клиента ""1С:Предприятие"". Установить?'");
		ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет); 
	КонецЕсли;
	
	Если ДополнительныеПараметры.ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, Подключено);
	КонецЕсли
	
КонецПроцедуры

#КонецЕсли

// Проверить доступность расширения работы с Файлами.
// 
Процедура ПроверитьДоступностьРасширенияРаботыСФайлами(ОповещениеПриЗавершении, ПредлагатьУстановку = Истина) Экспорт
	
#Если Не ВебКлиент Тогда
	// В тонком и толстом клиентах расширение подключено всегда.
	ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, Истина);
	Возврат;
#Иначе
	ДополнительныеПараметры = Новый Структура("ОповещениеПриЗавершении, ПредлагатьУстановку", ОповещениеПриЗавершении, ПредлагатьУстановку);
	Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияРаботыСФайламиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	НачатьПодключениеРасширенияРаботыСФайлами(Оповещение);
#КонецЕсли
	
КонецПроцедуры

// Отключение объекта драйвера.
//
Процедура ОтключитьОбъектДрайвера(ДанныеДрайвера) Экспорт

	НомерСтрокиМассива = глПодключаемоеОборудование.ПараметрыПодключенияПО.Найти(ДанныеДрайвера.ДрайверОборудования);
	Если НомерСтрокиМассива <> Неопределено Тогда
		глПодключаемоеОборудование.ПараметрыПодключенияПО.Удалить(НомерСтрокиМассива);
	КонецЕсли;
	
КонецПроцедуры

// Получение объекта драйвера
//
Функция ПолучитьОбъектДрайвера(ДанныеДрайвера, ТекстОшибки = Неопределено)
	
	ОбъектДрайвера = Неопределено;
	
	Для Каждого ДрайверПО Из глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования Цикл
		Если ДрайверПО.Ключ = ДанныеДрайвера.ДрайверОборудования  Тогда
			ОбъектДрайвера = ДрайверПО.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;   
	
	Если ОбъектДрайвера = Неопределено Тогда
		Попытка
			
			ProgID = ДанныеДрайвера.ИдентификаторОбъекта;
			Если ПустаяСтрока(ProgID) Тогда
				ОбъектДрайвера = ""; // Драйвер не требуется
			Иначе
				ProgID1 = ?(Найти(ProgID, "|") > 0, Сред(ProgID, 1, Найти(ProgID, "|")-1), ProgID); 
				ProgID2 = ?(Найти(ProgID, "|") > 0, Сред(ProgID, Найти(ProgID, "|")+1), ProgID); 
				Если ДанныеДрайвера.ПоставляетсяДистрибутивом Тогда
					ПодключитьВнешнююКомпоненту(ProgID1);
				Иначе
					ИмяОбъекта = Сред(ProgID1, Найти(ProgID1, ".") + 1); 
					Префикс = Сред(ProgID1, 1, Найти(ProgID1, ".")); 
					ProgID2 = Префикс + СтрЗаменить(ИмяОбъекта, ".", "_") + "." + ИмяОбъекта;
					Если ДанныеДрайвера.ВСоставеКонфигурации Тогда
						Результат = ПодключитьВнешнююКомпоненту("ОбщийМакет." + ДанныеДрайвера.ИмяМакетаДрайвера, СтрЗаменить(ИмяОбъекта, ".", "_"));
					Иначе
						СсылкаНаДрайвер = ПолучитьНавигационнуюСсылку(ДанныеДрайвера.ДрайверОборудования, "ЗагруженныйДрайвер");
						Результат = ПодключитьВнешнююКомпоненту(СсылкаНаДрайвер, СтрЗаменить(ИмяОбъекта, ".", "_"));
					КонецЕсли;
				КонецЕсли;
				ОбъектДрайвера = Новый (ProgID2);
			КонецЕсли;
				
		Исключение
			Инфо = ИнформацияОбОшибке();
			ТекстОшибки = Инфо.Описание;
		КонецПопытки;
		
		Если ОбъектДрайвера <> Неопределено Тогда
			глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования.Вставить(ДанныеДрайвера.ДрайверОборудования, ОбъектДрайвера);
			ОбъектДрайвера = глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования[ДанныеДрайвера.ДрайверОборудования];
		КонецЕсли;
		
	КонецЕсли;   
		
	Возврат ОбъектДрайвера;
	
КонецФункции

Процедура НачатьПолучениеОбъектаДрайвераЗавершение(Подключено, ДополнительныеПараметры) Экспорт
	
	ОбъектДрайвера = Неопределено;
	
	Если Подключено Тогда 
		Попытка
			ОбъектДрайвера = Новый (ДополнительныеПараметры.ProgID);
			Если ОбъектДрайвера <> Неопределено Тогда
				глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования.Вставить(ДополнительныеПараметры.ДрайверОборудования, ОбъектДрайвера);
				ОбъектДрайвера = глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования[ДополнительныеПараметры.ДрайверОборудования];
			КонецЕсли;
			ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, ОбъектДрайвера);
			Возврат;
		Исключение
			ОбъектДрайвера = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеПриЗавершении, Неопределено);
	
КонецПроцедуры

// Начать получение объекта драйвера.
//
Процедура НачатьПолучениеОбъектаДрайвера(ОповещениеПриЗавершении, ДанныеДрайвера) Экспорт
	
	ОбъектДрайвера = Неопределено;
	
	Для Каждого ДрайверПО Из глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования Цикл
		Если ДрайверПО.Ключ = ДанныеДрайвера.ДрайверОборудования  Тогда
			ОбъектДрайвера = ДрайверПО.Значение;
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, ОбъектДрайвера);
			Возврат;
		КонецЕсли;
	КонецЦикла;   
	
	Если ОбъектДрайвера = Неопределено Тогда
			ProgID = ДанныеДрайвера.ИдентификаторОбъекта;
			Если ПустаяСтрока(ProgID) Тогда
				ОбъектДрайвера = ""; // Драйвер не требуется
				ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, ОбъектДрайвера);
			Иначе
				ProgID1 = ?(Найти(ProgID, "|") > 0, Сред(ProgID, 1, Найти(ProgID, "|")-1), ProgID); 
				ProgID2 = ?(Найти(ProgID, "|") > 0, Сред(ProgID, Найти(ProgID, "|")+1), ProgID); 
				
				Если ДанныеДрайвера.ПоставляетсяДистрибутивом Тогда
					Параметры = Новый Структура("ProgID, ОповещениеПриЗавершении, ДрайверОборудования", ProgID2, ОповещениеПриЗавершении, ДанныеДрайвера.ДрайверОборудования);
					Оповещение = Новый ОписаниеОповещения("НачатьПолучениеОбъектаДрайвераЗавершение", ЭтотОбъект, Параметры);
					НачатьПодключениеВнешнейКомпоненты(Оповещение, ProgID1);
				Иначе
					ИмяОбъекта = Сред(ProgID1, Найти(ProgID1, ".") + 1); 
					Префикс = Сред(ProgID1, 1, Найти(ProgID1, ".")); 
					ProgID2 = Префикс + СтрЗаменить(ИмяОбъекта, ".", "_") + "." + ИмяОбъекта;
					
					Параметры = Новый Структура("ProgID, ОповещениеПриЗавершении, ДрайверОборудования", ProgID2, ОповещениеПриЗавершении, ДанныеДрайвера.ДрайверОборудования);
					Оповещение = Новый ОписаниеОповещения("НачатьПолучениеОбъектаДрайвераЗавершение", ЭтотОбъект, Параметры);
					Если ДанныеДрайвера.ВСоставеКонфигурации Тогда
						НачатьПодключениеВнешнейКомпоненты(Оповещение, "ОбщийМакет." + ДанныеДрайвера.ИмяМакетаДрайвера, СтрЗаменить(ИмяОбъекта, ".", "_"));
					Иначе
						СсылкаНаДрайвер = ПолучитьНавигационнуюСсылку(ДанныеДрайвера.ДрайверОборудования, "ЗагруженныйДрайвер");
						НачатьПодключениеВнешнейКомпоненты(Оповещение, СсылкаНаДрайвер, СтрЗаменить(ИмяОбъекта, ".", "_"));
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
	КонецЕсли;   
	
КонецПроцедуры

// Установить драйвер оборудования.
//
Процедура УстановитьДрайвер(Идентификатор, ОповещениеИзДистрибутиваПриЗавершении = Неопределено, ОповещениеИзАрхиваПриЗавершении = Неопределено) Экспорт
	
	ДанныеДрайвера = МенеджерОборудованияВызовСервера.ПолучитьДанныеДрайвера(Идентификатор);
	
	Попытка  
		Если ДанныеДрайвера.ВСоставеКонфигурации Тогда
			
			Если ДанныеДрайвера.ПоставляетсяДистрибутивом Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Данный драйвер не может быть установлен из дистрибутива.'")); 
			Иначе
				НачатьУстановкуВнешнейКомпоненты(ОповещениеИзАрхиваПриЗавершении, "ОбщийМакет." + ДанныеДрайвера.ИмяМакетаДрайвера);
			КонецЕсли;
			
		Иначе
			
			Если ДанныеДрайвера.ПоставляетсяДистрибутивом Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Данный драйвер не может быть установлен и использован.'")); 
			Иначе
				СсылкаНаДрайвер = ПолучитьНавигационнуюСсылку(ДанныеДрайвера.ДрайверОборудования, "ЗагруженныйДрайвер");
				НачатьУстановкуВнешнейКомпоненты(ОповещениеИзАрхиваПриЗавершении, СсылкаНаДрайвер);
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Произошла ошибка при установке драйвера.'")); 
	КонецПопытки;  
		
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляРаботыСПодключаемымОборудованием

// Начать выполнение команды ответственному обработчику драйвера
//
Процедура НачатьВыполнениеКоманды(ОповещениеПриЗавершении, Идентификатор, Команда, ВходныеПараметры) Экспорт
	
	
	// Поиск подключенного устройства.
	ПодключенноеУстройство = ПолучитьПодключенноеУстройство(Идентификатор,глПодключаемоеОборудование.ПараметрыПодключенияПО);
	
	Если ПодключенноеУстройство = Неопределено и глПодключаемоеОборудование.ПараметрыПодключенияПО.Количество() > 0 Тогда
	ПодключенноеУстройство = глПодключаемоеОборудование.ПараметрыПодключенияПО[0]	
	КонецЕсли;	
	
	//Если Команда = "PrintCheckCopy" Тогда  
	//	
	//ТипыПО = Новый Массив();
	//ТипыПО.Добавить("ПринтерЧеков");
	//МассивПринтеровЧеков =	МенеджерОборудованияВызовСервера.ОборудованиеПоПараметрам(ТипыПО, Идентификатор, РабочееМестоКлиента());	
	//Если МассивПринтеровЧеков.Количество() > 0 Тогда
	//	 ПодключенноеУстройство = МассивПринтеровЧеков[0]
	//КонецЕсли;	
	//КонецЕсли;	

	Если ПодключенноеУстройство <> Неопределено Тогда
		
		ОбработчикДрайвераМодуль = ПодключенноеУстройство.ОбработчикДрайвераМодуль; 
		//ОбработчикДрайвераМодуль = глПодключаемоеОборудование.ПараметрыПодключенияПО[0];
		ОбъектДрайвера = ПодключенноеУстройство.ОбъектДрайвера;  
		//ОбъектДрайвера = ОбработчикДрайвераМодуль.ОбъектДрайвера;
		Если ОбработчикДрайвераМодуль = Неопределено Или ОбъектДрайвера = Неопределено Тогда
			// Сообщить об ошибке, что не удалось загрузить драйвер.
			ТекстОшибки = НСтр("ru='Не удалось подключить обработчик драйвера или загрузить драйвер.'");
			РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании();
			РезультатВыполнения.Результат = Ложь;
			РезультатВыполнения.ОписаниеОшибки = ТекстОшибки; 
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
		Иначе
			Если ОбработчикДрайвераМодуль.ПоддержкаАсинхронногоРежима() Тогда
				ОбработчикДрайвераМодуль.НачатьВыполнениеКоманды(ОповещениеПриЗавершении, Команда, ВходныеПараметры,
					 ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
			Иначе
				ТекстОшибки = "";
				ВыходныеПараметры = Неопределено;
				Результат = ОбработчикДрайвераМодуль.ВыполнитьКоманду(Команда, ВходныеПараметры,
					ВыходныеПараметры,  ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
				Если Не Результат Тогда
					Если ВыходныеПараметры.Количество() >= 2 Тогда
						ТекстОшибки = ВыходныеПараметры[1];
					КонецЕсли;
					ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
				КонецЕсли;
				РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Результат, ТекстОшибки, Идентификатор);
				РезультатВыполнения.ВыходныеПараметры = ВыходныеПараметры;
				РезультатВыполнения.Вставить("ОбработчикДрайвераМодуль", ОбработчикДрайвераМодуль);
				РезультатВыполнения.Вставить("ОбъектДрайвера"          , ОбъектДрайвера);
				РезультатВыполнения.Вставить("ПодключенноеУстройство"  , ПодключенноеУстройство);
				ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
			КонецЕсли;
		КонецЕсли;
	Иначе
		// Сообщить об ошибке, что устройство не подключено.
		ТекстОшибки = НСтр("ru='Устройство не подключено. Перед выполнением операции устройство должно быть подключено.'");
		РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании();
		РезультатВыполнения.Результат = Ложь;
		РезультатВыполнения.ОписаниеОшибки = ТекстОшибки; 
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// Начать выполнение дополнительной команды к драйверу, не требующую предварительного подключения устройства в системе.
//
Процедура НачатьВыполнениеДополнительнойКоманды(ОповещениеПриЗавершении, Команда, ВходныеПараметры, Идентификатор, Параметры) Экспорт
	
	// Поиск подключенного устройства.
	ПодключенноеУстройство = ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО, Идентификатор);
	ПодключенноеУстройство = Неопределено;                                                      
	Если ПодключенноеУстройство = Неопределено Тогда
		ДанныеОборудования = МенеджерОборудованияВызовСервера.ПолучитьДанныеУстройства(Идентификатор);
		ПараметрыКоманды = Новый Структура();
		ПараметрыКоманды.Вставить("Команда"           , Команда);
		ПараметрыКоманды.Вставить("ВходныеПараметры"  , ВходныеПараметры);
		ПараметрыКоманды.Вставить("Параметры"         , Параметры);
		ПараметрыКоманды.Вставить("ДанныеОборудования", ДанныеОборудования);
		ПараметрыКоманды.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
		Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеДополнительнойКоманды_Завершение", ЭтотОбъект, ПараметрыКоманды);
		НачатьПолучениеОбъектаДрайвера(Оповещение, ДанныеОборудования);
	Иначе
		 //Сообщить об ошибке, что устройство подключено.
		ТекстОшибки = НСтр("ru='Устройство подключено. Перед выполнением операции устройство должно быть отключено.'");
		ВыходныеПараметры = Новый Массив();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ТекстОшибки);
		ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
		РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстОшибки, Идентификатор); 
		РезультатВыполнения.ВыходныеПараметры = ВыходныеПараметры;
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// Завершение выполнение дополнительной команды к драйверу.
// Не требует предварительного подключения устройства в системе.
//
// Параметры:
// 	ОбъектДрайвера - СправочникСсылка.ДрайверыОборудования - .
// 	ПараметрыКоманды - Структура - где:
// 	*Параметры - Структура - .
Процедура НачатьВыполнениеДополнительнойКоманды_Завершение(ОбъектДрайвера, ПараметрыКоманды) Экспорт
	
	Если ОбъектДрайвера = Неопределено Тогда
		// Сообщить об ошибке, что не удалось загрузить драйвер.
		ТекстОшибки = НСтр("ru='Не удалось загрузить драйвер устройства.
								|Проверьте, что драйвер корректно установлен и зарегистрирован в системе.'");
		ВыходныеПараметры = Новый Массив();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ТекстОшибки);
		ВыходныеПараметры.Добавить(НСтр("ru='Не установлен'"));
		РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстОшибки); 
		РезультатВыполнения.ВыходныеПараметры = ВыходныеПараметры;
		ВыполнитьОбработкуОповещения(ПараметрыКоманды.ОповещениеПриЗавершении, РезультатВыполнения);
	Иначе
		
		ДанныеОборудования = ПараметрыКоманды.ДанныеОборудования; 
		ОбработчикДрайвераМодуль = МенеджерОборудованияКлиентПовтИсп.ПолучитьОбработчикДрайвера(ДанныеОборудования.ОбработчикДрайвера, Не ДанныеОборудования.ВСоставеКонфигурации, ДанныеОборудования.ТипОборудованияИмя);
		
		Если ОбработчикДрайвераМодуль = Неопределено Тогда
			// Сообщить об ошибке, что не удалось подключить обработчик драйвера.
			ТекстОшибки = НСтр("ru='Не удалось подключить обработчик драйвера.'");
			ВыходныеПараметры = Новый Массив();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ТекстОшибки);
			ВыходныеПараметры.Добавить(НСтр("ru='Не установлен'"));
			РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстОшибки); 
			РезультатВыполнения.ВыходныеПараметры = ВыходныеПараметры;
			ВыполнитьОбработкуОповещения(ПараметрыКоманды.ОповещениеПриЗавершении, РезультатВыполнения);
		Иначе
			времПараметрыПодключения = Новый Структура();
			времПараметрыПодключения.Вставить("ТипОборудования", ПараметрыКоманды.ДанныеОборудования.ТипОборудованияИмя);
			
			Если ОбработчикДрайвераМодуль.ПоддержкаАсинхронногоРежима() Тогда
				ОбработчикДрайвераМодуль.НачатьВыполнениеКоманды(ПараметрыКоманды.ОповещениеПриЗавершении, ПараметрыКоманды.Команда, ПараметрыКоманды.ВходныеПараметры,
					ОбъектДрайвера, ПараметрыКоманды.Параметры, времПараметрыПодключения);
			Иначе
				ТекстОшибки = "";
				ВыходныеПараметры = Неопределено;
				Результат = ОбработчикДрайвераМодуль.ВыполнитьКоманду(ПараметрыКоманды.Команда, ПараметрыКоманды.ВходныеПараметры,
					ВыходныеПараметры, ОбъектДрайвера, ПараметрыКоманды.Параметры, времПараметрыПодключения);
				Если Не Результат Тогда
					Если ВыходныеПараметры.Количество() >= 2 Тогда
						ТекстОшибки = ВыходныеПараметры[1];
					КонецЕсли;
					ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
				КонецЕсли;
				РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Результат); 
				РезультатВыполнения.ВыходныеПараметры = ВыходныеПараметры;
				ВыполнитьОбработкуОповещения(ПараметрыКоманды.ОповещениеПриЗавершении, РезультатВыполнения);
			КонецЕсли;
		КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСУстройствамиВвода

// Производит обработку данных события, полученных от клиента.
// 
// Параметры:
// 	ОписаниеСобытия - Структура - содержит поля:
// 	*Источник - Строка - источник события.
// 	ОписаниеОшибки - Строка - Описание
// Возвращаемое значение:
// 	Булево - Описание
Функция ОбработатьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки = "") Экспорт

	Результат = Истина;
	
	// Поиск обработчика события
	
	ПараметрыПодключенияПО = глПодключаемоеОборудование.ПараметрыПодключенияПО; //Массив Из Структура, где: *Параметры - Структура - .
	
	Для Каждого Подключение Из ПараметрыПодключенияПО Цикл
						  
		Если Подключение.ИсточникСобытия = ОписаниеСобытия.Источник
		 Или (ПустаяСтрока(Подключение.ИсточникСобытия) И Подключение.ИменаСобытий <> Неопределено) Тогда
		   
		   // Ищем среди подключенного оборудования устройство с полученным событием.
		    Событие = Подключение.ИменаСобытий.Найти(ОписаниеСобытия.Событие);
		    Если Событие <> Неопределено Тогда
				
				ОбработчикДрайвераМодуль = Подключение.ОбработчикДрайвераМодуль;
				ОбъектДрайвера = Подключение.ОбъектДрайвера;
				
				ВыходныеПараметры = Новый Массив();
				
				// Обрабатываем сообщение
				Результат = ОбработчикДрайвераМодуль.ОбработатьСобытие(ОбъектДрайвера, Подключение.Параметры, Подключение.ПараметрыПодключения, ОписаниеСобытия.Событие, ОписаниеСобытия.Данные, ВыходныеПараметры);
				// Обрабатываем сообщение
				Если Результат Тогда
					// Оповещаем 
					Оповестить(ВыходныеПараметры[0], ВыходныеПараметры[1], "ПодключаемоеОборудование");
				КонецЕсли;
				ОбработчикДрайвераМодуль.ЗавершитьОбработкуСобытия(ОбъектДрайвера, Подключение.Параметры, Подключение.ПараметрыПодключения, ВыходныеПараметры);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСФискальнымиУстройствами

Процедура НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	Если ИдентификаторУстройства = Неопределено Тогда
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ОписаниеОшибки = НСтр("ru='Фискальное устройство не выбрано или не подключено.'");
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	Иначе
		// Возвращаем сохраненные ранее параметры регистрации устройства. 
		Если Параметры.ВыполняемаяКоманда = "GetDataKKT"  И (Параметры.Свойство("ИспользоватьСохраненныеЗначения") И Параметры.ИспользоватьСохраненныеЗначения) Тогда
			ПараметрыРегистрации = МенеджерОборудованияВызовСервера.ПолучитьПараметрыРегистрацииУстройства(ИдентификаторУстройства);
			Если ПараметрыРегистрации.ЕстьДанные Тогда
				РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Истина);
				РезультатВыполнения.Вставить("ВыходныеПараметры", ПараметрыРегистрации);
				ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатВыполнения);
				Возврат;
			КонецЕсли
		КонецЕсли;
		
		Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
		
		ТребуетсяПроверкаАктивностиСмены = Параметры.Свойство("ПроверкаАктивностиСмены") И Параметры.ПроверкаАктивностиСмены;
		Если ТребуетсяПроверкаАктивностиСмены Тогда
			
			СтатусПоследнейСмены = МенеджерОборудованияВызовСервера.ПолучитьСтатусПоследнейСмены(ИдентификаторУстройства);
			Если Не СтатусПоследнейСмены.Активна = Истина Тогда
				ОписаниеОшибки = НСтр("ru='Кассовая смена не открыта или истекла.'");
				РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
				ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
				Возврат;
			Иначе
				Если Параметры.ВыполняемаяКоманда = "CheckFiscalization" Тогда
					Если Параметры.ВходныеПараметры.Свойство("НомерЧека") Тогда
						Параметры.ВходныеПараметры.НомерЧека = СтатусПоследнейСмены.ТекущийНомерЧека;
					КонецЕсли;
					Параметры.ВходныеПараметры = МенеджерОборудованияВызовСервера.СформироватьШаблонЧека(Параметры.ВходныеПараметры, , ИдентификаторУстройства);
					ОсновныеПараметры = Параметры.ВходныеПараметры;
					// Проверка обязательности реквизитов 
					ОписаниеОшибки = "";
					Если НЕ МенеджерОборудованияВызовСервера.ВыполненаПроверкаОбязательностиИПравильностиЗаполненияТэгов(ОсновныеПараметры, ИдентификаторУстройства, ОписаниеОшибки) Тогда
						РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
						ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
						Возврат;
					КонецЕсли;
					Отказ = Ложь;
					ИсправленыОсновныеПараметры = Ложь;
					МенеджерОборудованияВызовСервера.ПривестиДанныеКТребуемомуФормату(ОсновныеПараметры, Отказ, ОписаниеОшибки, ИсправленыОсновныеПараметры);
					Если Отказ Тогда
						РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
						ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
						Возврат;
					ИначеЕсли ИсправленыОсновныеПараметры Тогда
						Параметры.ВходныеПараметры = ОсновныеПараметры;
					КонецЕсли;
					
				КонецЕсли;
				Параметры.Вставить("КассоваяСмена", СтатусПоследнейСмены.КассоваяСмена);
				
			КонецЕсли;
		КонецЕсли;
		
		Если Параметры.ВыполняемаяКоманда = "OpenShift" Тогда
			ТребуетсяЗакрытиеСмены = МенеджерОборудованияВызовСервера.ТребуетсяЗакрытиеСмены(ИдентификаторУстройства);
			Если ТребуетсяЗакрытиеСмены Тогда
				ОповещениеПриЗавершении = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПослеПроверкиСтатуса", ЭтотОбъект, Параметры);
				МенеджерОборудованияКлиент.НачатьПолучениеТекущегоСостоянияФискальногоУстройства(ОповещениеПриЗавершении, Параметры.УникальныйИдентификатор, ИдентификаторУстройства);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПодключениеЗавершение", ЭтотОбъект, Параметры);
		НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, Параметры.УникальныйИдентификатор, ИдентификаторУстройства);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыполнениеКоманды_ПослеПроверкиСтатуса(Результат, Параметры) Экспорт
	
	Если Результат.Результат Тогда
		
		СтатусСмены = Результат.ВыходныеПараметры[2];
		Если МенеджерОборудованияКлиентСервер.ТребуетсяЗакрытиеСмены(СтатусСмены) Тогда
			ТекстВопроса = НСтр("ru = 'На фискальном устройстве открыта кассовая смена, данные о которой отсутствуют в системе.
									|Выполнить закрытие смены?'");
			ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПослеПодтвержденияЗакрытияСмены", ЭтотОбъект, Параметры);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПодключениеЗавершение", ЭтотОбъект, Параметры);
			НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);
		КонецЕсли;
		
	Иначе
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПодключениеЗавершение", ЭтотОбъект, Параметры);
		НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыполнениеКоманды_ПослеПодтвержденияЗакрытияСмены(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		НоваяКассоваяСмена = МенеджерОборудованияВызовСервера.НоваяКассоваяСмена(Параметры.ИдентификаторУстройства);
		ОповещениеВыполнения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПослеЗакрытияСмены", ЭтотОбъект, Параметры);
		МенеджерОборудованияКлиент.НачатьЗакрытиеСменыНаФискальномУстройстве(ОповещениеВыполнения, Параметры.УникальныйИдентификатор, Параметры.ВходныеПараметры, Параметры.ИдентификаторУстройства,, НоваяКассоваяСмена);
		
	Иначе
		ТекстСообщения = НСтр("ru = 'На фискальном устройстве смена не закрыта'");
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстСообщения);
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыполнениеКоманды_ПослеЗакрытияСмены(Результат, Параметры) Экспорт
	
	Если Результат.Результат Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПодключениеЗавершение", ЭтотОбъект, Параметры);
		НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыполнениеКоманды_ПодключениеЗавершение(РезультатПодключения, Параметры) Экспорт
	
	Если Параметры.Свойство("ВыполняемаяКоманда") Тогда
		ВыполняемаяКоманда = Параметры.ВыполняемаяКоманда
	Иначе
		ВыполняемаяКоманда = Параметры.Команда
	КонецЕсли;
	
	Если ВыполняемаяКоманда = "CheckFiscalization" или ВыполняемаяКоманда = "PrintText" Тогда
		Если РезультатПодключения.Результат Тогда  
			ВходныеПараметры  = Неопределено; 
			
			Если (ВыполняемаяКоманда = "CheckFiscalization") И (Параметры.ОповещениеПослеОткрытииЧека <> Неопределено) Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыполнитьКомандуЗавершение", ЭтотОбъект, Параметры);
				НачатьВыполнениеКомандыПечатиЧека(ОписаниеОповещения, Параметры.ИдентификаторУстройства, ВыполняемаяКоманда, Параметры, Параметры.ВходныеПараметры);
			Иначе
				ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыполнитьКомандуЗавершение", ЭтотОбъект, Параметры);
				НачатьВыполнениеКоманды(ОписаниеОповещения, Параметры.ИдентификаторУстройства, ВыполняемаяКоманда, Параметры.ВходныеПараметры); 
				//НачатьВыполнениеКомандыСтарый(ОписаниеОповещения, Параметры.ИдентификаторКлиента,Параметры.ИдентификаторУстройства,Параметры.ПараметрыОперации,Параметры, Параметры.ИдентификаторУстройства);
			КонецЕсли;
		Иначе
			Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
				ТекстСообщения = НСтр("ru='При подключении оборудования произошла ошибка: %ДополнительноеОписание%'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатПодключения.ОписаниеОшибки);
				РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстСообщения);
				РезультатОперации.ИдентификаторУстройства = Параметры.ИдентификаторУстройства;
				ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		Если РезультатПодключения.Результат Тогда  
			
			ПодключенноеУстройство = ПолучитьПодключенноеУстройство(Параметры.ИдентификаторУстройства);
			Если ПодключенноеУстройство = Неопределено Тогда	
				
			ДанныеДрайвераОборудования = МенеджерОборудованияВызовСервера.ПолучитьДанныеУстройства(Параметры.ИдентификаторУстройства);  
			ПодключенноеУстройство = омг_WebKassa.ДанныеДрайвераОборудования(ДанныеДрайвераОборудования);

			КонецЕсли;

			Параметры.ПодключенноеУстройство = ПодключенноеУстройство;
			Параметры.Подключено = Истина;
			
			// Нужно ли использовать печатающее устройство.
			Если Параметры.ИспользоватьПечатающееУстройство И Параметры.ПечатьСлипЧека
				И НЕ ПодключенноеУстройство.ПечатьКвитанцийНаТерминале Тогда
				ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПечатающегоУстройстваЗавершение", ЭтотОбъект, Параметры);
				НачатьПодключениеПечатающегоУстройства(ОписаниеОповещения, Параметры.ИдентификаторКлиента, Параметры.ПечатающееУстройство); 
			Иначе
				ВыполнениеКомандыОбработчика(ПодключенноеУстройство, Параметры);
			КонецЕсли;
			
		Иначе
			ТекстСообщения = СтрШаблон(НСтр("ru='При подключении оборудования произошла ошибка: %1'"), РезультатПодключения.ОписаниеОшибки);
			РезультатОперации = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстСообщения);
			РезультатОперации.ИдентификаторУстройства = Параметры.ИдентификаторУстройства;
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Описание процедуры выполнения команды.
// 
// Параметры:
// 	РезультатВыполнения - Структура - содержит параметры:
// 	*ПодключенноеУстройство - СправочникСсылка.ПодключаемоеОборудование - .
// 	*ДополнительныеПараметры - Структура - структура дополнительных параметров.
// 	Параметры - Структура - содержит параметры:
// 	*ДополнительныеПараметры - Структура - структура дополнительных параметров.
//
Процедура НачатьВыполнениеКоманды_ВыполнитьКомандуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		ТекстСообщения = НСтр("ru='Ошибок нет.'");
		
		Если МенеджерОборудованияКлиентСервер.ТребуетсяВызовСобытияПослеВыполненияКомандыФискальнымУстройством(Параметры) Тогда
			
			СтруктураПараметров = Новый Структура();
			
			Если (РезультатВыполнения.ВыходныеПараметры.Количество() > 4) И РезультатВыполнения.ВыходныеПараметры[4] <> Неопределено Тогда
				СтруктураПараметров.Вставить("ФискальныеДанныеСтруктура", РезультатВыполнения.ВыходныеПараметры[4]);
			КонецЕсли;
			Если (РезультатВыполнения.ВыходныеПараметры.Количество() > 5) И РезультатВыполнения.ВыходныеПараметры[5] <> Неопределено Тогда
				СтруктураПараметров.Вставить("ФискальныеДанныеXMLСтрока", РезультатВыполнения.ВыходныеПараметры[5]);
			КонецЕсли;
			СтруктураПараметров.Вставить("ИдентификаторУстройства", Параметры.ИдентификаторУстройства);
			Если Параметры.Свойство("КассоваяСмена") Тогда
				СтруктураПараметров.Вставить("КассоваяСмена", Параметры.КассоваяСмена);
			КонецЕсли;
			СтруктураПараметров.Вставить("ВыполняемаяКоманда", Параметры.ВыполняемаяКоманда);
			Если Параметры.Свойство("ДополнительныеПараметры") Тогда
				СтруктураПараметров.Вставить("ДополнительныеПараметры", Параметры.ДополнительныеПараметры);
			КонецЕсли;
			
			МенеджерОборудованияВызовСервера.ПослеВыполненияКомандыФискальнымУстройством(СтруктураПараметров);
			
		КонецЕсли;
		
		Если Параметры.ВыполняемаяКоманда = "CheckFiscalization" И МенеджерОборудованияКлиентПовтИсп.ИспользуетсяПодсистемыФискальныхУстройств() Тогда
			
			МенеджерОборудованияВызовСервера.ИнкрементироватьТекущийНомерЧекаККТ(Параметры.ИдентификаторУстройства, Параметры.КассоваяСмена);
			
			ВремВходныеПараметры = Параметры.ВходныеПараметры; 
			ВремВыходныеПараметры = Неопределено;
			Если ВремВходныеПараметры.НефискальныеДокументы.Количество() > 0 И РезультатВыполнения.Свойство("ОбработчикДрайвераМодуль") Тогда
				ОбработчикДрайвераМодуль = РезультатВыполнения.ОбработчикДрайвераМодуль;
				ОбъектДрайвера           = РезультатВыполнения.ОбъектДрайвера;
				ПодключенноеУстройство   = РезультатВыполнения.ПодключенноеУстройство;
				ПоддержкаАсинхронногоРежима = ОбработчикДрайвераМодуль.ПоддержкаАсинхронногоРежима();
				
				ВходныеПараметрыОперации = Новый Массив();
				ВходныеПараметрыОперации.Добавить(ВремВходныеПараметры.НефискальныеДокументы);
				
				Если ПоддержкаАсинхронногоРежима Тогда
					ОбработчикДрайвераМодуль.НачатьВыполнениеКоманды(Неопределено, "PrintTextDocument", ВходныеПараметрыОперации, 
						ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
				Иначе
					ОбработчикДрайвераМодуль.ВыполнитьКоманду("PrintTextDocument", ВходныеПараметрыОперации, ВремВыходныеПараметры,
						ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
				КонецЕсли;
				
				МенеджерОборудованияКлиентПереопределяемый.НачатьРассылкуНефискальныхДокументов(Параметры);
				
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		ТекстСообщения = НСтр("ru='При выполнении операции произошла ошибка: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ВыходныеПараметры[1]);
	КонецЕсли;
	
	Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(РезультатВыполнения.Результат, ТекстСообщения, Параметры.ИдентификаторУстройства);
		РезультатОперации.Вставить("ВыходныеПараметры", РезультатВыполнения.ВыходныеПараметры);
		
		Если РезультатВыполнения.Свойство("ДополнительныеПараметры") Тогда
			РезультатОперации.Вставить("ДополнительныеПараметры", РезультатВыполнения.ДополнительныеПараметры);
		КонецЕсли;
		
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
	НачатьОтключениеОборудованиеПоИдентификатору(, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);
	
КонецПроцедуры

// Начать формирование отчета о текущем состоянии расчетов на фискальном устройстве.
// УникальныйИдентификатор - идентификатор формы.
// ИдентификаторУстройства - идентификатор устройства, если неопределенно - будет предложен выбор.
// ОповещениеПриЗавершении - оповещение при завершении завершении.
//
Процедура НачатьФормированиеОтчетаОТекущемСостоянииРасчетов(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства = Неопределено, ТипОборудования = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , ПараметрыОперации);
	Контекст.Вставить("ВыполняемаяКоманда"      , "ReportCurrentStatusOfSettlements");
	
	Если ТипОборудования = Неопределено Тогда
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
		ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
		ПоддерживаемыеТипыВО.Добавить("ККТ");
	Иначе
		ПоддерживаемыеТипыВО = ТипОборудования;
	КонецЕсли;
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите фискальное устройство'"),
			НСтр("ru='Фискальное устройство не подключено.'"), 
			НСтр("ru='Фискальное устройство не выбрано.'"),
			Истина);
	Иначе
		НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Начать формирование отчета отчет без гашения  на фискальном устройстве.
// УникальныйИдентификатор - идентификатор формы.
// ИдентификаторУстройства - идентификатор устройства, если неопределенно - будет предложен выбор.
// ОповещениеПриЗавершении - оповещение при завершении завершении.
//
Процедура НачатьФормированиеОтчетаБезГашения(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства = Неопределено, ТипОборудования = Неопределено) Экспорт
	                     
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , ПараметрыОперации);
	Контекст.Вставить("ВыполняемаяКоманда"      , "PrintXReport");
	
	Если ТипОборудования = Неопределено Тогда
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
		ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
		ПоддерживаемыеТипыВО.Добавить("ККТ");
	Иначе
		ПоддерживаемыеТипыВО = ТипОборудования;
	КонецЕсли;
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите фискальное устройство'"),
			НСтр("ru='Фискальное устройство не подключено.'"), 
			НСтр("ru='Фискальное устройство не выбрано.'"),
			Истина);
	Иначе
		НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Начать открытие смены на фискальном устройстве.
// УникальныйИдентификатор - идентификатор формы.
// ИдентификаторУстройства - идентификатор устройства, если неопределенно - будет предложен выбор.
// ОповещениеПриЗавершении - оповещение при завершении завершении.
//
Процедура НачатьОткрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства = Неопределено, ТипОборудования = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , ПараметрыОперации);
	Контекст.Вставить("ВыполняемаяКоманда"      , "OpenShift");
	Контекст.Вставить("ДополнительныеПараметры" , ДополнительныеПараметры);
	
	Если ТипОборудования = Неопределено Тогда
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
		ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
		ПоддерживаемыеТипыВО.Добавить("ККТ");
	Иначе
		ПоддерживаемыеТипыВО = ТипОборудования;
	КонецЕсли;
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите фискальное устройство'"), 
			НСтр("ru='Фискальное устройство не подключено.'"), 
			НСтр("ru='Фискальное устройство не выбрано.'"), 
			Истина);
	Иначе
		НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Начать закрытие смены на фискальном устройстве.
// УникальныйИдентификатор - идентификатор формы.
// ИдентификаторУстройства - идентификатор устройства, если неопределенно - будет предложен выбор.
// ОповещениеПриЗавершении - оповещение при завершении завершении.
//
Процедура НачатьЗакрытиеСменыНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства = Неопределено, ТипОборудования = Неопределено, КассоваяСмена = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , ПараметрыОперации);
	Контекст.Вставить("ВыполняемаяКоманда"      , "CloseShift");
	
	Если ТипОборудования = Неопределено Тогда
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
		ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
		ПоддерживаемыеТипыВО.Добавить("ККТ");
	Иначе
		ПоддерживаемыеТипыВО = ТипОборудования;
	КонецЕсли;
	
	Если КассоваяСмена = Неопределено Тогда
		
		Если ИдентификаторУстройства = Неопределено Тогда
			
			СтруктураОтбора = Новый Структура();
			СтруктураОтбора.Вставить("Статус", ПредопределенноеЗначение("Перечисление.СтатусыКассовойСмены.Открыта"));
			
			СтруктураРезультата = Новый Структура();
			СтруктураРезультата.Вставить("КассоваяСмена", "Ссылка");
			СтруктураРезультата.Вставить("ИдентификаторУстройства", "ФискальноеУстройство");
			
			ПараметрыВыбора = Новый Структура();
			ПараметрыВыбора.Вставить("СтруктураПараметрыОтбора", СтруктураОтбора);
			ПараметрыВыбора.Вставить("СтруктураРезультата", СтруктураРезультата);
			ПараметрыВыбора.Вставить("Заголовок", НСтр("ru = 'Выберите кассовую смену для закрытия'"));
			
			ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьСменуЗавершение", ЭтотОбъект, Контекст);
			ИмяФормы = "Документ.КассоваяСмена.ФормаВыбора";
			ОткрытьФорму(ИмяФормы, ПараметрыВыбора,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		Иначе
			
			ОписаниеПоследнейСмены = МенеджерОборудованияВызовСервера.ОписаниеПоследнейКассовойСмены(ИдентификаторУстройства);
			Если ОписаниеПоследнейСмены = Неопределено Тогда
				Если ОповещениеПриЗавершении <> Неопределено Тогда
					ТекстСообщения = НСтр("ru = 'Нет кассовых смен для устройства'") + Символы.НПП + Строка(ИдентификаторУстройства);
					РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстСообщения, ИдентификаторУстройства);
					ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
				КонецЕсли;
			Иначе
				Если ОписаниеПоследнейСмены.Статус = ПредопределенноеЗначение("Перечисление.СтатусыКассовойСмены.Открыта") Тогда
					Контекст.Вставить("КассоваяСмена", ОписаниеПоследнейСмены.КассоваяСмена);
					СтруктураПараметровСмены = Новый Структура();
					СтруктураПараметровСмены.Вставить("КассоваяСмена", ОписаниеПоследнейСмены.КассоваяСмена);
					СтруктураПараметровСмены.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
					НачатьВыполнениеКоманды_ВыбратьСменуЗавершение(СтруктураПараметровСмены, Контекст);
				Иначе
					Если ОповещениеПриЗавершении <> Неопределено Тогда
						ТекстСообщения = НСтр("ru = 'Кассовая смена была закрыта ранее'");
						РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстСообщения, ИдентификаторУстройства);
						ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Контекст.Вставить("КассоваяСмена", КассоваяСмена);
		СтруктураПараметровСмены = Новый Структура();
		СтруктураПараметровСмены.Вставить("КассоваяСмена", КассоваяСмена);
		СтруктураПараметровСмены.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
		НачатьВыполнениеКоманды_ВыбратьСменуЗавершение(СтруктураПараметровСмены, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Производить инкассацию на фискальном устройстве.
// УникальныйИдентификатор - идентификатор формы.
// ИдентификаторУстройства - идентификатор устройства, если неопределенно - будет предложен выбор.
// ОповещениеПриЗавершении - оповещение при завершении завершении.
//
Процедура НачатьИнкассациюНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства = Неопределено, ТипОборудования = Неопределено) Экспорт
	 
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , ПараметрыОперации);
	Контекст.Вставить("ВыполняемаяКоманда"      , "Encash");
	Контекст.Вставить("ПроверкаАктивностиСмены" , Истина); 
	
	Если ТипОборудования = Неопределено Тогда
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
		ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
		ПоддерживаемыеТипыВО.Добавить("ККТ");
	Иначе
		ПоддерживаемыеТипыВО = ТипОборудования;
	КонецЕсли;
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите фискальное устройство'"), 
			НСтр("ru='Фискальное устройство не подключено.'"), 
			НСтр("ru='Фискальное устройство не выбрано.'"),
			Истина);
	Иначе
		НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Процедура получает ширину строки в символах.
//  
Процедура НачатьПолучениеШириныСтрокиПечатающегоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства = Неопределено, ТипОборудования = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , Неопределено);
	Контекст.Вставить("ВыполняемаяКоманда"      , "GetLineLength");
	
	Если ТипОборудования = Неопределено Тогда
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
		ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
		ПоддерживаемыеТипыВО.Добавить("ККТ");
	Иначе
		ПоддерживаемыеТипыВО = ТипОборудования;
	КонецЕсли;
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите фискальное устройство'"), 
			НСтр("ru='Фискальное устройство не подключено.'"), 
			НСтр("ru='Фискальное устройство не выбрано.'"),
			Истина);
	Иначе
		НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Производить печать чека на фискальном устройстве.
// УникальныйИдентификатор - идентификатор формы.
// ИдентификаторУстройства - идентификатор устройства, если неопределенно - будет предложен выбор.
// ОповещениеПриЗавершении - оповещение при завершении завершении.
//
Процедура НачатьФискализациюЧекаНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства = Неопределено,
	ТипОборудования = Неопределено, ОповещениеПослеОткрытииЧека = Неопределено, ОповещениеПриОшибкеПечатиЧека = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении"    , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор"    , УникальныйИдентификатор);
	Контекст.Вставить("УникальныйИдентификатор"    , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"           , ПараметрыОперации);
	Контекст.Вставить("ВыполняемаяКоманда"         , "CheckFiscalization");
	Контекст.Вставить("ОповещениеПослеОткрытииЧека", ОповещениеПослеОткрытииЧека);
	Контекст.Вставить("ОповещениеПриОшибке"        , ОповещениеПриОшибкеПечатиЧека); 
	Контекст.Вставить("ПроверкаАктивностиСмены"    , Истина); 
	
	Если ИдентификаторУстройства = Неопределено Тогда
		
		Если ТипОборудования = Неопределено Тогда
			ПоддерживаемыеТипыВО = Новый Массив();
			ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
			ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
			ПоддерживаемыеТипыВО.Добавить("ККТ");
		Иначе
			ПоддерживаемыеТипыВО = ТипОборудования;
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите фискальное устройство'"),
			НСтр("ru='Фискальное устройство не подключено.'"), 
			НСтр("ru='Фискальное устройство не выбрано.'"),
			Истина);
	Иначе
		НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Производить печать чека на фискальном устройстве пакетом.
// УникальныйИдентификатор - идентификатор формы.
// ИдентификаторУстройства - идентификатор устройства, если неопределенно - будет предложен выбор.
// ОповещениеПриЗавершении - оповещение при завершении завершении.
//
Процедура НачатьФискализациюЧекаНаФискальномУстройствеПакетом(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства = Неопределено, ТипОборудования = Неопределено) Экспорт
	                     
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , ПараметрыОперации);
	Контекст.Вставить("ВыполняемаяКоманда"      , "CheckFiscalizationPacket");
	
	Если ТипОборудования = Неопределено Тогда
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
		ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
		ПоддерживаемыеТипыВО.Добавить("ККТ");
	Иначе
		ПоддерживаемыеТипыВО = ТипОборудования;
	КонецЕсли;
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите фискальное устройство'"),
			НСтр("ru='Фискальное устройство не подключено.'"), 
			НСтр("ru='Фискальное устройство не выбрано.'"),
			Истина);
	Иначе
		НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Производить печать текста на фискальном устройстве.
// УникальныйИдентификатор - идентификатор формы.
// ИдентификаторУстройства - идентификатор устройства, если неопределенно - будет предложен выбор.
// ОповещениеПриЗавершении - оповещение при завершении завершении.
//
Процедура НачатьПечатьТекста(ОповещениеПриЗавершении, УникальныйИдентификатор, Текст, ИдентификаторУстройства = Неопределено, ТипОборудования = Неопределено) Экспорт
	
	ВходныеПараметры = Новый Массив();
	ВходныеПараметры.Добавить(Текст);
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , ВходныеПараметры);
	Контекст.Вставить("ВыполняемаяКоманда"      , "PrintText");
	
	Если ИдентификаторУстройства = Неопределено Тогда
		
		Если ТипОборудования = Неопределено Тогда
			ПоддерживаемыеТипыВО = Новый Массив();
			ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
			ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
			ПоддерживаемыеТипыВО.Добавить("ККТ");
		Иначе
			ПоддерживаемыеТипыВО = ТипОборудования;
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите печатающее устройство'"), 
			НСтр("ru='Печатающее устройство не подключено.'"), 
			НСтр("ru='Печатающее устройство не выбрано.'"), 
			Истина);
	Иначе
		НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Производит печать текстового документа на фискальном устройстве.
// УникальныйИдентификатор - идентификатор формы.
// ИдентификаторУстройства - идентификатор устройства, если неопределенно - будет предложен выбор.
// ОповещениеПриЗавершении - оповещение при завершении завершении.
//
Процедура НачатьПечатьТекстовыхДокументов(ОповещениеПриЗавершении, УникальныйИдентификатор, НефискальныеДокументы, ИдентификаторУстройства = Неопределено, ТипОборудования = Неопределено) Экспорт
	
	ВходныеПараметры = Новый Массив();
	ВходныеПараметры.Добавить(НефискальныеДокументы);
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , ВходныеПараметры);
	Контекст.Вставить("ВыполняемаяКоманда"      , "PrintTextDocument");
	
	Если ИдентификаторУстройства = Неопределено Тогда
		
		Если ТипОборудования = Неопределено Тогда
			ПоддерживаемыеТипыВО = Новый Массив();
			ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
			ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
			ПоддерживаемыеТипыВО.Добавить("ККТ");
		Иначе
			ПоддерживаемыеТипыВО = ТипОборудования;
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите печатающее устройство'"), 
			НСтр("ru='Печатающее устройство не подключено.'"), 
			НСтр("ru='Печатающее устройство не выбрано.'"), 
			Истина);
	Иначе
		НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Производить формирование чека коррекции на фискальном устройстве.
// УникальныйИдентификатор - идентификатор формы.
// ИдентификаторУстройства - идентификатор устройства, если неопределенно - будет предложен выбор.
// ОповещениеПриЗавершении - оповещение при завершении завершении.
//
Процедура НачатьФормированиеЧекаКоррекцииНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства = Неопределено, ТипОборудования = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , ПараметрыОперации);
	Контекст.Вставить("ВыполняемаяКоманда"      , "PrintReceiptCorrection");
	Контекст.Вставить("ПроверкаАктивностиСмены" , Истина); 
	
	Если ИдентификаторУстройства = Неопределено Тогда
		
		Если ТипОборудования = Неопределено Тогда
			ПоддерживаемыеТипыВО = Новый Массив();
			ПоддерживаемыеТипыВО.Добавить("ККТ");
		Иначе
			ПоддерживаемыеТипыВО = ТипОборудования;
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите фискальное устройство'"),
			НСтр("ru='Фискальное устройство не подключено.'"), 
			НСтр("ru='Фискальное устройство не выбрано.'"),
			Истина);
	Иначе
		НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Осуществляет открытие денежного ящика.
// ОповещениеПриЗавершении - оповещение при завершении завершении.
// УникальныйИдентификатор - идентификатор формы.
// ИдентификаторУстройства - идентификатор устройства, если неопределенно - будет предложен выбор.
// ТипОборудования         - тип оборудования.
//
Процедура НачатьОткрытиеДенежногоЯщика(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства = Неопределено, ТипОборудования = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , Неопределено);
	Контекст.Вставить("ВыполняемаяКоманда"      , "OpenCashDrawer");
	
	Если ИдентификаторУстройства = Неопределено Тогда
		
		Если ТипОборудования = Неопределено Тогда
			ПоддерживаемыеТипыВО = Новый Массив();
			ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
			ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
			ПоддерживаемыеТипыВО.Добавить("ККТ");
		Иначе
			ПоддерживаемыеТипыВО = ТипОборудования;
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите фискальное устройство'"), 
			НСтр("ru='Фискальное устройство не подключено.'"), 
			НСтр("ru='Фискальное устройство не выбрано.'"),
			Истина);
	Иначе
		НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Производить аннулирование чека на фискальном устройстве.
// УникальныйИдентификатор - идентификатор формы.
// ИдентификаторУстройства - идентификатор устройства, если неопределенно - будет предложен выбор.
// ОповещениеПриЗавершении - оповещение при завершении завершении.
//
Процедура НачатьАннулированиеЧекаНаФискальномУстройстве(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства = Неопределено, ТипОборудования = Неопределено) Экспорт
	
	ТипРасчета = МенеджерОборудованияКлиентСервер.КодРасчетаДенежнымиСредствами(ПараметрыОперации.ТипРасчета);
	ТипЧека =  ?(ТипРасчета = 1, Ложь, Истина);

	ВходныеПараметры = Новый Массив();
	ВходныеПараметры.Добавить(ТипЧека);
	ВходныеПараметры.Добавить(ПараметрыОперации.Фискальный);
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , ВходныеПараметры);
	Контекст.Вставить("ВыполняемаяКоманда"      , "AnnulCheck");
	
	Если ИдентификаторУстройства = Неопределено Тогда
		
		Если ТипОборудования = Неопределено Тогда
			ПоддерживаемыеТипыВО = Новый Массив();
			ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
			ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
			ПоддерживаемыеТипыВО.Добавить("ККТ");
		Иначе
			ПоддерживаемыеТипыВО = ТипОборудования;
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите фискальное устройство'"),
			НСтр("ru='Фискальное устройство не подключено.'"), 
			НСтр("ru='Фискальное устройство не выбрано.'"),
			Истина);
	Иначе
		НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Производить получение параметров фискального устройства.
// ОповещениеПриЗавершении - оповещение при завершении завершении.
// УникальныйИдентификатор - идентификатор формы.
// ИдентификаторУстройства - идентификатор устройства, если неопределенно - будет предложен выбор.
//
Процедура НачатьПолучениеПараметровФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства = Неопределено, ИспользоватьСохраненныеЗначения = Истина) Экспорт
	
	ВходныеПараметры = Новый Структура();
	ВходныеПараметры.Вставить("ИспользоватьСохраненныеЗначения", ИспользоватьСохраненныеЗначения);
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , ВходныеПараметры);
	Контекст.Вставить("ВыполняемаяКоманда"      , "GetDataKKT");
	Контекст.Вставить("ИспользоватьСохраненныеЗначения", ИспользоватьСохраненныеЗначения); 
	
	ПоддерживаемыеТипыВО = Новый Массив();
	ПоддерживаемыеТипыВО.Добавить("ККТ");
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите фискальное устройство'"), 
			НСтр("ru='Фискальное устройство не подключено.'"), 
			НСтр("ru='Фискальное устройство не выбрано.'"),
			Истина);
	Иначе
		НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

// Получение текущего состояния фискального устройства.
// ОповещениеПриЗавершении - оповещение при завершении завершении.
// УникальныйИдентификатор - идентификатор формы.
// ИдентификаторУстройства - идентификатор устройства, если неопределенно - будет предложен выбор.
//
Процедура НачатьПолучениеТекущегоСостоянияФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства = Неопределено, ТипОборудования = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , Новый Структура());
	Контекст.Вставить("ВыполняемаяКоманда"      , "GetCurrentStatus");
	
	Если ТипОборудования = Неопределено Тогда
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
		ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
		ПоддерживаемыеТипыВО.Добавить("ККТ");
	Иначе
		ПоддерживаемыеТипыВО = ТипОборудования;
	КонецЕсли;
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите фискальное устройство'"), 
			НСтр("ru='Фискальное устройство не подключено.'"), 
			НСтр("ru='Фискальное устройство не выбрано.'"),
			Истина);
	Иначе
		НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьОперациюФНДляФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации, ИдентификаторУстройства = Неопределено, ТипОборудования = Неопределено) Экспорт
	
	ВходныеПараметры = Новый Массив();
	ВходныеПараметры.Добавить(ПараметрыОперации);
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"        , ВходныеПараметры);
	Контекст.Вставить("ВыполняемаяКоманда"      , "OperationFN");
	
	Если ТипОборудования = Неопределено Тогда
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
		ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
		ПоддерживаемыеТипыВО.Добавить("ККТ");
	Иначе
		ПоддерживаемыеТипыВО = ТипОборудования;
	КонецЕсли;
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru='Выберите фискальное устройство'"), 
			НСтр("ru='Фискальное устройство не подключено.'"), 
			НСтр("ru='Фискальное устройство не выбрано.'"),
			Истина);
	Иначе
		НачатьВыполнениеКоманды_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
КонецПроцедуры

// Функция формирует текст нефискального чека по шаблону.
//
Функция СформироватьТекстНефискальногоЧека(ШиринаСтроки, ТипДокумента, ВходныеПараметры, ДополнительныйТекст = Неопределено, ФорматФФД = "1.1") Экспорт
	
	ОбщиеПараметры = Новый Структура("ТипЧека");
	
	Если ВходныеПараметры <> Неопределено Тогда
		ОбщиеПараметры = ВходныеПараметры;
	КонецЕсли;
	
	Текст = МенеджерОборудованияКлиентСерверПереопределяемый.СформироватьТекстНефискальногоДокумента(ТипДокумента, ОбщиеПараметры, ШиринаСтроки, ДополнительныйТекст, ФорматФФД);
	
	Если ОбщиеПараметры.Свойство("КопийЧека") И ОбщиеПараметры.КопийЧека > 1 Тогда
		Эталон = Текст;
		Для Копия = 2 По ОбщиеПараметры.КопийЧека Цикл
			Текст = Текст + "[отрезка]" + Символы.ПС + Эталон;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Текст;
	
КонецФункции

// Начать выполнение команды печати чека ответственному обработчику драйвера
//
Процедура НачатьВыполнениеКомандыПечатиЧека(ОповещениеПриЗавершении, Идентификатор, Команда, Параметры, ВходныеПараметры) Экспорт
	
	// Поиск подключенного устройства.
	ПодключенноеУстройство = ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО, Идентификатор);
	
	Если ПодключенноеУстройство <> Неопределено Тогда
		
		ОбработчикДрайвераМодуль = ПодключенноеУстройство.ОбработчикДрайвераМодуль;
		ОбъектДрайвера = ПодключенноеУстройство.ОбъектДрайвера;
		
		Если ОбработчикДрайвераМодуль = Неопределено Или ОбъектДрайвера = Неопределено Тогда
			// Сообщить об ошибке, что не удалось загрузить драйвер.
			ТекстОшибки = НСтр("ru='Не удалось подключить обработчик драйвера или загрузить драйвер.'");
			ВыходныеПараметры = Новый Массив();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ТекстОшибки);
			ВыходныеПараметры.Добавить(НСтр("ru='Не установлен'"));
			
			РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании();
			РезультатВыполнения.Результат = Ложь;
			РезультатВыполнения.ОписаниеОшибки = ТекстОшибки; 
			РезультатВыполнения.ВыходныеПараметры = ВыходныеПараметры;
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
		Иначе
			
			ПоддержкаАсинхронногоРежима = ОбработчикДрайвераМодуль.ПоддержкаАсинхронногоРежима();
			
			ПараметрыВыполнения = Новый Структура();
			ПараметрыВыполнения.Вставить("ВходныеПараметры", ВходныеПараметры);
			ПараметрыВыполнения.Вставить("Команда"         , Команда);
			ПараметрыВыполнения.Вставить("Параметры"       , Параметры);
			ПараметрыВыполнения.Вставить("ОписаниеОшибки"  , Неопределено); 
			ПараметрыВыполнения.Вставить("ПродолжитьПечать", Истина);
			ПараметрыВыполнения.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
			ПараметрыВыполнения.Вставить("ОповещениеПриОшибке"     , Параметры.ОповещениеПриОшибке);
			ПараметрыВыполнения.Вставить("ОбработчикДрайвераМодуль", ОбработчикДрайвераМодуль);
			ПараметрыВыполнения.Вставить("ОбъектДрайвера", ОбъектДрайвера);
			ПараметрыВыполнения.Вставить("ПодключенноеУстройство", ПодключенноеУстройство);
			ПараметрыВыполнения.Вставить("ПоддержкаАсинхронногоРежима", ПоддержкаАсинхронногоРежима);
			
			ВыходныеПараметры = Неопределено;
			ОбщиеПараметры = ВходныеПараметры;
			
			Если ПоддержкаАсинхронногоРежима Тогда
				Если ПодключенноеУстройство.ТипОборудованияИмя = "ПринтерЧеков" Тогда
					ВыходныеПараметры = Новый Массив();
					ВыходныеПараметры.Добавить(ОбщиеПараметры.НомерСмены);
					ВыходныеПараметры.Добавить(ОбщиеПараметры.НомерЧека);
					РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ВыходныеПараметры", Истина, , ВыходныеПараметры);
					НачатьВыполнениеКомандыПечатиЧека_ЗавершениеОткрытиеЧека(РезультатВыполнения, ПараметрыВыполнения);
				ИначеЕсли ПодключенноеУстройство.ТипОборудованияИмя = "ККТ" Тогда
					Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеКомандыПечатиЧека_ЗавершениеОткрытиеЧека", ЭтотОбъект, ПараметрыВыполнения);
					ОбработчикДрайвераМодуль.НачатьВыполнениеКоманды(Оповещение, "GetCurrentStatus", ОбщиеПараметры,
						 ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
				Иначе
					Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеКомандыПечатиЧека_ЗавершениеОткрытиеЧека", ЭтотОбъект, ПараметрыВыполнения);
					ОбработчикДрайвераМодуль.НачатьВыполнениеКоманды(Оповещение, "OpenCheck", ОбщиеПараметры,
						 ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
				КонецЕсли;
			Иначе
				ЗаводскойНомерФН = Неопределено;
				Результат = Истина;
				
				Если ПодключенноеУстройство.ТипОборудованияИмя = "ПринтерЧеков" Тогда
					ВыходныеПараметры = Новый Массив();
					ВыходныеПараметры.Добавить(ОбщиеПараметры.НомерСмены);
					ВыходныеПараметры.Добавить(ОбщиеПараметры.НомерЧека);
				ИначеЕсли ПодключенноеУстройство.ТипОборудованияИмя = "ККТ" Тогда
					ВремВходныеПараметры = Новый Массив();
					// Получение текущего состояние ККТ с ФН.
					РезультатКоманды = ОбработчикДрайвераМодуль.ВыполнитьКоманду("GetCurrentStatus", ВходныеПараметры, ВыходныеПараметры,
						ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
					Если РезультатКоманды Тогда
						// Увеличиваем инкремент номера последнего чека.
						ВыходныеПараметры[1]    = ВыходныеПараметры[1] + 1;
						ЗаводскойНомерФН        = ВыходныеПараметры[5];
					Иначе
						ВыходныеПараметры = Новый Массив();
						ВыходныеПараметры.Добавить(ОбщиеПараметры.НомерСмены);
						ВыходныеПараметры.Добавить(ОбщиеПараметры.НомерЧека);
					КонецЕсли;
				Иначе
					ТипРасчета = МенеджерОборудованияКлиентСервер.КодРасчетаДенежнымиСредствами(ОбщиеПараметры.ТипРасчета);
					ТипЧека = ?(ТипРасчета = 1, Ложь, Истина);
					ПолучательИИН = ?(ОбщиеПараметры.Свойство("ПолучательИИН"), ОбщиеПараметры.ПолучательИИН, "");
					ПокупательEmail = ?(ОбщиеПараметры.Свойство("ПокупательEmail"), ОбщиеПараметры.ПокупательEmail, "");
					ПокупательНомер = ?(ОбщиеПараметры.Свойство("ПокупательНомер"), ОбщиеПараметры.ПокупательНомер, "");
					СтруктураПервичногоЧека = ?(ОбщиеПараметры.Свойство("ДанныеПервичногоЧека"), ОбщиеПараметры.ДанныеПервичногоЧека, Неопределено);
					ВремВходныеПараметры = Новый Массив();
					ВремВходныеПараметры.Добавить(ТипЧека);
					ВремВходныеПараметры.Добавить(Истина);
					ВремВходныеПараметры.Добавить(ПолучательИИН);
					ВремВходныеПараметры.Добавить(ПокупательEmail);
					ВремВходныеПараметры.Добавить(ПокупательНомер);
					ВремВходныеПараметры.Добавить(СтруктураПервичногоЧека);
					Результат = ОбработчикДрайвераМодуль.ВыполнитьКоманду("OpenCheck", ВремВходныеПараметры, ВыходныеПараметры,
						ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
				КонецЕсли;
				
				Если Не Результат Тогда
					ТекстОшибки = ?(ВыходныеПараметры.Количество() >= 2, ВыходныеПараметры[1], "");
					ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
					РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ВыходныеПараметры", Результат, ТекстОшибки, ВыходныеПараметры);
					ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
				Иначе
					Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеКомандыПечатиЧека_ЗавершениеПечати", ЭтотОбъект, Параметры);
					ЗаполнитьПараметрыОперацииПодписиЧека(ПараметрыВыполнения, ВыходныеПараметры[0], ВыходныеПараметры[1], ЗаводскойНомерФН); 
					ПараметрыВыполнения.Вставить("ОповещениеПродолжения", Оповещение);
					ВыполнитьОбработкуОповещения(Параметры.ОповещениеПослеОткрытииЧека, ПараметрыВыполнения);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		// Сообщить об ошибке, что устройство не подключено.
		ТекстОшибки = НСтр("ru='Устройство не подключено. Перед выполнением операции устройство должно быть подключено.'");
		ВыходныеПараметры = Новый Массив();
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(ТекстОшибки);
		ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
		РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании();
		РезультатВыполнения.Результат = Ложь;
		РезультатВыполнения.ОписаниеОшибки = ТекстОшибки; 
		РезультатВыполнения.ВыходныеПараметры = ВыходныеПараметры;
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыполнениеКомандыПечатиЧека_ЗавершениеОтмены(РезультатВыполнения, Параметры) Экспорт
	
	ВыходныеПараметры = Новый Массив();
	ВыходныеПараметры.Добавить(999);
	ВыходныеПараметры.Добавить(Параметры.ОписаниеОшибки);
	
	РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ВыходныеПараметры", Ложь, Параметры.ОписаниеОшибки, ВыходныеПараметры);
	ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатВыполнения);
	
КонецПроцедуры

Процедура НачатьВыполнениеКомандыПечатиЧека_ЗавершениеПроцессаПечатиСлипЧека(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		Если Параметры.ОповещениеПриОшибке <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриОшибке, Параметры);
		КонецЕсли;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, Параметры.РезультатВыполнения);
	
КонецПроцедуры

// Начинает выполнение печати чека.
// 
// Параметры:
// 	РезультатВыполнения - Структура - структура результата выполнения операции.
// 	Параметры - Структура - где:
// 	*ПодключенноеУстройство - Структура - где:
// 	**Параметры - Структура - .
Процедура НачатьВыполнениеКомандыПечатиЧека_ЗавершениеПроцессаПечати(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		Если Параметры.Свойство("ПодписьЧека") И НЕ ПустаяСтрока(Параметры.ПодписьЧека) Тогда 
			ПодключенноеУстройство = Параметры.ПодключенноеУстройство;
			ШиринаСтроки = ?(ПодключенноеУстройство.ПараметрыПодключения.Свойство("ШиринаСтроки"), ПодключенноеУстройство.ПараметрыПодключения.ШиринаСтроки, 32); 
			
			ВремВходныеПараметры = Новый Массив();
			ВремВходныеПараметры.Добавить(СформироватьШаблонИнфоКвитанции(Параметры, ШиринаСтроки));
			ВремВыходныеПараметры = Неопределено;  
			Параметры.Вставить("РезультатВыполнения", РезультатВыполнения);
			
			Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеКомандыПечатиЧека_ЗавершениеПроцессаПечатиСлипЧека", ЭтотОбъект, Параметры);
			Параметры.ОбработчикДрайвераМодуль.НачатьВыполнениеКоманды(Оповещение, "PrintText", ВремВходныеПараметры, 
				Параметры.ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
		Иначе
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатВыполнения);
		КонецЕсли;
	Иначе
		Если Параметры.ОповещениеПриОшибке <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриОшибке, Параметры);
		КонецЕсли;
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// Завершение печати.
// 
// Параметры:
// 	ПараметрыВыполнения - Структура - где:
// 	*ПодключенноеУстройство - Структура - где:
// 	**Параметры - Структура - .
// 	Параметры - Структура - .
Процедура НачатьВыполнениеКомандыПечатиЧека_ЗавершениеПечати(ПараметрыВыполнения, Параметры) Экспорт
	
	ОбработчикДрайвераМодуль = ПараметрыВыполнения.ОбработчикДрайвераМодуль;
	ОбъектДрайвера           = ПараметрыВыполнения.ОбъектДрайвера;
	ПодключенноеУстройство   = ПараметрыВыполнения.ПодключенноеУстройство;
	ВыходныеПараметры = Неопределено;
	
	Если ПараметрыВыполнения.ПродолжитьПечать Тогда 
		
		ОбщиеПараметры = ПараметрыВыполнения.ВходныеПараметры;
		
		ДополнительныеПараметры = Новый Структура();
		ЗаполнитьПараметрыОперацииПодписиЧека(ДополнительныеПараметры);
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, ПараметрыВыполнения);
		ДополнительныеПараметры.Вставить("АдресЧека"  , ?(ПараметрыВыполнения.Свойство("АдресЧека"), ПараметрыВыполнения.АдресЧека, Неопределено));
		ДополнительныеПараметры.Вставить("ПодписьЧека", ?(ПараметрыВыполнения.Свойство("ПодписьЧека"), ПараметрыВыполнения.ПодписьЧека, Неопределено));
		ДополнительныеПараметры.Вставить("НомерКассы" , ?(ОбщиеПараметры.Свойство("НомерКассы"), ОбщиеПараметры.НомерКассы, Неопределено));
		ОбщиеПараметры.Вставить("ПодписьЧека", ДополнительныеПараметры);
		
		Если ПараметрыВыполнения.ПоддержкаАсинхронногоРежима Тогда
			
			Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеКомандыПечатиЧека_ЗавершениеПроцессаПечати", ЭтотОбъект, ПараметрыВыполнения);
			ОбработчикДрайвераМодуль.НачатьВыполнениеКоманды(Оповещение, ПараметрыВыполнения.Команда, ПараметрыВыполнения.ВходныеПараметры, 
				ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
				
		Иначе
			Результат = ОбработчикДрайвераМодуль.ВыполнитьКоманду(ПараметрыВыполнения.Команда, ПараметрыВыполнения.ВходныеПараметры,
					ВыходныеПараметры, ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
			Если Не Результат Тогда
				Если ВыходныеПараметры.Количество() >= 2 Тогда
					ТекстОшибки = ВыходныеПараметры[1];
				КонецЕсли;
				ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
				
				Если ПараметрыВыполнения.ОповещениеПриОшибке <> Неопределено Тогда
					ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОповещениеПриОшибке, ПараметрыВыполнения);
				КонецЕсли;
			КонецЕсли;
			
			Если Результат И НЕ ПустаяСтрока(ДополнительныеПараметры.ПодписьЧека) Тогда
				
				ШиринаСтроки = ?(ПодключенноеУстройство.ПараметрыПодключения.Свойство("ШиринаСтроки"), ПодключенноеУстройство.ПараметрыПодключения.ШиринаСтроки, 32); 
				ВремВходныеПараметры = Новый Массив();
				ВремВходныеПараметры.Добавить(СформироватьШаблонИнфоКвитанции(ДополнительныеПараметры, ШиринаСтроки));
				
				ВремВыходныеПараметры = Неопределено;
				ДополнительныйРезультат = ОбработчикДрайвераМодуль.ВыполнитьКоманду("PrintText", ВремВходныеПараметры,
					ВремВыходныеПараметры, ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
			КонецЕсли;
			
			РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Результат, ТекстОшибки);
			РезультатВыполнения.ВыходныеПараметры = ВыходныеПараметры;
			РезультатВыполнения.Вставить("ОбработчикДрайвераМодуль", ОбработчикДрайвераМодуль);
			РезультатВыполнения.Вставить("ОбъектДрайвера"          , ОбъектДрайвера);
			РезультатВыполнения.Вставить("ПодключенноеУстройство"  , ПодключенноеУстройство);
			РезультатВыполнения.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
			ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОповещениеПриЗавершении, РезультатВыполнения);
		КонецЕсли;
		
	Иначе
		Если ПараметрыВыполнения.ПоддержкаАсинхронногоРежима Тогда
			Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеКомандыПечатиЧека_ЗавершениеОтмены", ЭтотОбъект, ПараметрыВыполнения);
			ОбработчикДрайвераМодуль.НачатьВыполнениеКоманды(Оповещение, "CancelCheck", Неопределено,
				ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
		Иначе
			ОбработчикДрайвераМодуль.ВыполнитьКоманду("CancelCheck", Неопределено, Неопределено,
				ОбъектДрайвера, ПодключенноеУстройство.Параметры, ПодключенноеУстройство.ПараметрыПодключения);
				
			ВыходныеПараметры = Новый Массив();
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ПараметрыВыполнения.ОписаниеОшибки);
		
			РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ВыходныеПараметры", Ложь, ПараметрыВыполнения.ОписаниеОшибки, ВыходныеПараметры);
			ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОповещениеПриЗавершении, РезультатВыполнения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыполнениеКомандыПечатиЧека_ЗавершениеОткрытиеЧека(РезультатОперации, ПараметрыВыполнения) Экспорт
	
	ВыходныеПараметры = РезультатОперации.ВыходныеПараметры;
	
	Если Не РезультатОперации.Результат Тогда
		Если ВыходныеПараметры.Количество() >= 2 Тогда
			ТекстОшибки = ВыходныеПараметры[1];
		КонецЕсли;
		ВыходныеПараметры.Добавить(НСтр("ru='Установлен'"));
		РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ВыходныеПараметры", РезультатОперации.Результат, ТекстОшибки, ВыходныеПараметры);
		ВыполнитьОбработкуОповещения(ПараметрыВыполнения.ОповещениеПриЗавершении, РезультатВыполнения);
	Иначе
		Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеКомандыПечатиЧека_ЗавершениеПечати", ЭтотОбъект, ПараметрыВыполнения.Параметры);
		ЗаводскойНомерФН = ?(ВыходныеПараметры.Количество() > 5, ВыходныеПараметры[5], Неопределено);  
		ЗаполнитьПараметрыОперацииПодписиЧека(ПараметрыВыполнения, ВыходныеПараметры[0], ВыходныеПараметры[1], ЗаводскойНомерФН);
		ПараметрыВыполнения.Вставить("ОповещениеПродолжения", Оповещение);
		ВыполнитьОбработкуОповещения(ПараметрыВыполнения.Параметры.ОповещениеПослеОткрытииЧека, ПараметрыВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// Вспомогательная функция - осуществляет печать чека по шаблону.
//
//  Параметры:
// 	ОбщийМодульОборудования - Строка - .
// 	ОбъектДрайвера - СправочникСсылка.ДрайверыОборудования - .
// 	Параметры - Структура - .
// 	ПараметрыПодключения - Структура - .
// 	ВходныеПараметры - Структура - где:
// 	*ПозицииЧека - Массив из Структура - где: 
// 	**Наименование - Строка - .
// 	ВыходныеПараметры - Структура - .
// Возвращаемое значение:
// 	Булево - Описание
//
Функция ПечатьЧекаПоШаблону(ОбщийМодульОборудования, ОбъектДрайвера, Параметры, ПараметрыПодключения, ВходныеПараметры, ВыходныеПараметры) Экспорт
	
	Результат  = Истина;
	
	ПозицииЧека  = ВходныеПараметры.ПозицииЧека;
	ТаблицаОплат = ВходныеПараметры.ТаблицаОплат;
	
	Если ВходныеПараметры.Свойство("ПодписьЧека")  Тогда
		// Печать чека производиться в 2 этапа. Чека был открыт ранее.
		РасширенныеПараметры = ВходныеПараметры.ПодписьЧека; 
		// Заполнение выходных параметров.
		ВыходныеПараметры.Очистить();
		ВыходныеПараметры.Добавить(РасширенныеПараметры.НомерСмены);
		ВыходныеПараметры.Добавить(РасширенныеПараметры.НомерЧека);
		ВыходныеПараметры.Добавить(0); // Номер документа
		ВыходныеПараметры.Добавить(МенеджерОборудованияКлиентПереопределяемый.ДатаСеанса());
		ВыходныеПараметры.Добавить(Неопределено);
		ВыходныеПараметры.Добавить(Неопределено);
		ВыходныеПараметры.Добавить(Неопределено);
		ВыходныеПараметры.Добавить(Неопределено);
		ВыходныеПараметры.Добавить(Неопределено);
	Иначе
		ТипРасчета = МенеджерОборудованияКлиентСервер.КодРасчетаДенежнымиСредствами(ВходныеПараметры.ТипРасчета);
		ТипЧека =  ?(ТипРасчета = 1, Ложь, Истина);
		// Открываем чек
		Параметры.Вставить("ПолучательИИН", ?(ВходныеПараметры.Свойство("ПолучательИИН"), ВходныеПараметры.ПолучательИИН, ""));
		Параметры.Вставить("ПокупательEmail", ?(ВходныеПараметры.Свойство("ПокупательEmail"), ВходныеПараметры.ПокупательEmail, ""));
		Параметры.Вставить("ПокупательНомер", ?(ВходныеПараметры.Свойство("ПокупательНомер"), ВходныеПараметры.ПокупательНомер, ""));
		Параметры.Вставить("ДанныеПервичногоЧека", ?(ВходныеПараметры.Свойство("ДанныеПервичногоЧека"), ВходныеПараметры.ДанныеПервичногоЧека, Неопределено));
		Результат = ОбщийМодульОборудования.ОткрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТипЧека, Истина, ВыходныеПараметры);
	КонецЕсли;
	
	// Печатаем строки чека   
	Если Результат Тогда
		
		ОшибкаПриПечати = Ложь;
		// Печатаем позиции чека
		Для ИндексМассива = 0 По ПозицииЧека.Количество() - 1 Цикл
			
			ПозицияЧека = ПозицииЧека[ИндексМассива];
			Если ПозицияЧека.Свойство("ФискальнаяСтрока") Тогда
				Наименование  = ?(ПозицияЧека.Свойство("Наименование") , ПозицияЧека.Наименование, "");
				Количество    = ?(ПозицияЧека.Свойство("Количество")   , ПозицияЧека.Количество  , 1);
				Цена          = ?(ПозицияЧека.Свойство("Цена")         , ПозицияЧека.Цена        , 0);
				Сумма         = ?(ПозицияЧека.Свойство("Сумма")        , ПозицияЧека.Сумма       , 0);
				НомерСекции   = ?(ПозицияЧека.Свойство("НомерСекции")  , ПозицияЧека.НомерСекции , 0);
				СтавкаНДС     = ?(ПозицияЧека.Свойство("СтавкаНДС")    , ПозицияЧека.СтавкаНДС   , 0);
				
				Если ПозицияЧека.Свойство("ТоварВС") И ПозицияЧека.ТоварВС Тогда
					Штрихкод   = ?(ПозицияЧека.Свойство("GTIN"),	 ПозицияЧека.GTIN,						"");
				Иначе
					Штрихкод   = ?(ПозицияЧека.Свойство("Штрихкод") И ЗначениеЗаполнено(ПозицияЧека.Штрихкод), 
									РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентСервер.GTINПоШтрихкодуEAN(ПозицияЧека.Штрихкод), "");				
				КонецЕсли;
				
				КодЕдиницыИзмерения = ПозицияЧека.КодЕдиницыИзмерения;
				Параметры.Вставить("КодЕдиницыИзмерения", КодЕдиницыИзмерения);
				
				Если ПозицияЧека.ДанныеКодаТоварнойНоменклатуры.Свойство("КодМаркировкиBase64") Тогда
					КодМаркировки = РазборИОбработкаКодовМаркировкиИСМПТКСлужебныйКлиентСервер.Base64ВШтрихкод(ПозицияЧека.ДанныеКодаТоварнойНоменклатуры.КодМаркировкиBase64);
				ИначеЕсли ПозицияЧека.ДанныеКодаТоварнойНоменклатуры.Свойство("КодМаркировки") Тогда 
					КодМаркировки = ПозицияЧека.ДанныеКодаТоварнойНоменклатуры.КодМаркировки;
				ИначеЕсли ЗначениеЗаполнено(ПозицияЧека.ДанныеКодаТоварнойНоменклатуры.ГлобальныйИдентификаторТорговойЕдиницы) 
					И ЗначениеЗаполнено(ПозицияЧека.ДанныеКодаТоварнойНоменклатуры.СерийныйНомер) Тогда
					КодМаркировки = ПозицияЧека.ДанныеКодаТоварнойНоменклатуры.ГлобальныйИдентификаторТорговойЕдиницы + ПозицияЧека.ДанныеКодаТоварнойНоменклатуры.СерийныйНомер;
					КодМаркировки = ?(ЗначениеЗаполнено(КодМаркировки), КодМаркировки, Неопределено);
				Иначе 
					КодМаркировки = Неопределено;
				КонецЕсли;
				Параметры.Вставить("КодМаркировки", КодМаркировки);
				
				ОсвобожденныйОборотНДС = ПозицияЧека.ОсвобожденныйОборотНДС;
				Параметры.Вставить("ОсвобожденныйОборотНДС", ОсвобожденныйОборотНДС);
				Параметры.Вставить("Штрихкод", Штрихкод);
				
				Если НЕ ОбщийМодульОборудования.НапечататьФискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
									Наименование, Количество, Цена, Сумма, НомерСекции, СтавкаНДС, ВыходныеПараметры) Тогда
					ОшибкаПриПечати = Истина;   
					Прервать;
				КонецЕсли;
			ИначеЕсли ПозицияЧека.Свойство("ТекстоваяСтрока") Тогда
				Текст = ?(ПозицияЧека.Свойство("Текст"), ПозицияЧека.Текст, "");
				Если НЕ ОбщийМодульОборудования.НапечататьНефискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
											Текст, ВыходныеПараметры) Тогда
					ОшибкаПриПечати = Истина;   
					Прервать;
				КонецЕсли;
			ИначеЕсли ПозицияЧека.Свойство("Штрихкод") Тогда
				ВремВыходныеПараметры = Новый Массив();
				ТипШтрихКодаЗнач = ?(ПозицияЧека.Свойство("ТипШтрихКода"), ПозицияЧека.ТипШтрихКода, "");
				ШтрихКод     = ?(ПозицияЧека.Свойство("ШтрихКод")    , ПозицияЧека.ШтрихКод    , "");
				Если НЕ ОбщийМодульОборудования.ПечатьШтрихкода(ОбъектДрайвера, Параметры, ПараметрыПодключения,
											ТипШтрихКодаЗнач, ШтрихКод, ВремВыходныеПараметры) Тогда
					Текст = НСтр("ru='<Штрихкод %ТипШтрихКода% не распечатан>'");
					Текст = СтрЗаменить(Текст, "%ТипШтрихКода%", ТипШтрихКодаЗнач);
					Если НЕ ОбщийМодульОборудования.НапечататьНефискальнуюСтроку(ОбъектДрайвера, Параметры, ПараметрыПодключения,
						Текст, ВремВыходныеПараметры) Тогда
						ОшибкаПриПечати = Истина;   
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;		
		КонецЦикла;
			
		Если НЕ ОшибкаПриПечати Тогда
		  	// Закрываем чек
			ТаблицаОплатЧека = Новый Массив();
			Если ТаблицаОплат <> Неопределено Тогда
				
				СуммаНаличными       = 0;
				СуммаЭлектронными    = 0;
				СуммаМобильный       = 0;
				СуммаПостоплатой     = 0;
				СуммаПредоплатой     = 0;
				СуммаПредоставлением = 0;
				
				Для ИндексОплаты = 0 По ТаблицаОплат.Количество() - 1 Цикл
					Если ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Электронно") Тогда
						СуммаЭлектронными = СуммаЭлектронными + ТаблицаОплат[ИндексОплаты].Сумма;
					ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Предоплата") Тогда
						СуммаПредоплатой = СуммаПредоплатой + ТаблицаОплат[ИндексОплаты].Сумма;
					ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.Постоплата") Тогда
						СуммаПостоплатой = СуммаПостоплатой + ТаблицаОплат[ИндексОплаты].Сумма;
					ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.ВстречноеПредоставление") Тогда
						СуммаПредоставлением = СуммаПредоставлением + ТаблицаОплат[ИндексОплаты].Сумма;
					ИначеЕсли ТаблицаОплат[ИндексОплаты].ТипОплаты = ПредопределенноеЗначение("Перечисление.ТипыОплатыККТ.МобильныйПлатеж") Тогда
						СуммаМобильный = СуммаМобильный + ТаблицаОплат[ИндексОплаты].Сумма;
					Иначе
						СуммаНаличными = СуммаНаличными + ТаблицаОплат[ИндексОплаты].Сумма;
					КонецЕсли;
				КонецЦикла;
				
				СтрокаОплаты = Новый СписокЗначений();
				СтрокаОплаты.Добавить(0);
				СтрокаОплаты.Добавить(СуммаНаличными);
				ТаблицаОплатЧека.Добавить(СтрокаОплаты);
				
				СтрокаОплаты = Новый СписокЗначений();
				СтрокаОплаты.Добавить(1);
				СтрокаОплаты.Добавить(СуммаЭлектронными + СуммаПредоставлением);
				ТаблицаОплатЧека.Добавить(СтрокаОплаты);
				
				СтрокаОплаты = Новый СписокЗначений();
				СтрокаОплаты.Добавить(2);
				СтрокаОплаты.Добавить(СуммаПостоплатой);
				ТаблицаОплатЧека.Добавить(СтрокаОплаты);
				
				СтрокаОплаты = Новый СписокЗначений();
				СтрокаОплаты.Добавить(3);
				СтрокаОплаты.Добавить(СуммаПредоплатой);
				ТаблицаОплатЧека.Добавить(СтрокаОплаты);
				
				СтрокаОплаты = Новый СписокЗначений();
				СтрокаОплаты.Добавить(4);
				СтрокаОплаты.Добавить(СуммаМобильный);
				ТаблицаОплатЧека.Добавить(СтрокаОплаты);
				
			КонецЕсли;
			Результат = ОбщийМодульОборудования.ЗакрытьЧек(ОбъектДрайвера, Параметры, ПараметрыПодключения, ТаблицаОплатЧека, ВыходныеПараметры);
		Иначе
			Результат = Ложь;
		КонецЕсли;
			
		КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполнить параметры операции подписи чека.
// 
Процедура ЗаполнитьПараметрыОперацииПодписиЧека(ПараметрыОперации, НомерСмены = Неопределено, 
	НомерЧека = Неопределено, ЗаводскойНомерФН = Неопределено) Экспорт; 
	
	ПараметрыОперации.Вставить("ИНН"       , Неопределено);
	ПараметрыОперации.Вставить("КПП"       , Неопределено);
	ПараметрыОперации.Вставить("НомерСмены", НомерСмены);
	ПараметрыОперации.Вставить("НомерЧека" , НомерЧека);
	ПараметрыОперации.Вставить("НомерКассы"      , Неопределено);
	ПараметрыОперации.Вставить("ЗаводскойНомерФН", ЗаводскойНомерФН);
	ПараметрыОперации.Вставить("НаименованиеОрганизации", Неопределено);
	
КонецПроцедуры

Функция СформироватьШаблонИнфоКвитанции(Параметры, ШиринаСтроки, ПечатьШтрихкода = Истина) Экспорт
	
	Текст = МенеджерОборудованияКлиентСервер.ВыстроитьПоля(Параметры.НаименованиеОрганизации, , ШиринаСтроки) + Символы.ПС;
	
	АдресЧека = ?(Параметры.Свойство("АдресЧека"), Параметры.АдресЧека, Неопределено);
	ПодписьЧека = ?(Параметры.Свойство("ПодписьЧека"), Параметры.ПодписьЧека, Неопределено);
	
	ОрганизацияИНН = ?(НЕ ПустаяСтрока(Параметры.ИНН), НСтр("ru='ИНН:'") + Параметры.ИНН, "");
	ОрганизацияКПП = ?(НЕ ПустаяСтрока(Параметры.КПП), НСтр("ru='КПП:'") + Параметры.КПП, "");
	Если Не ПустаяСтрока(ОрганизацияИНН) Или НЕ ПустаяСтрока(ОрганизацияКПП) Тогда
		Текст = Текст + МенеджерОборудованияКлиентСервер.ВыстроитьПоля(ОрганизацияИНН, ОрганизацияКПП, ШиринаСтроки) + Символы.ПС;
	КонецЕсли;  
	
	НомерКассы = ?(НЕ ПустаяСтрока(Параметры.НомерКассы), НСтр("ru='КАССА:'") + Параметры.НомерКассы, "");
	НомерСмены = ?(НЕ ПустаяСтрока(Параметры.НомерСмены), НСтр("ru='СМЕНА:'") + Формат(Параметры.НомерСмены, "ЧГ=0"), 0);
	
	Если Не ПустаяСтрока(НомерКассы) Или НЕ ПустаяСтрока(НомерСмены) Тогда
		Текст = Текст + МенеджерОборудованияКлиентСервер.ВыстроитьПоля(НомерКассы, НомерСмены, ШиринаСтроки) + Символы.ПС;
	КонецЕсли;
	
	НомерЧека = ?(НЕ ПустаяСтрока(Параметры.НомерЧека), НСтр("ru='ЧЕК:'") + Параметры.НомерЧека, "");
	ДатаВремя = НСтр("ru='ДАТА:'") + Формат(ТекущаяДата(), "ДФ=""дд.ММ.гггг ЧЧ:мм""");
	Если Не ПустаяСтрока(НомерЧека) Или НЕ ПустаяСтрока(ДатаВремя) Тогда
		Текст = Текст + МенеджерОборудованияКлиентСервер.ВыстроитьПоля(НомерЧека, ДатаВремя, ШиринаСтроки) + Символы.ПС;
	КонецЕсли;
	
	Текст = Текст + " " + Символы.ПС;
	
	Если ПечатьШтрихкода Тогда
		Текст = Текст + "|ШтрихКод|QR|" + АдресЧека + Символы.ПС;
	КонецЕсли;
	
	Текст = Текст + " " + Символы.ПС;
	
	СтрокаТекста = МенеджерОборудованияКлиентСервер.ПостроитьПолеПереносом(АдресЧека, ШиринаСтроки);
	Для НомерСтроки = 1 По СтрЧислоСтрок(СтрокаТекста) Цикл
		Текст = Текст + СтрПолучитьСтроку(СтрокаТекста, НомерСтроки) + Символы.ПС;
	КонецЦикла;
	
	Текст = Текст + " " + Символы.ПС;
	
	СтрокаТекста = МенеджерОборудованияКлиентСервер.ПостроитьПолеПереносом(ПодписьЧека, ШиринаСтроки);
	Для НомерСтроки = 1 По СтрЧислоСтрок(СтрокаТекста) Цикл
		Текст = Текст + СтрПолучитьСтроку(СтрокаТекста, НомерСтроки) + Символы.ПС;
	КонецЦикла;
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСЭквайрингом

// Заполняет структуру результата подключения эквайрингового терминала.
// 
Функция ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Результат = Ложь, ОписаниеОшибки = Неопределено) Экспорт; 
	
	РезультатОперации = Новый Структура();
	РезультатОперации.Вставить("Результат", Результат);
	РезультатОперации.Вставить("ОписаниеОшибки", ОписаниеОшибки);
	РезультатОперации.Вставить("ИдентификаторУстройстваЭТ" , Неопределено);
	РезультатОперации.Вставить("ИдентификаторУстройстваПУ" , Неопределено);
	РезультатОперации.Вставить("ПечатьКвитанцийНаТерминале", Ложь);
	Возврат РезультатОперации;
	
КонецФункции

// Начать подключение эквайрингово терминала.
// Возвращает структуру:
//   Результат - Результат операции.
//   ОписаниеОшибки - Описание ошибки (Для Результат = Ложь).
//   ИдентификаторПодключенногоЭТ - Идентификатор эквайринговогой терминала.
//   ИдентификаторПодключенногоПУ - Идентификатор фискального регистратора.
//   ПечатьКвитанцийНаТерминале   - Печать квитанций на терминале, если Истина то ИдентификаторПодключенногоПУ = Неопределено.
//
Процедура НачатьПодключенияЭквайринговогоТерминала(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройстваЭТ = Неопределено, ИдентификаторУстройстваПУ = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении"  , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор"  , УникальныйИдентификатор);
	Контекст.Вставить("ИдентификаторУстройстваЭТ", ИдентификаторУстройстваЭТ);
	Контекст.Вставить("ИдентификаторУстройстваПУ", ИдентификаторУстройстваПУ);
	
	Если Контекст.ИдентификаторУстройстваЭТ = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьПодключенияЭквайринговогоТерминала_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, "ЭквайринговыйТерминал",
			НСтр("ru='Выберите эквайринговый терминал'"), 
			НСтр("ru='Эквайринговый терминал не подключен.'"),
			НСтр("ru='Эквайринговый терминал не выбран.'"), 
			Истина);
	Иначе
		НачатьПодключенияЭквайринговогоТерминала_ВыбратьУстройствоЗавершение(Контекст.ИдентификаторУстройстваЭТ, Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПодключенияЭквайринговогоТерминала_ВыбратьУстройствоЗавершение(ИдентификаторУстройстваЭТ, Параметры) Экспорт
	
	Если ИдентификаторУстройстваЭТ = Неопределено Тогда
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ОписаниеОшибки = НСтр("ru='Эквайринговый терминал не выбран.'");
			РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Ложь, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	Иначе
		Параметры.Вставить("ИдентификаторУстройстваЭТ" , ИдентификаторУстройстваЭТ);
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьПодключенияЭквайринговогоТерминала_ПодключениеЗавершение", ЭтотОбъект, Параметры);
		НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, Параметры.УникальныйИдентификатор, ИдентификаторУстройстваЭТ);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПодключенияЭквайринговогоТерминала_ПодключениеЗавершение(РезультатПодключения, Параметры) Экспорт
	
	Если РезультатПодключения.Результат Тогда  
		ВходныеПараметры  = Неопределено;
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьПодключенияЭквайринговогоТерминала_ПечатьНаТерминалеЗавершение", ЭтотОбъект, Параметры);
		НачатьВыполнениеКоманды(ОписаниеОповещения, Параметры.ИдентификаторУстройстваЭТ, "PrintSlipOnTerminal", ВходныеПараметры);
	Иначе
		// Ошибка подключения.
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ТекстСообщения = НСтр("ru='Эквайринговая операция не была произведена: %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатПодключения.ОписаниеОшибки);
			РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Ложь, ТекстСообщения);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПодключенияЭквайринговогоТерминала_ПечатьНаТерминалеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ПечатьКвитанцийНаТерминале = РезультатВыполнения.ВыходныеПараметры[0]; 
		Параметры.Вставить("ПечатьКвитанцийНаТерминале", ПечатьКвитанцийНаТерминале);
		Если ПечатьКвитанцийНаТерминале Тогда
			Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
				РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Истина);
				РезультатОперации.ИдентификаторУстройстваЭТ  = Параметры.ИдентификаторУстройстваЭТ;
				РезультатОперации.ПечатьКвитанцийНаТерминале = ПечатьКвитанцийНаТерминале;
				ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
			КонецЕсли;
		Иначе
			Если Параметры.ИдентификаторУстройстваПУ = Неопределено Тогда
				ПоддерживаемыеТипыВО = Новый Массив();
				ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
				ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");
				ПоддерживаемыеТипыВО.Добавить("ККТ");
				ОписаниеОповещения = Новый ОписаниеОповещения("НачатьПодключенияЭквайринговогоТерминала_ВыбратьПечатающегоУстройстваЗавершение", ЭтотОбъект, Параметры);
				ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
					НСтр("ru='Выберите печатающее устройство'"), НСтр("ru='Печатающее устройство не подключено.'"), НСтр("ru='Печатающее устройство не выбрано.'"), Истина);
			Иначе
				НачатьПодключенияЭквайринговогоТерминала_ВыбратьПечатающегоУстройстваЗавершение(Параметры.ИдентификаторУстройстваПУ, Параметры);
			КонецЕсли;
		КонецЕсли;
	Иначе
		НачатьОтключениеОборудованиеПоИдентификатору(, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройстваЭТ);
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ТекстСообщения = НСтр("ru='При использовании терминала произошла ошибка: %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ВыходныеПараметры[1]);
			РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Ложь, ТекстСообщения);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПодключенияЭквайринговогоТерминала_ВыбратьПечатающегоУстройстваЗавершение(ИдентификаторУстройстваПУ, Параметры) Экспорт
	
	Если ИдентификаторУстройстваПУ = Неопределено Тогда
		НачатьОтключениеОборудованиеПоИдентификатору(, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройстваЭТ);
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ОписаниеОшибки = НСтр("ru='Печатающее устройство не выбрано.'");
			РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Ложь, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	Иначе
		Параметры.ИдентификаторУстройстваПУ = ИдентификаторУстройстваПУ;
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьПодключенияЭквайринговогоТерминала_ПечатающееУстройствоПодключениеЗавершение", ЭтотОбъект, Параметры);
		НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, Параметры.УникальныйИдентификатор, ИдентификаторУстройстваПУ);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПодключенияЭквайринговогоТерминала_ПечатающееУстройствоПодключениеЗавершение(РезультатПодключения, Параметры) Экспорт
	
	Если РезультатПодключения.Результат Тогда  
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Истина);
			РезультатОперации.ИдентификаторУстройстваЭТ  = Параметры.ИдентификаторУстройстваЭТ;
			РезультатОперации.ИдентификаторУстройстваПУ  = Параметры.ИдентификаторУстройстваПУ;
			РезультатОперации.ПечатьКвитанцийНаТерминале = Параметры.ПечатьКвитанцийНаТерминале;
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	Иначе
		НачатьОтключениеОборудованиеПоИдентификатору(, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройстваЭТ);
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ТекстСообщения = НСтр("ru='При подключении печатающего устройство произошла ошибка: %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатПодключения.ОписаниеОшибки);
			РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Ложь, ТекстСообщения);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Отключение подключенного эквайрингово терминала. 
// Если эквайринговый терминал не поддерживает печать квитанций на терминале, для печати подключается печатающее устройство.
// Данной процедурой оно тоже будет отключено.
// Входящие параметры:  
//  ПараметрыОперации - Структура со следующими атрибутами.
//    ИдентификаторУстройстваЭТ - Идентификатор подключенного эквайринговогой терминала.
//    ИдентификаторУстройстваПУ - Идентификатор подключенного фискального регистратора.
//    ПечатьКвитанцийНаТерминале   - Печать квитанций на терминале, если True то ИдентификаторПодключенногоПУ = Неопределено.
//  УникальныйИдентификатор - идентификатор формы.
//
Процедура НачатьОтключениеЭквайринговогоТерминала(ОповещениеПриЗавершении, УникальныйИдентификатор, ПараметрыОперации) Экспорт
	
	Если Не ПараметрыОперации.ПечатьКвитанцийНаТерминале И Не ПараметрыОперации.ИдентификаторУстройстваПУ = Неопределено Тогда
		НачатьОтключениеОборудованиеПоИдентификатору(, УникальныйИдентификатор, ПараметрыОперации.ИдентификаторУстройстваПУ);
	КонецЕсли;
	
	Если Не ПараметрыОперации.ИдентификаторУстройстваЭТ = Неопределено Тогда
		НачатьОтключениеОборудованиеПоИдентификатору(, УникальныйИдентификатор, ПараметрыОперации.ИдентификаторУстройстваЭТ);
	КонецЕсли;
	
	Если ОповещениеПриЗавершении <> Неопределено Тогда
		РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Истина);
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
КонецПроцедуры

// Выполнить сверку итогов на эквайринговом терминале.
// Если эквайринговый терминал не поддерживает печать квитанций на терминале, для печати подключается печатающее устройство.
//
Процедура НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройстваЭТ = Неопределено, ИдентификаторУстройстваПУ = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	
	Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале_ПодключениеЗавершение", ЭтотОбъект, Контекст);
	НачатьПодключенияЭквайринговогоТерминала(Оповещение, УникальныйИдентификатор, ИдентификаторУстройстваЭТ, ИдентификаторУстройстваПУ);
	
КонецПроцедуры

Процедура НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале_ПодключениеЗавершение(РезультатПодключения, Параметры) Экспорт
	
	Если РезультатПодключения.Результат Тогда  
		Параметры.Вставить("ПечатьКвитанцийНаТерминале", РезультатПодключения.ПечатьКвитанцийНаТерминале);
		Параметры.Вставить("ИдентификаторУстройстваЭТ" , РезультатПодключения.ИдентификаторУстройстваЭТ);
		Параметры.Вставить("ИдентификаторУстройстваПУ" , РезультатПодключения.ИдентификаторУстройстваПУ);
		
		ВходныеПараметры  = Неопределено;
		Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале_ВыполнениеКомандыЗавершение", ЭтотОбъект, Параметры);
		НачатьВыполнениеКоманды(Оповещение, РезультатПодключения.ИдентификаторУстройстваЭТ, "Settlement", ВходныеПараметры);
	Иначе
		// Ошибка подключения.
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ТекстСообщения = НСтр("ru='При подключении терминала произошла ошибка: %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатПодключения.ОписаниеОшибки);
			РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Ложь, ТекстСообщения);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале_ВыполнениеКомандыЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		ТекстСлипЧека = РезультатВыполнения.ВыходныеПараметры[0][1];
		
		Если Не ПустаяСтрока(ТекстСлипЧека) Тогда
			глПодключаемоеОборудование.Вставить("ПоследнийСлипЧек", ТекстСлипЧека);
		КонецЕсли;
		
		Если Не Параметры.ПечатьКвитанцийНаТерминале И Не Параметры.ИдентификаторУстройстваПУ = Неопределено И Не ПустаяСтрока(ТекстСлипЧека) Тогда
			Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале_ПечатьЗавершение", ЭтотОбъект, Параметры);
			НачатьПечатьТекста(Оповещение, Параметры.УникальныйИдентификатор, ТекстСлипЧека, Параметры.ИдентификаторУстройстваПУ);
		Иначе
			НачатьОтключениеЭквайринговогоТерминала(, Параметры.УникальныйИдентификатор, Параметры);
			Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
				РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Истина);
				ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		НачатьОтключениеЭквайринговогоТерминала(, Параметры.УникальныйИдентификатор, Параметры);
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ТекстСообщения = НСтр("ru='При использовании терминала произошла ошибка: %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ВыходныеПараметры[1]);
			РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Ложь, ТекстСообщения);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыполнениеСверкиИтоговНаЭквайринговомТерминале_ПечатьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	НачатьОтключениеЭквайринговогоТерминала(, Параметры.УникальныйИдентификатор, Параметры);
	
	Если РезультатВыполнения.Результат Тогда  
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала();
			РезультатОперации.Результат = Истина;
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	Иначе
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ТекстСообщения = НСтр("ru='При печати слип чека возникла ошибка: %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
			РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Ложь, ТекстСообщения);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет структуру параметров выполнения эквайринговой операции.
//
Функция ПараметрыВыполненияЭквайринговойОперации() Экспорт;
	
	Результат = Новый Структура();
	Результат.Вставить("ТипТранзакции"      , Неопределено);
	Результат.Вставить("СуммаОперации"      , 0);
	Результат.Вставить("НомерКарты"         , Неопределено);
	Результат.Вставить("НомерЧека"          , Неопределено);
	Результат.Вставить("НомерЧекаЭТ"        , Неопределено);
	Результат.Вставить("СсылочныйНомер"     , Неопределено);
	Результат.Вставить("ТекстСлипЧека"      , Неопределено);
	Результат.Вставить("КодАвторизации"     , Неопределено);
	Возврат Результат;
	
КонецФункции

// Выполнить операции на эквайринговом терминале.
// Если эквайринговый терминал не поддерживает печать квитанций на терминале, для печати подключается печатающее устройство.
//
Процедура НачатьВыполнениеОперацииНаЭквайринговомТерминале(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройстваЭТ = Неопределено, ИдентификаторУстройстваПУ = Неопределено, ПараметрыОперации = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ПараметрыОперации"       , ПараметрыОперации);
	
	Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеОперацииНаЭквайринговомТерминале_ПодключениеЗавершение", ЭтотОбъект, Контекст);
	НачатьПодключенияЭквайринговогоТерминала(Оповещение, УникальныйИдентификатор, ИдентификаторУстройстваЭТ, ИдентификаторУстройстваПУ);
	
КонецПроцедуры

Процедура НачатьВыполнениеОперацииНаЭквайринговомТерминале_ПодключениеЗавершение(РезультатПодключения, Параметры) Экспорт
	
	Если РезультатПодключения.Результат Тогда  
		Параметры.Вставить("ПечатьКвитанцийНаТерминале", РезультатПодключения.ПечатьКвитанцийНаТерминале);
		Параметры.Вставить("ИдентификаторУстройстваЭТ" , РезультатПодключения.ИдентификаторУстройстваЭТ);
		Параметры.Вставить("ИдентификаторУстройстваПУ" , РезультатПодключения.ИдентификаторУстройстваПУ);
		
		ПараметрыОперации = Параметры.ПараметрыОперации;
		
		ТипТранзакции  = Параметры.ПараметрыОперации.ТипТранзакции;
		СуммаОперации  = Параметры.ПараметрыОперации.СуммаОперации;
		НомерКарты     = ?(ПараметрыОперации.Свойство("НомерКарты")    , ПараметрыОперации.НомерКарты, "");
		НомерЧека      = ?(ПараметрыОперации.Свойство("НомерЧека")     , ПараметрыОперации.НомерЧека, "");
		НомерЧекаЭТ    = ?(ПараметрыОперации.Свойство("НомерЧекаЭТ")   , ПараметрыОперации.НомерЧекаЭТ, "");
		СсылочныйНомер = ?(ПараметрыОперации.Свойство("СсылочныйНомер"), ПараметрыОперации.СсылочныйНомер, "");   
		
		СсылочныйНомер = ?(ПустаяСтрока(СсылочныйНомер), "", СсылочныйНомер);
		НомерЧека = ?(ПустаяСтрока(НомерЧека), "", НомерЧека);
		НомерЧекаЭТ = ?(ПустаяСтрока(НомерЧекаЭТ), "", НомерЧекаЭТ);
		
		Если ТипТранзакции = "AuthorizeCompletion" Или ТипТранзакции = "AuthorizeVoidPreSales" Тогда
			Параметры.Вставить("БезВозвращаемыхПараметров", Истина);
		КонецЕсли;
		
		ВходныеПараметры  = Новый Массив();
		ВходныеПараметры.Добавить(СуммаОперации);
		
		Если ТипТранзакции = "AuthorizeSales" Тогда
			ВходныеПараметры.Добавить(НомерКарты);
			ВходныеПараметры.Добавить(НомерЧека);
			ВходныеПараметры.Добавить(СсылочныйНомер);
		ИначеЕсли ТипТранзакции = "AuthorizeVoid" Или ТипТранзакции = "EmergencyVoid" Тогда
			ВходныеПараметры.Добавить(СсылочныйНомер);
			ВходныеПараметры.Добавить(НомерЧекаЭТ);
			ВходныеПараметры.Добавить(НомерКарты);
		ИначеЕсли ТипТранзакции = "AuthorizeRefund" Тогда
			ВходныеПараметры.Добавить(НомерКарты);
			ВходныеПараметры.Добавить(СсылочныйНомер);
			ВходныеПараметры.Добавить(НомерЧекаЭТ);
		ИначеЕсли ТипТранзакции = "AuthorizePreSales" Тогда
			ВходныеПараметры.Добавить(НомерКарты);
			ВходныеПараметры.Добавить(НомерЧека);
			ВходныеПараметры.Добавить(СсылочныйНомер);
		Иначе
			ВходныеПараметры.Добавить(НомерКарты);
			ВходныеПараметры.Добавить(СсылочныйНомер);
			ВходныеПараметры.Добавить(НомерЧекаЭТ);
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеОперацииНаЭквайринговомТерминале_ВыполнениеКомандыЗавершение", ЭтотОбъект, Параметры);
		НачатьВыполнениеКоманды(Оповещение, РезультатПодключения.ИдентификаторУстройстваЭТ, ТипТранзакции, ВходныеПараметры);
		
	Иначе
		// Ошибка подключения.
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ТекстСообщения = НСтр("ru='Эквайринговая операция не была произведена: %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатПодключения.ОписаниеОшибки);
			РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Ложь, ТекстСообщения);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыполнениеОперацииНаЭквайринговомТерминале_ВыполнениеКомандыЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		// Эквайринговая операция произведена успешно.
		ПараметрыОперации = Параметры.ПараметрыОперации;
		Если Параметры.Свойство("БезВозвращаемыхПараметров") Или РезультатВыполнения.ВыходныеПараметры.Количество()= 1 Тогда
			ПараметрыОперации.НомерКарты     = "";
			ПараметрыОперации.СсылочныйНомер = "";
			ПараметрыОперации.НомерЧекаЭТ    = "";
			ПараметрыОперации.ТекстСлипЧека  = РезультатВыполнения.ВыходныеПараметры[0][1];
		Иначе
			ПараметрыОперации.НомерКарты     = РезультатВыполнения.ВыходныеПараметры[0];
			ПараметрыОперации.СсылочныйНомер = РезультатВыполнения.ВыходныеПараметры[1];
			ПараметрыОперации.НомерЧекаЭТ    = РезультатВыполнения.ВыходныеПараметры[2];
			ПараметрыОперации.ТекстСлипЧека  = РезультатВыполнения.ВыходныеПараметры[3][1];
			Если РезультатВыполнения.ВыходныеПараметры.Количество() > 4 Тогда
				ПараметрыОперации.КодАвторизации = РезультатВыполнения.ВыходныеПараметры[4];
			КонецЕсли;
		КонецЕсли;
	
		Если Не ПустаяСтрока(ПараметрыОперации.ТекстСлипЧека) Тогда
			глПодключаемоеОборудование.Вставить("ПоследнийСлипЧек", ПараметрыОперации.ТекстСлипЧека);
		КонецЕсли;
		
		Если Не Параметры.ПечатьКвитанцийНаТерминале И Не Параметры.ИдентификаторУстройстваПУ = Неопределено И Не ПустаяСтрока(ПараметрыОперации.ТекстСлипЧека) Тогда
			// Печатаем слипчек на подключаемом печатающем устройстве.
			Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеОперацииНаЭквайринговомТерминале_ПечатьЗавершение", ЭтотОбъект, Параметры);
			НачатьПечатьТекста(Оповещение, Параметры.УникальныйИдентификатор, ПараметрыОперации.ТекстСлипЧека, Параметры.ИдентификаторУстройстваПУ);
		Иначе
			НачатьОтключениеЭквайринговогоТерминала(, Параметры.УникальныйИдентификатор, Параметры);
			Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
				РезультатОперации = Параметры.ПараметрыОперации;
				РезультатОперации.Вставить("Результат", Истина);
				РезультатОперации.Вставить("ОписаниеОшибки");
				ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		// Эквайринговая операция не была произведена.
		НачатьОтключениеЭквайринговогоТерминала(, Параметры.УникальныйИдентификатор, Параметры);
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ТекстСообщения = НСтр("ru='Эквайринговая операция не была произведена: %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ВыходныеПараметры[1]);
			РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Ложь, ТекстСообщения);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Начинает выполнение операции на эквайринговом терминале.
// 
// Параметры:
// 	Результат
// 	РезультатВыполнения - Структура - где:
// 	*Параметры - Структура - .
Процедура НачатьВыполнениеОперацииНаЭквайринговомТерминале_ПослеЗакрытияВопроса(Результат, РезультатВыполнения) Экспорт
	
	Параметры = РезультатВыполнения.Параметры; 
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Параметры.Вставить("ОписаниеОшибки", РезультатВыполнения.ОписаниеОшибки);
		
		РезультатОперации = Параметры.ПараметрыОперации;
		ВходныеПараметры = Новый Массив();
		ВходныеПараметры.Добавить(РезультатОперации.СуммаОперации);
		ВходныеПараметры.Добавить(РезультатОперации.СсылочныйНомер);
		ВходныеПараметры.Добавить(РезультатОперации.НомерЧека);
		// Слип чек не распечатан, необходимо выполнить аварийную отмену операции.
		Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеОперацииНаЭквайринговомТерминале_ОшибкаПечатиЗавершение", ЭтотОбъект, Параметры);
		НачатьВыполнениеКоманды(Оповещение, Параметры.ИдентификаторУстройстваЭТ, "EmergencyVoid", ВходныеПараметры);
	Иначе
		ПараметрыОперации = Параметры.ПараметрыОперации;
		Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеОперацииНаЭквайринговомТерминале_ПечатьЗавершение", ЭтотОбъект, Параметры);
		НачатьПечатьТекста(Оповещение, Параметры.УникальныйИдентификатор, ПараметрыОперации.ТекстСлипЧека, Параметры.ИдентификаторУстройстваПУ);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыполнениеОперацииНаЭквайринговомТерминале_ПечатьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда  
		// Слип чек распечатан успешно.
		НачатьОтключениеЭквайринговогоТерминала(, Параметры.УникальныйИдентификатор, Параметры);
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			РезультатОперации = Параметры.ПараметрыОперации;
			РезультатОперации.Вставить("Результат", Истина);
			РезультатОперации.Вставить("ОписаниеОшибки");
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	Иначе
		РезультатВыполнения.Вставить("Параметры", Параметры);
		Режим = РежимДиалогаВопрос.ПовторитьОтмена;
		СообщениеНаЭкране = РезультатВыполнения.ОписаниеОшибки  + Символы.ПС +
			НСтр("ru = 'Повторить печать слип-чека?'") + Символы.ПС +
			НСтр("ru = 'ВНИМАНИЕ:'") + Символы.ПС +
			НСтр("ru = 'При отмене печати слип-чека выполнится аварийная отмена операции на экваринговом терминале.'") + Символы.ПС +
			НСтр("ru = 'Подготовьте банковскую карту покупателя.'");
		Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеОперацииНаЭквайринговомТерминале_ПослеЗакрытияВопроса", ЭтотОбъект, РезультатВыполнения);
		ПоказатьВопрос(Оповещение, СообщениеНаЭкране, Режим, ,, НСтр("ru = 'При печати слип-чека произошла ошибка'"));
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыполнениеОперацииНаЭквайринговомТерминале_ОшибкаПечатиЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	НачатьОтключениеЭквайринговогоТерминала(, Параметры.УникальныйИдентификатор, Параметры);
	
	Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
		Если РезультатВыполнения.Результат Тогда 
			// Слип чек не распечатан, аварийная отмена операции произведена успешно.
			ТекстСообщения = НСтр("ru='Эквайринговая операция отменена - ошибка печати слип чека: %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", Параметры.ОписаниеОшибки);
		Иначе
			// Ошибка при аварийной отмене операции.
			ТекстСообщения = НСтр("ru='Ошибка отмены операции транзакции. Обратитесь в банк. %ДополнительноеОписание%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		КонецЕсли;
		РезультатОперации = ПараметрыРезультатаПодключенияЭквайринговогоТерминала(Ложь, ТекстСообщения);
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСДисплеямиПокупателя

// Начать вывод тестовых строк на подключенные дисплеи покупателя.
//
Процедура НачатьВыводИнформацииНаДисплейПокупателя(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства = Неопределено, СтрокиТекста = Неопределено) Экспорт
	
	ПодключенныеУстройства = ПолучитьПодключенныеУстройства(глПодключаемоеОборудование.ПараметрыПодключенияПО, 
		ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ДисплейПокупателя"), ИдентификаторУстройства);
	
	Если ПодключенныеУстройства.Количество() > 0 Тогда
		Для Каждого Устройство Из ПодключенныеУстройства Цикл
			Контекст = Новый Структура;
			Контекст.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
			Контекст.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
			Контекст.Вставить("ИдентификаторУстройства", Устройство.Ссылка);
			Оповещение = Новый ОписаниеОповещения("НачатьОперациюНаДисплейПокупателя_ВыполнитьКомандуЗавершение", ЭтотОбъект, Контекст);
			
			ВходныеПараметры  = Новый Массив();
			ВходныеПараметры.Добавить(СтрокиТекста);
			НачатьВыполнениеКоманды(Оповещение, Устройство.Ссылка, "DisplayText", ВходныеПараметры);
		КонецЦикла
	ИначеЕсли ИдентификаторУстройства <> Неопределено И ОповещениеПриЗавершении <> Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='Нет подключенных дисплеев покупателя.'");
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки, ИдентификаторУстройства);
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
КонецПроцедуры

// Начать очистку подключенных дисплеев покупателя.
//
Процедура НачатьОчисткуДисплеяПокупателя(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства = Неопределено) Экспорт
	
	ПодключенныеУстройства = ПолучитьПодключенныеУстройства(глПодключаемоеОборудование.ПараметрыПодключенияПО, 
		ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.ДисплейПокупателя"), ИдентификаторУстройства);
	
	Если ПодключенныеУстройства.Количество() > 0 Тогда
		Для Каждого Устройство Из ПодключенныеУстройства Цикл
			Контекст = Новый Структура;
			Контекст.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
			Контекст.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
			Контекст.Вставить("ИдентификаторУстройства", Устройство.Ссылка);
			Оповещение = Новый ОписаниеОповещения("НачатьОперациюНаДисплейПокупателя_ВыполнитьКомандуЗавершение", ЭтотОбъект, Контекст);
			ВходныеПараметры  = Неопределено;
			НачатьВыполнениеКоманды(Оповещение, Устройство.Ссылка, "ClearText", ВходныеПараметры);
		КонецЦикла
	ИначеЕсли ИдентификаторУстройства <> Неопределено И ОповещениеПриЗавершении <> Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='Нет подключенных дисплеев покупателя.'");
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки, ИдентификаторУстройства); 
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьОперациюНаДисплейПокупателя_ВыполнитьКомандуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ОписаниеОшибки = "";
	Иначе
		ОписаниеОшибки = НСтр("ru='При использовании дисплея покупателя произошла ошибка: %ДополнительноеОписание%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", РезультатВыполнения.ВыходныеПараметры[1]);
	КонецЕсли;
	
	Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(РезультатВыполнения.Результат, ОписаниеОшибки, Параметры.ИдентификаторУстройства);
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСТСД

// Начать загрузку данных из терминала сбора данных.
//
Процедура НачатьЗагрузкуДанныеИзТСД(ОповещениеПриЗавершении, УникальныйИдентификатор, СворачиватьДанные = Ложь) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("СворачиватьДанные"       , СворачиватьДанные);
	
	Оповещение = Новый ОписаниеОповещения("НачатьЗагрузкуДанныеИзТСД_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
	ПредложитьВыбратьУстройство(Оповещение, "ТерминалСбораДанных", НСтр("ru='Выберите терминал сбора данных'"), НСтр("ru='Терминал сбора данных не подключен.'"), ,Истина);
		
КонецПроцедуры

Процедура НачатьЗагрузкуДанныеИзТСД_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='Терминал сбора данных не подключен.'");
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	Оповещение = Новый ОписаниеОповещения("НачатьЗагрузкуДанныеИзТСД_ПодключениеЗавершение", ЭтотОбъект, Параметры);
	НачатьПодключениеОборудованиеПоИдентификатору(Оповещение, Параметры.УникальныйИдентификатор, ИдентификаторУстройства);
	
КонецПроцедуры

Процедура НачатьЗагрузкуДанныеИзТСД_ПодключениеЗавершение(РезультатПодключения, Параметры) Экспорт
	
	Если РезультатПодключения.Результат Тогда
		ВходныеПараметры  = Неопределено;
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьЗагрузкуДанныеИзТСД_ВыполнитьКомандуЗавершение", ЭтотОбъект, Параметры);
		НачатьВыполнениеКоманды(ОписаниеОповещения, Параметры.ИдентификаторУстройства, "DownloadDocument", ВходныеПараметры);
	Иначе
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ОписаниеОшибки = РезультатПодключения.ОписаниеОшибки;
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки, Параметры.ИдентификаторУстройства);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьЗагрузкуДанныеИзТСД_ВыполнитьКомандуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		ВыходныеПараметры = РезультатВыполнения.ВыходныеПараметры;
		ТаблицаШтрихкодов = ВыходныеПараметры[0];
		АлкогольнаяПродукция = (ВыходныеПараметры.Количество() > 1) И ВыходныеПараметры[1];
		МассивЗагрузкиИзТСД = Новый Массив;       
		
		Если Параметры.СворачиватьДанные И НЕ АлкогольнаяПродукция Тогда
			
			СоответствиеДанных = Новый Соответствие;
			Для Индекс = 0 По ТаблицаШтрихкодов.Количество() - 1 Цикл
				Штрихкод   = ТаблицаШтрихкодов[Индекс].Штрихкод;
				Количество = Число(?(ПустаяСтрока(ТаблицаШтрихкодов[Индекс].Количество), 0, ТаблицаШтрихкодов[Индекс].Количество));
				ЭлементСоответствия = СоответствиеДанных.Получить(Штрихкод);
				Если ЭлементСоответствия = Неопределено Тогда
					СтруктураШтрихкода = Новый Структура("Штрихкод, Количество", Штрихкод, Количество);
					ИндексЗагрузки = МассивЗагрузкиИзТСД.Количество(); // Вычитать 1 не нужно, т.к. добавление идет после.
					МассивЗагрузкиИзТСД.Добавить(СтруктураШтрихкода);
					СоответствиеДанных.Вставить(Штрихкод, ИндексЗагрузки);
				Иначе
					СтруктураШтрихкода = МассивЗагрузкиИзТСД[ЭлементСоответствия];
					СтруктураШтрихкода.Количество = СтруктураШтрихкода.Количество + Количество;
				КонецЕсли;
			КонецЦикла;
		Иначе
			МассивЗагрузкиИзТСД = ТаблицаШтрихкодов; 
		КонецЕсли;
		
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Истина, ,Параметры.ИдентификаторУстройства);
			РезультатОперации.Вставить("ТаблицаТоваров"      , МассивЗагрузкиИзТСД);
			РезультатОперации.Вставить("АлкогольнаяПродукция", АлкогольнаяПродукция);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
		
	Иначе
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ОписаниеОшибки = НСтр("ru='При загрузке данных из терминала сбора данных произошла ошибка.
								  |%ОписаниеОшибки%'");
			ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", РезультатВыполнения.ВыходныеПараметры[1]);
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(РезультатВыполнения.Результат, ОписаниеОшибки, Параметры.ИдентификаторУстройства);  
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
	НачатьОтключениеОборудованиеПоИдентификатору(, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);
	
КонецПроцедуры

// Начать выгрузку данных в терминал сбора данных.
//
Процедура НачатьВыгрузкуДанныеВТСД(ОповещениеПриЗавершении, УникальныйИдентификатор, ТаблицаВыгрузкиТоваров, ПолнаяВыгрузка = Истина) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ТаблицаВыгрузкиТоваров"  , ТаблицаВыгрузкиТоваров);
	Контекст.Вставить("ПолнаяВыгрузка"          , ПолнаяВыгрузка);
	
	Оповещение = Новый ОписаниеОповещения("НачатьВыгрузкуДанныеВТСД_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
	ПредложитьВыбратьУстройство(Оповещение, "ТерминалСбораДанных", НСтр("ru='Выберите терминал сбора данных'"), НСтр("ru='Терминал сбора данных не подключен.'"), ,Истина);
	
КонецПроцедуры                          

Процедура НачатьВыгрузкуДанныеВТСД_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='Терминал сбора данных не подключен.'");
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	Оповещение = Новый ОписаниеОповещения("НачатьВыгрузкуДанныеВТСД_ПодключениеЗавершение", ЭтотОбъект, Параметры);
	НачатьПодключениеОборудованиеПоИдентификатору(Оповещение, Параметры.УникальныйИдентификатор, ИдентификаторУстройства);
	
КонецПроцедуры

// Начинает выгрузку данных в ТСД.
// 
// Параметры:
// 	РезультатПодключения - Структура - структура результата подключения.
// 	Параметры - Структура - где:
// 	*ТаблицаВыгрузкиТоваров - ТаблицаЗначений - где:
// 	**Наименование - Строка - .
Процедура НачатьВыгрузкуДанныеВТСД_ПодключениеЗавершение(РезультатПодключения, Параметры) Экспорт
	
	Если РезультатПодключения.Результат Тогда
		
		ВходныеПараметры  = Новый Массив();
		МассивТСД = Новый Массив;
		Для Каждого текСтрока Из Параметры.ТаблицаВыгрузкиТоваров Цикл
			НаименованиеНоменклатуры = "";
			Если текСтрока.Свойство("Номенклатура") Тогда
				НаименованиеНоменклатуры = Строка(текСтрока.Номенклатура);
			КонецЕсли;
			Если ПустаяСтрока(НаименованиеНоменклатуры) И текСтрока.Свойство("Наименование") Тогда
				НаименованиеНоменклатуры = текСтрока.Наименование;
			КонецЕсли;
			
			СтрокаМассиваТСД = Новый СписокЗначений; // Не массив для сохранения совместимости с обработками обслуживания.
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("Штрихкод")                   , текСтрока.Штрихкод, ""));
			СтрокаМассиваТСД.Добавить(НаименованиеНоменклатуры);
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("ЕдиницаИзмерения")           , текСтрока.ЕдиницаИзмерения, ""));
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("ХарактеристикаНоменклатуры") , текСтрока.ХарактеристикаНоменклатуры, ""));
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("СерияНоменклатуры")          , текСтрока.СерияНоменклатуры, ""));
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("Качество")                   , текСтрока.Качество, ""));
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("Цена")                       , текСтрока.Цена, 0));
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("Количество")                 , текСтрока.Количество, 0));
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("Артикул ")                   , текСтрока.Артикул, ""));
			// Данные ЕГАИС.
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("Алкоголь")                 , текСтрока.Алкоголь, Ложь));
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("Маркируемый")              , текСтрока.Маркируемый, Ложь));
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("КодВидаАлкогольнойПродукции"), текСтрока.КодВидаАлкогольнойПродукции, ""));
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("КодАлкогольнойПродукции")    , текСтрока.КодАлкогольнойПродукции, ""));
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("ЕмкостьТары")                , текСтрока.ЕмкостьТары, Неопределено));
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("Крепость")                   , текСтрока.Крепость, Неопределено));
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("ИННПроизводителя")           , текСтрока.ИННПроизводителя, Неопределено));
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("КПППроизводителя")           , текСтрока.КПППроизводителя, Неопределено));
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("ШтрихкодМаркиАлкогольнойПродукции") , текСтрока.ШтрихкодМаркиАлкогольнойПродукции, Неопределено));
			СтрокаМассиваТСД.Добавить(?(текСтрока.Свойство("ШтрихкодУпаковки")           , текСтрока.ШтрихкодУпаковки, Неопределено));
			МассивТСД.Добавить(СтрокаМассиваТСД);
		КонецЦикла;
				
		ВходныеПараметры.Добавить("Items");
		ВходныеПараметры.Добавить(МассивТСД);
		ВходныеПараметры.Добавить(Параметры.ПолнаяВыгрузка);
		
		Оповещение = Новый ОписаниеОповещения("НачатьВыгрузкуДанныеВТСД_ВыполнитьКомандуЗавершение", ЭтотОбъект, Параметры);
		НачатьВыполнениеКоманды(Оповещение, Параметры.ИдентификаторУстройства, "UploadDirectory", ВходныеПараметры);
		
	Иначе
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ОписаниеОшибки = РезультатПодключения.ОписаниеОшибки;
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки, Параметры.ИдентификаторУстройства);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыгрузкуДанныеВТСД_ВыполнитьКомандуЗавершение(РезультатВыполнения, Параметры) Экспорт
		
	Если РезультатВыполнения.Результат Тогда
		ОписаниеОшибки = ""; 
	Иначе
		ОписаниеОшибки = НСтр("ru='При выгрузке данных в терминал сбора данных произошла ошибка: %ОписаниеОшибки%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", РезультатВыполнения.ВыходныеПараметры[1]);
	КонецЕсли;
	
	Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(РезультатВыполнения.Результат, ОписаниеОшибки, Параметры.ИдентификаторУстройства); 
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
	НачатьОтключениеОборудованиеПоИдентификатору(, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);
	
КонецПроцедуры

// Начать очистку данных в терминале сбора данных.
//
Процедура НачатьОчисткуДанныеВТСД(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	
	Если ИдентификаторУстройства = Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("НачатьОчисткуДанныеВТСД_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(Оповещение, "ТерминалСбораДанных",
			НСтр("ru='Выберите терминал сбора данных'"), НСтр("ru='Терминал сбора данных не подключен.'"), ,Истина);
	Иначе
		НачатьОчисткуДанныеВТСД_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьОчисткуДанныеВТСД_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='Терминал сбора данных не подключен.'");
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки); 
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	ОписаниеОповещения = Новый ОписаниеОповещения("НачатьОчисткуДанныеВТСД_ПодключениеЗавершение", ЭтотОбъект, Параметры);
	НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, Параметры.УникальныйИдентификатор, ИдентификаторУстройства);
	
КонецПроцедуры

Процедура НачатьОчисткуДанныеВТСД_ПодключениеЗавершение(РезультатПодключения, Параметры) Экспорт
	
	Если РезультатПодключения.Результат Тогда
		ВходныеПараметры  = Неопределено;
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьОчисткуДанныеВТСД_ВыполнитьКомандуЗавершение", ЭтотОбъект, Параметры);
		НачатьВыполнениеКоманды(ОписаниеОповещения, Параметры.ИдентификаторУстройства, "ClearTable", ВходныеПараметры);
	Иначе
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ОписаниеОшибки = РезультатПодключения.ОписаниеОшибки;
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки, Параметры.ИдентификаторУстройства);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьОчисткуДанныеВТСД_ВыполнитьКомандуЗавершение(РезультатВыполнения, Параметры) Экспорт
		
	Если РезультатВыполнения.Результат Тогда
		ОписаниеОшибки = ""; 
	Иначе
		ОписаниеОшибки = НСтр("ru='При очистке данных в терминале сбора данных произошла ошибка: %ОписаниеОшибки%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", РезультатВыполнения.ВыходныеПараметры[1]);
	КонецЕсли;
	
	Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(РезультатВыполнения.Результат, ОписаниеОшибки, Параметры.ИдентификаторУстройства); 
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
	НачатьОтключениеОборудованиеПоИдентификатору(, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСЭлектроннымиВесами

// Получает вес с электронных весов.
// УникальныйИдентификатор - идентификатор формы.
// ОповещениеПриЗавершении - оповещение при завершении взвешивании и передачи веса.
//
Процедура НачатьПолученияВесаСЭлектронныхВесов(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства = Неопределено, ОтображатьСообщения = Ложь) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	Контекст.Вставить("ОтображатьСообщения"    , ОтображатьСообщения);
	
	Если ИдентификаторУстройства = Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("НачатьПолученияВесаСЭлектронныхВесов_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(Оповещение, "ЭлектронныеВесы",
			НСтр("ru='Выберите электронные весы'"), 
			НСтр("ru='Электронные весы не подключены.'"), 
			НСтр("ru='Электронные весы не выбраны.'"),
			Истина);
	Иначе
		НачатьПолученияВесаСЭлектронныхВесов_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПолученияВесаСЭлектронныхВесов_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='Электронные весы не выбраны.'");
		Если Параметры.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		КонецЕсли;
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании();
			РезультатОперации.Результат = Ложь;
			РезультатОперации.ОписаниеОшибки = ОписаниеОшибки;
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства" , ИдентификаторУстройства);
	Оповещение = Новый ОписаниеОповещения("НачатьПолученияВесаСЭлектронныхВесов_ПодключениеЗавершение", ЭтотОбъект, Параметры);
	НачатьПодключениеОборудованиеПоИдентификатору(Оповещение, Параметры.УникальныйИдентификатор, ИдентификаторУстройства);
	
КонецПроцедуры

Процедура НачатьПолученияВесаСЭлектронныхВесов_ПодключениеЗавершение(РезультатПодключения, Параметры) Экспорт
	
	Если РезультатПодключения.Результат Тогда  
		ВходныеПараметры  = Неопределено;
		Оповещение = Новый ОписаниеОповещения("НачатьПолученияВесаСЭлектронныхВесов_ВыполнитьКомандуЗавершение", ЭтотОбъект, Параметры);
		НачатьВыполнениеКоманды(Оповещение, Параметры.ИдентификаторУстройства, "ПолучитьВес", ВходныеПараметры);
	Иначе
		// Ошибка подключения весов
		ОписаниеОшибки = РезультатПодключения.ОписаниеОшибки;
		Если Параметры.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		КонецЕсли;
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки, Параметры.ИдентификаторУстройства);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПолученияВесаСЭлектронныхВесов_ВыполнитьКомандуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		Вес = РезультатВыполнения.ВыходныеПараметры[0]; // Вес получен
		ОписаниеОшибки = "";
	Иначе
		Вес = Неопределено;
		ОписаниеОшибки = НСтр("ru='При использовании электронных весов произошла ошибка: %ДополнительноеОписание%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", РезультатВыполнения.ВыходныеПараметры[1]);
		Если Параметры.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(РезультатВыполнения.Результат, ОписаниеОшибки, Параметры.ИдентификаторУстройства);
		РезультатОперации.Вставить("Вес", Вес);
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
	НачатьОтключениеОборудованиеПоИдентификатору(, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);
	
КонецПроцедуры

// Начать установку веса тары на электронных весах.
// УникальныйИдентификатор - идентификатор формы.
// ОповещениеПриЗавершении - оповещение при завершении взвешивании и передачи веса.
//
Процедура НачатьУстановкуВесаТары(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства = Неопределено, Вес = Неопределено) Экспорт
	
	ВходныеПараметры = Новый Массив();
	ВходныеПараметры.Добавить(Вес);
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	Контекст.Вставить("ВходныеПараметры"       , ВходныеПараметры);
	
	Если ИдентификаторУстройства = Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("НачатьУстановкуВесаТары_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(Оповещение, "ЭлектронныеВесы",
			НСтр("ru='Выберите электронные весы'"), 
			НСтр("ru='Электронные весы не подключены.'"), 
			НСтр("ru='Электронные весы не выбраны.'"),
			Истина);
	Иначе
		НачатьУстановкуВесаТары_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьУстановкуВесаТары_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='Электронные весы не выбраны.'");
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании();
			РезультатОперации.Результат = Ложь;
			РезультатОперации.ОписаниеОшибки = ОписаниеОшибки;
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства" , ИдентификаторУстройства);
	Оповещение = Новый ОписаниеОповещения("НачатьУстановкуВесаТары_ПодключениеЗавершение", ЭтотОбъект, Параметры);
	НачатьПодключениеОборудованиеПоИдентификатору(Оповещение, Параметры.УникальныйИдентификатор, ИдентификаторУстройства);
	
КонецПроцедуры

Процедура НачатьУстановкуВесаТары_ПодключениеЗавершение(РезультатПодключения, Параметры) Экспорт
	
	Если РезультатПодключения.Результат Тогда  
		ВходныеПараметры  = Параметры.ВходныеПараметры;
		Оповещение = Новый ОписаниеОповещения("НачатьУстановкуВесаТары_ВыполнитьКомандуЗавершение", ЭтотОбъект, Параметры);
		НачатьВыполнениеКоманды(Оповещение, Параметры.ИдентификаторУстройства, "Тарировать", ВходныеПараметры);
	Иначе
		// Ошибка подключения весов
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ОписаниеОшибки = РезультатПодключения.ОписаниеОшибки;
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки, Параметры.ИдентификаторУстройства);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьУстановкуВесаТары_ВыполнитьКомандуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ОписаниеОшибки = НСтр("ru='При использовании электронных весов произошла ошибка: %ДополнительноеОписание%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", РезультатВыполнения.ВыходныеПараметры[1]);
	КонецЕсли;
	
	Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(РезультатВыполнения.Результат, ОписаниеОшибки, Параметры.ИдентификаторУстройства);
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
	НачатьОтключениеОборудованиеПоИдентификатору(, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСОборудованиемПринтеромЭтикеток

// Начать печать этикеток.
//
Процедура НачатьПечатьЭтикеток(ОповещениеПриЗавершенииПечати, УникальныйИдентификатор, ОписаниеЭтикеткиВXML, ДанныеДляПечати, ИдентификаторУстройства = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("СледующееОповещение"     , ОповещениеПриЗавершенииПечати);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ОписаниеЭтикеткиВXML"    , ОписаниеЭтикеткиВXML);
	Контекст.Вставить("ДанныеДляПечати"         , ДанныеДляПечати);
	
	Если ИдентификаторУстройства = Неопределено Тогда	
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьПечатьЭтикеток_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, "ПринтерЭтикеток",
			НСтр("ru='Выберите принтер этикеток'"), 
			НСтр("ru='Принтер этикеток не подключен.'"), 
			НСтр("ru='Принтер этикеток не выбран.'"), 
			Истина);
	Иначе
		НачатьПечатьЭтикеток_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПечатьЭтикеток_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	Если ИдентификаторУстройства = Неопределено Тогда
		Если Параметры.СледующееОповещение <> Неопределено Тогда
			ОписаниеОшибки = НСтр("ru='Принтер этикеток не выбран.'");
			Результат = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, Результат);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	ОписаниеОповещения = Новый ОписаниеОповещения("НачатьПечатьЭтикеток_ПодключениеЗавершение", ЭтотОбъект, Параметры);
	НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, Параметры.УникальныйИдентификатор, ИдентификаторУстройства);
	
КонецПроцедуры

Процедура НачатьПечатьЭтикеток_ПодключениеЗавершение(РезультатПодключения, Параметры) Экспорт
	
	Если РезультатПодключения.Результат Тогда
		
		СообщениеОбОшибке = "";
		ОписаниеЭтикеткиВСтруктуре = Неопределено;
		Результат = МенеджерОборудованияВызовСервера.ПолучитьОписаниеМакета(Параметры.ОписаниеЭтикеткиВXML, СообщениеОбОшибке, ОписаниеЭтикеткиВСтруктуре);
		
		Если Не Результат Тогда
			Если Параметры.СледующееОповещение <> Неопределено Тогда
				ОписаниеОшибки = НСтр("ru='При обработке макета этикетки произошла ошибка.
									  |%ОписаниеОшибки%
									  |Печать прервана.'");
				ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", СообщениеОбОшибке);
				РезультатВыполнения = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства", Ложь, ОписаниеОшибки, Параметры.ИдентификаторУстройства);
				ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатВыполнения);
			КонецЕсли;
		Иначе
			ВходныеПараметры = Новый Массив();
			ВходныеПараметры.Добавить(ОписаниеЭтикеткиВСтруктуре);
			ВходныеПараметры.Добавить(Параметры.ДанныеДляПечати);
			ОписаниеОповещения = Новый ОписаниеОповещения("НачатьПечатьЭтикеток_ВыполнитьКомандуЗавершение", ЭтотОбъект, Параметры);
			НачатьВыполнениеКоманды(ОписаниеОповещения, Параметры.ИдентификаторУстройства, "ПечатьЭтикеток", ВходныеПараметры);
		КонецЕсли;
		
	ИначеЕсли Параметры.СледующееОповещение <> Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='При подключении устройства произошла ошибка.
							  |%ОписаниеОшибки%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", РезультатПодключения.ОписаниеОшибки);
		РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки, Параметры.ИдентификаторУстройства); 
		ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПечатьЭтикеток_ВыполнитьКомандуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ОписаниеОшибки = НСтр("ru='Ошибок нет.'");
	Иначе
		ОписаниеОшибки = НСтр("ru='При работе с принтером этикеток произошла ошибка.
								  |%ОписаниеОшибки%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", РезультатВыполнения.ВыходныеПараметры[1]);
	КонецЕсли;
		
	Если Параметры.СледующееОповещение <> Неопределено Тогда
		Результат = ПараметрыВыполненияОперацииНаОборудовании(РезультатВыполнения.Результат, ОписаниеОшибки, Параметры.ИдентификаторУстройства); 
		ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, Результат);
	КонецЕсли;
	
	НачатьОтключениеОборудованиеПоИдентификатору(, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);
	
КонецПроцедуры

// Начать инициализацию принтера этикеток.
//
Процедура НачатьИнициализацияПринтераЭтикеток(ОповещениеПриЗавершенииПечати, УникальныйИдентификатор, ИдентификаторУстройства = Неопределено) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("СледующееОповещение"     , ОповещениеПриЗавершенииПечати);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	
	Если ИдентификаторУстройства = Неопределено Тогда	
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьИнициализацияПринтераЭтикеток_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, "ПринтерЭтикеток",
			НСтр("ru='Выберите принтер этикеток'"), 
			НСтр("ru='Принтер этикеток не подключен.'"), 
			НСтр("ru='Принтер этикеток не выбран.'"), 
			Истина);
	Иначе
		НачатьИнициализацияПринтераЭтикеток_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьИнициализацияПринтераЭтикеток_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	Если ИдентификаторУстройства = Неопределено Тогда
		Если Параметры.СледующееОповещение <> Неопределено Тогда
			ОписаниеОшибки = НСтр("ru='Принтер этикеток не выбран.'");
			Результат = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, Результат);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	ОписаниеОповещения = Новый ОписаниеОповещения("НачатьИнициализацияПринтераЭтикеток_ПодключениеЗавершение", ЭтотОбъект, Параметры);
	НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, Параметры.УникальныйИдентификатор, ИдентификаторУстройства);
	
КонецПроцедуры

Процедура НачатьИнициализацияПринтераЭтикеток_ПодключениеЗавершение(РезультатПодключения, Параметры) Экспорт
	
	Если РезультатПодключения.Результат Тогда
		СообщениеОбОшибке = "";
		ВходныеПараметры = Новый Массив();
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьИнициализацияПринтераЭтикеток_ВыполнитьКомандуЗавершение", ЭтотОбъект, Параметры);
		НачатьВыполнениеКоманды(ОписаниеОповещения, Параметры.ИдентификаторУстройства, "ИнициализацияПринтера", ВходныеПараметры);
	ИначеЕсли Параметры.СледующееОповещение <> Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='При подключении устройства произошла ошибка.
							  |%ОписаниеОшибки%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", РезультатПодключения.ОписаниеОшибки);
		РезультатВыполнения = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки, Параметры.ИдентификаторУстройства); 
		ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьИнициализацияПринтераЭтикеток_ВыполнитьКомандуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ОписаниеОшибки = НСтр("ru='Ошибок нет.'");
	Иначе
		ОписаниеОшибки = НСтр("ru='При работе с принтером этикеток произошла ошибка.
								  |%ОписаниеОшибки%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", РезультатВыполнения.ВыходныеПараметры[1]);
	КонецЕсли;
		
	Если Параметры.СледующееОповещение <> Неопределено Тогда
		Результат = ПараметрыВыполненияОперацииНаОборудовании(РезультатВыполнения.Результат, ОписаниеОшибки, Параметры.ИдентификаторУстройства); 
		ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, Результат);
	КонецЕсли;
	
	НачатьОтключениеОборудованиеПоИдентификатору(, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);
	
КонецПроцедуры

// Начать редактирование макета.
//
Процедура НачатьРедактированиеМакета(ОповещениеПриЗавершенииРедактирования, ОписаниеЭтикеткиВXML, АдресХранилищаСКД) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("СледующееОповещение", ОповещениеПриЗавершенииРедактирования);
	Контекст.Вставить("XMLОписаниеМакета"  , ОписаниеЭтикеткиВXML);
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("НачатьРедактированиеМакета_Завершение", ЭтотОбъект, Контекст);
	
	ИмяФормы = "ОбщаяФорма.РедакторЭтикетокФормаРедактированияМакета";
	Попытка
		ОткрытьФорму(ИмяФормы, Новый Структура("АдресХранилищаСКД", АдресХранилищаСКД),,,,, ОповещениеПриЗавершении);
	Исключение
		ТекстСообщения = НСтр("ru='Использование редактора этикеток невозможно! Функциональность не поддерживается.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

Процедура НачатьРедактированиеМакета_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("РазмерМакета",      ?(Результат <> Неопределено, ДополнительныеПараметры.РазмерМакета, Неопределено));
	ДопПараметры.Вставить("XMLОписаниеМакета", ?(Результат <> Неопределено, ДополнительныеПараметры.XMLОписаниеМакета, Неопределено));
	ДопПараметры.Вставить("Поля",              ?(Результат <> Неопределено, ДополнительныеПараметры.Поля, Неопределено));
	
	ОписаниеОповещения = Новый ОписаниеОповещения(ДополнительныеПараметры.СледующееОповещение.ИмяПроцедуры, ДополнительныеПараметры.СледующееОповещение.Модуль, ДопПараметры);
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, ?(Результат <> Неопределено, Результат, КодВозвратаДиалога.Отмена));
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииРаботыCВесамиСПечатьюЭтикеток

// Начать выгрузку данных в терминал сбора данных.
//
Процедура НачатьВыгрузкуДанныеВВесыСПечатьюЭтикеток(ОповещениеПриЗавершении, УникальныйИдентификатор, ТаблицаВыгрузкиТоваров, ИдентификаторУстройства = Неопределено, ЧастичнаяВыгрузка = Ложь, ОтображатьСообщения = Ложь) Экспорт
	
	Если ТаблицаВыгрузкиТоваров.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("ru='Нет данных для выгрузки.'");
		Если ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		Если ОповещениеПриЗавершении <> Неопределено Тогда
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании();
			РезультатОперации.Результат = Ложь;
			РезультатОперации.ОписаниеОшибки = ТекстСообщения;
			РезультатОперации.ИдентификаторУстройства = ИдентификаторУстройства;
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	Контекст = Новый Структура; 
	Контекст.Вставить("СледующееОповещение"     , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ТаблицаВыгрузкиТоваров"  , ТаблицаВыгрузкиТоваров);
	Контекст.Вставить("ЧастичнаяВыгрузка"       , ЧастичнаяВыгрузка);
	Контекст.Вставить("ОтображатьСообщения"     , ОтображатьСообщения);
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыгрузкуДанныеВВесыСПечатьюЭтикеток_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, "ВесыСПечатьюЭтикеток",
			НСтр("ru='Выберите весы с печатью этикеток'"),
			НСтр("ru='Весы с печатью этикеток не подключены.'"), 
			НСтр("ru='Весы с печатью этикеток не выбраны.'"), 
			Истина);
	Иначе
		НачатьВыгрузкуДанныеВВесыСПечатьюЭтикеток_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыгрузкуДанныеВВесыСПечатьюЭтикеток_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	Если ИдентификаторУстройства = Неопределено Тогда
		Если Параметры.СледующееОповещение <> Неопределено Тогда
			ТекстСообщения = НСтр("ru='Весы с печатью этикеток не выбраны.'");
			Результат = Новый Структура("Результат, ОписаниеОшибки, ИдентификаторУстройства", Ложь, ТекстСообщения, Неопределено);
			ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, Результат);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
#Если ВебКлиент Тогда
	ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыгрузкуДанныеВВесыСПечатьюЭтикеток_ФайловоеРасширениеЗавершение", ЭтотОбъект, Параметры);
	ПроверитьДоступностьРасширенияРаботыСФайлами(ОписаниеОповещения, Ложь);
#Иначе
	// В тонком и толстом клиентах расширение подключено всегда.
	НачатьВыгрузкуДанныеВВесыСПечатьюЭтикеток_ФайловоеРасширениеЗавершение(Истина, Параметры);
#КонецЕсли
	
КонецПроцедуры

Процедура НачатьВыгрузкуДанныеВВесыСПечатьюЭтикеток_ФайловоеРасширениеЗавершение(Подключено, Параметры) Экспорт
	
	Если Подключено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыгрузкуДанныеВВесыСПечатьюЭтикеток_ПодключениеЗавершение", ЭтотОбъект, Параметры);
		НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);
	Иначе
		ТекстСообщения = НСтр("ru='Данная операция не доступна без установленного расширения для веб-клиента ""1С:Предприятие"".'");
		Если Параметры.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Если Параметры.СледующееОповещение <> Неопределено Тогда
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстСообщения, Параметры.ИдентификаторУстройства);
			ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыгрузкуДанныеВВесыСПечатьюЭтикеток_ПодключениеЗавершение(РезультатПодключения, Параметры) Экспорт
	
	Если РезультатПодключения.Результат Тогда
		
		ВходныеПараметры  = Новый Массив;
		ВходныеПараметры.Добавить(Параметры.ТаблицаВыгрузкиТоваров);
		ВходныеПараметры.Добавить(Параметры.ЧастичнаяВыгрузка); // Частичная выгрузка.
		ВыходныеПараметры = Неопределено;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыгрузкуДанныеВВесыСПечатьюЭтикеток_ВыполнитьКомандуЗавершение", ЭтотОбъект, Параметры);
		НачатьВыполнениеКоманды(ОписаниеОповещения, Параметры.ИдентификаторУстройства, "ВыгрузитьТовары", ВходныеПараметры);
		
	Иначе
		ТекстСообщения = НСтр("ru='При подключении устройства произошла ошибка.
								  |%ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатПодключения.ОписаниеОшибки);
		
		Если Параметры.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
		Если Параметры.СледующееОповещение <> Неопределено Тогда
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстСообщения, Параметры.ИдентификаторУстройства);
			ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатОперации);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыгрузкуДанныеВВесыСПечатьюЭтикеток_ВыполнитьКомандуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ТекстСообщения = НСтр("ru='Ошибок нет.'");
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru='При выгрузке данных в оборудование произошла ошибка.
								  |%ОписаниеОшибки%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", РезультатВыполнения.ВыходныеПараметры[1]);
		Если Параметры.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
		
	Если Параметры.СледующееОповещение <> Неопределено Тогда
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(РезультатВыполнения.Результат, ТекстСообщения, Параметры.ИдентификаторУстройства);
		ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатОперации);
	КонецЕсли;
	
	НачатьОтключениеОборудованиеПоИдентификатору(, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);
	
КонецПроцедуры

// Начать очистку товаров в весах с печатью этикеток.
//
Процедура НачатьОчисткуТоваровВВесахСПечатьюЭтикеток(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства = Неопределено, ОтображатьСообщения = Ложь) Экспорт
	
	Контекст = Новый Структура;
	Контекст.Вставить("СледующееОповещение"     , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ОтображатьСообщения"     , ОтображатьСообщения);
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьОчисткуТоваровВВесахСПечатьюЭтикеток_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, "ВесыСПечатьюЭтикеток",
			НСтр("ru='Выберите весы с печатью этикеток'"), 
			НСтр("ru='Весы с печатью этикеток не подключены.'"),
			НСтр("ru='Весы с печатью этикеток не выбраны.'"), 
			Истина);
	Иначе
		НачатьОчисткуТоваровВВесахСПечатьюЭтикеток_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
		
КонецПроцедуры

Процедура НачатьОчисткуТоваровВВесахСПечатьюЭтикеток_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	Если ИдентификаторУстройства = Неопределено Тогда
		Если Параметры.СледующееОповещение <> Неопределено Тогда
			ОписаниеОшибки = НСтр("ru='Весы с печатью этикеток не выбраны.'");
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки, Неопределено);
			ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатОперации);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	ОписаниеОповещения = Новый ОписаниеОповещения("НачатьОчисткуТоваровВВесахСПечатьюЭтикеток_ПодключениеЗавершение", ЭтотОбъект, Параметры);
	НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, Параметры.УникальныйИдентификатор, ИдентификаторУстройства);
	
КонецПроцедуры

Процедура НачатьОчисткуТоваровВВесахСПечатьюЭтикеток_ПодключениеЗавершение(РезультатПодключения, Параметры) Экспорт
	
	ТекстСообщения = НСтр("ru='Ошибок нет.'");
	
	Если РезультатПодключения.Результат Тогда
		ВходныеПараметры  = Неопределено;
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьОчисткуТоваровВВесахСПечатьюЭтикеток_ВыполнитьКомандуЗавершение", ЭтотОбъект, Параметры);
		НачатьВыполнениеКоманды(ОписаниеОповещения, Параметры.ИдентификаторУстройства, "ОчиститьБазу", ВходныеПараметры);
	Иначе
		ОписаниеОшибки = НСтр("ru='При подключении устройства произошла ошибка. |%ОписаниеОшибки%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", РезультатПодключения.ОписаниеОшибки);
		
		Если Параметры.ОтображатьСообщения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	
		Если Параметры.СледующееОповещение <> Неопределено Тогда
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки, Параметры.ИдентификаторУстройства);
			ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатОперации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьОчисткуТоваровВВесахСПечатьюЭтикеток_ВыполнитьКомандуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ОписаниеОшибки = НСтр("ru='Ошибок нет.'");
	Иначе
		ОписаниеОшибки = НСтр("ru='При очистке данных в оборудование произошла ошибка. |%ОписаниеОшибки%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", РезультатВыполнения.ВыходныеПараметры[1]);
	КонецЕсли;
	
	Если Параметры.ОтображатьСообщения Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
	КонецЕсли;
	
	Если Параметры.СледующееОповещение <> Неопределено Тогда
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(РезультатВыполнения.Результат, ОписаниеОшибки, Параметры.ИдентификаторУстройства);
		ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, РезультатОперации);
	КонецЕсли;
	
	НачатьОтключениеОборудованиеПоИдентификатору(, Параметры.УникальныйИдентификатор, Параметры.ИдентификаторУстройства);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииРаботыСОборудованиемRFID

// Заполняет структуру параметров записи метки RFID.
// 
Функция ПараметрыЗаписиМеткиRFID() Экспорт; 
	
	Результат = Новый Структура();
	Результат.Вставить("TID"       , Неопределено);
	Результат.Вставить("EPC"       , Неопределено);
	Результат.Вставить("Данные"    , Неопределено);
	Результат.Вставить("БанкПамяти", "EPC");
	Возврат Результат;
	
КонецФункции

// Начать открытие сессии считывателя RFID.
//
Процедура НачатьОткрытиеСессииСчитывателяRFID(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства = Неопределено) Экспорт
	
	ПодключенныеУстройства = ПолучитьПодключенныеУстройства(глПодключаемоеОборудование.ПараметрыПодключенияПО, 
		ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.СчитывательRFID"), ИдентификаторУстройства);
	
	Если ПодключенныеУстройства.Количество() > 0 Тогда
		Для Каждого Устройство Из ПодключенныеУстройства Цикл
			Контекст = Новый Структура;
			Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
			Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
			Контекст.Вставить("ИдентификаторУстройства" , Устройство.Ссылка);
			Оповещение = Новый ОписаниеОповещения("НачатьОткрытиеСессииСчитывателяRFID_ВыполнитьКомандуЗавершение", ЭтотОбъект, Контекст);
			ВходныеПараметры  = Новый Массив();
			НачатьВыполнениеКоманды(Оповещение, Устройство.Ссылка, "OpenSessionRFID", ВходныеПараметры);
		КонецЦикла
	ИначеЕсли  ОповещениеПриЗавершении <> Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='Нет подключенных RFID считывателей.'");
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
		
КонецПроцедуры

Процедура НачатьОткрытиеСессииСчитывателяRFID_ВыполнитьКомандуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ОписаниеОшибки = "";
	Иначе
		ОписаниеОшибки = НСтр("ru='При работе со считывателем RFID произошла ошибка: %ДополнительноеОписание%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", РезультатВыполнения.ВыходныеПараметры[1]);
	КонецЕсли;
	
	Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(РезультатВыполнения.Результат, ОписаниеОшибки, Параметры.ИдентификаторУстройства);
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
КонецПроцедуры

// Начать закрытие сессии считывателя RFID.
//
Процедура НачатьЗакрытиеСессииСчитывателяRFID(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства = Неопределено) Экспорт
	
	ПодключенныеУстройства = ПолучитьПодключенныеУстройства(глПодключаемоеОборудование.ПараметрыПодключенияПО, 
		ПредопределенноеЗначение("Перечисление.ТипыПодключаемогоОборудования.СчитывательRFID"), ИдентификаторУстройства);
	
	Если ПодключенныеУстройства.Количество() > 0 Тогда
		Для Каждого Устройство Из ПодключенныеУстройства Цикл
			Контекст = Новый Структура;
			Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
			Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
			Контекст.Вставить("ИдентификаторУстройства" , Устройство.Ссылка);
			Оповещение = Новый ОписаниеОповещения("НачатьЗакрытиеСессииСчитывателяRFID_ВыполнитьКомандуЗавершение", ЭтотОбъект, Контекст);
			
			ВходныеПараметры  = Новый Массив();
			НачатьВыполнениеКоманды(Оповещение, Устройство.Ссылка, "CloseSessionRFID", ВходныеПараметры);
		КонецЦикла
	ИначеЕсли  ОповещениеПриЗавершении <> Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='Нет подключенных RFID считывателей.'");
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
		
КонецПроцедуры

Процедура НачатьЗакрытиеСессииСчитывателяRFID_ВыполнитьКомандуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ОписаниеОшибки = "";
	Иначе
		ОписаниеОшибки = НСтр("ru='При работе со считывателем RFID произошла ошибка: %ДополнительноеОписание%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ДополнительноеОписание%", РезультатВыполнения.ВыходныеПараметры[1]);
	КонецЕсли;
	
	Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(РезультатВыполнения.Результат, ОписаниеОшибки, Параметры.ИдентификаторУстройства);
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьЗаписьДанныхВМеткуRFID(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства, ПараметрыЗаписи, Таймаут = 0) Экспорт 
	
	Контекст = Новый Структура;
	Контекст.Вставить("ОповещениеПриЗавершении" , ОповещениеПриЗавершении);
	Контекст.Вставить("УникальныйИдентификатор" , УникальныйИдентификатор);
	Контекст.Вставить("ПараметрыЗаписи"         , ПараметрыЗаписи);
	Контекст.Вставить("Таймаут"                 , Таймаут);
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьЗаписьДанныхВМеткуRFID_ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		ПредложитьВыбратьУстройство(ОписаниеОповещения, "СчитывательRFID",
			НСтр("ru='Выберите RFID считыватель'"), НСтр("ru='Нет подключенных RFID считывателей.'"));
	Иначе
		НачатьЗаписьДанныхВМеткуRFID_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Контекст);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьЗаписьДанныхВМеткуRFID_ВыбратьУстройствоЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	Если ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОшибки = НСтр("ru='RFID считыватель  не подключен.'");
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании();
			РезультатОперации.Результат = Ложь;
			РезультатОперации.ОписаниеОшибки = ОписаниеОшибки;
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	
	ВходныеПараметры  = Новый Массив();
	ВходныеПараметры.Добавить(Параметры.ПараметрыЗаписи);
	ВходныеПараметры.Добавить(Параметры.Таймаут);
	
	Оповещение = Новый ОписаниеОповещения("НачатьЗаписьДанныхВМеткуRFID_ВыполнитьКомандуЗавершение", ЭтотОбъект, Параметры);
	НачатьВыполнениеКоманды(Оповещение, ИдентификаторУстройства, "SaveDataTagRFID", ВходныеПараметры);
	
КонецПроцедуры

Процедура НачатьЗаписьДанныхВМеткуRFID_ВыполнитьКомандуЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	ОписаниеОшибки = ""; 
	Если НЕ РезультатВыполнения.Результат Тогда
		ОписаниеОшибки = НСтр("ru='При работе со считывателем RFID произошла ошибка: %ОписаниеОшибки%'");
		ОписаниеОшибки = СтрЗаменить(ОписаниеОшибки, "%ОписаниеОшибки%", РезультатВыполнения.ВыходныеПараметры[1]);
	КонецЕсли;
	
	Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
		РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(РезультатВыполнения.Результат, ОписаниеОшибки, Параметры.ИдентификаторУстройства); 
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыРаботыСФайлами

// Процедура получения содержания текстовых файлов.
// Параметры:
//  ИменаФайлов  - Строка, Массив - имя файла или массив с именами файлов.
//  ОписаниеОповещенияПриЗавершении  - ОписаниеОповещения - вызывается после завершения чтения файлов.
//  Кодировка - КодировкаТекста - кодировка при чтении текстового файла, по умолчанию КодировкаТекста.UTF8.
//
Процедура ПолучитьСодержаниеТекстовыхФайлов(ИменаФайлов, ОписаниеОповещенияПриЗавершении, Кодировка = Неопределено) Экспорт
	
	Кодировка = МенеджерОборудованияВызовСервера.ПолучитьКодировкуФайла(Кодировка); //Массив из ОписаниеПередаваемогоФайла
	
	ПомещаемыеФайлы = Новый Массив; //Массив из ОписаниеПередаваемогоФайла
	
	Если ТипЗнч(ИменаФайлов) = Тип("Строка") Тогда
		ОписаниеФайла = Новый ОписаниеПередаваемогоФайла(ИменаФайлов);
		ПомещаемыеФайлы.Добавить(ОписаниеФайла);
	ИначеЕсли ТипЗнч(ИменаФайлов) = Тип("Массив") Тогда
		Если ИменаФайлов.Количество() = 0 Тогда
			РезультатЧтенияФайлов = Новый Структура;
			РезультатЧтенияФайлов.Вставить("СодержаниеФайлов", Новый Массив);
			РезультатЧтенияФайлов.Вставить("Успешно", Истина);
			РезультатЧтенияФайлов.Вставить("ТекстОшибки","");
		Иначе
			Для Каждого ИмяФайла Из ИменаФайлов Цикл
				ПомещаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ИмяФайла));
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	#Если ВебКлиент Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ОписаниеОповещенияПриЗавершении", ОписаниеОповещенияПриЗавершении);
		ДополнительныеПараметры.Вставить("Кодировка", Кодировка);
		
		ОповещениеНачатьПомещениеФайла = Новый ОписаниеОповещения("ПолучитьСодержаниеТекстовыхФайловЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		НачатьПомещениеФайлов(ОповещениеНачатьПомещениеФайла, ПомещаемыеФайлы,, Ложь);
		
	#Иначе
		
		СодержаниеФайлов = Новый Массив;
		РезультатЧтенияФайлов = Новый Структура;
		РезультатЧтенияФайлов.Вставить("СодержаниеФайлов", Неопределено);
		РезультатЧтенияФайлов.Вставить("Успешно", Ложь);
		РезультатЧтенияФайлов.Вставить("ТекстОшибки", "");
		
		Для Каждого Файл Из ПомещаемыеФайлы Цикл
			
			СтруктураСодержанияФайла = Новый Структура;
			
			Попытка
				ЧтениеТекста = Новый ЧтениеТекста(Файл.Имя, Кодировка);
				ТекстСодержания = ЧтениеТекста.Прочитать();
			Исключение
				
				ТекстСообщения =  НСтр("ru = 'При чтении файла %ИмяФайла% произошла ошибка'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИмяФайла%", Файл.Имя);
				
				РезультатЧтенияФайлов.ТекстОшибки = ТекстСообщения + Символы.ПС + ОписаниеОшибки();
				
			КонецПопытки;
			
			СтруктураСодержанияФайла.Вставить("ОписаниеПереданногоФайла", Файл);
			СтруктураСодержанияФайла.Вставить("ТекстСодержания",          ТекстСодержания);
			
			СодержаниеФайлов.Добавить(СтруктураСодержанияФайла);
			ЧтениеТекста.Закрыть();
			
		КонецЦикла;
		
		РезультатЧтенияФайлов.Успешно = Истина;
		РезультатЧтенияФайлов.СодержаниеФайлов = СодержаниеФайлов;
		ВыполнитьОбработкуОповещения(ОписаниеОповещенияПриЗавершении, РезультатЧтенияФайлов);
		
	#КонецЕсли
	
КонецПроцедуры

// Процедура оповещения получения содержания текстовых файлов.
// Вызывается из процедуры ПолучитьСодержаниеТекстовыхФайлов.
//
Процедура ПолучитьСодержаниеТекстовыхФайловЗавершение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт
	
	РезультатЧтенияФайлов = Новый Структура;
	РезультатЧтенияФайлов.Вставить("СодержаниеФайлов", Неопределено);
	РезультатЧтенияФайлов.Вставить("Успешно", Ложь);
	РезультатЧтенияФайлов.Вставить("ТекстОшибки", "");
	
	Если ПомещенныеФайлы = Неопределено Тогда
		РезультатЧтенияФайлов.ТекстОшибки = НСтр("ru = 'Неизвестная ошибка при передаче файлов на сервер.'");
	Иначе
		Если Не ПомещенныеФайлы.Количество() = 0 Тогда
			РезультатИзвлеченияТекста = МенеджерОборудованияВызовСервера.ПолучитьСодержаниеТекстовыхФайловИзХранилища(
				ПомещенныеФайлы, ДополнительныеПараметры.Кодировка);
			ЗаполнитьЗначенияСвойств(РезультатЧтенияФайлов, РезультатИзвлеченияТекста);
		КонецЕсли;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияПриЗавершении, РезультатЧтенияФайлов);
	
КонецПроцедуры

Процедура ПредложитьВыбратьСмену(ОповещениеВыбора, ТекстЗаголовкаВыбора,
	СообщениеНеПодключен = "", СообщениеНеВыбран = "", БезСообщений = Ложь, ТекстСообщения = "") Экспорт
	
	Если Не ОбновитьРабочееМестоКлиента() Тогда
		ТекстСообщения = НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");
		Если Не БезСообщений Тогда
		      ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СтруктураПараметрыОтбора = Новый Структура();
	СтруктураПараметрыОтбора.Вставить("Статус", ПредопределенноеЗначение("Перечисление.СтатусыКассовойСмены.Открыта"));
	
	СтруктураРезультата = Новый Структура();
	СтруктураРезультата.Вставить("КассоваяСмена", "Ссылка");
	СтруктураРезультата.Вставить("ИдентификаторУстройства", "ФискальноеУстройство");
	
	Контекст = Новый Структура;
	Контекст.Вставить("СледующееОповещение" , ОповещениеВыбора);
	Контекст.Вставить("СообщениеНеВыбран"   , ?(ПустаяСтрока(СообщениеНеВыбран), СообщениеНеПодключен, СообщениеНеВыбран));
	Контекст.Вставить("БезСообщений"        , БезСообщений);
	Контекст.Вставить("ТекстЗаголовкаВыбора", ТекстЗаголовкаВыбора);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("БезСообщений"        , БезСообщений);
	ПараметрыОткрытия.Вставить("ТекстЗаголовкаВыбора", ТекстЗаголовкаВыбора);
	ПараметрыОткрытия.Вставить("СтруктураПараметрыОтбора", СтруктураПараметрыОтбора);
	ПараметрыОткрытия.Вставить("СтруктураРезультата", СтруктураРезультата);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПредложитьВыбратьСменуЗавершение", ЭтотОбъект, Контекст);
	ИмяФормы = "Документ.КассоваяСмена.ФормаВыбора";
	ОткрытьФорму(ИмяФормы, ПараметрыОткрытия,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ПредложитьВыбратьСменуЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено И НЕ Параметры.БезСообщений И Не ПустаяСтрока(Параметры.СообщениеНеВыбран) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Параметры.СообщениеНеВыбран);
	КонецЕсли;
	
	Если Параметры.СледующееОповещение <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(Параметры.СледующееОповещение, Результат);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьВыполнениеКоманды_ВыбратьСменуЗавершение(СтруктураПараметровСмены, Параметры) Экспорт
	
	Если СтруктураПараметровСмены = Неопределено Тогда
		Если Параметры.ОповещениеПриЗавершении <> Неопределено Тогда
			ОписаниеОшибки = НСтр("ru='Кассовая смена не выбрана'");
			РезультатОперации = ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
	Иначе
		Параметры.Вставить("КассоваяСмена", СтруктураПараметровСмены.КассоваяСмена);
		Параметры.Вставить("ИдентификаторУстройства", СтруктураПараметровСмены.ИдентификаторУстройства);
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПодключениеЗавершение", ЭтотОбъект, Параметры);
		НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, Параметры.УникальныйИдентификатор, СтруктураПараметровСмены.ИдентификаторУстройства);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

// Преобразовать данные со сканера в массив.
// 
// Параметры:
//  Параметр - Структура:
//   * Штрихкод - Строка - штрихкод.
//   * Количество - Число - количество.
// 
// Возвращаемое значение:
//  Массив из Структура.
//
Функция ПреобразоватьДанныеСоСканераВМассив(Параметр) Экспорт
	
	МенеджерОборудованияКлиентПереопределяемый.ОбработатьСобытие(); // АПК:222 - Для обратной совместимости
	
	Данные = Новый Массив;
	Данные.Добавить(ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
	
	Возврат Данные;
	
КонецФункции

// Преобразовать данные со сканера в структуру.
// 
// Параметры:
//  Параметр - Структура - Параметр:
//   * Штрихкод - Строка - штрихкод.
//   * Количество - Число - количество.
// 
// Возвращаемое значение:
//  Структура - Преобразовать данные со сканера в структуру:
//   * Штрихкод - Строка - штрихкод со сканера.
//   * Количество - Число - количество товаров.
//
Функция ПреобразоватьДанныеСоСканераВСтруктуру(Параметр) Экспорт
	
	МенеджерОборудованияКлиентПереопределяемый.ОбработатьСобытие(); // АПК:222 - Для обратной совместимости
	
	Если Параметр[1] = Неопределено Тогда
		Данные = Новый Структура("Штрихкод, Количество", Параметр[0], 1);    // Достаем штрихкод из основных данных
	Иначе
		Данные = Новый Структура("Штрихкод, Количество", Параметр[1][1], 1); // Достаем штрихкод из дополнительных данных
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

#Область Системные

// Производит получение события от устройства.
// 
// Параметры:
//  ОписаниеСобытия - Структура:
//   * Источник - Строка - Источник внешнего события.
//   * Событие - Строка - Наименование события.
//   * Данные - Строка - Данные для события.
//  ОписаниеОшибки - Строка - описание ошибки
//
// Возвращаемое значение:
//  Структура.
//  Неопределено.
//
Функция ПолучитьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки = "") Экспорт
	
	Результат = Неопределено;
	
	// Поиск обработчика события
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	Для Каждого Подключение Из ПодключаемоеОборудование.ПараметрыПодключенияПО Цикл
		Если Подключение.ИДУстройства = ОписаниеСобытия.Источник
		 Или (ПустаяСтрока(Подключение.ИДУстройства) И Подключение.ИменаСобытий.Количество() > 0) Тогда
			// Ищем среди подключенного оборудования устройство с полученным событием.
			Событие = Подключение.ИменаСобытий.Найти(ОписаниеСобытия.Событие);
			Если Событие <> Неопределено Тогда
				ОбъектДрайвера = Подключение.ОбъектДрайвера;
				// Обрабатываем сообщение
				РезультатОбработки = Подключение.ОбработчикДрайвера.ОбработатьСобытие(ОбъектДрайвера, Подключение, ОписаниеСобытия.Событие, ОписаниеСобытия.Данные);
				// Оповещаем 
				Если РезультатОбработки.Результат Тогда 
					Результат = Новый Структура();
					Результат.Вставить("ИмяСобытия", РезультатОбработки.Событие);
					Результат.Вставить("Параметр",   РезультатОбработки.Данные);
					Результат.Вставить("Источник",   "ПодключаемоеОборудование");
					Возврат Результат;
				Иначе
					ОписаниеОшибки = ОписаниеСобытия.Событие;
					Возврат Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Параметры подключения драйвера.
// 
// Параметры:
//  ДанныеДрайвера - Структура - Данные драйвера.
// 
// Возвращаемое значение:
//  Структура - Параметры подключения:
//   *Наименование - Строка.
//   *ТипОборудования - ПеречислениеСсылка.ТипыПодключаемогоОборудования.
//   *ПодключениеИзМакета - Булево.
//   *ПодключениеЛокальноПоИдентификатору - Булево. 
//   *ИдентификаторОбъекта - СправочникСсылка.ПодключаемоеОборудование.
//   *ВерсияДрайвера - Строка.
//   *ИмяМакетаДрайвера - Строка.
//   *РевизияИнтерфейса - Строка.
//   *ШиринаСтроки - Строка.
//   *ПечатьКвитанцийНаТерминале - Булево. 
//   *КороткиеСлипЧеки - Булево.
//   *ВыдачиНаличныхДенежныхСредств - Булево. 
//   *ОплатаЭлектроннымиСертификатами - Булево.
//   *СтолбцовНаДисплее - Число.
//   *СтрокНаДисплее - Число. 
//   *ДисплейОтображаетТекст - Булево.
//   *ДисплейОтображаетГрафику - Булево.
//   *ДисплейОтображаетQRКод - Булево.  
//   *ДисплейОтображаетHTML - Булево.
//   *ДисплейОтображаетСтатус - Булево.
//   *ИдентификаторУстройства - УникальныйИдентификатор.
//   *ОбъектДрайвера - Неопределено -
//   *Параметры - Неопределено -
//   *ОбработчикДрайвера - Неопределено -
//
Функция ПараметрыПодключенияДрайвера(ДанныеДрайвера) Экспорт
	
	Подключение = МенеджерОборудованияКлиентСервер.ПараметрыПодключения(ДанныеДрайвера);
	Подключение.Вставить("ОбъектДрайвера"    , Неопределено);
	Подключение.Вставить("Параметры"         , Неопределено);   
	Подключение.Вставить("ОбработчикДрайвера", ПодключаемоеОборудованиеДрайверКлиент);
	Возврат Подключение;
	
КонецФункции

// Параметры подключения устройства.
// 
// Параметры:
//  ДанныеУстройства - Неопределено, Произвольный, Структура - Данные устройства
// 
// Возвращаемое значение:
//  Структура - Параметры подключения:
//   * Наименование - Строка.
//   * ТипОборудования - ПеречислениеСсылка.ТипыПодключаемогоОборудования.
//   * ПодключениеИзМакета - Булево.
//   * ПодключениеЛокальноПоИдентификатору - Булево. 
//   * ИдентификаторОбъекта - СправочникСсылка.ПодключаемоеОборудование.
//   * ВерсияДрайвера - Строка.
//   * ИмяМакетаДрайвера - Строка.
//   * РевизияИнтерфейса - Строка.
//   * ШиринаСтроки - Строка.
//   * ПечатьКвитанцийНаТерминале - Булево. 
//   * КороткиеСлипЧеки - Булево.
//   * ВыдачиНаличныхДенежныхСредств - Булево.
//   * ОплатаЭлектроннымиСертификатами - Булево. 
//   * ЧастичнаяОтмена - Булево. 
//   * СписокОперацийПоКартам - Булево.
//   * ConsumerPresentedQR - Булево.   
//   * ПокупкаСЗачислениемНаКарту - Булево.  
//   * СтолбцовНаДисплее - Число.
//   * СтрокНаДисплее - Число. 
//   * ДисплейОтображаетТекст - Булево.
//   * ДисплейОтображаетГрафику - Булево.
//   * ДисплейОтображаетQRКод - Булево.
//   * ИдентификаторУстройства - УникальныйИдентификатор.
//   * ОбъектДрайвера - Неопределено -
//   * Параметры - Неопределено -
//   * ОбработчикДрайвера - Неопределено -
//   * Клиенты - Массив из СправочникСсылка.РабочиеМеста -
//   * Ссылка - СправочникСсылка.ПодключаемоеОборудование.
//   * СетевоеОборудование - Булево. 
//   * КоличествоПодключенных - Число -
//   * ИменаСобытий - Массив Из Строка -
//   * ИДУстройства - Строка.
//
Функция ПараметрыПодключенияУстройства(ДанныеУстройства) Экспорт
	
	Подключение = ПараметрыПодключенияДрайвера(ДанныеУстройства);
	Подключение.Вставить("Клиенты", Новый Массив());
	Подключение.Вставить("Ссылка"                  , ДанныеУстройства.Ссылка);
	Подключение.Вставить("Параметры"               , ДанныеУстройства.Параметры);
	Подключение.Вставить("ПараметрыXML"            , ДанныеУстройства.ПараметрыXML);    
	Подключение.Вставить("ПараметрыПриложенияXML"  , ДанныеУстройства.ПараметрыПриложенияXML);    
	Подключение.Вставить("СетевоеОборудование"     , ДанныеУстройства.СетевоеОборудование);
	Подключение.Вставить("КоличествоПодключенных"  , 0);
	Подключение.Вставить("ИменаСобытий"            , Новый Массив());
	Подключение.Вставить("ИДУстройства"            , "");
	Возврат Подключение;
	
КонецФункции

// Событие устройств ввода новый формат.
// 
// Возвращаемое значение:
//  Булево - Событие устройств ввода новый формат
//
Функция СобытиеУстройствВводаНовыйФормат() Экспорт
	
	СтандартнаяОбработка = Истина;
	НовыйФормат = Ложь;
	МенеджерОборудованияКлиентПереопределяемый.СобытиеУстройствВводаНовыйФормат(НовыйФормат, СтандартнаяОбработка);
	Результат = ?(Не СтандартнаяОбработка, НовыйФормат, Ложь); 
	
	Возврат Результат;
	
КонецФункции

// Возвращает необходимость печати слип чека алкогольной продукции. 
// 
// Возвращаемое значение:
//  Булево.
//
Функция ПечатьСлипЧекаАлкогольнойПродукции() Экспорт
	
	Результат = Ложь;
	ПечатьСлипЧека = Результат; 
	СтандартнаяОбработка = Истина;
	МенеджерОборудованияКлиентПереопределяемый.ПечатьСлипЧекаАлкогольнойПродукции(ПечатьСлипЧека, СтандартнаяОбработка);
	Результат = ?(СтандартнаяОбработка, Результат, ПечатьСлипЧека);
	Возврат Результат; 
	
КонецФункции                               

// Возвращает необходимость печати слип чека эквайринговой операции. 
// 
// Возвращаемое значение:
//  Булево.
//
Функция ПечатьСлипЧекаЭквайринговойОперации() Экспорт
	
	ПечатьСлипЧека = Истина;      
	ПолныйСлипЧек  = Истина; 
	СтандартнаяОбработка = Истина;
	МенеджерОборудованияКлиентПереопределяемый.ПечатьСлипЧекаЭквайринговойОперации(ПечатьСлипЧека, ПолныйСлипЧек, СтандартнаяОбработка);
	
	Результат = Новый Структура();
	Результат.Вставить("ПечатьСлипЧека", ?(СтандартнаяОбработка, Истина, ПечатьСлипЧека)); 
	Результат.Вставить("ПолныйСлипЧек" , ?(СтандартнаяОбработка, Истина, ПолныйСлипЧек));
	
	Возврат Результат; 
	
КонецФункции 

// Возвращает необходимость вывода QR-кода чека на дисплей покупателя после фискализации. 
// 
// Возвращаемое значение:
//  Булево.
//
Функция ВыводQRКодаЧекаНаДисплейПокупателяПослеФискализации() Экспорт
	
	Результат = Истина;
	ВыводQRКодаЧека = Результат; 
	СтандартнаяОбработка = Истина;
	МенеджерОборудованияКлиентПереопределяемый.ВыводQRКодаЧекаНаДисплейПокупателяПослеФискализации(ВыводQRКодаЧека, СтандартнаяОбработка);
	Результат = ?(СтандартнаяОбработка, Результат, ВыводQRКодаЧека);
	Возврат Результат; 
	
КонецФункции

// Возвращает глобальные переменные подключаемого оборудования
//
// Возвращаемое значение:
//  Структура:
//   * ПараметрыПодключенияПО - Массив из Структура
//   * ДрайверыОборудования - Соответствие из КлючИЗначение
//   * ПоследнийСлипЧек - Строка
//   * ЗавершениеРаботыСистемы - Булево
//   * ДанныеОчереди - Неопределено
//   * ФискальныеУстройства - Массив из Структура
//   * ПроверкиКодаМаркировки - Массив из Структура
//   * РабочееМесто - СправочникСсылка.РабочиеМеста
//   * MACАдрес - Строка
//   * ДлительныеОперации - Соответствие из КлючИЗначение
//   * ПромежуточныйРезультат - Соответствие из КлючИЗначение
//
Функция ПодключаемоеОборудование() Экспорт
	
	Если ПараметрыПриложения = Неопределено Тогда
		ПараметрыПриложения = Новый Соответствие();
	КонецЕсли;
	
	ПодключаемоеОборудование = ПараметрыПриложения.Получить("БПО.ПодключаемоеОборудование");
	
	Если ПодключаемоеОборудование = Неопределено Тогда
		ПодключаемоеОборудование = Новый Структура();
		ПодключаемоеОборудование.Вставить("ПараметрыПодключенияПО" , Новый Массив());
		ПодключаемоеОборудование.Вставить("ДрайверыОборудования"   , Новый Соответствие());
		ПодключаемоеОборудование.Вставить("ПоследнийСлипЧек"       , "");
		ПодключаемоеОборудование.Вставить("ЗавершениеРаботыСистемы", Ложь);
		ПодключаемоеОборудование.Вставить("ДанныеОчереди"          , Неопределено);
		ПодключаемоеОборудование.Вставить("ФискальныеУстройства"   , Новый Массив());
		ПодключаемоеОборудование.Вставить("ПроверкиКодаМаркировки" , Новый Массив());
		ПодключаемоеОборудование.Вставить("РабочееМесто"           , Неопределено);
		ПодключаемоеОборудование.Вставить("MACАдрес"               , "");
		ПодключаемоеОборудование.Вставить("ДлительныеОперации"     , Новый Соответствие());
		ПодключаемоеОборудование.Вставить("ПромежуточныйРезультат" , Новый Соответствие());
		ПараметрыПриложения.Вставить("БПО.ПодключаемоеОборудование", ПодключаемоеОборудование);
	КонецЕсли;
	
	Возврат ПодключаемоеОборудование;
	
КонецФункции

// Получить описание драйвера.
//
// Параметры:
//  СтрокаXML - Строка.
//
// Возвращаемое значение:
//  см. МенеджерОборудованияКлиентСервер.ПараметрыОписанияДрайвера
//
Функция ПолучитьОписаниеДрайвера(СтрокаXML) Экспорт
	
	ПараметрыXML = ОбщегоНазначенияБПОКлиент.ПрочитатьКорневойЭлементXML(СтрокаXML);      
	
	Параметры = МенеджерОборудованияКлиентСервер.ПараметрыОписанияДрайвера();
	Параметры.НаименованиеДрайвера = ?(ПараметрыXML.Свойство("Name"), ПараметрыXML.Name, "");
	Параметры.ОписаниеДрайвера     = ?(ПараметрыXML.Свойство("Description"), ПараметрыXML.Description, "");
	Параметры.ТипОборудования      = ?(ПараметрыXML.Свойство("EquipmentType"), ПараметрыXML.EquipmentType, "");
	Параметры.ВерсияДрайвера       = ?(ПараметрыXML.Свойство("DriverVersion"), ПараметрыXML.DriverVersion, ""); 
	Параметры.ВерсияИнтеграционногоКомпонента = ?(ПараметрыXML.Свойство("IntegrationComponentVersion"), ПараметрыXML.IntegrationComponentVersion, "");    
	Параметры.URLЗагрузкиДрайвера   = ?(ПараметрыXML.Свойство("DownloadURL"), ПараметрыXML.DownloadURL, "");
	Параметры.ЛогДрайвераПутьКФайлу = ?(ПараметрыXML.Свойство("LogPath"), ПараметрыXML.LogPath, "");
	Параметры.ИнтеграционныйКомпонент   = ПараметрыXML.Свойство("IntegrationComponent") И ВРег(ПараметрыXML.IntegrationComponent) = "TRUE"; 
	Параметры.ОсновнойДрайверУстановлен = ПараметрыXML.Свойство("MainDriverInstalled") И ВРег(ПараметрыXML.MainDriverInstalled) = "TRUE"; 
	Параметры.ЛогДрайвераВключен        = ПараметрыXML.Свойство("LogIsEnabled") И ВРег(ПараметрыXML.LogIsEnabled) = "TRUE"; 
	Параметры.ПоддерживаетсяЛокализация = ПараметрыXML.Свойство("LocalizationSupported") И ВРег(ПараметрыXML.LocalizationSupported) = "TRUE"; 
	Параметры.ЭтоЭмулятор               = ПараметрыXML.Свойство("IsEmulator") И ВРег(ПараметрыXML.IsEmulator) = "TRUE"; 
	Параметры.ИнформацияОбОкружении     = ?(ПараметрыXML.Свойство("EnvironmentInformation"), ПараметрыXML.EnvironmentInformation, ""); 
	Параметры.АвтоНастройкаОборудования = ПараметрыXML.Свойство("AutoSetup") И ВРег(ПараметрыXML.AutoSetup) = "TRUE";
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#Область РабочееМесто         

// Возвращает текущее рабочее место на клиенте.
//
// Параметры:
//  ЗапрашиватьНаСервере - Булево - если Истина, то в случае когда рабочее место отсутствует на клиенте, 
//                         будет выполнен запрос на сервер.
//
// Возвращаемое значение:
//  СправочникСсылка.РабочиеМеста
//
Функция РабочееМестоКлиента(ЗапрашиватьНаСервере = Истина) Экспорт
	
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	РабочееМесто = ПодключаемоеОборудование.РабочееМесто;
	Если ЗапрашиватьНаСервере И Не ЗначениеЗаполнено(РабочееМесто) Тогда
		РабочееМесто = МенеджерОборудованияВызовСервера.РабочееМестоКлиента();
		ПодключаемоеОборудование.РабочееМесто = РабочееМесто;
	КонецЕсли;
	
	Возврат РабочееМесто;
	
КонецФункции

// Возвращает массив содержащий рабочие места по найденным параметрам.
//
// Параметры:
//  ИдентификаторКлиента - Строка - идентификатор клиента для рабочего места       
//  ИмяКомпьютера - Строка - Имя компьютера   
//  MACАдрес - Строка - 
//
// Возвращаемое значение:
//  Массив.
Функция НайтиРабочиеМестаПоИдентификатору(ИдентификаторКлиента, ИмяКомпьютера, MACАдрес = "") Экспорт
	
	Возврат МенеджерОборудованияКлиентПовтИсп.НайтиРабочиеМестаПоИдентификатору(ИдентификаторКлиента, ИмяКомпьютера, MACАдрес);
	
КонецФункции

// Идентификатор клиента для рабочего места.
// 
// Возвращаемое значение:
//  Строка - Идентификатор клиента для рабочего места
Функция ИдентификаторКлиентаДляРабочегоМеста() Экспорт
	
	Возврат МенеджерОборудованияКлиентСервер.ИдентификаторКлиентаДляРабочегоМеста();
	
КонецФункции

#КонецОбласти            

#Область ОбщиеМетодыДрайвера

// Функция возвращает структуру с данными драйвера.
//
// Параметры:
//  ИдентификаторДрайвера - СправочникСсылка.ДрайверыОборудования - идентификатор драйвера.
//
// Возвращаемое значение:
//  Структура:
//   * Наименование - Строка
Функция ДанныеДрайвераОборудования(ИдентификаторДрайвера) Экспорт
	
	Возврат МенеджерОборудованияКлиентПовтИсп.ДанныеДрайвераОборудования(ИдентификаторДрайвера);
	
КонецФункции

// Поиск по идентификатору подключенного ранее устройства. 
//
// Параметры:
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - экземпляр подключаемого оборудования.
//
// Возвращаемое значение:
//  СправочникСсылка.ПодключаемоеОборудование
//
Функция ПолучитьПодключенноеУстройство(ИдентификаторУстройства,СписокПодключений = Неопределено) Экспорт
	
	ПодключаемоеОборудование = ПодключаемоеОборудование(); 
	Если СписокПодключений = Неопределено Тогда
	СписокПодключений = ПодключаемоеОборудование.ПараметрыПодключенияПО;
	КонецЕсли;
	//ПодключенноеУстройство = Неопределено;  
	//
	//Для Каждого Подключение Из СписокПодключений Цикл
	//		Если Подключение.Ссылка = ИдентификаторУстройства Тогда
	//			ПодключенноеУстройство = Подключение;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
		
	Если СписокПодключений <> Неопределено Тогда 
		Если ТипЗнч(СписокПодключений)	= Тип("СправочникСсылка.ПодключаемоеОборудование") Тогда
			ПодключенноеУстройство = СписокПодключений
		Иначе	
		Для Каждого Подключение Из СписокПодключений Цикл
			Если Подключение.Ссылка = ИдентификаторУстройства Тогда
				ПодключенноеУстройство = Подключение;
				Прервать;
			КонецЕсли;
		КонецЦикла; 
		КонецЕсли;
	КонецЕсли; 
	
	Возврат ПодключенноеУстройство;
	
КонецФункции

// Возвращает соответствие содержащее типы оборудования,
// ключем является строка на русском и английском языках, а значением ссылка на перечисление
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение
Функция СоответствиеТиповОборудования() Экспорт
	
	ИмяПараметра = "БПО.СоответствиеТиповОборудования";
	Возврат ОбщегоНазначенияБПОКлиент.ПараметрПриложения(ИмяПараметра);
	
КонецФункции

// Формирования массива типов оборудования
// 
// Параметры:
//   ТипыПО - Массив из Строка, Строка - тип оборудования.
// Возвращаемое значение:
//   Массив из ПеречислениеСсылка.ТипыПодключаемогоОборудования -  
//           
Функция ПолучитьТипыОборудования(ТипыПО) Экспорт
	
	Соответствие = СоответствиеТиповОборудования();
	МассивТипов = Новый Массив();
	Если ТипЗнч(ТипыПО) = Тип("Строка") Тогда    
		ТипыВМассиве = СтрРазделить(ТипыПО, ",", Ложь);
		Для Каждого ТипОборудования Из ТипыВМассиве Цикл
			МассивТипов.Добавить(Соответствие.Получить(СокрЛП(ТипОборудования)));
		КонецЦикла;
	ИначеЕсли ТипЗнч(ТипыПО) = Тип("Массив") Тогда
		Для Каждого ТипОборудования Из ТипыПО Цикл   
			Если ТипЗнч(ТипОборудования) = Тип("Строка") Тогда 
				МассивТипов.Добавить(Соответствие.Получить(СокрЛП(ТипОборудования)));   
			ИначеЕсли ТипЗнч(ТипОборудования) = Тип("ПеречислениеСсылка.ТипыПодключаемогоОборудования") Тогда 
				МассивТипов.Добавить(ТипОборудования);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ТипыПО) = Тип("Структура") Тогда
		Для Каждого КлючИЗначение Из ТипыПО Цикл
			Если КлючИЗначение.Значение Тогда
				МассивТипов.Добавить(Соответствие.Получить(КлючИЗначение.Ключ));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;     
	
	Возврат МассивТипов; 
	
КонецФункции

// Поиск по типу подключенные ранее устройства.
//
// Параметры:
//  ТипыПодключаемогоОборудования - Структура, Массив из Строка, Строка - тип оборудования.
//
// Возвращаемое значение:
//  Массив из СправочникСсылка.ПодключаемоеОборудование
//
Функция ПолучитьПодключенныеУстройства(СписокПодключений= Неопределено, ТипыПодключаемогоОборудования, Идентификатор = Неопределено) Экспорт
	
	ПодключенныеУстройства = Новый Массив();
	
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	СписокПодключений = ПодключаемоеОборудование.ПараметрыПодключенияПО;
	
	Если СписокПодключений = Неопределено Тогда
		Возврат ПодключенныеУстройства;
	КонецЕсли;
		
	Если ТипЗнч(ТипыПодключаемогоОборудования) = Тип("Структура") Тогда  
		Для Каждого Подключение Из СписокПодключений Цикл
			Для Каждого КлючИЗначение Из ТипыПодключаемогоОборудования Цикл   
				// Находим устройство по одному подходящему типу.
				Если КлючИЗначение.Значение Тогда     
					ЗначениеКлюча = Ложь;
					Если Подключение.ТипыОборудования.Свойство(КлючИЗначение.Ключ, ЗначениеКлюча) И ЗначениеКлюча Тогда
						ПодключенныеУстройства.Добавить(Подключение);
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла; 
		КонецЦикла;
	Иначе
		ТипыОборудования = ПолучитьТипыОборудования(ТипыПодключаемогоОборудования);
		Для Каждого Подключение Из СписокПодключений Цикл
			Если ТипыОборудования.Найти(Подключение.ТипОборудования) <> Неопределено Тогда 
				ПодключенныеУстройства.Добавить(Подключение);
			КонецЕсли; 
		КонецЦикла;    
	КонецЕсли;
	
	Возврат ПодключенныеУстройства;
	
КонецФункции

// Поиск по типу подключенные ранее устройства.
//
// Параметры:
//  ИдентификаторОбъекта - СправочникСсылка.ПодключаемоеОборудование - экземпляр подключаемого оборудования.
//
// Возвращаемое значение:
//  Массив.
//
Функция ПодключенныеУстройстваПоИдентификаторуОбъекта(ИдентификаторОбъекта) Экспорт
	
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	СписокПодключений = ПодключаемоеОборудование.ПараметрыПодключенияПО;
	
	ПодключенныеУстройства = Новый Массив();
	Для Каждого Подключение Из СписокПодключений Цикл
		Если Подключение.ИдентификаторОбъекта = ИдентификаторОбъекта Тогда
			ПодключенныеУстройства.Добавить(Подключение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ПодключенныеУстройства;
	
КонецФункции

// Получает описание драйвера.
//
// Параметры:
//  ОповещениеПриЗавершении - ОписаниеОповещения - событие описания оповещения.
//  ИдентификаторДрайвера - СправочникСсылка.ДрайверыОборудования - идентификатор драйвера.
//  ДанныеДрайвера - см. МенеджерОборудованияВызовСервера.ДанныеДрайвераОборудования
//
Процедура НачатьПолучениеОписанияДрайвера(ОповещениеПриЗавершении, ИдентификаторДрайвера = Неопределено, ДанныеДрайвера = Неопределено) Экспорт
	
	Если ИдентификаторДрайвера <> Неопределено Тогда
		ДанныеДрайвера = МенеджерОборудованияВызовСервера.ДанныеДрайвераОборудования(ИдентификаторДрайвера);
	КонецЕсли;
	
	НовоеПодключение = ПараметрыПодключенияДрайвера(ДанныеДрайвера);
	
	ОбработчикДрайвера = НовоеПодключение.ОбработчикДрайвера;
	ОбработчикДрайвера.НачатьПолучениеОписанияДрайвера(ОповещениеПриЗавершении, НовоеПодключение); 
	
КонецПроцедуры

// Получает описание оборудования.
//
// Параметры:
//  ОповещениеПриЗавершении - ОписаниеОповещения - событие описания оповещения.
//  ИдентификаторОборудования - СправочникСсылка.ПодключаемоеОборудование - идентификатор драйвера.
//  ДанныеОборудования - см. МенеджерОборудованияВызовСервера.ДанныеУстройства  
//
Процедура НачатьПолучениеОписанияОборудования(ОповещениеПриЗавершении, ИдентификаторОборудования = Неопределено, ДанныеОборудования = Неопределено) Экспорт

	
	Если ИдентификаторОборудования <> Неопределено Тогда
		ДанныеОборудования = МенеджерОборудованияВызовСервера.ДанныеУстройства(ИдентификаторОборудования);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДанныеОборудования) Тогда
		ОписаниеОшибки = НСтр("ru = 'Не удалось получить описание оборудования, возможно устройство отмечено не используемым.'");
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки, ИдентификаторОборудования);
		Если ОповещениеПриЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	НовоеПодключение = ПараметрыПодключенияУстройства(ДанныеОборудования);
	Если Не ПустаяСтрока(ДанныеОборудования.ИдентификаторОбъекта) Тогда
		СписокПодключений = ПодключенныеУстройстваПоИдентификаторуОбъекта(ДанныеОборудования.ИдентификаторОбъекта);
		НовоеПодключение.КоличествоПодключенных = СписокПодключений.Количество();
	КонецЕсли;
	
	ОбработчикДрайвера = НовоеПодключение.ОбработчикДрайвера;     
	ОбработчикДрайвера.НачатьПолучениеОписанияДрайвера(ОповещениеПриЗавершении, НовоеПодключение);
	
КонецПроцедуры

// Начать выполнение дополнительной команды к драйверу, не требующую предварительного подключения устройства в системе.
//
// Параметры:
//  ОповещениеПриЗавершении - ОписаниеОповещения - событие описания оповещения.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор драйвера.
//  ПараметрыУстройства - Структура - параметры устройства.
//
Процедура НачатьТестУстройства(ОповещениеПриЗавершении, ИдентификаторУстройства, ПараметрыУстройства = Неопределено) Экспорт
	
	// Поиск подключенного устройства.
	ПодключенноеУстройство = ПолучитьПодключенноеУстройство(ИдентификаторУстройства);
	Если ПодключенноеУстройство = Неопределено Тогда
		ДанныеОборудования = МенеджерОборудованияВызовСервера.ДанныеУстройства(ИдентификаторУстройства, Неопределено, ПараметрыУстройства);
		
		НовоеПодключение = ПараметрыПодключенияУстройства(ДанныеОборудования);
		ОбработчикДрайвера = НовоеПодключение.ОбработчикДрайвера;    
		ОбработчикДрайвера.НачатьТестУстройства(ОповещениеПриЗавершении, НовоеПодключение, Неопределено);
	Иначе
		// Сообщить об ошибке, что устройство подключено.
		ОписаниеОшибки = НСтр("ru='Устройство подключено, операция не может быть выполнена. Для отключения устройства требуется закрыть все формы приложения для текущей информационной базы.'");
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры    

// Начать выполнение дополнительной команды к драйверу, не требующую предварительного подключения устройства в системе.
//
// Параметры:
//  ОповещениеПриЗавершении - ОписаниеОповещения - событие описания оповещения.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - идентификатор драйвера.
//  ПараметрыУстройства - Структура - параметры устройства.
//
Процедура НачатьАвтонастройкуУстройства(ОповещениеПриЗавершении, ИдентификаторУстройства, ПараметрыУстройства = Неопределено) Экспорт
	
	// Поиск подключенного устройства.
	ПодключенноеУстройство = ПолучитьПодключенноеУстройство(ИдентификаторУстройства);
	Если ПодключенноеУстройство = Неопределено Тогда
		ДанныеОборудования = МенеджерОборудованияВызовСервера.ДанныеУстройства(ИдентификаторУстройства, Неопределено, ПараметрыУстройства);
		
		НовоеПодключение = МенеджерОборудованияКлиент.ПараметрыПодключенияУстройства(ДанныеОборудования);
		ОбработчикДрайвера = НовоеПодключение.ОбработчикДрайвера;    
		ОбработчикДрайвера.НачатьАвтонастройкуУстройства(ОповещениеПриЗавершении, НовоеПодключение, Неопределено);
	Иначе
		// Сообщить об ошибке, что устройство подключено.
		ОписаниеОшибки = НСтр("ru='Устройство подключено, операция не может быть выполнена. Для отключения устройства требуется закрыть все формы приложения для текущей информационной базы.'");
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры    

// Установить компоненту подключения оборудования.
//
// Параметры:
//  ИдентификаторДрайвера - СправочникСсылка.ДрайверыОборудования - идентификатор драйвера.
//
// Возвращаемое значение:
//  см. МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании.
// 
Асинх Функция УстановитьДрайверОборудованияАсинх(ИдентификаторДрайвера) Экспорт
	
	ДанныеДрайвера = ДанныеДрайвераОборудования(ИдентификаторДрайвера);
	Если НЕ ЗначениеЗаполнено(ДанныеДрайвера) Тогда
		ОписаниеОшибки = НСтр("ru = 'Драйвер не найден.'");
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	                 
	ТекстСообщения = СтрШаблон(НСтр("ru = 'Для продолжения работы требуется установка внешней компоненты ""%1""'"), ДанныеДрайвера.Наименование); 
	Если ДанныеДрайвера.ПодключениеИзМакета Тогда
		Если Не ДанныеДрайвера.МакетДоступен Тогда
			ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Макет драйвера ""%1"" не найден.'"), ДанныеДрайвера.ИмяМакетаДрайвера); 
			РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
			РезультатВыполнения.ИдентификаторОбъекта    = ДанныеДрайвера.ИдентификаторОбъекта;
			РезультатВыполнения.ИдентификаторУстройства = ДанныеДрайвера.Ссылка;
			Возврат РезультатВыполнения;
		Иначе
			ПараметрыУстановки = ВнешниеКомпонентыБПОКлиент.ПараметрыУстановки();
			ПараметрыУстановки.ТекстПояснения = ТекстСообщения;
			Результат = Ждать ВнешниеКомпонентыБПОКлиент.УстановитьКомпонентуИзМакетаАсинх(ДанныеДрайвера.ИмяМакетаДрайвера, ПараметрыУстановки); // Структура
		КонецЕсли;
	Иначе
		ПараметрыУстановки = ВнешниеКомпонентыБПОКлиент.ПараметрыУстановки();
		ПараметрыУстановки.ПредложитьЗагрузить  = НЕ ДанныеДрайвера.СнятСПоддержки;
		ПараметрыУстановки.ПредложитьУстановить = Истина;
		ПараметрыУстановки.ТекстПояснения = ТекстСообщения; 
		Результат = Ждать ВнешниеКомпонентыБПОКлиент.УстановитьКомпонентуАсинх(ДанныеДрайвера.ИдентификаторОбъекта, Неопределено, ПараметрыУстановки);  // Структура
	КонецЕсли;

	РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Результат.Установлено, Результат.ОписаниеОшибки);
	РезультатВыполнения.ИдентификаторОбъекта    = ДанныеДрайвера.ИдентификаторОбъекта;
	РезультатВыполнения.ИдентификаторУстройства = ДанныеДрайвера.Ссылка;
	Возврат РезультатВыполнения;
	
КонецФункции

// Установить компоненту подключения оборудования.
//
// Параметры:
//  ОповещениеПриЗавершении - ОписаниеОповещения - событие описания оповещения.
//  ИдентификаторДрайвера - СправочникСсылка.ДрайверыОборудования - идентификатор драйвера.
//
Процедура УстановитьДрайверОборудования(ОповещениеПриЗавершении, ИдентификаторДрайвера) Экспорт
		
	// Замер производительности
	КлючеваяОперация = "ОбщийМодуль.МенеджерОборудованияКлиент.УстановитьДрайверОборудования";
	ОбщегоНазначенияБПОКлиент.ЗамерВремениБПО(КлючеваяОперация, ОповещениеПриЗавершении);
	
	
	ДанныеДрайвера = ДанныеДрайвераОборудования(ИдентификаторДрайвера);
	Если НЕ ЗначениеЗаполнено(ДанныеДрайвера) Тогда
		ОписаниеОшибки = НСтр("ru = 'Драйвер не найден.'");
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	Контекст = Новый Структура();
	Контекст.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	Контекст.Вставить("ДанныеДрайвера", ДанныеДрайвера);
	Оповещение = Новый ОписаниеОповещения("УстановитьДрайверОборудованияЗавершение", ЭтотОбъект, Контекст);
	
	ТекстСообщения = СтрШаблон(
		НСтр("ru = 'Для продолжения работы требуется установка внешней компоненты ""%1"".'"),
		ДанныеДрайвера.Наименование);
	
	Если ДанныеДрайвера.ПодключениеИзМакета Или ОбщегоНазначенияБПОКлиентСервер.ЭтоМобильныйКлиент() Тогда
		Если Не ДанныеДрайвера.МакетДоступен Тогда
			ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Макет драйвера ""%1"" не найден.'"), ДанныеДрайвера.ИмяМакетаДрайвера); 
			РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
		Иначе
			Если ДопустимаУстановкаКомпоненты(ДанныеДрайвера.ИмяМакетаДрайвера) Тогда
				ПараметрыУстановки = ВнешниеКомпонентыБПОКлиент.ПараметрыУстановки();
				ПараметрыУстановки.ТекстПояснения = ТекстСообщения;
				ВнешниеКомпонентыБПОКлиент.УстановитьКомпонентуИзМакета(Оповещение, ДанныеДрайвера.ИмяМакетаДрайвера, ПараметрыУстановки);
			Иначе
				ОписаниеОшибки = СтрШаблон(НСтр("ru = 'Для компоненты %1 не предусмотрена работа в web-клиенте.'"), ДанныеДрайвера.Наименование);
				РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
				ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ПараметрыУстановки = ВнешниеКомпонентыБПОКлиент.ПараметрыУстановки();
		ПараметрыУстановки.ТекстПояснения       = ТекстСообщения; 
		ПараметрыУстановки.ПредложитьЗагрузить  = НЕ ДанныеДрайвера.СнятСПоддержки;;
		ПараметрыУстановки.ПредложитьУстановить = Истина;
		ВнешниеКомпонентыБПОКлиент.УстановитьКомпоненту(Оповещение, ДанныеДрайвера.ИдентификаторОбъекта, Неопределено, ПараметрыУстановки);
	КонецЕсли;
	
КонецПроцедуры

// Завершение установки драйвера оборудования
// 
// Параметры:
//  Результат - Структура
//  Контекст - Структура
//
Процедура УстановитьДрайверОборудованияЗавершение(Результат, Контекст) Экспорт
	
	Если Контекст.ОповещениеПриЗавершении <> Неопределено Тогда
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Результат.Установлено, Результат.ОписаниеОшибки);
		РезультатВыполнения.ИдентификаторОбъекта    = Контекст.ДанныеДрайвера.ИдентификаторОбъекта;
		РезультатВыполнения.ИдентификаторУстройства = Контекст.ДанныеДрайвера.Ссылка;
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеПриЗавершении, РезультатВыполнения);
	КонецЕсли;
	
	
КонецПроцедуры

#КонецОбласти

#Область ВыбратьУстройство

// Процедура выбора устройства из доступных, привязанных к текущему рабочему месту.
//
// Параметры:
//  Отбор - Структура, Массив из Строка, Строка - тип оборудования для выбора устройства.
//          см. МенеджерОборудованияКлиентСервер.СписокОборудованияОтбор
//  ТекстЗаголовкаВыбора - Строка - Заголовок окна выбора.
//  СообщениеНеПодключено - Строка - Текст сообщения о не подключенных устройствах
//  СообщениеНеВыбрано - Строка - Текст сообщения о не выбранных устройствах
//
// Возвращаемое значение:
//  см. МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании
//
Асинх Функция ВыбратьУстройствоАсинх(Отбор, ТекстЗаголовкаВыбора, СообщениеНеПодключено = "", СообщениеНеВыбрано = "") Экспорт
	
	Если Не ОбновитьРабочееМестоКлиента() Тогда
		ТекстСообщения = НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстСообщения);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	Если ПустаяСтрока(СообщениеНеПодключено) Тогда
		СообщениеНеПодключено = НСтр("ru='Необходимые устройства не подключены к текущему рабочему месту.'");
	КонецЕсли;
	
	Если ПустаяСтрока(СообщениеНеВыбрано) Тогда
		СообщениеНеВыбрано = НСтр("ru='Устройство не выбрано.'");
	КонецЕсли;
	
	Если ТипЗнч(Отбор) = Тип("Структура") Тогда
		Если Отбор.Свойство("ТипыПО") Тогда
			СписокОборудованияОтбор = Отбор; 
		Иначе
			СписокОборудованияОтбор = МенеджерОборудованияКлиентСервер.СписокОборудованияОтбор();
			СписокОборудованияОтбор.ТипыПО = Отбор;
		КонецЕсли;                  
	Иначе
		СписокОборудованияОтбор = МенеджерОборудованияКлиентСервер.СписокОборудованияОтбор();
		СписокОборудованияОтбор.ТипыПО = Отбор;
	КонецЕсли;                  
		
	СписокДоступныхУстройств = МенеджерОборудованияВызовСервера.СписокОборудования(СписокОборудованияОтбор);
	СписокУстройств          = Новый СписокЗначений();
	Для Каждого Устройства Из СписокДоступныхУстройств Цикл
		СписокУстройств.Добавить(Устройства.Ссылка, Устройства.Наименование);
	КонецЦикла;
	
	Если СписокУстройств.Количество() = 0 Тогда
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, СообщениеНеПодключено);
	ИначеЕсли СписокУстройств.Количество() = 1 Тогда
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Истина);
		РезультатВыполнения.ИдентификаторУстройства = СписокУстройств[0].Значение;
	Иначе
		Результат = Ждать СписокУстройств.ВыбратьЭлементАсинх(ТекстЗаголовкаВыбора);
		Если Результат = Неопределено Тогда 
			РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, СообщениеНеВыбрано);
		Иначе
			РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Истина);
			РезультатВыполнения.ИдентификаторУстройства = Результат.Значение;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

// Процедура выбора устройства из доступных, привязанных к текущему рабочему месту.
//
// Параметры:
//  ОповещениеВыбора - ОписаниеОповещения - событие описания оповещения.
//  Отбор - Строка - тип оборудования для выбора устройства.
//        - Массив из Строка
//        - см. МенеджерОборудованияКлиентСервер.СписокОборудованияОтбор
//  ТекстЗаголовкаВыбора - Строка - Заголовок окна выбора.
//  СообщениеНеПодключено - Строка - Текст сообщения о не подключенных устройствах
//  СообщениеНеВыбрано - Строка - Текст сообщения о не выбранных устройствах
//
Процедура ВыбратьУстройство(ОповещениеВыбора, Отбор, ТекстЗаголовкаВыбора, СообщениеНеПодключено = "", СообщениеНеВыбрано = "") Экспорт
	
	Если Не ОбновитьРабочееМестоКлиента() Тогда
		ТекстСообщения = НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстСообщения);
		ВыполнитьОбработкуОповещения(ОповещениеВыбора, РезультатВыполнения);
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(СообщениеНеПодключено) Тогда
		СообщениеНеПодключено = НСтр("ru='Необходимые устройства не подключены к текущему рабочему месту.'");
	КонецЕсли;
	
	Если ПустаяСтрока(СообщениеНеВыбрано) Тогда
		СообщениеНеВыбрано = НСтр("ru='Устройство не выбрано.'");
	КонецЕсли;
		
	Если ТипЗнч(Отбор) <> Тип("Структура") Тогда
		СписокОборудованияОтбор = МенеджерОборудованияКлиентСервер.СписокОборудованияОтбор();
		СписокОборудованияОтбор.ТипыПО = Отбор;
	ИначеЕсли Не Отбор.Свойство("ТипыПО") Тогда
		СписокОборудованияОтбор = МенеджерОборудованияКлиентСервер.СписокОборудованияОтбор();
		СписокОборудованияОтбор.ТипыПО = Отбор;
	Иначе
		СписокОборудованияОтбор = Отбор;
	КонецЕсли;
	
	СписокДоступныхУстройств = МенеджерОборудованияВызовСервера.СписокОборудования(СписокОборудованияОтбор);
	СписокУстройств          = Новый СписокЗначений();
	Для Каждого Устройства Из СписокДоступныхУстройств Цикл
		СписокУстройств.Добавить(Устройства.Ссылка, Устройства.Наименование);
	КонецЦикла;
	
	Если СписокУстройств.Количество() = 0 Тогда
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, СообщениеНеПодключено);
		ВыполнитьОбработкуОповещения(ОповещениеВыбора, РезультатВыполнения);
	ИначеЕсли СписокУстройств.Количество() = 1 Тогда
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Истина);
		РезультатВыполнения.ИдентификаторУстройства = СписокУстройств[0].Значение;
		ВыполнитьОбработкуОповещения(ОповещениеВыбора, РезультатВыполнения);
	Иначе
		Контекст = Новый Структура;
		Контекст.Вставить("ОповещениеВыбора"  , ОповещениеВыбора);
		Контекст.Вставить("СообщениеНеВыбрано", СообщениеНеВыбрано);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьУстройствоЗавершение", ЭтотОбъект, Контекст);
		СписокУстройств.ПоказатьВыборЭлемента(ОписаниеОповещения, ТекстЗаголовкаВыбора);
	КонецЕсли;
	
КонецПроцедуры

// Завершение выбора устройства.
// 
// Параметры:
//  Результат - Структура
//  Контекст - Структура
// 
Процедура ВыбратьУстройствоЗавершение(Результат, Контекст) Экспорт
	
	Если Результат = Неопределено Тогда 
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, Контекст.СообщениеНеВыбрано);
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеВыбора, РезультатВыполнения);
	Иначе
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Истина);
		РезультатВыполнения.ИдентификаторУстройства = Результат.Значение;
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеВыбора, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПодключениеОтключенияОборудования                 

// Начать подключения устройств.
//
// Параметры:
//  ИдентификаторКлиента - УникальныйИдентификатор - уникальный идентификатор клиента.
//  ТипыПО - Структура, Массив из Строка, Строка - тип оборудования для выбора устройства.
//  ИдентификаторУстройства - Массив из Строка, СправочникСсылка.ПодключаемоеОборудование - подключаемое устройство.
//  СетевоеОборудование - Булево - использовать сетевое оборудование при подключении.
//
// Возвращаемое значение:
//  Массив из см. МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании - Результаты подключения устройств.
//
Асинх Функция ПодключениеОборудованияАсинх(ИдентификаторКлиента, ТипыПО = Неопределено, ИдентификаторУстройства = Неопределено, СетевоеОборудование = Истина) Экспорт
	
	// Замер производительности
	КлючеваяОперация = "ОбщийМодуль.МенеджерОборудованияКлиент.ПодключениеОборудованияАсинх";
	УИДЗамера = ОбщегоНазначенияБПОКлиент.ЗамерВремениБПО(КлючеваяОперация);     
	
	ПодключенноеОборудование = Новый Массив(); // Результаты подключения устройств
	
	Если Не ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = НСтр("ru='Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса.'");
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);   
		ПодключенноеОборудование.Добавить(РезультатВыполнения);
		// Замер производительности
		ОбщегоНазначенияБПОКлиент.ЗавершитьЗамерВремениБПО(УИДЗамера, Истина);
		Возврат ПодключенноеОборудование;
	КонецЕсли;
	
	УстройстваДляПодключения = УстройстваДляПодключения(ИдентификаторКлиента, ТипыПО, ИдентификаторУстройства, СетевоеОборудование);
	ПодключенноеОборудование = УстройстваДляПодключения.ПодключенноеОборудование;
	ОборудованиеДляПодключения = УстройстваДляПодключения.ОборудованиеДляПодключения;
	
	Для Каждого Устройство Из ОборудованиеДляПодключения Цикл
		
		НовоеПодключение = ПараметрыПодключенияУстройства(Устройство);
		РезультатПодключения = Ждать НовоеПодключение.ОбработчикДрайвера.ПодключитьУстройствоАсинх(НовоеПодключение);
		Если РезультатПодключения.Результат Тогда
			НовоеПодключение.Клиенты.Добавить(ИдентификаторКлиента);
			НовоеПодключение.КоличествоПодключенных = 1;
			ПодключаемоеОборудование = ПодключаемоеОборудование();
			ПодключаемоеОборудование.ПараметрыПодключенияПО.Добавить(НовоеПодключение);
			Результат = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Истина, Неопределено, Устройство.Ссылка);
			Результат.ПодключенноеУстройство = НовоеПодключение;
			ПодключенноеОборудование.Добавить(Результат);
		Иначе
			ОписаниеОшибки = СтрШаблон(НСтр("ru='Не удалось подключить устройство (%1): %2'"), ИдентификаторУстройства, РезультатПодключения.ОписаниеОшибки);
			Результат = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки, Устройство.Ссылка);
			Результат.ОшибкаЗагрузки = РезультатПодключения.ОшибкаЗагрузки;
			ПодключенноеОборудование.Добавить(Результат);
		КонецЕсли;
		
	КонецЦикла;
	
	// Замер производительности
	ОбщегоНазначенияБПОКлиент.ЗавершитьЗамерВремениБПО(УИДЗамера, Истина);
	
	Возврат ПодключенноеОборудование;
	
КонецФункции

// Начать отключение устройств по типу оборудования.
//
// Параметры:
//  ОповещениеПриОтключении - ОписаниеОповещения - событие описания оповещения.
//  ИдентификаторКлиента - УникальныйИдентификатор
//  ТипыПО - Структура, Массив из Строка, Строка - тип оборудования для отключения устройств.
//
Процедура НачатьОтключениеОборудованияПоТипу(ОповещениеПриОтключении, ИдентификаторКлиента, ТипыПО) Экспорт
	
	НачатьОтключениеОборудования(ОповещениеПриОтключении, ИдентификаторКлиента, ТипыПО);
	
КонецПроцедуры

// Функция подключает устройства по типу оборудования.
//
// Параметры:
//  ИдентификаторКлиента - УникальныйИдентификатор
//  ТипыПО - Структура, Массив из Строка, Строка - тип оборудования для отключения устройств.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - отключаемое устройство.
//      
// Возвращаемое значение:
//  Массив из см. МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании - Результаты отключения устройств.
//  
Асинх Функция ОтключениеОборудованияАсинх(ИдентификаторКлиента, ТипыПО = Неопределено, ИдентификаторУстройства = Неопределено) Экспорт
	
	ОтключенноеОборудование = Новый Массив(); // Результаты отключения устройств  
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	
	ПодключенныеУстройства = УстройстваДляОтключения(ТипыПО, ИдентификаторУстройства);
	Для Каждого ОтключаемоеУстройство Из ПодключенныеУстройства Цикл // Структура
		КлиентПодключения = ОтключаемоеУстройство.Клиенты.Найти(ИдентификаторКлиента);
		Если КлиентПодключения <> Неопределено Тогда  
			// Необходимое устройство
			Если ОтключаемоеУстройство.КоличествоПодключенных = 1 Тогда
				РезультатОперации = Ждать ОтключаемоеУстройство.ОбработчикДрайвера.ОтключитьУстройствоАсинх(ОтключаемоеУстройство);
				Если РезультатОперации.Результат Тогда
					// Отключить устройство.
					ОтключаемоеУстройство .КоличествоПодключенных = 0;
					НомерСтрокиМассива = ПодключаемоеОборудование.ПараметрыПодключенияПО.Найти(ОтключаемоеУстройство);
					Если НомерСтрокиМассива <> Неопределено Тогда
						ПодключаемоеОборудование.ПараметрыПодключенияПО.Удалить(НомерСтрокиМассива);
					КонецЕсли;
					РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Истина);
					РезультатВыполнения.ИдентификаторУстройства = ОтключаемоеУстройство.Ссылка;
				Иначе
					ОписаниеОшибки = СтрШаблон(
						НСтр("ru='При отключении устройства ""%1"" произошла ошибка.'"), 
						ОтключаемоеУстройство.Наименование);
					РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
					РезультатВыполнения.ИдентификаторУстройства = ОтключаемоеУстройство.Ссылка;
				КонецЕсли;
				ОтключенноеОборудование.Добавить(РезультатВыполнения);
			Иначе
				ОтключаемоеУстройство.КоличествоПодключенных = ОтключаемоеУстройство.КоличествоПодключенных - 1;
				ОтключаемоеУстройство.Клиенты.Удалить(КлиентПодключения);
				РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Истина, ОтключаемоеУстройство.Ссылка);
				ОтключенноеОборудование.Добавить(РезультатВыполнения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;    
	
	Возврат ОтключенноеОборудование;
	
КонецФункции  

// Функция подключает устройства по типу оборудования.
//
// Параметры:
//  ОповещениеПриОтключении - ОписаниеОповещения - событие описания оповещения.
//  ИдентификаторКлиента - УникальныйИдентификатор
//  ТипыПО - Структура, Массив из Строка, Строка - тип оборудования для отключения устройств.
//  ИдентификаторУстройства - Массив из Строка, СправочникСсылка.ПодключаемоеОборудование - отключаемое устройство.
//
Процедура НачатьОтключениеОборудования(ОповещениеПриОтключении, ИдентификаторКлиента, ТипыПО = Неопределено, ИдентификаторУстройства = Неопределено) Экспорт
	
	ПодключенныеУстройства = УстройстваДляОтключения(ТипыПО, ИдентификаторУстройства);
	
	Для Каждого ОтключаемоеУстройство Из ПодключенныеУстройства Цикл
		КлиентПодключения = ОтключаемоеУстройство.Клиенты.Найти(ИдентификаторКлиента);
		Если КлиентПодключения <> Неопределено Тогда  
			Если ОтключаемоеУстройство.КоличествоПодключенных = 1 Тогда
				Контекст = Новый Структура();
				Контекст.Вставить("ОтключаемоеУстройство",  ОтключаемоеУстройство);
				Контекст.Вставить("ОповещениеПриОтключении", ОповещениеПриОтключении);
				Оповещение = Новый ОписаниеОповещения("НачатьОтключениеОборудованияЗавершение", ЭтотОбъект, Контекст);
				ОтключаемоеУстройство.ОбработчикДрайвера.НачатьОтключениеУстройства(Оповещение, ОтключаемоеУстройство);
			Иначе
				ОтключаемоеУстройство.КоличествоПодключенных = ОтключаемоеУстройство.КоличествоПодключенных - 1;
				ОтключаемоеУстройство.Клиенты.Удалить(КлиентПодключения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;    
	
КонецПроцедуры  

// Завершение отключения оборудования.
// 
// Параметры:
//  РезультатВыполнения - Структура
//  Контекст - Структура:
//   * ПодключенноеУстройство - Структура:
//      * Наименование - Строка - наименование устройства
//   * ОповещениеПриОтключении - ОписаниеОповещения
// 
Процедура НачатьОтключениеОборудованияЗавершение(РезультатВыполнения, Контекст) Экспорт
	
	ОтключаемоеУстройство = Контекст.ОтключаемоеУстройство; // Структура
	Если РезультатВыполнения.Результат Тогда
		// Отключить устройство.
		ОтключаемоеУстройство.КоличествоПодключенных = 0;
		ПодключаемоеОборудование = ПодключаемоеОборудование();
		Индекс = ПодключаемоеОборудование.ПараметрыПодключенияПО.Найти(ОтключаемоеУстройство);
		Если Индекс <> Неопределено Тогда
			ПодключаемоеОборудование.ПараметрыПодключенияПО.Удалить(Индекс);
		КонецЕсли;
		Результат = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Истина);
		Результат.ИдентификаторУстройства = ОтключаемоеУстройство.Ссылка;
	Иначе
		ОписаниеОшибки = СтрШаблон(
			НСтр("ru='При отключении устройства ""%1"" произошла ошибка.'"), 
			ОтключаемоеУстройство.Наименование);
		Результат = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
		Результат.ИдентификаторУстройства = ОтключаемоеУстройство.Ссылка;
	КонецЕсли;
	Если Контекст.ОповещениеПриОтключении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(Контекст.ОповещениеПриОтключении, Результат);
	КонецЕсли;
	
КонецПроцедуры

// Производит принудительное отключение всего подключенного оборудования, независимо от числа ссылок на подключение.
//
// Возвращаемое значение:
//  Булево.
// 
Асинх Функция ОтключениеВсегоОборудованияАсинх() Экспорт
	
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	Для Каждого ПодключенноеУстройство Из ПодключаемоеОборудование.ПараметрыПодключенияПО Цикл
		РезультатОперации = Ждать ПодключаемоеОборудованиеДрайверКлиент.ОтключитьУстройствоАсинх(ПодключенноеУстройство);
 		Если НЕ РезультатОперации.Результат Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru='При отключении оборудования произошла ошибка: %1'"), РезультатОперации.ОписаниеОшибки);
			ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		ПодключенноеУстройство.КоличествоПодключенных = 0;
	КонецЦикла;
	
	КоличествоПодключенныхКлиентов = 0;
	Для Каждого ПодключенноеУстройство Из ПодключаемоеОборудование.ПараметрыПодключенияПО Цикл
		КоличествоПодключенныхКлиентов = КоличествоПодключенныхКлиентов + ПодключенноеУстройство.КоличествоПодключенных;
	КонецЦикла;
	
	ПодключаемоеОборудование.ПараметрыПодключенияПО.Очистить();        
	
	Возврат Истина;
	
КонецФункции

// Функция возвращает подключено ли оборудование.
// 
// Параметры: 
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - ИдентификаторУстройства.
// 
// Возвращаемое значение:
//  Булево - Устройство подключено
//
Функция УстройствоПодключено(ИдентификаторУстройства) Экспорт
	
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	Для Каждого Подключение Из ПодключаемоеОборудование.ПараметрыПодключенияПО Цикл
		Если Подключение.Ссылка = ИдентификаторУстройства Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область ПечатающееУстройство

// Начать подключение печатающего устройства
//
// Параметры:
//  ОповещениеПриЗавершении - ОписаниеОповещения - событие описания оповещения.
//  ИдентификаторКлиента - УникальныйИдентификатор - уникальный идентификатор клиента.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - подключаемое устройство.
//
Процедура НачатьПодключениеПечатающегоУстройства(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства = Неопределено) Экспорт
	
	ПараметрыВыполнение = Новый Структура();
	ПараметрыВыполнение.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);
	ПараметрыВыполнение.Вставить("ИдентификаторКлиента"   , ИдентификаторКлиента);
	ПараметрыВыполнение.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	
	Если ИдентификаторУстройства = Неопределено Или ПустаяСтрока(ИдентификаторУстройства) Тогда
		
		ПоддерживаемыеТипы = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ПоддерживаемыеТипы.ПринтерЧеков = Истина;
		ПоддерживаемыеТипы.ККТ = Истина;
		
		Оповещение = Новый ОписаниеОповещения("НачатьПодключениеПечатающегоУстройства_ВыборЗавершение", ЭтотОбъект, ПараметрыВыполнение);
		ВыбратьУстройство(Оповещение, ПоддерживаемыеТипы,
			НСтр("ru='Выберите устройство для печати'"),
			НСтр("ru='Для данного рабочего места нет доступных устройств для печати.'"), 
			НСтр("ru='Устройство для печати не выбрано.'"));
	Иначе
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Истина, Неопределено, ИдентификаторУстройства); 
		НачатьПодключениеПечатающегоУстройства_ВыборЗавершение(РезультатВыполнения, ПараметрыВыполнение);
	КонецЕсли;
	
КонецПроцедуры

// Завершение подключения печатающего устройства.
// 
// Параметры:
//  РезультатВыполнения - Структура
//  ПараметрыВыполнение - Структура
// 
Процедура НачатьПодключениеПечатающегоУстройства_ВыборЗавершение(РезультатВыполнения, ПараметрыВыполнение) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ПараметрыВыполнение.ИдентификаторУстройства = РезультатВыполнения.ИдентификаторУстройства; 
		// Поиск подключенного устройства.
		ПодключенноеУстройство = ПолучитьПодключенноеУстройство(ПараметрыВыполнение.ИдентификаторУстройства);                                                
		Если ПодключенноеУстройство = Неопределено Тогда
			НачатьПодключениеОборудованиеПоИдентификатору(ПараметрыВыполнение.ОповещениеПриЗавершении, ПараметрыВыполнение.ИдентификаторКлиента, ПараметрыВыполнение.ИдентификаторУстройства);
		Иначе
			РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Истина, Неопределено, ПараметрыВыполнение.ИдентификаторУстройства); 
			РезультатВыполнения.Вставить("ПечатающееУстройствоБылоПодключенное", Истина);
			ВыполнитьОбработкуОповещения(ПараметрыВыполнение.ОповещениеПриЗавершении, РезультатВыполнения);
		КонецЕсли;
	Иначе
		ВыполнитьОбработкуОповещения(ПараметрыВыполнение.ОповещениеПриЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВыполнениеКоманды

// Выполнение команды обработчика для подключенного устройства.
//
// Параметры:
//  ПодключенноеУстройство - СправочникСсылка.ПодключаемоеОборудование
//  ПараметрыВыполнениеКоманды - Структура
//
Процедура ВыполнениеКомандыОбработчика(ПодключенноеУстройство, ПараметрыВыполнениеКоманды) Экспорт
	
	Команда = ПараметрыВыполнениеКоманды.Команда;
	
	// Вызываем модуль "Процессор данных" отвечающий за подготовку данных для выполнение команды на оборудовании.
	Если ПараметрыВыполнениеКоманды.ПодготовитьДанные Тогда
		
		ПараметрыПодключенияСервер = МенеджерОборудованияКлиентСервер.ПараметрыПодключения(ПодключенноеУстройство,ПараметрыВыполнениеКоманды);
		ПроцессорДанных = ПараметрыВыполнениеКоманды.ПроцессорДанных;   
		// Подготовка данных для проведения операции на сервере.
		ДанныеОперации = МенеджерОборудованияВызовСервера.ПодготовитьДанныеОперации(ПараметрыПодключенияСервер, ПроцессорДанных, Команда, ПараметрыВыполнениеКоманды.ПараметрыОперации); 
		
		Если ДанныеОперации = Неопределено Тогда
			ТекстОшибки = НСтр("ru='Ошибка подготовки данных для операции.'");
			РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстОшибки, ПараметрыВыполнениеКоманды.ИдентификаторУстройства);
			ОтключитьОборудованиеПослеВыполнениеКоманды(ПараметрыВыполнениеКоманды, РезультатВыполнения);
			Возврат;
		ИначеЕсли НЕ ДанныеОперации.Результат Тогда
			РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ДанныеОперации.ТекстОшибки, ПараметрыВыполнениеКоманды.ИдентификаторУстройства);
			ОтключитьОборудованиеПослеВыполнениеКоманды(ПараметрыВыполнениеКоманды, РезультатВыполнения);
			Возврат;
		КонецЕсли; 
	Иначе
		ДанныеОперации = ПараметрыВыполнениеКоманды.ПараметрыОперации;
		Если ДанныеОперации = Неопределено Тогда
			ДанныеОперации = Новый Структура();
		КонецЕсли; 
	КонецЕсли;
	
	Если не ПодключенноеУстройство.Свойство("ОбработчикДрайвера") Тогда
	ОбработчикДрайвера = МенеджерОборудованияКлиент;	
	иначе
	ОбработчикДрайвера = ПодключенноеУстройство.ОбработчикДрайвера; 
	КонецЕсли;
	Если ОбработчикДрайвера = Неопределено Тогда
		// Сообщить об ошибке, что не удалось загрузить драйвер.
		ТекстОшибки = НСтр("ru='Не удалось подключить обработчик драйвера.'");
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстОшибки, ПараметрыВыполнениеКоманды.ИдентификаторУстройства);
		ВыполнитьОбработкуОповещения(ПараметрыВыполнениеКоманды.ОповещениеПриЗавершении, РезультатВыполнения);
	Иначе
		ПараметрыВыполнениеКоманды.Вставить("ДанныеОперации", ДанныеОперации);
		ПараметрыВыполнениеКоманды.Вставить("ПодключенноеУстройство", ПодключенноеУстройство);
		
		Если Команда = "CheckFiscalization"
			И ПараметрыВыполнениеКоманды.Свойство("ОповещениеПослеОткрытииЧека")
			И ПараметрыВыполнениеКоманды.ОповещениеПослеОткрытииЧека <> Неопределено Тогда
			
			ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПослеОткрытииЧека", ЭтотОбъект, ПараметрыВыполнениеКоманды);
			ОбработчикДрайвера.НачатьВыполнениеКоманды(ОписаниеОповещения, ПодключенноеУстройство, "GetCurrentStatus", ДанныеОперации.ТекущееСостояние);
		Иначе        
			ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_Завершение", ЭтотОбъект, ПараметрыВыполнениеКоманды);
			ОбработчикДрайвера.НачатьВыполнениеКоманды(ОписаниеОповещения, ПодключенноеУстройство, Команда, ДанныеОперации);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик оповещения "После открытия чека", вызывается во время команды "CheckFiscalization".
// 
// Параметры:
//  РезультатВыполнения - Структура
//  ПараметрыВыполнениеКоманды - Структура
// 
Процедура НачатьВыполнениеКоманды_ПослеОткрытииЧека(РезультатВыполнения, ПараметрыВыполнениеКоманды)  Экспорт
	
	ДанныеОперации = ПараметрыВыполнениеКоманды.ДанныеОперации;
	ПодключенноеУстройство = ПараметрыВыполнениеКоманды.ПодключенноеУстройство;

	ПараметрыВыполнения = Новый Структура();
	ПараметрыВыполнения.Вставить("ВходныеПараметры", ПараметрыВыполнениеКоманды.ДанныеОперации);
	ПараметрыВыполнения.Вставить("ОписаниеОшибки"  , Неопределено); 
	ПараметрыВыполнения.Вставить("ПродолжитьПечать", Истина);
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяЧекопечатающиеУстройства() Тогда
		МодульОборудованиеЧекопечатающиеУстройстваВызовСервера = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваВызовСервера");
		ТекущееСостояние = ДанныеОперации.ТекущееСостояние;
		ФискальныеДанныеСтруктура = МодульОборудованиеЧекопечатающиеУстройстваВызовСервера.ПолучитьПараметрыСменыИзXMLПакета(
			ТекущееСостояние.РезультатXML, ПодключенноеУстройство.РевизияИнтерфейса, ТекущееСостояние.НомерСменыККТ, ТекущееСостояние.НомерЧекаККТ);
		ЗаполнитьПараметрыОперацииПодписиЧека(ПараметрыВыполнения, ФискальныеДанныеСтруктура.НомерСменыККТ, Число(ФискальныеДанныеСтруктура.НомерЧекаККТ) + 1, ДанныеОперации.ЗаводскойНомерФН); 
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ЗавершениеПечати", ЭтотОбъект, ПараметрыВыполнениеКоманды);
	ПараметрыВыполнения.Вставить("ОповещениеПродолжения", Оповещение);
	ВыполнитьОбработкуОповещения(ПараметрыВыполнениеКоманды.ОповещениеПослеОткрытииЧека, ПараметрыВыполнения);
	
КонецПроцедуры

// Обработчик оповещения "Завершение печати", вызывается после открытия чека.
// 
// Параметры:
//  РезультатВыполнения - Структура
//  ПараметрыВыполнениеКоманды - Структура
// 
Процедура НачатьВыполнениеКоманды_ЗавершениеПечати(РезультатВыполнения, ПараметрыВыполнениеКоманды)  Экспорт
	
	Если РезультатВыполнения.ПродолжитьПечать Тогда        
		
		ДанныеОперации = ПараметрыВыполнениеКоманды.ДанныеОперации;
		ПараметрыОперации = ПараметрыВыполнениеКоманды.ПараметрыОперации;
		ПодключенноеУстройство = ПараметрыВыполнениеКоманды.ПодключенноеУстройство;
		
		ДополнительныеПараметры = Новый Структура();
		ЗаполнитьПараметрыОперацииПодписиЧека(ДополнительныеПараметры);
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, РезультатВыполнения);
		ДополнительныеПараметры.Вставить("АдресЧека"  , ?(РезультатВыполнения.Свойство("АдресЧека"), РезультатВыполнения.АдресЧека, Неопределено));
		ДополнительныеПараметры.Вставить("ПодписьЧека", ?(РезультатВыполнения.Свойство("ПодписьЧека"), РезультатВыполнения.ПодписьЧека, Неопределено));
		ДанныеОперации.Вставить("ПодписьЧека", ДополнительныеПараметры);
		ПараметрыОперации.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
		 
		Если НЕ ПустаяСтрока(ДополнительныеПараметры.АдресЧека) Тогда // Необходима печать слип-чека алко-продукции.
			ПечатьСлипЧека = ПечатьСлипЧекаАлкогольнойПродукции(); 
			Если ПечатьСлипЧека И ОбщегоНазначенияБПОКлиент.ИспользуетсяЧекопечатающиеУстройства() Тогда
				ШиринаСтроки = ?(ПодключенноеУстройство.Свойство("ШиринаСтроки"), ПодключенноеУстройство.ШиринаСтроки, 36);
				
				МодульОборудованиеЧекопечатающиеУстройстваКлиентСервер = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиентСервер");
				МодульОборудованиеЧекопечатающиеУстройстваВызовСервера = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваВызовСервера");
				
				ДанныеОперации.ТестовыеЧеки = МодульОборудованиеЧекопечатающиеУстройстваВызовСервера.XMLПакетИнфоКвитанции(
					ДополнительныеПараметры, ШиринаСтроки, ПодключенноеУстройство.РевизияИнтерфейса);
			КонецЕсли;
		КонецЕсли;
		
		ОбработчикДрайвера = ПараметрыВыполнениеКоманды.ПодключенноеУстройство.ОбработчикДрайвера;
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_Завершение", ЭтотОбъект, ПараметрыВыполнениеКоманды);
		ОбработчикДрайвера.НачатьВыполнениеКоманды(ОписаниеОповещения, ПодключенноеУстройство, ПараметрыВыполнениеКоманды.Команда, ПараметрыВыполнениеКоманды.ДанныеОперации);
		
	Иначе
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, РезультатВыполнения.ОписаниеОшибки, ПараметрыВыполнениеКоманды.ИдентификаторУстройства);
		ВыполнитьОбработкуОповещения(ПараметрыВыполнениеКоманды.ОповещениеПриЗавершении, РезультатВыполнения);
	КонецЕсли;

КонецПроцедуры

// Завершение подключения печатающего устройства
// 
// Параметры:
//  РезультатПодключения - Структура
//  ПараметрыВыполнениеКоманды - Структура
// 
Процедура НачатьВыполнениеКоманды_ПечатающегоУстройстваЗавершение(РезультатПодключения, ПараметрыВыполнениеКоманды) Экспорт
	
	Если РезультатПодключения.Результат Тогда  
		ПараметрыВыполнениеКоманды.ПечатающееУстройство = РезультатПодключения.ИдентификаторУстройства;
		ПараметрыВыполнениеКоманды.ПечатающееУстройствоПодключено = Истина;  
		
		Если РезультатПодключения.Свойство("ПечатающееУстройствоБылоПодключенное") И РезультатПодключения.ПечатающееУстройствоБылоПодключенное Тогда
			ПараметрыВыполнениеКоманды.ПечатающееУстройствоБылоПодключенное = Истина;
		КонецЕсли;
		ВыполнениеКомандыОбработчика(ПараметрыВыполнениеКоманды.ПодключенноеУстройство, ПараметрыВыполнениеКоманды);
	Иначе
		ТекстСообщения = СтрШаблон(НСтр("ru='При подключении печатающего устройства произошла ошибка: %1'"), РезультатПодключения.ОписаниеОшибки); 
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстСообщения);
		РезультатВыполнения.ИдентификаторУстройства = РезультатПодключения.ИдентификаторУстройства;
		// Отключение оборудования при завершение
		ОтключитьОборудованиеПослеВыполнениеКоманды(ПараметрыВыполнениеКоманды, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// Завершение выполнения команды
// 
// Параметры:
//  РезультатВыполнения - Структура
//  ПараметрыВыполнениеКоманды - Структура:
//   * ПараметрыОперации - Структура:
//      ** ОбработатьДанные - Булево
//      ** ОбработатьДанныеПриОшибке - Булево
//      ** ИспользоватьПечатающееУстройство - Булево
//      ** ДополнительныеПараметры - Структура
// 
Процедура НачатьВыполнениеКоманды_Завершение(РезультатВыполнения, ПараметрыВыполнениеКоманды) Экспорт
	
	// Обработка данный на сервере после выполнение команды
	Если (РезультатВыполнения.Результат И ПараметрыВыполнениеКоманды.ОбработатьДанные)
		Или (ПараметрыВыполнениеКоманды.Свойство("ОбработатьДанныеПриОшибке") И ПараметрыВыполнениеКоманды.ОбработатьДанныеПриОшибке) Тогда
		
		ПараметрыПодключенияСервер = МенеджерОборудованияКлиентСервер.ПараметрыПодключения(ПараметрыВыполнениеКоманды.ПодключенноеУстройство);   
		ПараметрыПодключенияСервер.Вставить("ИдентификаторУстройства", ПараметрыВыполнениеКоманды.ИдентификаторУстройства);
		ПроцессорДанных = ПараметрыВыполнениеКоманды.ПроцессорДанных;
		Команда = ПараметрыВыполнениеКоманды.Команда;
		// Вызываем модуль  отвечающий за обработку данных после выполнение команды на оборудовании.
		МенеджерОборудованияВызовСервера.ОбработатьДанныеОперации(ПараметрыПодключенияСервер, ПроцессорДанных, Команда, РезультатВыполнения, ПараметрыВыполнениеКоманды.ДанныеОперации); 
	КонецЕсли;
	
	Если РезультатВыполнения.Свойство("ИдентификаторУстройства") И НЕ ЗначениеЗаполнено(РезультатВыполнения.ИдентификаторУстройства) Тогда 
		РезультатВыполнения.ИдентификаторУстройства = ПараметрыВыполнениеКоманды.ИдентификаторУстройства;
	КонецЕсли;
	
	Если РезультатВыполнения.Результат Тогда
		Если ПараметрыВыполнениеКоманды.Свойство("ПараметрыОперации") 
			И ПараметрыВыполнениеКоманды.ПараметрыОперации <> Неопределено
			И ПараметрыВыполнениеКоманды.ПараметрыОперации.Свойство("ДополнительныеПараметры") Тогда
			РезультатВыполнения.Вставить("ДополнительныеПараметры", ПараметрыВыполнениеКоманды.ПараметрыОперации.ДополнительныеПараметры);
		КонецЕсли;
		Если ПараметрыВыполнениеКоманды.Команда = "CheckFiscalization" 
			И ОбщегоНазначенияБПОКлиент.ИспользуетсяДисплеиПокупателя() 
			И ВыводQRКодаЧекаНаДисплейПокупателяПослеФискализации() Тогда
				СообщениеНаДисплее = СтрШаблон(НСтр("ru = 'Электронный чек%1Проверьте чек в ФНС'"), Символы.ПС);
				МодульОборудованиеДисплеиПокупателяКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеДисплеиПокупателяКлиент");
				ПараметрыОперацииQR = МодульОборудованиеДисплеиПокупателяКлиент.ПараметрыОперацииДисплейПокупателя(СообщениеНаДисплее, РезультатВыполнения.QRКодЧекаККТ);
				ПараметрыОперацииQR.ВнутренняяОперация = Истина;
				МодульОборудованиеДисплеиПокупателяКлиент.НачатьВыводQRКодаНаДисплейПокупателя(Неопределено, Неопределено, Неопределено, ПараметрыОперацииQR); 
		КонецЕсли;
	Иначе          
		ДополнительнаяОбработкаОшибки(РезультатВыполнения);
		Если ПараметрыВыполнениеКоманды.Команда = "CheckFiscalization"
			И ПараметрыВыполнениеКоманды.Свойство("ОповещениеПриОшибкеПечатиЧека")
			И ПараметрыВыполнениеКоманды.ОповещениеПриОшибкеПечатиЧека <> Неопределено Тогда
				ДанныеОперации = ПараметрыВыполнениеКоманды.ДанныеОперации;
				ПараметрыВыполнения = Новый Структура();
				ПараметрыВыполнения.Вставить("ВходныеПараметры", ПараметрыВыполнениеКоманды.ДанныеОперации);
				ПараметрыВыполнения.Вставить("ОписаниеОшибки"  , Неопределено); 
				ПараметрыВыполнения.Вставить("ПродолжитьПечать", Истина);
				ПараметрыВыполнения.Вставить("ОповещениеПродолжения", Неопределено);
				ЗаполнитьПараметрыОперацииПодписиЧека(ПараметрыВыполнения, ДанныеОперации.НомерСменыККТ, ДанныеОперации.НомерЧекаККТ, ДанныеОперации.ЗаводскойНомерФН); 
				ВыполнитьОбработкуОповещения(ПараметрыВыполнениеКоманды.ОповещениеПриОшибкеПечатиЧека, ПараметрыВыполнения);
		КонецЕсли;
	КонецЕсли;                        
	
	Если ПараметрыВыполнениеКоманды.ИспользоватьПечатающееУстройство 
		И ПараметрыВыполнениеКоманды.ПечатающееУстройствоПодключено И РезультатВыполнения.Свойство("ТестовыеЧеки") Тогда
		// Поиск подключенного устройства.
		ПечатающееУстройство = ПолучитьПодключенноеУстройство(ПараметрыВыполнениеКоманды.ПечатающееУстройство);                                                
		Если ПечатающееУстройство = Неопределено Тогда
			ТекстОшибки = НСтр("ru='Ошибка печати слип чека. Операция отменена.'");
			РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстОшибки, ПараметрыВыполнениеКоманды.ИдентификаторУстройства);
			// Отключение оборудования.
			ОтключитьОборудованиеПослеВыполнениеКоманды(ПараметрыВыполнениеКоманды, РезультатВыполнения);
		Иначе
			Если РезультатВыполнения.Свойство("ТекстСлипЧека") И Не ПустаяСтрока(РезультатВыполнения.ТекстСлипЧека) Тогда
				ПодключаемоеОборудование = ПодключаемоеОборудование();
				ПодключаемоеОборудование.Вставить("ПоследнийСлипЧек", РезультатВыполнения.ТекстСлипЧека);
			КонецЕсли;
			// Результат выполнения исходной операции
			ПараметрыВыполнениеКоманды.Вставить("РезультатВыполнения", РезультатВыполнения);
			ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПечатьЗавершение", ЭтотОбъект, ПараметрыВыполнениеКоманды);
			ПечатающееУстройство.ОбработчикДрайвера.НачатьВыполнениеКоманды(ОписаниеОповещения, ПечатающееУстройство, "PrintText", РезультатВыполнения);
		КонецЕсли;
	ИначеЕсли ПараметрыВыполнениеКоманды.Свойство("ПараметрыОперации")
		И ПараметрыВыполнениеКоманды.ПараметрыОперации <> Неопределено
		И ПараметрыВыполнениеКоманды.ПараметрыОперации.Свойство("УстройствоПечати")
		И ПараметрыВыполнениеКоманды.ПараметрыОперации.Свойство("ПакетДокументов") 
		И (ЗначениеЗаполнено(ПараметрыВыполнениеКоманды.ПараметрыОперации.УстройствоПечати) 
		ИЛИ ЗначениеЗаполнено(ПараметрыВыполнениеКоманды.ПараметрыОперации.ПакетДокументов)) Тогда
			НачатьПодключениеУстройстваПечатиДополнительныхДокументов(РезультатВыполнения, ПараметрыВыполнениеКоманды);
	Иначе
		// Отключение оборудования.
		ОтключитьОборудованиеПослеВыполнениеКоманды(ПараметрыВыполнениеКоманды, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// Подключение оборудования печати.
// 
// Параметры:
//  РезультатВыполнения - Структура
//  ПараметрыВыполнениеКоманды - Структура
// 
Процедура НачатьПодключениеУстройстваПечатиДополнительныхДокументов(РезультатВыполнения, ПараметрыВыполнениеКоманды) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("РезультатВыполнения", РезультатВыполнения);
	ДополнительныеПараметры.Вставить("ПараметрыВыполнениеКоманды", ПараметрыВыполнениеКоманды);
	ДополнительныеПараметры.Вставить("УстройствКПодключению", 0);
	ДополнительныеПараметры.Вставить("ПодключеноУстройств", 0);
	ДополнительныеПараметры.Вставить("МассивУстройствДляПодключения", Новый Массив);
	ДополнительныеПараметры.Вставить("НеобходимаПечатьКопииЧека", Истина);
	
	ПечатающееУстройство = ПолучитьПодключенноеУстройство(ПараметрыВыполнениеКоманды.ПараметрыОперации.УстройствоПечати);
	Если ПечатающееУстройство = Неопределено И ЗначениеЗаполнено(ПараметрыВыполнениеКоманды.ПараметрыОперации.УстройствоПечати) Тогда
		ДополнительныеПараметры.МассивУстройствДляПодключения.Добавить(ПараметрыВыполнениеКоманды.ПараметрыОперации.УстройствоПечати);
		ДополнительныеПараметры.УстройствКПодключению = 1;
	ИначеЕсли ПечатающееУстройство <> Неопределено Тогда
		ДополнительныеПараметры.ПараметрыВыполнениеКоманды.ПодключенноеПечатающееУстройствоДополнительныхДокументов = ПечатающееУстройство;
		ДополнительныеПараметры.ПараметрыВыполнениеКоманды.ПечатающееУстройствоДополнительныхДокументов = ПечатающееУстройство.ИдентификаторУстройства;
	Иначе
		ДополнительныеПараметры.НеобходимаПечатьКопииЧека = Ложь;
	КонецЕсли;
	
	Для Каждого СоответствиеУстройства Из ПараметрыВыполнениеКоманды.ПараметрыОперации.ПакетДокументов Цикл
		Если ДополнительныеПараметры.МассивУстройствДляПодключения.Найти(СоответствиеУстройства.Значение) = Неопределено 
			И ПолучитьПодключенноеУстройство(СоответствиеУстройства.Значение) = Неопределено Тогда
			ДополнительныеПараметры.МассивУстройствДляПодключения.Добавить(СоответствиеУстройства.Значение);
			ДополнительныеПараметры.УстройствКПодключению = ДополнительныеПараметры.УстройствКПодключению + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если ДополнительныеПараметры.УстройствКПодключению > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПечатьДополнительныхДокументов", ЭтотОбъект, ДополнительныеПараметры);
		НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, ПараметрыВыполнениеКоманды.ИдентификаторКлиента, ДополнительныеПараметры.МассивУстройствДляПодключения);
	Иначе
		НачатьВыполнениеКоманды_ПечатьДополнительныхДокументов(РезультатВыполнения, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Печать дополнительных документов.
// 
// Параметры:
//  РезультатВыполнения - Структура
//  ПараметрыВыполнение - Структура
// 
Процедура НачатьВыполнениеКоманды_ПечатьДополнительныхДокументов(РезультатВыполнения, ПараметрыВыполнение) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		
		ПараметрыВыполнение.ПодключеноУстройств = ПараметрыВыполнение.ПодключеноУстройств + 1;
		Если ПараметрыВыполнение.ПодключеноУстройств < ПараметрыВыполнение.УстройствКПодключению Тогда
			Возврат;
		КонецЕсли;
		
		Если ПараметрыВыполнение.ПараметрыВыполнениеКоманды.Свойство("КопияРаспечатана") И ПараметрыВыполнение.ПараметрыВыполнениеКоманды.КопияРаспечатана 
			ИЛИ НЕ ПараметрыВыполнение.НеобходимаПечатьКопииЧека Тогда
			
			Команда = "PrintText";
			СоответствиеПечати = ПараметрыВыполнение.ПараметрыВыполнениеКоманды.ДанныеОперации.ДополнительныеДокументы;
			ДокументПечати = СоответствиеПечати.Получить(0); 

			УстройствоПечати = ПолучитьПодключенноеУстройство(ДокументПечати.УстройствоПечати);
			ДанныеОперации = Новый Структура;
			ДанныеОперации.Вставить("ТестовыеЧеки", Новый Массив);
			ДанныеОперации.ТестовыеЧеки = ДокументПечати.ТекстПечати;

			ПараметрыВыполнение.Вставить("РезультатВыполнения", РезультатВыполнения);
			ПараметрыВыполнение.ПараметрыВыполнениеКоманды.ДанныеОперации.ДополнительныеДокументы.Удалить(0);
			ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПечатьДополнительныхДокументовЗавершение", ЭтотОбъект, ПараметрыВыполнение);
			УстройствоПечати.ОбработчикДрайвера.НачатьВыполнениеКоманды(ОписаниеОповещения, УстройствоПечати, Команда, ДанныеОперации);
			
		Иначе
			
			ПараметрыВыполнениеКоманды = ПараметрыВыполнение.ПараметрыВыполнениеКоманды;
			Команда                    = "PrintText";
			ДанныеОперации             = ПараметрыВыполнениеКоманды.ДанныеОперации;
			Если Не ЗначениеЗаполнено(ПараметрыВыполнениеКоманды.ПечатающееУстройствоДополнительныхДокументов) Тогда
				ПараметрыВыполнениеКоманды.ПечатающееУстройствоДополнительныхДокументов = РезультатВыполнения.ИдентификаторУстройства;
				ПараметрыВыполнениеКоманды.ПодключенноеПечатающееУстройствоДополнительныхДокументов = РезультатВыполнения.ПодключенноеУстройство;
			КонецЕсли;
			ПараметрыПодключения = ПараметрыВыполнениеКоманды.ПодключенноеПечатающееУстройствоДополнительныхДокументов;
			ОбработчикДрайвера = ПараметрыВыполнениеКоманды.ПодключенноеПечатающееУстройствоДополнительныхДокументов.ОбработчикДрайвера;
			
			ПараметрыВыполнение.Вставить("РезультатВыполнения", РезультатВыполнения); 
			ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПечатьДополнительныхДокументовЗавершение", ЭтотОбъект, ПараметрыВыполнение);
			ОбработчикДрайвера.НачатьВыполнениеКоманды(ОписаниеОповещения, ПараметрыПодключения, Команда, ДанныеОперации);
		
		КонецЕсли;
		
	Иначе
		НачатьВыполнениеКоманды_ПечатьДополнительныхДокументовЗавершение(РезультатВыполнения, ПараметрыВыполнение);
	КонецЕсли;
	
КонецПроцедуры

// Завершение печати дополнительных документов.
// 
// Параметры:
//  РезультатВыполнения - Структура
//  ПараметрыВыполнение - Структура
// 
Процедура НачатьВыполнениеКоманды_ПечатьДополнительныхДокументовЗавершение(РезультатВыполнения, ПараметрыВыполнение) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ДополнительныеДокументы = ПараметрыВыполнение.ПараметрыВыполнениеКоманды.ДанныеОперации.ДополнительныеДокументы;
		Если ПараметрыВыполнение.ПараметрыВыполнениеКоманды.Свойство("КопияРаспечатана") И ПараметрыВыполнение.ПараметрыВыполнениеКоманды.КопияРаспечатана И ДополнительныеДокументы.Количество() > 0 Тогда
			НачатьВыполнениеКоманды_ПечатьДополнительныхДокументов(РезультатВыполнения, ПараметрыВыполнение);
		ИначеЕсли НЕ ПараметрыВыполнение.ПараметрыВыполнениеКоманды.Свойство("КопияРаспечатана") И ДополнительныеДокументы.Количество() > 0 Тогда
			ПараметрыВыполнение.ПараметрыВыполнениеКоманды.Вставить("КопияРаспечатана", Истина);
			НачатьВыполнениеКоманды_ПечатьДополнительныхДокументов(РезультатВыполнения, ПараметрыВыполнение);
		Иначе
			// Отключение оборудования.
			ОтключитьОборудованиеПослеВыполнениеКоманды(ПараметрыВыполнение.ПараметрыВыполнениеКоманды, ПараметрыВыполнение.РезультатВыполнения);
		КонецЕсли;
	Иначе
		
		ТекстСообщения = СтрШаблон(
		НСтр("ru='При печати дополнительных документов произошла ошибка: %1'"),
		РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
		Если ОбщегоНазначенияБПОКлиент.ИспользуетсяБазоваяФункциональность() Тогда
			
			Если РезультатВыполнения.Свойство("ОписаниеОшибки") Тогда
				ТекстСообщения = ТекстСообщения + Символы.ПС + РезультатВыполнения.ОписаниеОшибки;
			КонецЕсли;
			
			Попытка
				МодульЖурналРегистрацииКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ЖурналРегистрацииКлиент");
				МодульЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(
				НСтр("ru = 'Подключаемое оборудование.'"),
				"Ошибка", 
				ТекстСообщения);
			Исключение
				ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатВыполнения.ОписаниеОшибки);
			КонецПопытки;
		КонецЕсли;
		
		// Отключение оборудования.
		ОтключитьОборудованиеПослеВыполнениеКоманды(ПараметрыВыполнение.ПараметрыВыполнениеКоманды, ПараметрыВыполнение.РезультатВыполнения);
		
	КонецЕсли;
	
КонецПроцедуры

// Завершение печати
// 
// Параметры:
//  РезультатВыполнения - Структура
//  ПараметрыВыполнениеКоманды - Структура
// 
Процедура НачатьВыполнениеКоманды_ПечатьЗавершение(РезультатВыполнения, ПараметрыВыполнениеКоманды) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		// Отключение оборудования.
		ОтключитьОборудованиеПослеВыполнениеКоманды(ПараметрыВыполнениеКоманды, ПараметрыВыполнениеКоманды.РезультатВыполнения);
	Иначе
		// При команде "AuthorizeVoid" нельзя выполнить аварийную отмену последней операции отмены
		Если ПараметрыВыполнениеКоманды.Команда = "AuthorizeVoid" Тогда
			// Отключение оборудования.
			ОтключитьОборудованиеПослеВыполнениеКоманды(ПараметрыВыполнениеКоманды, ПараметрыВыполнениеКоманды.РезультатВыполнения);
		// При команде "Settlement" нельзя выполнить аварийную отмену последней операции
		ИначеЕсли ПараметрыВыполнениеКоманды.Команда = "Settlement" Тогда
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru='При получении итогов дня по картам, произошла ошибка печати слип чека.
					|На печатающем устройстве не поддерживается печать текстовых документов.
					|Терминал: %1
					|Печатающее устройство: %2'"),
				ПараметрыВыполнениеКоманды.ИдентификаторУстройства,
				ПараметрыВыполнениеКоманды.ПечатающееУстройство);
			ОбщегоНазначенияБПОКлиент.СообщитьПользователю(ТекстСообщения);
			Если ОбщегоНазначенияБПОКлиент.ИспользуетсяБазоваяФункциональность() Тогда
				
				Если РезультатВыполнения.Свойство("ОписаниеОшибки") Тогда
					ТекстСообщения = ТекстСообщения + Символы.ПС + РезультатВыполнения.ОписаниеОшибки;
				КонецЕсли;
				
				Попытка
					ОбщегоНазначенияБПОКлиент.ЗаписатьОшибкуВЖурналРегистрации(
						НСтр("ru = 'Подключаемое оборудование.'"),
						ТекстСообщения);
				Исключение
					ОбщегоНазначенияБПОКлиент.СообщитьПользователю(РезультатВыполнения.ОписаниеОшибки);
				КонецПопытки;
			КонецЕсли;
			
			РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Истина, ТекстСообщения, ПараметрыВыполнениеКоманды.ИдентификаторУстройства);
			// Отключение оборудования.
			ОтключитьОборудованиеПослеВыполнениеКоманды(ПараметрыВыполнениеКоманды, РезультатВыполнения);
		Иначе
			
			ПараметрыВыполнениеКоманды.Вставить("ОписаниеОшибки", РезультатВыполнения.ОписаниеОшибки);
			ТекстСообщения = РезультатВыполнения.ОписаниеОшибки + Символы.ПС
				+ НСтр("ru = 'Продолжить без печати слип-чека?'") + Символы.ПС
				+ НСтр("ru = 'ВНИМАНИЕ:'") + Символы.ПС
				+ НСтр("ru = 'При отмене выполнится отмена операции на эквайринговом терминале.'") + Символы.ПС
				+ НСтр("ru = 'Подготовьте банковскую карту покупателя.'");
			Оповещение = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПослеЗакрытияВопроса", ЭтотОбъект, ПараметрыВыполнениеКоманды);
			ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ОКОтмена, ,, НСтр("ru = 'При печати слип-чека произошла ошибка'"));  
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры  

// Завершение отмены операции
// 
// Параметры:
//  РезультатВыполнения - Структура
//  ПараметрыВыполнениеКоманды - Структура
// 
Процедура НачатьВыполнениеКоманды_ОтменаОперацииИЗавершение(РезультатВыполнения, ПараметрыВыполнениеКоманды) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяПлатежныеСистемы() Тогда
		МодульОборудованиеПлатежныеСистемыКлиентСервер = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеПлатежныеСистемыКлиентСервер");
		ПараметрыОперации = МодульОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации();
		ЗаполнитьЗначенияСвойств(ПараметрыОперации, ПараметрыВыполнениеКоманды.ДанныеОперации, , "ИдентификаторЗапроса");
		ЛогированиеОперацийБПОСлужебныйВызовСервера.ЗаписатьИсториюПлатежнойОперации("EmergencyVoid", ПараметрыОперации, РезультатВыполнения);
	КонецЕсли;
	
	Если РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru='Эквайринговая операция отменена - ошибка печати слип чека возникла ошибка.'");
	Иначе
		ТекстСообщения = НСтр("ru='Ошибка отмены операции транзакции. Обратитесь в банк.'");
	КонецЕсли;
	
	Если ПараметрыВыполнениеКоманды.Свойство("ОписаниеОшибки") Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + ПараметрыВыполнениеКоманды.ОписаниеОшибки;
	КонецЕсли;
	
	РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ТекстСообщения, ПараметрыВыполнениеКоманды.ИдентификаторУстройства);
	// Отключение оборудования.
	ОтключитьОборудованиеПослеВыполнениеКоманды(ПараметрыВыполнениеКоманды, РезультатВыполнения);
	
КонецПроцедуры  

// Отключение оборудования 
// 
// Параметры:
//  ПараметрыВыполнениеКоманды - Структура
//  РезультатОперации - Структура
//
Процедура ОтключитьОборудованиеПослеВыполнениеКоманды(ПараметрыВыполнениеКоманды, РезультатОперации = Неопределено) Экспорт
	
	Если ПараметрыВыполнениеКоманды.Свойство("ПечатающееУстройствоДополнительныхДокументов") И ЗначениеЗаполнено(ПараметрыВыполнениеКоманды.ПечатающееУстройствоДополнительныхДокументов) Тогда
		НачатьОтключениеОборудованиеПоИдентификатору(Неопределено, ПараметрыВыполнениеКоманды.ИдентификаторКлиента, ПараметрыВыполнениеКоманды.ПечатающееУстройствоДополнительныхДокументов);
	КонецЕсли;
	
	КонтекстВыполнения = Новый Структура();   
	КонтекстВыполнения.Вставить("РезультатОперации", РезультатОперации);
	КонтекстВыполнения.Вставить("ПараметрыВыполнениеКоманды", ПараметрыВыполнениеКоманды);
	
	Если ПараметрыВыполнениеКоманды.ПечатающееУстройствоПодключено И НЕ ПараметрыВыполнениеКоманды.ПечатающееУстройствоБылоПодключенное Тогда                               
			ОповещениеПриОтключении = Новый ОписаниеОповещения("ОтключитьОборудованиеПослеВыполнениеКоманды_ОтключитьПечатающееУстройствоЗавершение", ЭтотОбъект, КонтекстВыполнения);
		НачатьОтключениеОборудованиеПоИдентификатору(ОповещениеПриОтключении, ПараметрыВыполнениеКоманды.ИдентификаторКлиента, ПараметрыВыполнениеКоманды.ПечатающееУстройство);
	Иначе
		ОтключитьОборудованиеПослеВыполнениеКоманды_ОтключитьПечатающееУстройствоЗавершение(Неопределено, КонтекстВыполнения);
	КонецЕсли;     
	
КонецПроцедуры                  

// Завершение отключения оборудования
// 
Процедура ОтключитьОборудованиеПослеВыполнениеКоманды_ОтключитьПечатающееУстройствоЗавершение(РезультатОтключения, КонтекстВыполнения) Экспорт
	
	ПараметрыВыполнениеКоманды = КонтекстВыполнения.ПараметрыВыполнениеКоманды;
	РезультатОперации = КонтекстВыполнения.РезультатОперации;    
	
	
	Если ПараметрыВыполнениеКоманды.ПодключенноеУстройство.Свойство("СетевоеОборудование") Тогда
	СетевоеОборудование = ПараметрыВыполнениеКоманды.ПодключенноеУстройство.СетевоеОборудование;
	иначе
	СетевоеОборудование = ПараметрыВыполнениеКоманды.СетевоеОборудование;
	КонецЕсли;

	ОтключениеОборудования = ПараметрыВыполнениеКоманды.Подключено;
	
	Если ПараметрыВыполнениеКоманды.Свойство("ОставитьПодключенным") И ПараметрыВыполнениеКоманды.ОставитьПодключенным Тогда
		ОтключениеОборудования = Ложь;
	КонецЕсли;
	
	Если ОтключениеОборудования Или СетевоеОборудование Тогда
		
		Если РезультатОперации <> Неопределено Тогда
			КонтекстВыполнения = Новый Структура();   
			КонтекстВыполнения.Вставить("РезультатОперации", РезультатОперации);
			КонтекстВыполнения.Вставить("ПараметрыВыполнениеКоманды", ПараметрыВыполнениеКоманды);
			ОповещениеПриОтключении = Новый ОписаниеОповещения("ОтключитьОборудованиеПослеВыполнениеКоманды_ОтключитьЗавершение", ЭтотОбъект, КонтекстВыполнения);
		Иначе  
			ОповещениеПриОтключении = Неопределено;
		КонецЕсли;
			
		НачатьОтключениеОборудованиеПоИдентификатору(ОповещениеПриОтключении, ПараметрыВыполнениеКоманды.ИдентификаторКлиента, ПараметрыВыполнениеКоманды.ИдентификаторУстройства);
		
	Иначе   
		Если РезультатОперации <> Неопределено Тогда
			ЗавершениеВыполнениеКоманды(РезультатОперации, ПараметрыВыполнениеКоманды);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 


// Завершение отключения оборудования
// 
Процедура ОтключитьОборудованиеПослеВыполнениеКоманды_ОтключитьЗавершение(РезультатОтключения, КонтекстВыполнения) Экспорт
	
	ПараметрыВыполнениеКоманды = КонтекстВыполнения.ПараметрыВыполнениеКоманды;
	РезультатОперации = КонтекстВыполнения.РезультатОперации;           
	
	ЗавершениеВыполнениеКоманды(РезультатОперации, ПараметрыВыполнениеКоманды);
	
КонецПроцедуры 

// Начать получение параметров устройства
//
// Параметры:
//  ОповещениеПриЗавершении - ОписаниеОповещения - событие описания оповещения.
//  ИдентификаторКлиента - УникальныйИдентификатор - уникальный идентификатор клиента.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - подключаемое устройство.
//
Процедура НачатьПолучениеПараметровУстройства(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства) Экспорт
	
	Если ИдентификаторУстройства = Неопределено Или ПустаяСтрока(ИдентификаторУстройства) Тогда
		Если ОповещениеПриЗавершении <> Неопределено Тогда
			ОписаниеОшибки = НСтр("ru='Устройство не выбрано или не подключено.'");
			РезультатОперации = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
		Возврат;
	КонецЕсли;

	// Поиск подключенного устройства.
	ПодключенноеУстройство = ПолучитьПодключенноеУстройство(ИдентификаторУстройства);      
	Если ПодключенноеУстройство = Неопределено Тогда
		ПараметрыВыполнениеКоманды = Новый Структура();
		ПараметрыВыполнениеКоманды.Вставить("ОповещениеПриЗавершении", ОповещениеПриЗавершении);  
		ПараметрыВыполнениеКоманды.Вставить("ИдентификаторКлиента"   , ИдентификаторКлиента);
		ПараметрыВыполнениеКоманды.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьПолучениеПараметровУстройства_ПодключениеЗавершение", ЭтотОбъект, ПараметрыВыполнениеКоманды);
		НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, ИдентификаторКлиента, ИдентификаторУстройства);
	Иначе                                                                                                                       
		ПараметровУстройства = МенеджерОборудованияКлиентСервер.ПараметрыПодключения(ПодключенноеУстройство);
		РезультатОперации = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Истина, Неопределено, ИдентификаторУстройства);
		РезультатОперации.ПодключенноеУстройство = ПодключенноеУстройство; 
		РезультатОперации.Вставить("ПараметровУстройства", ПараметровУстройства);
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;    
	
КонецПроцедуры

// Завершение подключения оборудования
// 
// Параметры:
//  РезультатПодключения - Структура
//  ПараметрыВыполнениеКоманды - Структура
// 
Процедура НачатьПолучениеПараметровУстройства_ПодключениеЗавершение(РезультатПодключения, ПараметрыВыполнениеКоманды) Экспорт
	
	Если РезультатПодключения.Результат Тогда  
		ПодключенноеУстройство = РезультатПодключения.ПодключенноеУстройство;   
		ПараметровУстройства = МенеджерОборудованияКлиентСервер.ПараметрыПодключения(ПодключенноеУстройство);  
		РезультатПодключения.Вставить("ПараметровУстройства", ПараметровУстройства);
		ВыполнитьОбработкуОповещения(ПараметрыВыполнениеКоманды.ОповещениеПриЗавершении, РезультатПодключения);
		НачатьОтключениеОборудованиеПоИдентификатору(Неопределено, ПараметрыВыполнениеКоманды.ИдентификаторКлиента, ПараметрыВыполнениеКоманды.ИдентификаторУстройства);
	Иначе
		ВыполнитьОбработкуОповещения(ПараметрыВыполнениеКоманды.ОповещениеПриЗавершении, РезультатПодключения);
	КонецЕсли;
	
КонецПроцедуры

// Начинает выполнение операции на эквайринговом терминале.
// 
Процедура НачатьВыполнениеКоманды_ПослеЗакрытияВопроса(Результат, ПараметрыВыполнениеКоманды) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда    
		ПодключенноеУстройство = ПараметрыВыполнениеКоманды.ПодключенноеУстройство;
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ОтменаОперацииИЗавершение", ЭтотОбъект, ПараметрыВыполнениеКоманды);
		ПодключенноеУстройство.ОбработчикДрайвера.НачатьВыполнениеКоманды(ОписаниеОповещения, ПодключенноеУстройство, "EmergencyVoid", ПараметрыВыполнениеКоманды.ДанныеОперации);  
	Иначе
		// Отключение оборудования.
		ОтключитьОборудованиеПослеВыполнениеКоманды(ПараметрыВыполнениеКоманды, ПараметрыВыполнениеКоманды.РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры  

#КонецОбласти

#Область Интерфейсные

// Открытие формы драйверов оборудования.
//
// Параметры:
//  ПараметрКоманды - Произвольный - источник, в котором реализована команда
//  ПараметрыВыполненияКоманды - ПараметрыВыполненияКоманды
//
Процедура ОткрытьДрайверыОборудования(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
#Если Не МобильноеПриложениеКлиент Тогда 
	// Замер производительности.
	КлючеваяОперация = "ОбщийМодуль.МенеджерОборудованияКлиент.ОткрытьДрайверыОборудования";
	ОбщегоНазначенияБПОКлиент.ЗамерВремениБПО(КлючеваяОперация, Неопределено, Ложь, Истина);
#КонецЕсли
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Справочник.ДрайверыОборудования.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

// Открытие формы списка платежных операций
//
// Параметры:
//  ПараметрКоманды - Произвольный - источник, в котором реализована команда
//  ПараметрыВыполненияКоманды - ПараметрыВыполненияКоманды
//
Процедура ОткрытьПлатежныеОперации(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	// ++ НеМобильноеПриложение
#Если Не МобильноеПриложениеКлиент Тогда 
	// Замер производительности.
	КлючеваяОперация = "ОбщийМодуль.МенеджерОборудованияКлиент.ОткрытьПлатежныеОперации";
	ОбщегоНазначенияБПОКлиент.ЗамерВремениБПО(КлючеваяОперация, Неопределено, Ложь, Истина);
#КонецЕсли
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("РегистрСведений.ПлатежныеОперации.ФормаСписка", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно);
	// -- НеМобильноеПриложение
	
КонецПроцедуры

// Открытие формы списка фискальных операций
//
// Параметры:
//  ПараметрКоманды - Произвольный - источник, в котором реализована команда
//  ПараметрыВыполненияКоманды - ПараметрыВыполненияКоманды
//
Процедура ОткрытьФискальныеОперации(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
#Если Не МобильноеПриложениеКлиент Тогда 
	// Замер производительности.
	КлючеваяОперация = "ОбщийМодуль.МенеджерОборудованияКлиент.ОткрытьФискальныеОперации";
	ОбщегоНазначенияБПОКлиент.ЗамерВремениБПО(КлючеваяОперация, Неопределено, Ложь, Истина);
#КонецЕсли
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("РегистрСведений.ФискальныеОперации.ФормаСписка", 
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

// Открытие формы списка операций очереди чеков
//
// Параметры:
//  ПараметрКоманды - Произвольный - источник, в котором реализована команда
//  ПараметрыВыполненияКоманды - ПараметрыВыполненияКоманды
//
Процедура ОткрытьОчередьЧеков(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ОткрытьОчередьЧеков(ПараметрКоманды, ПараметрыВыполненияКоманды);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УпрощениеНастройкиПараметров

// Начинает асинхронное заполнение ключевых параметров оборудования по идентификатору
//
// Параметры:
//  ОповещениеЗавершения  - ОписаниеОповещения - оповещение которое будет вызвано по результатам заполнения параметров
//  Идентификатор - СправочникСсылка.ПодключаемоеОборудование - идентификатор оборудования
Процедура НачатьПолучениеКлючевыхПараметров(ОповещениеЗавершения, Идентификатор) Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("КлючевыеПараметры",    Новый Структура());
	Контекст.Вставить("ОповещениеЗавершения", ОповещениеЗавершения);
	Контекст.Вставить("Идентификатор",        Идентификатор);

	Оповещение = Новый ОписаниеОповещения("НачатьПолучениеКлючевыхПараметровЗавершение", ЭтотОбъект, Контекст);
	НачатьПолучениеОписанияОборудования(Оповещение, Идентификатор);

КонецПроцедуры

// Завершает асинхронное заполнение ключевых параметров оборудования по идентификатору
//
// Параметры:
//  Результат - Структура
//  Контекст - Структура
Процедура НачатьПолучениеКлючевыхПараметровЗавершение(Результат, Контекст) Экспорт
	
	ОповещениеЗавершения = Контекст.ОповещениеЗавершения;

	Если Результат.Результат Тогда
	
		Идентификатор      = Контекст.Идентификатор;
		КлючевыеПараметры  = Контекст.КлючевыеПараметры;
		ОписаниеИнтерфейса = Результат.ОписаниеДрайвера.ПараметрыДрайвера;
		
		ПрочитатьАтрибутыКлючевыхПараметров(ОписаниеИнтерфейса, КлючевыеПараметры);
	
		ПодключаемоеОборудование = ПодключаемоеОборудование();
		Если Не ПодключаемоеОборудование.Свойство("СобственныеПараметрыОборудования") Тогда
			ПодключаемоеОборудование.Вставить("СобственныеПараметрыОборудования", Новый Соответствие());
		КонецЕсли;
		ПодключаемоеОборудование.СобственныеПараметрыОборудования.Вставить(Идентификатор, КлючевыеПараметры);
		
		// добавить общие параметры
		Если Не КлючевыеПараметры.Свойство("LogEnabled") Тогда
			ДобавитьПараметрЛогДрайвераВключен(КлючевыеПараметры, Результат.ОписаниеДрайвера.ЛогДрайвераВключен);
		КонецЕсли;
		Если Не КлючевыеПараметры.Свойство("LogPath") Тогда
			ДобавитьПараметрЛогДрайвераПутьКФайлу(КлючевыеПараметры, Результат.ОписаниеДрайвера.ЛогДрайвераПутьКФайлу);
		КонецЕсли;
		
		
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения, Истина);
	Иначе
		ВыполнитьОбработкуОповещения(ОповещениеЗавершения, Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает атрибуты параметра оборудования по стандартному имени параметра, имя проверяется по словарю возможных вариантов
//
// Параметры:
//  Идентификатор - СправочникСсылка.ПодключаемоеОборудование - идентификатор оборудования
//  ИмяПараметра - Строка - стандартное имя параметра оборудования
//
// Возвращаемое значение:
//  - Неопределено
//  - Структура - см. НовыйАтрибутыПараметра
//
Функция АтрибутыПараметра(Идентификатор, ИмяПараметра) Экспорт

	ПодключаемоеОборудование = ПодключаемоеОборудование();
	Если Не ПодключаемоеОборудование.Свойство("СобственныеПараметрыОборудования") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КлючевыеПараметры = ПодключаемоеОборудование.СобственныеПараметрыОборудования.Получить(Идентификатор);
	Если КлючевыеПараметры = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	АтрибутыПараметра = Неопределено;
	Если Не КлючевыеПараметры.Свойство(ИмяПараметра, АтрибутыПараметра) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат АтрибутыПараметра;

КонецФункции

// Возвращает Истина если параметр с именем ИмяПараметра существует, имя проверяется по словарю возможных вариантов
//
// Параметры:
//  Идентификатор - СправочникСсылка.ПодключаемоеОборудование - идентификатор оборудования
//  ИмяПараметра - Строка - стандартное имя параметра оборудования
//
// Возвращаемое значение:
//  Булево - 
Функция ПараметрСуществует(Идентификатор, ИмяПараметра) Экспорт

	АтрибутыПараметра = АтрибутыПараметра(Идентификатор, ИмяПараметра);
	Возврат АтрибутыПараметра <> Неопределено;

КонецФункции

// Возвращает тип параметра оборудования по стандартному имени параметра, имя проверяется по словарю возможных вариантов
//
// Параметры:
//  Идентификатор - СправочникСсылка.ПодключаемоеОборудование - идентификатор оборудования
//  ИмяПараметра - Строка - стандартное имя параметра оборудования
//
// Возвращаемое значение:
//   Тип - Тип - Тип значения параметра (Число, Строка, Булево)
Функция ТипПараметра(Идентификатор, ИмяПараметра) Экспорт
	
	АтрибутыПараметра = АтрибутыПараметра(Идентификатор, ИмяПараметра);
	Если АтрибутыПараметра = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат АтрибутыПараметра.Тип;

КонецФункции

// Возвращает значение параметра оборудования по стандартному имени параметра, имя проверяется по словарю возможных вариантов
//
// Параметры:
//  Идентификатор - СправочникСсылка.ПодключаемоеОборудование - идентификатор оборудования
//  ИмяПараметра - Строка - стандартное имя параметра оборудования
//
// Возвращаемое значение:
//  Число, Строка, Булево, Неопределено - установленное значение параметра
Функция ЗначениеПараметра(Идентификатор, ИмяПараметра) Экспорт

	АтрибутыПараметра = АтрибутыПараметра(Идентификатор, ИмяПараметра);
	Если АтрибутыПараметра = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если АтрибутыПараметра.Стандартный Тогда
		Возврат АтрибутыПараметра.ЗначениеСтандартного;
	КонецЕсли;
	
	ПараметрыУстройства = МенеджерОборудованияВызовСервера.ПараметрыУстройства(Идентификатор);
	ИмяРеквизита        = АтрибутыПараметра.ИмяРеквизита;
	ЗначениеПараметра   = Неопределено;
	Если Не ПараметрыУстройства.Свойство(ИмяРеквизита, ЗначениеПараметра) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если АтрибутыПараметра.Преобразование = "Инвертировать" И АтрибутыПараметра.Тип = Тип("Булево") Тогда
		ЗначениеПараметра = Не ЗначениеПараметра;
	КонецЕсли;
	
	Возврат ЗначениеПараметра;

КонецФункции

// Устанавливает значение параметра оборудования по стандартному имени параметра, имя проверяется по словарю возможных вариантов
//
// Параметры:
//  Идентификатор - СправочникСсылка.ПодключаемоеОборудование - идентификатор оборудования
//  ИмяПараметра - Строка - стандартное имя параметра оборудования
//  НовоеЗначение - Число, Строка, Булево, Неопределено - новое значение параметра которое требуется установить
// 
// Возвращаемое значение:
//  Булево - результат выполнения
Функция УстановитьЗначениеПараметра(Идентификатор, ИмяПараметра, НовоеЗначение) Экспорт
	
	АтрибутыПараметра = АтрибутыПараметра(Идентификатор, ИмяПараметра);
	Если АтрибутыПараметра = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если АтрибутыПараметра.ТолькоЧтение Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыУстройства = МенеджерОборудованияВызовСервера.ПараметрыУстройства(Идентификатор);
	ИмяРеквизита        = АтрибутыПараметра.ИмяРеквизита;
	Если АтрибутыПараметра.Преобразование = "Инвертировать" И АтрибутыПараметра.Тип = Тип("Булево") Тогда
		НовоеЗначение = Не НовоеЗначение;
	КонецЕсли;
	ПараметрыУстройства.Вставить(ИмяРеквизита, НовоеЗначение);
	
	
	Возврат МенеджерОборудованияВызовСервера.СохранитьПараметрыУстройства(Идентификатор, ПараметрыУстройства);
	
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

#Область Системные

//// Устарела: следует использовать ИнтеграцияПодсистемБПОКлиент.ПередНачаломРаботыСистемы.
//// Вызываемая перед началом работы системы.
////
//Процедура ПередНачаломРаботыСистемы() Экспорт
//	
//	ИнтеграцияПодсистемБПОКлиент.ПередНачаломРаботыСистемы();
//	
//КонецПроцедуры

//// Устарела: следует использовать ИнтеграцияПодсистемБПОКлиент.ПриНачалеРаботыСистемы.
//// Функция, вызываемая при начале работы системы.
////
//Процедура ПриНачалеРаботыСистемы() Экспорт
//	
//	ИнтеграцияПодсистемБПОКлиент.ПриНачалеРаботыСистемы();
//	
//КонецПроцедуры

//// Устарела: следует использовать ИнтеграцияПодсистемБПОКлиент.ПередЗавершениемРаботыСистемы.
////
//Процедура ПередЗавершениемРаботыСистемы() Экспорт
//	
//	ИнтеграцияПодсистемБПОКлиент.ПередЗавершениемРаботыСистемы();
//	
//КонецПроцедуры

// Устарела: следует использовать ОбщегоНазначенияБПОКлиент.ДатаСеанса.
// Возвращает текущую дату, приведенную к часовому поясу сеанса.
// Предназначена для использования вместо функции ТекущаяДата().
//
// Возвращаемое значение:
//  Дата.
//
Функция ДатаСеанса() Экспорт
	
	Возврат ОбщегоНазначенияБПОКлиент.ДатаСеанса();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область РаспределеннаяФискализации

// Устарела: следует использовать РаспределеннаяФискализацияКлиент.ПодключениеСистемыВзаимодействия.
// Подключает обработчики системы оповещения, для использования в распределенной фискализации
//
Процедура ПодключениеСистемыВзаимодействия() Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ПодключениеСистемыВзаимодействия(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать РаспределеннаяФискализацияКлиент.ОбработкаОповещенияПодключенияСообщенийФискализации.
// Завершение подключения обработчика системы оповещения
// 
// Параметры:
//  ДополнительныеПараметры - Произвольный
// 
Процедура ОбработкаОповещенияПодключенияСообщенийФискализации(ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ОбработкаОповещенияПодключенияСообщенийФискализации(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать РаспределеннаяФискализацияКлиент.ОбработкаОповещенияСообщенийФискализации.
// Обработчик появлении новых сообщений в обсуждении 
//
// Параметры:
//  Сообщение - СообщениеСистемыВзаимодействия
//  ДополнительныеПараметры - Произвольный
// 
Процедура ОбработкаОповещенияСообщенийФискализации(Сообщение, ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ОбработкаОповещенияСообщенийФискализации(Сообщение, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать РаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди_ПослеОткрытияЧека.
// Обработчик после открытия чека.
//
// Параметры:
//  ПараметрыВыполнения - Структура - Параметры выполнения команды
//  ДополнительныеПараметры - Произвольный
//
Процедура ФискализацияЧековВОчереди_ПослеОткрытияЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди_ПослеОткрытияЧека(ПараметрыВыполнения, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать РаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди_ПослеОшибкиПечатиЧека.
// Обработчик после ошибки печати чека.
//
// Параметры:
//  ПараметрыВыполнения - Структура - Параметры выполнения команды
//  ДополнительныеПараметры - Произвольный
//
Процедура ФискализацияЧековВОчереди_ПослеОшибкиПечатиЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди_ПослеОшибкиПечатиЧека(ПараметрыВыполнения, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать РаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди_Завершение.
// Завершение фискализации чеков в очереди
// 
// Параметры:
//  РезультатВыполнения - Структура
//  ОбщиеПараметры - Структура
// 
Процедура ФискализацияЧековВОчереди_Завершение(РезультатВыполнения, ОбщиеПараметры) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди_Завершение(РезультатВыполнения, ОбщиеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать РаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди_ЗавершениеПакетнойОперации.
// Завершение фискализации пакетной операции в очереди
// 
// Параметры:
//  РезультатВыполнения - см. ОборудованиеЧекопечатающиеУстройстваКлиент.РезультатПродажаСВыдачейНаличных
//  ОбщиеПараметры - Структура
// 
Процедура ФискализацияЧековВОчереди_ЗавершениеПакетнойОперации(РезультатВыполнения, ОбщиеПараметры) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди_ЗавершениеПакетнойОперации(РезультатВыполнения, ОбщиеПараметры);
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать РаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди_Начало.
// Начать фискализацию чеков в очереди
// 
// Параметры:
//  Параметры - см. ПараметрыФискализацииОчередиЧеков
Процедура ФискализацияЧековВОчереди_Начало(Параметры = Неопределено) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди_Начало(Параметры);
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать РаспределеннаяФискализацияКлиент.ПараметрыФискализацииОчередиЧеков.
// Возвращает структуру параметров для выполнения фискализации очереди чеков
// 
// Возвращаемое значение:
//  Структура:
//   * Форма - ФормаКлиентскогоПриложения
//   * КассаККМ - ОпределяемыйТип.КассаБПО
Функция ПараметрыФискализацииОчередиЧеков() Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		Возврат МодульРаспределеннаяФискализацияКлиент.ПараметрыФискализацииОчередиЧеков();
	КонецЕсли;
	
КонецФункции

// Устарела: следует использовать РаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди.
// Выполнить фискализацию чеков в очереди
//
// Параметры:
//  РазрешенаАвтоматическаяФискализация - Булево
//  Параметры - см. ПараметрыФискализацииОчередиЧеков.
Процедура ФискализацияЧековВОчереди(РазрешенаАвтоматическаяФискализация = Истина, Параметры = Неопределено) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяРаспределеннаяФискализация() Тогда
		МодульРаспределеннаяФискализацияКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("РаспределеннаяФискализацияКлиент");
		МодульРаспределеннаяФискализацияКлиент.ФискализацияЧековВОчереди(РазрешенаАвтоматическаяФискализация, Параметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ВыборКодаВидаНоменклатурнойКлассификации

// Устарела: больше не используется
// Процедура открывает форму выбора кода вида номенклатурной классификации
//
// Параметры:
//  ОповещениеПриВыборе - ОписаниеОповещения - событие описания оповещения.
//
Процедура НачатьВыборКодаВидаНоменклатурнойКлассификации(ОповещениеПриВыборе) Экспорт
	
	// ++ Локализация
	ПараметрыКоманды = Новый Структура("ОповещениеПриВыборе", ОповещениеПриВыборе);
	Обработчик = Новый ОписаниеОповещения("НачатьВыборКодаВидаНоменклатурнойКлассификации_Завершение", ЭтотОбъект, ПараметрыКоманды);
	ОткрытьФорму("ОбщаяФорма.КодВидаНоменклатурнойКлассификации", ,,,  ,, Обработчик, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	// -- Локализация
	
КонецПроцедуры

// Устарела: больше не используется
// Завершение выбора 
// 
// Параметры:
//  Результат - Структура
//  Параметры - Структура
// 
Процедура НачатьВыборКодаВидаНоменклатурнойКлассификации_Завершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
			Если Параметры.ОповещениеПриВыборе <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриВыборе, Результат);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ККТ

// Устарела: следует использовать ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОткрытиеСессииРегистрацииКМ.
// Осуществляет открытие сессии регистрации КМ.
//
// Параметры:
//  ОповещениеПриЗавершении - ОписаниеОповещения - обработчик результата.
//  УникальныйИдентификатор - УникальныйИдентификатор - Идентификатор формы.
//  Параметры - Структура - Содержит параметры выполнения операции.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - Устройство.
//
Процедура НачатьОткрытиеСессииРегистрацииКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, Параметры = Неопределено, ИдентификаторУстройства = Неопределено) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяЧекопечатающиеУстройства() Тогда
		МодульОборудованиеЧекопечатающиеУстройстваКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиент");
		МодульОборудованиеЧекопечатающиеУстройстваКлиент.НачатьОткрытиеСессииРегистрацииКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства, Параметры); 
	Иначе
		РезультатОперации                = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании();
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = НСтр("ru = 'Подсистема Чекопечатающие устройства не используется'");
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗакрытииСессииРегистрацииКМ.
// Осуществляет закрытии сессии регистрации КМ.
//
// Параметры:
//  ОповещениеПриЗавершении - ОписаниеОповещения - обработчик результата.
//  УникальныйИдентификатор - УникальныйИдентификатор - Идентификатор формы.
//  Параметры - Структура - Содержит параметры выполнения операции.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - Устройство.
//
Процедура НачатьЗакрытииСессииРегистрацииКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, Параметры = Неопределено, ИдентификаторУстройства = Неопределено) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяЧекопечатающиеУстройства() Тогда
		МодульОборудованиеЧекопечатающиеУстройстваКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиент");
		МодульОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗакрытииСессииРегистрацииКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства, Параметры); 
	Иначе
		РезультатОперации                = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании();
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = НСтр("ru = 'Подсистема Чекопечатающие устройства не используется'");
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗапросКМ.
// Осуществляет запрос КМ.
//
// Параметры:
//  ОповещениеПриЗавершении - ОписаниеОповещения - обработчик результата.
//  УникальныйИдентификатор - УникальныйИдентификатор - Идентификатор формы.
//  Параметры - Структура - Содержит параметры выполнения операции.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - Устройство.
//
Процедура НачатьЗапросКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, Параметры, ИдентификаторУстройства = Неопределено) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяЧекопечатающиеУстройства() Тогда
		ДополнительныеПараметры = МенеджерОборудованияКлиентСервер.ДополнительныеПараметрыОперации(Истина);
		МодульОборудованиеЧекопечатающиеУстройстваКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиент");
		МодульОборудованиеЧекопечатающиеУстройстваКлиент.НачатьЗапросКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства, Параметры, ДополнительныеПараметры);
	Иначе
		РезультатОперации                = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании();
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = НСтр("ru = 'Подсистема Чекопечатающие устройства не используется'");
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолученияРезультатовЗапросаКМ.
// Начать получения результатов запроса КМ.
//
// Параметры:
//  ОповещениеПриЗавершении - ОписаниеОповещения - обработчик результата.
//  УникальныйИдентификатор - УникальныйИдентификатор - Идентификатор формы.
//  Параметры - Структура - Содержит параметры выполнения операции.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - Устройство.
//
Процедура НачатьПолученияРезультатовЗапросаКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, Параметры, ИдентификаторУстройства = Неопределено) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяЧекопечатающиеУстройства() Тогда
		МодульОборудованиеЧекопечатающиеУстройстваКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиент");
		МодульОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПолученияРезультатовЗапросаКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства, Параметры);
	Иначе
		РезультатОперации                = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании();
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = НСтр("ru = 'Подсистема Чекопечатающие устройства не используется'");
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
КонецПроцедуры

// Устарела: следует использовать ОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПодтверждениеКМ.
// Начать подтверждение КМ.
//
// Параметры:
//  ОповещениеПриЗавершении - ОписаниеОповещения - обработчик результата.
//  УникальныйИдентификатор - УникальныйИдентификатор - Идентификатор формы.
//  Параметры - Структура - Содержит параметры выполнения операции.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - Устройство.
//
Процедура НачатьПодтверждениеКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, Параметры, ИдентификаторУстройства = Неопределено) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяЧекопечатающиеУстройства() Тогда
		МодульОборудованиеЧекопечатающиеУстройстваКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("ОборудованиеЧекопечатающиеУстройстваКлиент");
		МодульОборудованиеЧекопечатающиеУстройстваКлиент.НачатьПодтверждениеКМ(ОповещениеПриЗавершении, УникальныйИдентификатор, ИдентификаторУстройства, Параметры);
	Иначе
		РезультатОперации                = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании();
		РезультатОперации.Результат      = Ложь;
		РезультатОперации.ОписаниеОшибки = НСтр("ru = 'Подсистема Чекопечатающие устройства не используется'");
		ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ТСД

#КонецОбласти

#Область ЭлектронныеВесы

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Подключение оборудования рекурсивно
// 
// Параметры:
//  РезультатПодключения - Структура
//  Контекст - Структура
//   * ПараметрыПодключения - Структура
//   * ОповещениеПриПодключении - ОписаниеОповещения
Процедура НачатьПодключениеОборудованияРекурсивно(РезультатПодключения, Контекст) Экспорт
	
	ОборудованиеДляПодключения = Контекст.ОборудованиеДляПодключения;
	Если РезультатПодключения <> Неопределено Тогда
		ОборудованиеДляПодключения.Удалить(ОборудованиеДляПодключения.ВГраница());
		Если РезультатПодключения.Результат Тогда
			ПараметрыПодключения = Контекст.ПараметрыПодключения; // Структура
			ПараметрыПодключения.Клиенты.Добавить(Контекст.ИдентификаторКлиента);
			ПараметрыПодключения.КоличествоПодключенных = 1;
			ПодключаемоеОборудование = ПодключаемоеОборудование();
			ПодключаемоеОборудование.ПараметрыПодключенияПО.Добавить(ПараметрыПодключения);
			
			Если Контекст.ОповещениеПриПодключении <> Неопределено Тогда
				Результат = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Истина);
				Результат.ПодключенноеУстройство  = ПараметрыПодключения;
				Результат.ИдентификаторУстройства = ПараметрыПодключения.ИдентификаторУстройства;
				ВыполнитьОбработкуОповещения(Контекст.ОповещениеПриПодключении, Результат);
			КонецЕсли;
		Иначе
			Если Контекст.ОповещениеПриПодключении <> Неопределено Тогда
				ПараметрыПодключения = Контекст.ПараметрыПодключения; // Структура
				ОписаниеОшибки = СтрШаблон(
					НСтр("ru='Не удалось подключить устройство (%1): %2'"), 
					ПараметрыПодключения.Наименование, 
					РезультатПодключения.ОписаниеОшибки);
				Результат = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
				Результат.ИдентификаторУстройства = ПараметрыПодключения.ИдентификаторУстройства;
				Результат.ОшибкаЗагрузки = РезультатПодключения.ОшибкаЗагрузки;
				ВыполнитьОбработкуОповещения(Контекст.ОповещениеПриПодключении, Результат);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ОборудованиеДляПодключения.Количество()>0 Тогда
		Оповещение       = Новый ОписаниеОповещения("НачатьПодключениеОборудованияРекурсивно", ЭтотОбъект, Контекст);
		Устройство       = ОборудованиеДляПодключения[ОборудованиеДляПодключения.ВГраница()];
		НовоеПодключение = ПараметрыПодключенияУстройства(Устройство);
		Контекст.ПараметрыПодключения = НовоеПодключение;
		НовоеПодключение.ОбработчикДрайвера.НачатьПодключениеУстройства(Оповещение, НовоеПодключение);
	КонецЕсли;
	
КонецПроцедуры

// Возвращает объект драйвера из локального кеша клиентского приложения
// 
// Параметры:
//   ИдентификаторОбъекта - Строка -
// 
// Возвращаемое значение:
//   ОбъектВнешнейКомпоненты
// 
Функция ОбъектДрайвераИзКэша(ИдентификаторОбъекта) Экспорт
	
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	Для Каждого ДрайверОборудования Из ПодключаемоеОборудование.ДрайверыОборудования Цикл
		Если ДрайверОборудования.Ключ = ИдентификаторОбъекта  Тогда
			ОбъектДрайвера = ДрайверОборудования.Значение;
			Возврат ОбъектДрайвера;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДопустимаУстановкаКомпоненты(ИмяМакета) Экспорт

#Если ВебКлиент Тогда
	Если ОбщегоНазначенияБПОКлиент.ИспользуетсяБСП() Тогда
		Реквизиты = МенеджерОборудованияВызовСервера.СовместимостьВнешнейКомпонентыИзФайла(ИмяМакета);
		Если ЗначениеЗаполнено(Реквизиты) Тогда
			Результат = ТекущийКлиентПоддерживаетсяКомпонентой(Реквизиты);
			Возврат Результат = Истина; // Результат может содержать Неопределено
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли;
#Иначе
	Возврат Истина;
#КонецЕсли

КонецФункции

Процедура УстановитьРежимПодключенияРасширенияИнформацииОКомпьютере(Режим) Экспорт
	
	Если ОбщегоНазначенияБПОКлиент.ЭтоВебКлиент() Тогда
		ИмяПараметра = "БПО.ВыполнятьУстановкуРасширенияИнформацииОКомпьютере";
		ОбщегоНазначенияБПОКлиент.УстановитьПараметрПриложения(ИмяПараметра, Режим);
		МенеджерОборудованияКлиентПереопределяемый.УстановитьРежимПодключенияРасширенияИнформацииОКомпьютере(Режим);
	КонецЕсли;
	
КонецПроцедуры

Процедура НачатьПолучениеMACАдреса(ОбработкаОповещения, УстанавливатьРасширение = Истина, ЗапускПриложения = Ложь) Экспорт
	
#Если ВебКлиент Тогда
	Контекст = Новый Структура();
	Контекст.Вставить("ОбработкаОповещения", ОбработкаОповещения);
	Контекст.Вставить("УстанавливатьРасширение", УстанавливатьРасширение);
	Контекст.Вставить("ЗапускПриложения", ЗапускПриложения);

	Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияПолученияИнформацииОКомпьютере_Завершение", ЭтотОбъект, Контекст);
	НачатьПодключениеРасширенияПолученияИнформацииОКомпьютере(Оповещение);
#Иначе 
	ВыполнитьПолучениеИнформацииОСетевыхАдаптерах(ОбработкаОповещения);
#КонецЕсли
	
КонецПроцедуры

Процедура НачатьПолучениеMACАдресаЗавершение(MACАдрес, Контекст) Экспорт
	
	ПривязатьРабочееМестоПоMACАдресу(Контекст.ИдентификаторКлиента, MACАдрес);
	
КонецПроцедуры

// Выполняет отображение списка рабочих мест для выбора рабочего места к текущему идентификатору веб-клиента
//
// Параметры:
//   ИдентификаторКлиента - Строка
//   MACАдрес - Строка
//
Процедура ПривязатьРабочееМестоПоMACАдресу(ИдентификаторКлиента, MACАдрес) Экспорт
	
	СписокРабочихМест = МенеджерОборудованияВызовСервера.ПривязатьРабочееМестоПоMACАдресу(ИдентификаторКлиента, MACАдрес); 
	Если СписокРабочихМест.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	РабочееМесто = СписокРабочихМест[0];
	ПодключаемоеОборудование().РабочееМесто = РабочееМесто;
	Оповестить("ИзмененоРабочееМестоТекущегоСеанса", РабочееМесто);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПолучениеMACАдреса

Процедура НачатьПодключениеРасширенияПолученияИнформацииОКомпьютере_Завершение(Результат, Контекст) Экспорт
	
	ОбработкаОповещения = Контекст.ОбработкаОповещения;
	УстанавливатьРасширение = Контекст.УстанавливатьРасширение;
	ЗапускПриложения = Контекст.ЗапускПриложения;
	
	Если Результат Тогда
		ВыполнитьПолучениеИнформацииОСетевыхАдаптерах(ОбработкаОповещения);
	Иначе
		Если ЗапускПриложения Тогда
			// при запуске приложения не нужно создавать рабочее место, 
			// т.к. еще не устанавливалось расширение работы с браузером,
			// расширение будет установлено позднее при обращении к оборудованию.
			Возврат;
		КонецЕсли;
		Если УстанавливатьРасширение Тогда
			ВыполнитьУстановкуРасширенияСПомощьюБПО(ОбработкаОповещения);
		Иначе
			Если ОбработкаОповещения <> Неопределено Тогда 
				ВыполнитьОбработкуОповещения(ОбработкаОповещения, Неопределено);
			КонецЕсли;     
		КонецЕсли;
			
	КонецЕсли;
		
КонецПроцедуры

Процедура ВыполнитьУстановкуРасширенияСПомощьюБПО(ОбработкаОповещения)
	
	ИмяПараметра = "БПО.ВыполнятьУстановкуРасширенияИнформацииОКомпьютере";
	ВыполнятьУстановку = ОбщегоНазначенияБПОКлиент.ПараметрПриложения(ИмяПараметра);
	Если ВыполнятьУстановку = Неопределено Тогда
		ВыполнятьУстановку = Истина;
	КонецЕсли;
	Если ВыполнятьУстановку Тогда
		Оповещение = Новый ОписаниеОповещения("ПоказатьВопросНачатьПодключениеРасширения_Завершение", ЭтотОбъект, ОбработкаОповещения);
		ОткрытьФорму("ОбщаяФорма.ВопросОбУстановкеРасширенияРаботыСКомпьютеромБПО",,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Если ОбработкаОповещения <> Неопределено Тогда 
			ВыполнитьОбработкуОповещения(ОбработкаОповещения, Неопределено);
		КонецЕсли;     
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьВопросНачатьПодключениеРасширения_Завершение(Результат, ОбработкаОповещения) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
#Если ВебКлиент Тогда
		Оповещение = Новый ОписаниеОповещения("НачатьУстановкуРасширенияПолученияИнформацииОКомпьютере_Завершение", ЭтотОбъект, ОбработкаОповещения);
		НачатьУстановкуРасширенияПолученияИнформацииОКомпьютере(Оповещение);
#КонецЕсли
	Иначе
		
		УстановитьРежимПодключенияРасширенияИнформацииОКомпьютере(Ложь);
		
		Если ОбработкаОповещения <> Неопределено Тогда 
			ВыполнитьОбработкуОповещения(ОбработкаОповещения, Неопределено);
		КонецЕсли;     
	КонецЕсли;     
	
КонецПроцедуры

Процедура НачатьУстановкуРасширенияПолученияИнформацииОКомпьютере_Завершение(ОбработкаОповещения) Экспорт
	
	Контекст = Новый Структура();
	Контекст.Вставить("ОбработкаОповещения", ОбработкаОповещения);
	Контекст.Вставить("УстанавливатьРасширение", Ложь); // если расширение не установилось, повторно не устанавливать
	Контекст.Вставить("ЗапускПриложения", Ложь);
	
#Если ВебКлиент Тогда
	Оповещение = Новый ОписаниеОповещения("НачатьПодключениеРасширенияПолученияИнформацииОКомпьютере_Завершение", ЭтотОбъект, Контекст);  
	НачатьПодключениеРасширенияПолученияИнформацииОКомпьютере(Оповещение);
#КонецЕсли
	
КонецПроцедуры 

Процедура ВыполнитьПолучениеИнформацииОСетевыхАдаптерах(ОбработкаОповещения) Экспорт
	
#Если МобильныйКлиент Или МобильноеПриложениеКлиент Тогда
	
	НачатьПолучениеИнформацииОСетевыхАдаптерахЗавершение(Новый Массив(), ОбработкаОповещения);
	
#Иначе
	Оповещение = Новый ОписаниеОповещения("НачатьПолучениеИнформацииОСетевыхАдаптерахЗавершение", ЭтотОбъект, ОбработкаОповещения);   
	НачатьПолучениеИнформацииОСетевыхАдаптерах(Оповещение);
	
#КонецЕсли
	
КонецПроцедуры 

Процедура НачатьПолучениеИнформацииОСетевыхАдаптерахЗавершение(Результат, ОбработкаОповещения) Экспорт
	
	Если Результат.Количество() > 0 Тогда
		MACАдрес = Результат[0].MACАдрес;
	Иначе
		MACАдрес = "";
	КонецЕсли;     
	
	Если ОбработкаОповещения <> Неопределено Тогда 
		ВыполнитьОбработкуОповещения(ОбработкаОповещения, MACАдрес);
	КонецЕсли;     
	
КонецПроцедуры 

#КонецОбласти

#Область ПодключениеОборудования

// Начать подключения устройств.
//
// Параметры:
//  ИдентификаторКлиента - УникальныйИдентификатор - уникальный идентификатор клиента.
//  ТипыПО - Структура, Массив из Строка, Строка - тип оборудования для выбора устройства.
//  ИдентификаторУстройства - Массив из Строка, СправочникСсылка.ПодключаемоеОборудование - подключаемое устройство.
//  СетевоеОборудование - Булево - использовать сетевое оборудование при подключении.
//
// Возвращаемое значение:
//  Структура - Результаты подключения устройств.
//
Функция УстройстваДляПодключения(ИдентификаторКлиента, ТипыПО = Неопределено, ИдентификаторУстройства = Неопределено, СетевоеОборудование = Истина)

	ПодключенноеОборудование = Новый Массив(); // Результаты подключения устройств
	ОборудованиеДляПодключения = Новый Массив();
	
	ТекущийЯзык = ТекущийЯзык();
	КодЯзыкаПользователя = ?(ТипЗнч(ТекущийЯзык) = Тип("Строка"), ТекущийЯзык, ТекущийЯзык.КодЯзыка); 
	
	Если ЭтоСписокОборудования(ТипыПО) Тогда
		СписокОборудования = ТипыПО;
	Иначе
		ОборудованияОтбор = МенеджерОборудованияКлиентСервер.СписокОборудованияОтбор();
		ОборудованияОтбор.ТипыПО = ТипыПО;
		ОборудованияОтбор.Идентификатор = ИдентификаторУстройства;
		ОборудованияОтбор.СетевоеОборудование = СетевоеОборудование;
		ОборудованияОтбор.КодЯзыка = КодЯзыкаПользователя;
		СписокОборудования = МенеджерОборудованияВызовСервера.СписокОборудования(ОборудованияОтбор); 
	КонецЕсли;
	
	Если СписокОборудования.Количество() > 0 Тогда
		Для Каждого Устройство Из СписокОборудования Цикл
			// Проверим, не подключено ли устройство ранее.
			ПодключенноеУстройство = ПолучитьПодключенноеУстройство(Устройство.Ссылка);
			Если ПодключенноеУстройство = Неопределено Тогда // Если устройство не было подключено ранее.
				
				Если Устройство.СетевоеОборудование И НЕ Устройство.ДоступноТекущемуПользователю Тогда
					ОписаниеОшибки = НСтр("ru='Нет прав на использование для текущего пользователя.'");
					Результат = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
					Результат.ИдентификаторОбъекта = Устройство.ИдентификаторОбъекта;
					ПодключенноеОборудование.Добавить(Результат);
					Продолжить;
				КонецЕсли;
				
				ОборудованиеДляПодключения.Добавить(Устройство);
				
			Иначе // Устройство было подключено ранее.
				// Увеличим количество пользователей данного соединения.
				ПодключенноеУстройство.Клиенты.Добавить(ИдентификаторКлиента);
				ПодключенноеУстройство.КоличествоПодключенных = ПодключенноеУстройство.КоличествоПодключенных + 1;
				Результат = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Истина, Неопределено, Устройство.Ссылка);
				Результат.ПодключенноеУстройство = ПодключенноеУстройство;
				Результат.ИдентификаторОбъекта   = Устройство.ИдентификаторОбъекта;
				ПодключенноеОборудование.Добавить(Результат);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ИдентификаторУстройства <> Неопределено Тогда
		ОписаниеОшибки = 
			НСтр("ru='Устройство отсутствует на текущем рабочем месте и не может использоваться для подключения. Укажите другое устройство.'");
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
		ПодключенноеОборудование.Добавить(РезультатВыполнения);
	ИначеЕсли ТипыПО = Неопределено И ИдентификаторУстройства = Неопределено Тогда
		ОписаниеОшибки =  НСтр("ru='Нет доступного оборудования для подключения.'");
		РезультатВыполнения = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
		ПодключенноеОборудование.Добавить(РезультатВыполнения);
	КонецЕсли; 
	
	Результат = Новый Структура();
	Результат.Вставить("ПодключенноеОборудование", ПодключенноеОборудование);
	Результат.Вставить("ОборудованиеДляПодключения", ОборудованиеДляПодключения);
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьПоддерживаемыеТипыПодключаемогоОборудованияНаФорме(Форма, ПоддерживаемыеТипыПодключаемогоОборудования)
	
	Если ПоддерживаемыеТипыПодключаемогоОборудования = Неопределено Тогда
		ПоддерживаемыеТипыПодключаемогоОборудования = "";
	КонецЕсли;
	
	Если ТипЗнч(Форма.ПоддерживаемыеТипыПодключаемогоОборудования) = Тип("Строка") Тогда
		Если ТипЗнч(ПоддерживаемыеТипыПодключаемогоОборудования) = Тип("Структура") Тогда
			Форма.ПоддерживаемыеТипыПодключаемогоОборудования = СтруктураТипОборудованияВСтроку(ПоддерживаемыеТипыПодключаемогоОборудования);
		Иначе
			Форма.ПоддерживаемыеТипыПодключаемогоОборудования = ПоддерживаемыеТипыПодключаемогоОборудования;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Форма.ПоддерживаемыеТипыПодключаемогоОборудования) = Тип("Структура") Тогда
		Форма.ПоддерживаемыеТипыПодключаемогоОборудования = ПоддерживаемыеТипыПодключаемогоОборудования;
	ИначеЕсли ТипЗнч(Форма.ПоддерживаемыеТипыПодключаемогоОборудования) = Тип("Массив") Тогда
		ТипыОборудования = ПолучитьТипыОборудования(ПоддерживаемыеТипыПодключаемогоОборудования);
		Форма.ПоддерживаемыеТипыПодключаемогоОборудования = ТипыОборудования;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОтключениеОборудования

// Функция отключает устройства
//
// Параметры:
//  ИдентификаторКлиента - УникальныйИдентификатор
//  ТипыПО - Структура, Массив из Строка, Строка - тип оборудования для отключения устройств.
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - отключаемое устройство.
//      
// Возвращаемое значение:
//  Массив из СправочникСсылка.ПодключаемоеОборудование - Результаты отключения устройств.
//  
Функция УстройстваДляОтключения(ТипыПО = Неопределено, ИдентификаторУстройства = Неопределено) Экспорт
	
	ОтключенноеОборудование  = Новый Массив(); // Результаты отключения устройств  
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	
	Если ТипыПО <> Неопределено Тогда
		ПодключенныеУстройства = ПолучитьПодключенныеУстройства(,ТипыПО,);
	ИначеЕсли ИдентификаторУстройства <> Неопределено Тогда   
		ПодключенноеУстройство = ПолучитьПодключенноеУстройство(ИдентификаторУстройства);
		Если ПодключенноеУстройство <> Неопределено Тогда        
			ПодключенныеУстройства = Новый Массив();
			ПодключенныеУстройства.Добавить(ПодключенноеУстройство);
		Иначе
			Возврат ОтключенноеОборудование; 
		КонецЕсли;   
	Иначе
		Возврат ОтключенноеОборудование; 
	КонецЕсли;
	
	Возврат ПодключенныеУстройства;
	
КонецФункции  

#КонецОбласти

#Область ККТ

// Процедура дополнительной обработки ошибки.
// 
// Параметры:
//  РезультатВыполнения - Структура 
//
Процедура ДополнительнаяОбработкаОшибки(РезультатВыполнения)     
	
	ОписаниеОшибки = "";
	
	Если СтрНайти(ВРег(ОписаниеОшибки), ВРег(НСтр("ru='Не поддерживается в данной версии'"))) > 0 Тогда
		ОписаниеОшибки = НСтр("ru='Не поддерживается в данной версии.'") 
		+ Символы.НПП + НСтр("ru='Обновите прошивку ККТ до актуальной версии.'");
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////
	//ОМГ +
	Если не РезультатВыполнения.Свойство("ОписаниеОшибки") Тогда
	РезультатВыполнения.Вставить("ОписаниеОшибки","");	
	КонецЕсли;	
	//ОМГ +	
	/////////////////////////////////////////////////////////////
		
	РезультатВыполнения.ОписаниеОшибки = ОписаниеОшибки; 
	
КонецПроцедуры

// Функция возвращает идентификатор открытой сессии для фискального устройства.
// 
// Параметры:
//  ИдентификаторУстройства - УникальныйИдентификатор - Идентификатор устройства
// 
// Возвращаемое значение:
//  Неопределено - Сессия проверки кодов маркировки
Функция СессияПроверкиКодовМаркировки(ИдентификаторУстройства) Экспорт
	
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	ФискальныеУстройства = ПодключаемоеОборудование.ФискальныеУстройства;
	
	ИдентификаторСессии = Неопределено;
	Для Каждого ФискальноеУстройство Из ФискальныеУстройства Цикл
		Если ФискальноеУстройство.ИдентификаторУстройства = ИдентификаторУстройства Тогда
			ИдентификаторСессии = ФискальноеУстройство.ИдентификаторСессии;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИдентификаторСессии;
	
КонецФункции

// Процедура сохраняет идентификатор открытой сессии для фискального устройства.
//
// Параметры:
//  ИдентификаторУстройства - СправочникСсылка.ПодключаемоеОборудование - Устройство.
//  ИдентификаторСессии - Строка
//  ИдентификаторЗапроса - Строка
//
Процедура УстановитьСессиюПроверкиКодовМаркировки(ИдентификаторУстройства, ИдентификаторСессии = Неопределено, ИдентификаторЗапроса = Неопределено) Экспорт
	
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	ФискальныеУстройства = ПодключаемоеОборудование.ФискальныеУстройства;
	
	Для Каждого ФискальноеУстройство Из ФискальныеУстройства Цикл
		Если ФискальноеУстройство.ИдентификаторУстройства = ИдентификаторУстройства Тогда
			ФискальноеУстройство.ИдентификаторСессии = ИдентификаторСессии;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	ФискальноеУстройство = Новый Структура();
	ФискальноеУстройство.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	ФискальноеУстройство.Вставить("ИдентификаторСессии" , ИдентификаторСессии);
	ФискальноеУстройство.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
	ФискальныеУстройства.Добавить(ФискальноеУстройство);
	
КонецПроцедуры

// Функция возвращает проверяет ли устройство код маркировки.
// 
// Параметры:
//  ИдентификаторУстройства - УникальныйИдентификатор -Идентификатор устройства
// 
// Возвращаемое значение:
//  Структура - Проверка кода маркировки:
//   * ИдентификаторСессии - УникальныйИдентификатор.
//   * ИдентификаторЗапроса - УникальныйИдентификатор.
//
Функция ПроверкаКодаМаркировки(ИдентификаторУстройства) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("ИдентификаторСессии");
	Результат.Вставить("ИдентификаторЗапроса");   
	Результат.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	ФискальныеУстройства = ПодключаемоеОборудование.ФискальныеУстройства;
	
	Для Каждого ФискальноеУстройство Из ФискальныеУстройства Цикл
		Если ФискальноеУстройство.ИдентификаторУстройства = ИдентификаторУстройства Тогда
			Результат.ИдентификаторСессии  = ФискальноеУстройство.ИдентификаторСессии;
			Результат.ИдентификаторЗапроса = ФискальноеУстройство.ИдентификаторЗапроса;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Процедура сохраняет статус проверки кода маркировки.
// 
// Параметры:
//  ИдентификаторУстройства - УникальныйИдентификатор - Идентификатор устройства.
//  ИдентификаторЗапроса - Неопределено - Идентификатор запроса
//
Процедура УстановитьПроверкуКодаМаркировки(ИдентификаторУстройства, ИдентификаторЗапроса = Неопределено) Экспорт
	
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	ФискальныеУстройства = ПодключаемоеОборудование.ФискальныеУстройства;
	
	Для Каждого ФискальноеУстройство Из ФискальныеУстройства Цикл
		Если ФискальноеУстройство.ИдентификаторУстройства = ИдентификаторУстройства Тогда
			   ФискальноеУстройство.ИдентификаторЗапроса = ИдентификаторЗапроса;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Результат проверки кода маркировки.
// 
// Параметры:
//  ИдентификаторУстройства - УникальныйИдентификатор - Идентификатор устройства
//  ИдентификаторСессии - УникальныйИдентификатор - Идентификатор сессии
//  ПараметрыЗапросаКМ -Структура - Параметры запроса КМ.
// 
// Возвращаемое значение:
//  Неопределено - Результат проверки кода маркировки
Функция РезультатПроверкиКодаМаркировки(ИдентификаторУстройства, ИдентификаторСессии, ПараметрыЗапросаКМ) Экспорт
	
	РезультатПроверки  = Неопределено;
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	ПроверкиКодаМаркировки = ПодключаемоеОборудование.ПроверкиКодаМаркировки;
	
	Для Каждого ПроверкаКодаМаркировки Из ПроверкиКодаМаркировки Цикл
		Если ПроверкаКодаМаркировки.ИдентификаторУстройства = ИдентификаторУстройства
			И ПроверкаКодаМаркировки.ИдентификаторСессии = ИдентификаторСессии
			И ПроверкаКодаМаркировки.ПараметрыЗапросаКМ.КонтрольнаяМарка = ПараметрыЗапросаКМ.КонтрольнаяМарка  
			И ПроверкаКодаМаркировки.ПараметрыЗапросаКМ.Количество = ПараметрыЗапросаКМ.Количество
			И ПроверкаКодаМаркировки.ПараметрыЗапросаКМ.ПланируемыйСтатусТовара = ПараметрыЗапросаКМ.ПланируемыйСтатусТовара Тогда
				РезультатПроверки = ПроверкаКодаМаркировки.РезультатПроверки;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
КонецФункции

// Процедура устанавливает результат проверки кода маркировки.
// 
// Параметры:
//  ИдентификаторУстройства - УникальныйИдентификатор - Идентификатор устройства.
//  ИдентификаторСессии - УникальныйИдентификатор
//  ПараметрыЗапросаКМ - Структура
//  РезультатПроверки - Структура
//  ИдентификаторЗапроса - УникальныйИдентификатор
//
Процедура УстановитьРезультатПроверкиКодаМаркировки(ИдентификаторУстройства, ИдентификаторСессии, ПараметрыЗапросаКМ, РезультатПроверки, ИдентификаторЗапроса = Неопределено) Экспорт
	
	ПодключаемоеОборудование = ПодключаемоеОборудование();
	ФискальныеУстройства = ПодключаемоеОборудование.ФискальныеУстройства;
	Для Каждого ФискальноеУстройство Из ФискальныеУстройства Цикл
		Если ФискальноеУстройство.ИдентификаторУстройства = ИдентификаторУстройства Тогда
			   ФискальноеУстройство.ИдентификаторЗапроса = ИдентификаторЗапроса;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ПроверкиКодаМаркировки = ПодключаемоеОборудование.ПроверкиКодаМаркировки;
	Для Каждого ПроверкаКодаМаркировки Из ПроверкиКодаМаркировки Цикл
		Если ПроверкаКодаМаркировки.ИдентификаторУстройства = ИдентификаторУстройства
			И ПроверкаКодаМаркировки.ИдентификаторСессии = ИдентификаторСессии
			И ПроверкаКодаМаркировки.ПараметрыЗапросаКМ.КонтрольнаяМарка = ПараметрыЗапросаКМ.КонтрольнаяМарка  
			И ПроверкаКодаМаркировки.ПараметрыЗапросаКМ.Количество = ПараметрыЗапросаКМ.Количество
			И ПроверкаКодаМаркировки.ПараметрыЗапросаКМ.ПланируемыйСтатусТовара = ПараметрыЗапросаКМ.ПланируемыйСтатусТовара Тогда
				ПроверкаКодаМаркировки.РезультатПроверки = РезультатПроверки;
			Возврат;
		КонецЕсли;
	КонецЦикла;                             
	
	ПроверкаКодаМаркировки = Новый Структура();
	ПроверкаКодаМаркировки.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	ПроверкаКодаМаркировки.Вставить("ИдентификаторСессии", ИдентификаторСессии);
	ПроверкаКодаМаркировки.Вставить("ПараметрыЗапросаКМ" , ПараметрыЗапросаКМ);
	ПроверкаКодаМаркировки.Вставить("РезультатПроверки"  , РезультатПроверки);  
	
	ПроверкиКодаМаркировки.Добавить(ПроверкаКодаМаркировки);
	
КонецПроцедуры

#КонецОбласти

#Область ВыполнениеКоманды

// Завершение выполнение команды
// 
// Параметры:
//  РезультатОперации - Структура
//  ПараметрыВыполнениеКоманды - Структура
//
Процедура ЗавершениеВыполнениеКоманды(РезультатОперации, ПараметрыВыполнениеКоманды) Экспорт
	
	Если ПараметрыВыполнениеКоманды.Свойство("СообщенияВСлужбуТехническойПоддержки") 
		И ПараметрыВыполнениеКоманды.СообщенияВСлужбуТехническойПоддержки 
		И ОбщегоНазначенияБПОКлиент.ИспользуетсяСообщенияВСлужбуТехническойПоддержки() Тогда
		
		МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент = ОбщегоНазначенияБПОКлиент.ОбщийМодуль("СообщенияВСлужбуТехническойПоддержкиБПОКлиент");
		Если Не РезультатОперации.Результат Тогда
			
			ПараметрыВыполнениеКоманды.Вставить("РезультатВыполненияОперации", РезультатОперации);
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершениеВыполнениеКоманды_ПроверкаРезультата", ЭтотОбъект, ПараметрыВыполнениеКоманды);
			
			ДополнительныеДанные = Новый Структура();
			ДополнительныеДанные.Вставить("Операция",          ПараметрыВыполнениеКоманды.Команда);
			ДополнительныеДанные.Вставить("ОписаниеОшибки",    РезультатОперации.ОписаниеОшибки);
			ДополнительныеДанные.Вставить("ПараметрыОперации", ПараметрыВыполнениеКоманды.ПараметрыОперации);
			
			ТекстВопроса = СтрШаблон(НСтр("ru = '%1
				|
				|Подготовить сообщение об ошибке разработчику?'"), РезультатОперации.ОписаниеОшибки);
			
			Параметры = МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент.ПараметрыОтправкиСообщенияОбОшибке();
			Параметры.Вставить("ИдентификаторОборудования", ПараметрыВыполнениеКоманды.ИдентификаторУстройства);
			Параметры.Вставить("ТекстОшибки",               РезультатОперации.ОписаниеОшибки);
			Параметры.Вставить("ДополнительныеДанные",      ДополнительныеДанные);
			Параметры.Вставить("ТекстВопроса",              ТекстВопроса);
			
			МодульСообщенияВСлужбуТехническойПоддержкиБПОКлиент.ПоказатьВопросОправкиСообщенияОбОшибке(ОписаниеОповещения, Параметры);
				
			Возврат; // Вызов оповещения будет выполнен в процедуре ЗавершениеВыполнениеКоманды_ПроверкаРезультата
			
		КонецЕсли;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ПараметрыВыполнениеКоманды.ОповещениеПриЗавершении, РезультатОперации); 
	
КонецПроцедуры

// Завершает проверку результата операции
// 
// Параметры:
//  Результат - см. СообщенияВСлужбуТехническойПоддержкиБПОКлиент.РезультатОперации
//  ПараметрыВыполнениеКоманды - см. ПараметрыПроверкиРезультатаОперации     
//
Процедура ЗавершениеВыполнениеКоманды_ПроверкаРезультата(Результат, ПараметрыВыполнениеКоманды) Экспорт
	
	Если ПараметрыВыполнениеКоманды.ОповещениеПриЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ПараметрыВыполнениеКоманды.ОповещениеПриЗавершении, ПараметрыВыполнениеКоманды.РезультатВыполненияОперации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область УпрощениеНастройкиПараметров

// Возвращает словарь реквизитов и возможных вариантов имен параметров производителя драйверов
//
// Возвращаемое значение:
//  см. МенеджерОборудованияКлиентПовтИсп.СловарьКлючевыхСвойств
Функция СловарьКлючевыхСвойств() 
	
	Возврат МенеджерОборудованияКлиентПовтИсп.СловарьКлючевыхСвойств();
	
КонецФункции

// Возвращает имя параметра по имени параметра указанного в файле XML
//
// Параметры:
//  ИмяПараметраXML - Строка - имя параметра оборудования заданное в файле XML
//  Преобразование - Булево
//
// Возвращаемое значение:
//  Строка, Неопределено - если имя параметра найдено в словаре, возвращает имя стандартного параметра
Функция ИмяКлючевогоПараметра(ИмяПараметраXML, Преобразование = Неопределено)
	
	Словарь = СловарьКлючевыхСвойств();
	
	Для Каждого КлючЗначение Из Словарь Цикл
		Если КлючЗначение.Значение.Свойство(ИмяПараметраXML, Преобразование) Тогда
			Возврат КлючЗначение.Ключ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает структуру атрибуты параметра
//
// Возвращаемое значение:
//  Структура:
//   * Стандартный - Булево - реквизит предусмотрен стандартами БПО
//   * ИмяПараметраXML - Строка - имя параметра как оно задано у производителя оборудования
//   * ИмяПараметра - Строка - имя стандартного параметра
//   * ИмяРеквизита - Строка - имя реквизита, под которым хранится значение данного параметра в справочнике
//   * ТолькоЧтение - Булево - параметр только для чтения
//   * Тип - Тип - Тип значения параметра (Число, Строка, Булево)
//   * Заголовок - Строка - заголовок параметра
//   * ЗначениеПоУмолчанию - Число, Строка, Булево - значение параметра по умолчанию
//   * Описание - Строка - описание параметра
//   * СтрокаФорматирования - Строка - строка форматирования параметра
//   * СписокВыбора - СписокЗначений из Строка - возможные варианты значения параметра
// 
Функция НовыйАтрибутыПараметра()
	
	Результат = Новый Структура();
	Результат.Вставить("Стандартный",          Ложь);
	Результат.Вставить("ЗначениеСтандартного", "");
	Результат.Вставить("ИмяПараметраXML",      "");
	Результат.Вставить("ИмяПараметра",         "");
	Результат.Вставить("ИмяРеквизита",         "");
	Результат.Вставить("ТолькоЧтение",         Ложь);
	Результат.Вставить("Тип",                  Тип("Число"));
	Результат.Вставить("Заголовок",            "");
	Результат.Вставить("ЗначениеПоУмолчанию",  "");
	Результат.Вставить("Описание",             "");
	Результат.Вставить("СтрокаФорматирования", "");
	Результат.Вставить("СписокВыбора",         Новый СписокЗначений());
	Результат.Вставить("Преобразование",       "");
	
	Возврат Результат;
КонецФункции

// Возвращает структуру атрибуты параметра
//
// Параметры:
//  ЧтениеXML - ЧтениеXML - открытый для чтения объект XML
//
// Возвращаемое значение:
//  Структура - см. НовыйАтрибутыПараметра
Функция ПрочитатьАтрибутыПараметра(ЧтениеXML)
	
	ИмяПараметраXML =  ЧтениеXML.ЗначениеАтрибута("Name");
	Преобразование  = Неопределено;
	ИмяПараметра    = ИмяКлючевогоПараметра(ИмяПараметраXML, Преобразование);
	Если ИмяПараметра = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЗначениеАтрибута = ВРег(ЧтениеXML.ЗначениеАтрибута("ReadOnly"));
	ТолькоЧтение     = (ЗначениеАтрибута = "TRUE" Или ЗначениеАтрибута = "ИСТИНА");
	
	ЗначениеАтрибута = ВРег(ЧтениеXML.ЗначениеАтрибута("TypeValue"));
	ПараметрТип      = ?(НЕ ПустаяСтрока(ЗначениеАтрибута), ЗначениеАтрибута, "STRING");
	
	Результат = НовыйАтрибутыПараметра();
	Результат.ИмяПараметраXML = ИмяПараметраXML;
	Результат.ИмяПараметра    = ИмяПараметра;
	Результат.Тип             = Тип(ПараметрТип);
	Результат.ТолькоЧтение    = ТолькоЧтение;
	Результат.ИмяРеквизита    = ?(ТолькоЧтение, "R_", "P_") + ИмяПараметраXML;
	Результат.Заголовок       = ЧтениеXML.ЗначениеАтрибута("Caption");
	Результат.Описание        = ЧтениеXML.ЗначениеАтрибута("Description");
	Результат.Преобразование  = Преобразование;
	Результат.ЗначениеПоУмолчанию  = ЧтениеXML.ЗначениеАтрибута("DefaultValue");
	Результат.СтрокаФорматирования = ЧтениеXML.ЗначениеАтрибута("FieldFormat");
	
	Возврат Результат;
КонецФункции

// Заполняет список выбора в атрибутах параметра из XML
//
// Параметры:
//  АтрибутыПараметра - Структура - в которую нужно занести список выбора
//  ЧтениеXML - ЧтениеXML - открытый для чтения объект XML
Процедура ПрочитатьСписокВыбора(АтрибутыПараметра, ЧтениеXML)
	
	#Если Не ВебКлиент Тогда
	СписокВыбора = Новый СписокЗначений();
	АтрибутыПараметра.Вставить("СписокВыбора", СписокВыбора);
	
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.Имя = "ChoiceList" И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда  
			Прервать;
		ИначеЕсли ЧтениеXML.Имя = "Item" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
			Значение = ЧтениеXML.ЗначениеАтрибута("Value");
		ИначеЕсли ЧтениеXML.Имя = "#text" И ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда  
			Представление = ЧтениеXML.Значение;
		ИначеЕсли ЧтениеXML.Имя = "Item" И ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда  
			СписокВыбора.Добавить(Значение, Представление);
		КонецЕсли;
	КонецЦикла;
	#КонецЕсли

КонецПроцедуры

// Заполнить структуру стандартных параметров по описанию интерфейса
//
// Параметры:
//  ОписаниеИнтерфейса - Строка - строка XML в которой находится описание интерфейса
//  КлючевыеПараметры - Структура - структура содержащая найденные ключевые параметры и их атрибуты
Процедура ПрочитатьАтрибутыКлючевыхПараметров(ОписаниеИнтерфейса, КлючевыеПараметры)
	
	#Если Не ВебКлиент Тогда
	ЧтениеXML = Новый ЧтениеXML; 
	ЧтениеXML.УстановитьСтроку(ОписаниеИнтерфейса);
	ЧтениеXML.ПерейтиКСодержимому();
	
	АтрибутыПараметра = Неопределено;
	Если ЧтениеXML.Имя = "Settings" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
		Пока ЧтениеXML.Прочитать() Цикл  
			Если ЧтениеXML.Имя = "ChoiceList" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
				Если АтрибутыПараметра <> Неопределено Тогда
					ПрочитатьСписокВыбора(АтрибутыПараметра, ЧтениеXML);
				КонецЕсли;
			ИначеЕсли ЧтениеXML.Имя = "Parameter" И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда  
				АтрибутыПараметра = ПрочитатьАтрибутыПараметра(ЧтениеXML);
				Если АтрибутыПараметра <> Неопределено Тогда
					КлючевыеПараметры.Вставить(АтрибутыПараметра.ИмяПараметра, АтрибутыПараметра);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Процедура ДобавитьПараметрЛогДрайвераВключен(КлючевыеПараметры, Значение)
	
	АтрибутыПараметра = НовыйАтрибутыПараметра();
	АтрибутыПараметра.Стандартный     = Истина;
	АтрибутыПараметра.ИмяПараметраXML = "";
	АтрибутыПараметра.ИмяПараметра    = "LogEnabled";
	АтрибутыПараметра.Тип             = Тип("Булево");
	АтрибутыПараметра.ТолькоЧтение    = Истина;
	АтрибутыПараметра.ИмяРеквизита    = "";
	АтрибутыПараметра.Заголовок       = НСтр("ru = 'Включен лог'");
	АтрибутыПараметра.Описание        = "";
	АтрибутыПараметра.Преобразование  = "";
	АтрибутыПараметра.ЗначениеСтандартного = Значение;
	АтрибутыПараметра.ЗначениеПоУмолчанию  = Ложь;
	АтрибутыПараметра.СтрокаФорматирования = "";
	
	КлючевыеПараметры.Вставить(АтрибутыПараметра.ИмяПараметра, АтрибутыПараметра);

КонецПроцедуры

Процедура ДобавитьПараметрЛогДрайвераПутьКФайлу(КлючевыеПараметры, Значение)
	
	АтрибутыПараметра = НовыйАтрибутыПараметра();
	АтрибутыПараметра.Стандартный     = Истина;
	АтрибутыПараметра.ИмяПараметраXML = "";
	АтрибутыПараметра.ИмяПараметра    = "LogPath";
	АтрибутыПараметра.Тип             = Тип("Строка");
	АтрибутыПараметра.ТолькоЧтение    = Истина;
	АтрибутыПараметра.ИмяРеквизита    = "";
	АтрибутыПараметра.Заголовок       = НСтр("ru = 'Путь к log-файлу'");
	АтрибутыПараметра.Описание        = "";
	АтрибутыПараметра.Преобразование  = "";
	АтрибутыПараметра.ЗначениеСтандартного = Значение;
	АтрибутыПараметра.ЗначениеПоУмолчанию  = "";
	АтрибутыПараметра.СтрокаФорматирования = "";
	
	КлючевыеПараметры.Вставить(АтрибутыПараметра.ИмяПараметра, АтрибутыПараметра);

КонецПроцедуры

#КонецОбласти

Функция ПодключаемоеОборудованиеНаФорме(Форма)

	ЗначенияСвойств = Новый Структура("ПодключаемоеОборудованиеБПО", Null);
	ЗаполнитьЗначенияСвойств(ЗначенияСвойств, Форма);

	Результат = ЗначенияСвойств.ПодключаемоеОборудованиеБПО;
	
	Если ТипЗнч(Результат) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ЭтоСписокОборудования(Список)
	Возврат ТипЗнч(Список) = Тип("Массив") И Список.Количество() > 0 И ТипЗнч(Список[0]) = Тип("Структура");
КонецФункции

// Проверка существуют ли реквизиты на форме
// Параметры:
//  Форма - ФормаКлиентскогоПриложения
//  ИменаРеквизитов - Строка - Имена реквизитов формы через запятую 
//
Функция СуществуютРеквизитыНаФорме(Форма, ИменаРеквизитов)
	
	МассивРеквизитов = СтрРазделить(ИменаРеквизитов,",", Ложь);
	
	ЗначенияСвойств = Новый Структура(ИменаРеквизитов);
	Для Каждого ИмяРеквизита Из МассивРеквизитов Цикл
		ЗначенияСвойств.Вставить(ИмяРеквизита, Null);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(ЗначенияСвойств, Форма);
	
	Для Каждого КлючЗначение Из ЗначенияСвойств Цикл
		Если КлючЗначение.Значение = Null Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;     
	
	Возврат Истина;
	
КонецФункции

Функция ТекущийКлиентПоддерживаетсяКомпонентой(Реквизиты)
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Браузер = Неопределено;
#Если ВебКлиент Тогда
	Строка = СистемнаяИнформация.ИнформацияПрограммыПросмотра;
	
	Если СтрНайти(Строка, "Chrome/") > 0 Тогда
		Браузер = "Chrome";
	ИначеЕсли СтрНайти(Строка, "MSIE") > 0 Тогда
		Браузер = "MSIE";
	ИначеЕсли СтрНайти(Строка, "Safari/") > 0 Тогда
		Браузер = "Safari";
	ИначеЕсли СтрНайти(Строка, "Firefox/") > 0 Тогда
		Браузер = "Firefox";
	КонецЕсли;
#КонецЕсли
	
	Если Реквизиты.Свойство("ЦелевыеПлатформы") Тогда
		ЦелевыеПлатформы = Реквизиты.ЦелевыеПлатформы;
	Иначе
		ЦелевыеПлатформы = Реквизиты;
	КонецЕсли;
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		
		Если Браузер = Неопределено Тогда
			Возврат ЦелевыеПлатформы.Linux_x86;
		КонецЕсли;
		
		Если Браузер = "Firefox" Тогда
			Возврат ЦелевыеПлатформы.Linux_x86_Firefox;
		КонецЕсли;
		
		Если Браузер = "Chrome" Тогда
			Возврат ЦелевыеПлатформы.Linux_x86_Chrome;
		КонецЕсли;
			
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		
		Если Браузер = Неопределено Тогда
			Возврат ЦелевыеПлатформы.Linux_x86_64;
		КонецЕсли;
		
		Если Браузер = "Firefox" Тогда
			Возврат ЦелевыеПлатформы.Linux_x86_64_Firefox;
		КонецЕсли;
		
		Если Браузер = "Chrome" Тогда
			Возврат ЦелевыеПлатформы.Linux_x86_64_Chrome;
		КонецЕсли;
		
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86_64 Тогда
		
		Если Браузер = Неопределено Тогда
			Возврат ЦелевыеПлатформы.MacOS_x86_64;
		КонецЕсли;
		
		Если Браузер = "Safari" Тогда
			Возврат ЦелевыеПлатформы.MacOS_x86_64_Safari;
		КонецЕсли;
		
		Если Браузер = "Firefox" Тогда
			Возврат ЦелевыеПлатформы.MacOS_x86_64_Firefox;
		КонецЕсли;
		
		Если Браузер = "Chrome" Тогда
			Возврат ЦелевыеПлатформы.MacOS_x86_64_Chrome;
		КонецЕсли;
		
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		
		Если Браузер = Неопределено Тогда
			Возврат ЦелевыеПлатформы.Windows_x86;
		КонецЕсли;
		
		Если Браузер = "Firefox" Тогда
			Возврат ЦелевыеПлатформы.Windows_x86_Firefox;
		КонецЕсли;
		
		Если Браузер = "Chrome" Тогда
			Возврат ЦелевыеПлатформы.Windows_x86_Chrome;
		КонецЕсли;
		
		Если Браузер = "MSIE" Тогда
			Возврат ЦелевыеПлатформы.Windows_x86_MSIE;
		КонецЕсли;
		
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		
		Если Браузер = Неопределено Тогда
			Возврат ЦелевыеПлатформы.Windows_x86_64;
		КонецЕсли;
		
		Если Браузер = "Firefox" Тогда
			Возврат ЦелевыеПлатформы.Windows_x86_Firefox;
		КонецЕсли;
		
		Если Браузер = "Chrome" Тогда
			Возврат ЦелевыеПлатформы.Windows_x86_Chrome;
		КонецЕсли;
		
		Если Браузер = "MSIE" Тогда
			Возврат ЦелевыеПлатформы.Windows_x86_64_MSIE;
		КонецЕсли;
	
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86 Тогда
		// В браузере может быть неправильно определен тип платформы.
	
		Если Браузер = "Firefox" Тогда
			Возврат ЦелевыеПлатформы.MacOS_x86_64_Firefox;
		КонецЕсли;
		
		Если Браузер = "Chrome" Тогда
			Возврат ЦелевыеПлатформы.MacOS_x86_64_Chrome;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция СтруктураТипОборудованияВСтроку(ТипыПО)
	
	МассивТипов = Новый Массив();
	Для Каждого КлючИЗначение Из ТипыПО Цикл
		Если КлючИЗначение.Значение Тогда
			МассивТипов.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	Возврат СтрСоединить(МассивТипов, ",");
	
КонецФункции

#КонецОбласти

// Устарела: больше не используется.
// Возвращает значения параметров, необходимых для работы клиентского кода конфигурации
// без дополнительных серверных вызовов.
// 
// Возвращаемое значение:
//   см. ИнтеграцияПодсистемБПОКлиент.ПараметрыРаботыКлиентаПриЗапуске
//
Функция ПараметрыРаботыКлиентаПриЗапуске() Экспорт
	
	Возврат ИнтеграцияПодсистемБПОКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	
КонецФункции

// Устарела: следует использовать ИнтеграцияПодсистемБПОКлиент.ОбработкаВнешнегоСобытия.
// Выполняет обработку внешнего события, вызывается из глобального модуля
//
// Параметры:
//  Источник - Строка.
//  Событие - Строка.
//  Данные - Строка.
Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные) Экспорт
	
	ИнтеграцияПодсистемБПОКлиент.ОбработкаВнешнегоСобытия(Источник, Событие, Данные);
	
КонецПроцедуры

Процедура НачатьВыполнениеКомандыСтарый(ОповещениеПриЗавершении, ИдентификаторКлиента, ИдентификаторУстройства, ПараметрыОперации, ПараметрыВыполнениеКоманды, ПечатающееУстройство = Неопределено) Экспорт
	
	Если ИдентификаторУстройства = Неопределено Или ПустаяСтрока(ИдентификаторУстройства) Тогда
		Если ОповещениеПриЗавершении <> Неопределено Тогда
			ОписаниеОшибки = НСтр("ru='Устройство не выбрано или не подключено.'");
			РезультатОперации = МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании(Ложь, ОписаниеОшибки);
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатОперации);
		КонецЕсли;
		Возврат; 
	КонецЕсли;          
	
#Если Не МобильноеПриложениеКлиент Тогда 
	// Замер производительности.
	КлючеваяОперация = СтрШаблон("ОбщийМодуль.МенеджерОборудованияКлиент.НачатьВыполнениеКоманды.%1", ПараметрыВыполнениеКоманды.Команда);
	ОбщегоНазначенияБПОКлиент.ЗамерВремениБПО(КлючеваяОперация, ОповещениеПриЗавершении);
#КонецЕсли          
	
	ПараметрыВыполнениеКоманды.Вставить("ОповещениеПриЗавершении"   , ОповещениеПриЗавершении);  
	ПараметрыВыполнениеКоманды.Вставить("ИдентификаторКлиента"      , ИдентификаторКлиента);
	ПараметрыВыполнениеКоманды.Вставить("ИдентификаторУстройства"   , ИдентификаторУстройства);
	ПараметрыВыполнениеКоманды.Вставить("ПараметрыОперации"         , ПараметрыОперации);
	ПараметрыВыполнениеКоманды.Вставить("Подключено"                , Ложь);
	ПараметрыВыполнениеКоманды.Вставить("ПодключенноеУстройство"    , Неопределено);
	ПараметрыВыполнениеКоманды.Вставить("ПечатающееУстройство"           , ПечатающееУстройство);
	ПараметрыВыполнениеКоманды.Вставить("ПечатающееУстройствоПодключено"      , Ложь);   
	ПараметрыВыполнениеКоманды.Вставить("ПечатающееУстройствоБылоПодключенное", Ложь);   
	ПараметрыВыполнениеКоманды.Вставить("СетевоеОборудование");
	ПараметрыВыполнениеКоманды.Вставить("ПечатающееУстройствоДополнительныхДокументов"); 
	ПараметрыВыполнениеКоманды.Вставить("ПодключенноеПечатающееУстройствоДополнительныхДокументов");
	
	// Поиск подключенного устройства.
	ПодключенноеУстройство = ПолучитьПодключенноеУстройство(ИдентификаторУстройства);                                                
	Если ПодключенноеУстройство = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПодключениеЗавершение", ЭтотОбъект, ПараметрыВыполнениеКоманды);
		НачатьПодключениеОборудованиеПоИдентификатору(ОписаниеОповещения, ИдентификаторКлиента, ИдентификаторУстройства);
	Иначе
		ПараметрыВыполнениеКоманды.ПодключенноеУстройство = ПодключенноеУстройство;
		// Нужно ли использовать печатающее устройство.
		Если ПараметрыВыполнениеКоманды.ИспользоватьПечатающееУстройство И ПараметрыВыполнениеКоманды.ПечатьСлипЧека
			И НЕ ПодключенноеУстройство.ПечатьКвитанцийНаТерминале Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("НачатьВыполнениеКоманды_ПечатающегоУстройстваЗавершение", ЭтотОбъект, ПараметрыВыполнениеКоманды);
			НачатьПодключениеПечатающегоУстройства(ОписаниеОповещения, ПараметрыВыполнениеКоманды.ИдентификаторКлиента, ПечатающееУстройство); 
		Иначе
			ВыполнениеКомандыОбработчика(ПодключенноеУстройство, ПараметрыВыполнениеКоманды);
		КонецЕсли;
	КонецЕсли;
	                                    
КонецПроцедуры
