Процедура УстановкаПараметровСеанса() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаИСМП = Новый ХранилищеЗначения(Новый Массив());
КонецПроцедуры

Процедура ПолучитьРазрешение(ПроверяемыеКМ, Филиал, Оборудование, ПозицииЧека, ТекстОшибки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Организация = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Филиал, "Организация");
	
	КлючСессии = ПолучитьКлючСессии(Организация);
	Если КлючСессии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаМаркировки = Новый ТаблицаЗначений();
	ТаблицаМаркировки.Колонки.Добавить("ПолныйКодМаркировки",           ОбщегоНазначения.ОписаниеТипаСтрока(255));
	ТаблицаМаркировки.Колонки.Добавить("НормализованныйШтрихкод",       ОбщегоНазначения.ОписаниеТипаСтрока(255));
	ТаблицаМаркировки.Колонки.Добавить("ВидПродукции",                  Новый ОписаниеТипов("ПеречислениеСсылка.ВидыПродукцииИС"));
	ТаблицаМаркировки.Колонки.Добавить("ТекстОшибки",                   ОбщегоНазначения.ОписаниеТипаСтрока(0));
	ТаблицаМаркировки.Колонки.Добавить("ПредставлениеНоменклатуры",     ОбщегоНазначения.ОписаниеТипаСтрока(255));
	ТаблицаМаркировки.Колонки.Добавить("КонтролиРазрешительногоРежима", Новый ОписаниеТипов("Массив"));
	
	Для Каждого Эл Из ПроверяемыеКМ Цикл
		
		НоваяСтрокаДанных = ТаблицаМаркировки.Добавить();
		НоваяСтрокаДанных.ПолныйКодМаркировки       = Эл.КонтрольнаяМарка;
		НоваяСтрокаДанных.НормализованныйШтрихкод   = Эл.ШтрихкодУпаковки;
		//НоваяСтрокаДанных.ВидПродукции              = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.БАДы");
		//НоваяСтрокаДанных.ПредставлениеНоменклатуры = Строка("Товар №1");
		
		//СтрокиЗапроса.Вставить(НоваяСтрокаДанных, НоваяСтрокаДанных.НормализованныйШтрихкод);
		
	КонецЦикла;
	
	НомерФН = ОборудованиеЧекопечатающиеУстройства.ПараметрыРегистрацииУстройства(Оборудование).ЗаводскойНомерФН;
	
	РезультатПроверки = МаркировкаРазрешительныйРежим.СокращеннаяИнформацияПоКМПриРозничнойПродаже(ТаблицаМаркировки, Организация, НомерФН,, Истина, КлючСессии);
	
	Если РезультатПроверки.АварийныйРежим Тогда
		Возврат;
	ИначеЕсли РезультатПроверки.ТребуетсяОбновлениеКлючаСессии Тогда
		ТекстОшибки = "Неверный токен авторизации, проверьте токен";
		Возврат;
	ИначеЕсли РезультатПроверки.ОтсутствуютCDNПлощадки Тогда
		ТекстОшибки = "Необходимо загрузить CDN площадки";
		Возврат;
	КонецЕсли;
	
	Для Каждого Эл Из ПозицииЧека Цикл
		
		Если Эл.Свойство("ШтрихкодBase64") И ЗначениеЗаполнено(Эл.ШтрихкодBase64) Тогда
			СтрокаТаблицыМаркировок = ТаблицаМаркировки.Найти(Эл.ШтрихкодBase64, "ПолныйКодМаркировки");
			Если СтрокаТаблицыМаркировок = Неопределено Тогда
				ВызватьИсключение "Произошла неизвестная ошибка при проверке кода через разрешительный режим.";
			КонецЕсли;
			Если ЗначениеЗаполнено(СтрокаТаблицыМаркировок.ТекстОшибки) Тогда
				ТекстОшибки = ТекстОшибки + Символы.ПС + "Для " + Эл.Штрихкод + " "  + СтрокаТаблицыМаркировок.ТекстОшибки;
				Продолжить;
			КонецЕсли;
			СтрокаСтатуса = РезультатПроверки.СтатусыКодовМаркировкиГИСМТ.Получить(СтрокаТаблицыМаркировок);
			Если СтрокаСтатуса = Неопределено Тогда
				МожноПродатьБезПроверки = РезультатПроверки.КодыМаркировкиБезДанныхГИСМТ.Получить(СтрокаТаблицыМаркировок);
				Если МожноПродатьБезПроверки Тогда
					Продолжить;
				КонецЕсли;
				ВызватьИсключение "Произошла неизвестная ошибка при проверке кода через разрешительный режим.";
			КонецЕсли;
			Эл.ЗапросПроверкиКода.ВременнаяМетка = СтрокаСтатуса.РазрешительныйРежимДатаЗапросаГИСМТ;
			Эл.ЗапросПроверкиКода.ИдентификаторЗапроса = СтрокаСтатуса.РазрешительныйРежимИдентификаторЗапросаГИСМТ;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьКлючСессии(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиРазрешительногоРежима.ТокенАвторизации КАК ТокенАвторизации
		|ИЗ
		|	РегистрСведений.НастройкиРазрешительногоРежима КАК НастройкиРазрешительногоРежима
		|ГДЕ
		|	НастройкиРазрешительногоРежима.Организация = &Организация
		|	И НастройкиРазрешительногоРежима.Используется = ИСТИНА";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ТокенАвторизации;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДействуетАварийныйРежимДляРозничныхПродаж()
	ДатаДействияАварийногоРежима = Константы.ДатаОкончанияРазрешительногоАварийногоРежима.Получить();
	Возврат ДатаДействияАварийногоРежима > ТекущаяУниверсальнаяДата();
КонецФункции

Функция СокращеннаяИнформацияПоКМПриРозничнойПродаже(ДанныеПроверкиКМ, Организация, ИдентификаторФискальногоНакопителя, ТаймаутНаПродажу = Истина, ЭтоОперацияПробития = Ложь, КлючСессии) Экспорт
	
	//КлючСессии = ПроверитьОбновитьКлючСессии(Организация);
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",                  Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии",  КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеCDNПлощадок",  Ложь);
	ВозвращаемоеЗначение.Вставить("ОтсутствуютCDNПлощадки",          Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатыОтправкиЗапросов",      Новый Массив);
	ВозвращаемоеЗначение.Вставить("СтатусыКодовМаркировкиГИСМТ",     Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("КодыМаркировкиБезДанныхГИСМТ",    Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                     "");
	
	МассивКМ                  = Новый Массив;
	СоответствиеПолногоКодаКМ = Новый Соответствие();
	МассивПлощадокКБлокировке = Новый Массив;
	
	Для Каждого СтрокаДанныхПроверкиКМ Из ДанныеПроверкиКМ Цикл
		
		ПолныйКодКМ = СтрокаДанныхПроверкиКМ.ПолныйКодМаркировки;
		
		Если Не ЗначениеЗаполнено(ПолныйКодКМ) Тогда
			Продолжить;
		КонецЕсли;
		
		КодМаркировкиНаПроверку = МенеджерОборудованияВызовСервера.Base64ВШтрихкод(ПолныйКодКМ);
		МассивКМ.Добавить(КодМаркировкиНаПроверку);
		
		СоответствиеПолногоКодаКМ.Вставить(КодМаркировкиНаПроверку, СтрокаДанныхПроверкиКМ);
		
	КонецЦикла;
	
	Если МассивКМ.Количество() = 0 Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ВозвращаемоеЗначение.АварийныйРежим = ДействуетАварийныйРежимДляРозничныхПродаж();
	
	Если ВозвращаемоеЗначение.АварийныйРежим Тогда
		
		// на срок действия аварийного режима разрешена продажа без разрешительного режима
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	СтруктураДополнительныхПараметров = Новый Структура();
	СтруктураДополнительныхПараметров.Вставить("Организация",                Организация);
	СтруктураДополнительныхПараметров.Вставить("ИННОрганизации",             "");
	СтруктураДополнительныхПараметров.Вставить("НомерФН",                    ИдентификаторФискальногоНакопителя);
	СтруктураДополнительныхПараметров.Вставить("КешОрганизаций",             Новый Соответствие());
	СтруктураДополнительныхПараметров.Вставить("ЛогироватьУспешныеПроверки", Истина);
	
	СтруктураДополнительныхПараметров.ИННОрганизации = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Организация, "Инн");
	СтруктураДополнительныхПараметров.КешОрганизаций.Вставить(Организация, СтруктураДополнительныхПараметров.ИННОрганизации);
	
	ДанныеCDNПлощадок = СортированнаяТаблицаCDNПлощадок();
	ВозвращаемоеЗначение.ТребуетсяОбновлениеCDNПлощадок = ДанныеCDNПлощадок.ТребуетсяОбновлениеПлощадок;
	
	Если ДанныеCDNПлощадок.ТаблицаПлощадок.Количество() = 0 Тогда
		
		// если список площадок отсутствует вовсе - вернуть ошибку
		ВозвращаемоеЗначение.ОтсутствуютCDNПлощадки = Истина;
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	КешСоединений = Новый Соответствие();
	
	Для Каждого КодМаркировки Из МассивКМ Цикл
		
		ДанныеШтрихкода = СоответствиеПолногоКодаКМ.Получить(КодМаркировки);
		
		РезультатОбработкиКМ = ОбработатьКодМаркировкиНаCDNПлощадках(КодМаркировки,
			ДанныеШтрихкода,
			ДанныеCDNПлощадок.ТаблицаПлощадок,
			КлючСессии,
			МассивПлощадокКБлокировке,
			СтруктураДополнительныхПараметров,
			КешСоединений,
			ТаймаутНаПродажу);
		
		ВозвращаемоеЗначение.АварийныйРежим                 = РезультатОбработкиКМ.АварийныйРежим;
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = РезультатОбработкиКМ.ТребуетсяОбновлениеКлючаСессии;
		
		Для Каждого РезультатОтправкиЗапросаНаПлощадку Из РезультатОбработкиКМ.РезультатыОтправкиЗапросов Цикл
			ВозвращаемоеЗначение.РезультатыОтправкиЗапросов.Добавить(РезультатОтправкиЗапросаНаПлощадку);
		КонецЦикла;
		
		ВозвращаемоеЗначение.ТекстОшибки = ВозвращаемоеЗначение.ТекстОшибки
			+ ?(ЗначениеЗаполнено(ВозвращаемоеЗначение.ТекстОшибки), Символы.ПС, "")
			+ РезультатОбработкиКМ.ТекстОшибки;
		
		Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
			
			// если была получена ошибка 401 хотя бы по одному КМ - прервать обработку,
			// необходимо обновление ключа сессии
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
		Если ВозвращаемоеЗначение.АварийныйРежим Тогда
			
			// если был получен код 203 хотя бы по одному КМ - прервать обработку,
			// действует аварийный режим
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
		Если Не РезультатОбработкиКМ.ПараметрыКодаМаркировки = Неопределено Тогда
			
			// по КМ был получен ответ из ГИС МТ
			ВозвращаемоеЗначение.СтатусыКодовМаркировкиГИСМТ.Вставить(ДанныеШтрихкода, РезультатОбработкиКМ.ПараметрыКодаМаркировки);
			
		КонецЕсли;
		
		Если РезультатОбработкиКМ.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ Тогда
			
			// продажа разрешена по таймауту или как молочка из Беларуси
			ВозвращаемоеЗначение.КодыМаркировкиБезДанныхГИСМТ.Вставить(ДанныеШтрихкода, Истина);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивПлощадокКБлокировке.Количество() > 0 Тогда
		
		ЗаблокироватьСписокПлощадок(МассивПлощадокКБлокировке);
		
		// все блокировки перенесены в регистр, надо убрать заблокированные площадки из массива Параметра сеанса
		ПлощадкиСОшибкамиОбмена = ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаИСМП.Получить();
		ОставшиесяПлощадкиСОшибкамиОбмена = ОбщегоНазначенияКлиентСервер.РазностьМассивов(ПлощадкиСОшибкамиОбмена, МассивПлощадокКБлокировке);
		
		ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаИСМП = Новый ХранилищеЗначения(ОставшиесяПлощадкиСОшибкамиОбмена);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;

КонецФункции

// Вовращает признак необходимости обновления площадок и их ранжированный список
//  от наиболее приоритетной по скорости отклика до наименее приоритетной
// 
// Возвращаемое значение:
//  Структура - структура данных CDN-площадок:
// * ТребуетсяОбновлениеПлощадок - Булево - признак, что все площадки либо заблокированы, либо не загружены,
//    либо срок их актуальности подошел к концу
// * ТаблицаПлощадок - ТаблицаЗначений - сортированный список CDN-площадок:
// ** АдресПлощадки - Строка - адрес площадки
// ** Сервер - Строка - адрес сервера
// ** Порт - Число - порт
// ** ЗащищенноеСоединение - Булево - защищенное соединение
// ** СкоростьОтклика - Число - общая скорость отклика, сумма среднего времени обработки КМ на площадке
//     и времени обращения к ней
// ** ПлощадкаДоступна - Булево - признак доступности площадки
Функция СортированнаяТаблицаCDNПлощадок() Экспорт
	
	ТаблицаПлощадок = Новый ТаблицаЗначений();
	ТаблицаПлощадок.Колонки.Добавить("АдресПлощадки",        ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ТаблицаПлощадок.Колонки.Добавить("Сервер",               ОбщегоНазначения.ОписаниеТипаСтрока(200));
	ТаблицаПлощадок.Колонки.Добавить("Порт",                 ОбщегоНазначения.ОписаниеТипаЧисло(6));
	ТаблицаПлощадок.Колонки.Добавить("ЗащищенноеСоединение", Новый ОписаниеТипов("Булево"));
	ТаблицаПлощадок.Колонки.Добавить("СкоростьОтклика",      ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ТаблицаПлощадок.Колонки.Добавить("ПлощадкаДоступна",     Новый ОписаниеТипов("Булево"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	CDNПлощадкиИСМП.АдресПлощадки                                               КАК АдресПлощадки,
		|	CDNПлощадкиИСМП.Сервер                                                      КАК Сервер,
		|	CDNПлощадкиИСМП.Порт                                                        КАК Порт,
		|	CDNПлощадкиИСМП.ЗащищенноеСоединение                                        КАК ЗащищенноеСоединение,
		|	CDNПлощадкиИСМП.СреднееВремяОтвета + CDNПлощадкиИСМП.СреднееВремяПроверкиКМ КАК СкоростьОтклика,
		|	CDNПлощадкиИСМП.ДатаНедоступнаДоУниверсальная < &ТекущаяУниверсальнаяДата   КАК ПлощадкаДоступна,
		|	ДОБАВИТЬКДАТЕ(CDNПлощадкиИСМП.ДатаОбновленияУниверсальная, ЧАС,
		|		&ВремяОбновленияПлощадок) >= &ТекущаяУниверсальнаяДата                  КАК ПлощадкаАктуальна,
		|	CDNПлощадкиИСМП.СреднееВремяПроверкиКМ > 0
		|		И CDNПлощадкиИСМП.СреднееВремяОтвета > 0                                КАК БылПолученОтветПлощадки
		|ИЗ
		|	РегистрСведений.СостоянияCDNПлощадокИСМП КАК CDNПлощадкиИСМП
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПлощадкаДоступна УБЫВ,
		|	БылПолученОтветПлощадки УБЫВ,
		|	СкоростьОтклика";
	
	Запрос.УстановитьПараметр("ВремяОбновленияПлощадок",  6);
	Запрос.УстановитьПараметр("ТекущаяУниверсальнаяДата", ТекущаяУниверсальнаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ЕстьХотяБыОднаАктивнаяПлощадка = Ложь;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТаблицаПлощадок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
		Если Не ЕстьХотяБыОднаАктивнаяПлощадка
			И ВыборкаДетальныеЗаписи.ПлощадкаАктуальна Тогда
			ЕстьХотяБыОднаАктивнаяПлощадка = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ТребуетсяОбновлениеПлощадок", Не ЕстьХотяБыОднаАктивнаяПлощадка);
	СтруктураВозврата.Вставить("ТаблицаПлощадок",             ТаблицаПлощадок);
	
	Возврат СтруктураВозврата;
	
КонецФункции

#Область ПроцессПроверкиНаCDNПлощадке

Функция ОбработатьКодМаркировкиНаCDNПлощадках(КодМаркировки, ДанныеШтрихкода, ТаблицаCDNПлощадок, КлючСессии, МассивПлощадокКБлокировке, СтруктураДополнительныхПараметров, КешСоединений = Неопределено, ТаймаутНаПродажу = Истина)
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",                         Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии",         Ложь);
	ВозвращаемоеЗначение.Вставить("ПараметрыКодаМаркировки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ПродажаРазрешенаВОтсутствиеОтветаГИСМТ", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатыОтправкиЗапросов",             Новый Массив);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                            "");
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("X-API-KEY",      КлючСессии);

	URLЗапроса = "api/v4/true-api/codes/check";
	
	МассивКодовМаркировкиДляОтправки = Новый Массив;
	МассивКодовМаркировкиДляОтправки.Добавить(КодМаркировки);
	
	ЭтоМолочкаИзБеларуси = Ложь;
	// молочная продукция из Беларуси, серийный номер из 8 символов и начинается с цифры 2
	ЭтоМолочкаИзБеларуси = ЭтоМолочнаяПродукцияИСМП(ДанныеШтрихкода.ВидПродукции)
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеШтрихкода, "СоставКодаМаркировки")
		И СтрНачинаетсяС(ДанныеШтрихкода.СоставКодаМаркировки.СерийныйНомер, "2")
		И СтрДлина(ДанныеШтрихкода.СоставКодаМаркировки.СерийныйНомер) = 8;
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("codes",             МассивКодовМаркировкиДляОтправки);
	ПараметрыЗапроса.Вставить("inn",               СтруктураДополнительныхПараметров.ИННОрганизации);
	ПараметрыЗапроса.Вставить("fiscalDriveNumber", СтруктураДополнительныхПараметров.НомерФН);
	
	ПараметрыЗапросов         = ПараметрыОтправкиHTTPЗапросов(, Истина);
	
	ТелоЗапросаJSON = ОбъектВТекстJSON(ПараметрыЗапроса, Истина);
	
	ОтправленЗапрос                      = Ложь;
	ПолученОтвет                         = Ложь;
	ВремяОжиданияОтветаГИСМТ             = 1.5;
	ТаймерНачалоЗапросаВМиллисекундах    = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ТаймерОкончаниеЗапросаВМиллисекундах = ТаймерНачалоЗапросаВМиллисекундах + ВремяОжиданияОтветаГИСМТ * 1000;
	
	ЗапросыДляЛогирования = Новый Массив();
	
	Для Каждого СтрокаПлощадок Из ТаблицаCDNПлощадок Цикл
		
		// если площадка уже в списке к блокировке, и мы уже выполнили формальный запрос, не надо к ней обращаться
		Если МассивПлощадокКБлокировке.Найти(СтрокаПлощадок.АдресПлощадки) <> Неопределено И ОтправленЗапрос Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТаймаутНаПродажу И ТаймерОкончаниеЗапросаВМиллисекундах < ТекущаяУниверсальнаяДатаВМиллисекундах() Тогда
			
			ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
			Прервать;
			
		КонецЕсли;
		
		Если Не СтрокаПлощадок.ПлощадкаДоступна И ОтправленЗапрос Тогда
			
			// либо все площадки доступные уже перебрали, и остались недоступные,
			// либо все были недоступные, но мы уже отправили один обязательный запрос, можно продавать
			// переход к следующему КМ, по нему тоже надо отправить хотя бы один запрос
			ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
			Прервать;
			
		КонецЕсли;
		
		ПараметрыЗапросов.ИспользоватьЗащищенноеСоединение = СтрокаПлощадок.ЗащищенноеСоединение;
		ПараметрыЗапросов.Порт                             = СтрокаПлощадок.Порт;
		ПараметрыЗапросов.Сервер                           = СтрокаПлощадок.Сервер;
		
		ДанныеДляОтправкиЗапросаНаПлощадку = ПараметрыОтправкиЗапросовНаCDNПлощадку();
		ДанныеДляОтправкиЗапросаНаПлощадку.URLЗапроса           = URLЗапроса;
		ДанныеДляОтправкиЗапросаНаПлощадку.ЗаголовокHTTP        = ЗаголовокHTTP;
		ДанныеДляОтправкиЗапросаНаПлощадку.КлючСессии           = КлючСессии;
		ДанныеДляОтправкиЗапросаНаПлощадку.ПараметрыЗапроса     = ПараметрыЗапроса;
		ДанныеДляОтправкиЗапросаНаПлощадку.ПараметрыЗапросов    = ПараметрыЗапросов;
		ДанныеДляОтправкиЗапросаНаПлощадку.ТелоЗапросаJSON      = ТелоЗапросаJSON;
		ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки        = СтрокаПлощадок.АдресПлощадки;
		ДанныеДляОтправкиЗапросаНаПлощадку.Сервер               = СтрокаПлощадок.Сервер;
		ДанныеДляОтправкиЗапросаНаПлощадку.Порт                 = СтрокаПлощадок.Порт;
		ДанныеДляОтправкиЗапросаНаПлощадку.ЗащищенноеСоединение = СтрокаПлощадок.ЗащищенноеСоединение;
		
		// таймаут на запрос соответствует оставшемуся времени на получение ответа от площадок
		Если ТаймаутНаПродажу Тогда
			ДанныеДляОтправкиЗапросаНаПлощадку.ПараметрыЗапросов.Таймаут = (ТаймерОкончаниеЗапросаВМиллисекундах - ТекущаяУниверсальнаяДатаВМиллисекундах()) / 1000;
		Иначе
			ДанныеДляОтправкиЗапросаНаПлощадку.ПараметрыЗапросов.Таймаут = 60;
		КонецЕсли;
		
		РезультатОтправкиНаПлощадку = ОтправитьЗапросПоКодуМаркировкиНаПлощадку(ДанныеДляОтправкиЗапросаНаПлощадку,
			МассивПлощадокКБлокировке,
			ДанныеШтрихкода,
			СтруктураДополнительныхПараметров,
			КешСоединений,
			ЭтоМолочкаИзБеларуси,,
			ТаймаутНаПродажу);
			
		ОтправленЗапрос             = Истина;
		
		ВозвращаемоеЗначение.АварийныйРежим                 = РезультатОтправкиНаПлощадку.АварийныйРежим;
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = РезультатОтправкиНаПлощадку.ТребуетсяОбновлениеКлючаСессии;
		
		ВозвращаемоеЗначение.РезультатыОтправкиЗапросов.Добавить(РезультатОтправкиНаПлощадку.РезультатОтправкиЗапроса);
		
		ВозвращаемоеЗначение.ТекстОшибки = ВозвращаемоеЗначение.ТекстОшибки
			+ ?(ЗначениеЗаполнено(ВозвращаемоеЗначение.ТекстОшибки), Символы.ПС, "")
			+ РезультатОтправкиНаПлощадку.ТекстОшибки;
			
		Для Каждого Запрос Из РезультатОтправкиНаПлощадку.ЗапросыДляЛогирования Цикл
			ЗапросыДляЛогирования.Добавить(Запрос);
		КонецЦикла;
		
		Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
			
			ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
			
			// если была получена ошибка 401 хотя бы по одной площадке - прервать обработку,
			// необходимо обновление ключа сессии
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
		Если ВозвращаемоеЗначение.АварийныйРежим Тогда
			
			ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
			
			// если был получен код 203 хотя бы по одной площадке - прервать обработку,
			// действует аварийный режим
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
		Если Не РезультатОтправкиНаПлощадку.ПараметрыКодаМаркировки = Неопределено Тогда
			
			// по КМ по площадке был получен ответ из ГИС МТ
			ВозвращаемоеЗначение.ПараметрыКодаМаркировки = РезультатОтправкиНаПлощадку.ПараметрыКодаМаркировки;
			ПолученОтвет = Истина;
			
		КонецЕсли;
		
		Если РезультатОтправкиНаПлощадку.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ Тогда
			
			// продажа разрешена как молочка из Беларуси
			ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
			ПолученОтвет = Истина;
			
		КонецЕсли;
		
		Если РезультатОтправкиНаПлощадку.ПерейтиКСледующейПлощадке Тогда
			Продолжить;
		КонецЕсли;
		
		Если РезультатОтправкиНаПлощадку.ПерейтиКСледующемуКМ Тогда
			Прервать;
		КонецЕсли;
		
		Если ПолученОтвет Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	ЛогироватьРезультатыОперацийПроверкиКМ(ЗапросыДляЛогирования);
	
	Возврат ВозвращаемоеЗначение;

КонецФункции

// Возвращает признак принадлежности переданного в параметре вида продукции к молочной продукции ИСМП.
//
// Параметры:
//  ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции для анализа
// Возвращаемое значение:
//  Булево - Принадлежность к виду молочной продукции ИСМП.
//
Функция ЭтоМолочнаяПродукцияИСМП(ВидПродукции) Экспорт
	Возврат ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС");
КонецФункции

// Возвращает параметры для отправки HTTP запросов ИС МП.
//
// Параметры:
//   ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции (В тестовом контуре адреса серверов
//                                                       могут отличаться для различных видов продукции).
//   ИспользоватьTrueAPI - Булево - Использовать true-api.
//   ЗагрузкаCDNПлощадок - Булево - Загрузка CDN-площадок
//
// Возвращаемое значение:
//  Структура - Описание:
//   * ИспользоватьЗащищенноеСоединение - Булево - Признак использования SSL.
//   * Таймаут - Число - Таймаут соединения.
//   * Порт - Число - Порт соединения.
//   * Сервер - Строка - Адрес сервера.
//   * ПредставлениеСервиса - Строка - Представления сервиса.
//
Функция ПараметрыОтправкиHTTPЗапросов(ВидПродукции = Неопределено, ИспользоватьTrueAPI = Ложь, ЗагрузкаCDNПлощадок = Ложь) Экспорт
	
	ПараметрыОтправкиHTTPЗапросов = Новый Структура;
	ПараметрыОтправкиHTTPЗапросов.Вставить("ПредставлениеСервиса",             НСтр("ru = 'ГИС МТ'"));
	ПараметрыОтправкиHTTPЗапросов.Вставить("Сервер",                           АдресСервера(ВидПродукции, ИспользоватьTrueAPI, ЗагрузкаCDNПлощадок));
	ПараметрыОтправкиHTTPЗапросов.Вставить("Порт",                             443);
	ПараметрыОтправкиHTTPЗапросов.Вставить("Таймаут",                          60);
	ПараметрыОтправкиHTTPЗапросов.Вставить("ИспользоватьЗащищенноеСоединение", Истина);
	
	Возврат ПараметрыОтправкиHTTPЗапросов;
	
КонецФункции

Функция АдресСервера(ВидПродукции = Неопределено, ИспользоватьTrueAPI = Ложь, ЗагрузкаCDNПлощадок = Ложь) Экспорт
	
	РежимРаботыСТестовымКонтуромИСМП = Константы.РазрешительныйРежимТестовыйКонтур.Получить();
	
	Если РежимРаботыСТестовымКонтуромИСМП Тогда
		Если ИспользоватьTrueAPI Или ЗагрузкаCDNПлощадок Тогда
			Возврат "markirovka.sandbox.crptech.ru";
		Иначе
			Возврат "sandbox.crptech.ru";
		КонецЕсли;
	Иначе
		Если ЗагрузкаCDNПлощадок Тогда
			Возврат "cdn.crpt.ru";
		ИначеЕсли ИспользоватьTrueAPI Тогда
			Возврат "markirovka.crpt.ru";
		Иначе
			Возврат "ismp.crpt.ru";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ОбъектВТекстJSON(Структура, УдалитьПробелыИПереносыСтрок = Ложь) Экспорт
	
	Если УдалитьПробелыИПереносыСтрок Тогда
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, "");
	Иначе
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "  ");
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписатьJSON(ЗаписьJSON, Структура);
	
	ТекстJSON = ЗаписьJSON.Закрыть();
	
	Возврат ТекстJSON;
	
КонецФункции

Функция ПараметрыОтправкиЗапросовНаCDNПлощадку()
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("URLЗапроса",           "");
	СтруктураПараметров.Вставить("ТелоЗапросаJSON",      "");
	СтруктураПараметров.Вставить("КлючСессии",           Неопределено);
	СтруктураПараметров.Вставить("ПараметрыЗапроса",     Неопределено);
	СтруктураПараметров.Вставить("ПараметрыЗапросов",    Неопределено);
	СтруктураПараметров.Вставить("ЗаголовокHTTP",        Неопределено);
	СтруктураПараметров.Вставить("АдресПлощадки",        "");
	СтруктураПараметров.Вставить("Сервер",               "");
	СтруктураПараметров.Вставить("Порт",                 0);
	СтруктураПараметров.Вставить("ЗащищенноеСоединение", Ложь);
	
	Возврат СтруктураПараметров;
	
КонецФункции

Функция ОтправитьЗапросПоКодуМаркировкиНаПлощадку(ДанныеДляОтправкиЗапросаНаПлощадку, МассивПлощадокКБлокировке, ДанныеШтрихкода, СтруктураДополнительныхПараметров, КешСоединений = Неопределено, ЭтоМолочкаИзБеларуси = Ложь, КешОбработаннойМолочкиИзБеларуси = Неопределено, ТаймаутНаПродажу = Истина)
	
	ВозвращаемоеЗначение = Новый Структура();
	ВозвращаемоеЗначение.Вставить("АварийныйРежим",                         Ложь);
	ВозвращаемоеЗначение.Вставить("ПерейтиКСледующейПлощадке",              Ложь);
	ВозвращаемоеЗначение.Вставить("ПерейтиКСледующемуКМ",                   Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессии",         Ложь);
	ВозвращаемоеЗначение.Вставить("ПараметрыКодаМаркировки",                Неопределено);
	ВозвращаемоеЗначение.Вставить("ПродажаРазрешенаВОтсутствиеОтветаГИСМТ", Ложь);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",               Неопределено);
	ВозвращаемоеЗначение.Вставить("ЗапросыДляЛогирования",                  Новый Массив);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                            "");
	
	Если КешСоединений = Неопределено Тогда
		Соединение = Неопределено;
	Иначе
		Соединение = КешСоединений.Получить(ДанныеДляОтправкиЗапросаНаПлощадку);
	КонецЕсли;
	
	РезультатЗапроса = ОтправитьДанныеВСервис(
		ДанныеДляОтправкиЗапросаНаПлощадку.URLЗапроса,
		ДанныеДляОтправкиЗапросаНаПлощадку.ТелоЗапросаJSON,
		ДанныеДляОтправкиЗапросаНаПлощадку.КлючСессии,
		"POST",
		ДанныеДляОтправкиЗапросаНаПлощадку.ПараметрыЗапросов,
		ДанныеДляОтправкиЗапросаНаПлощадку.ЗаголовокHTTP,
		,
		Соединение);
	
	Если Не Соединение = Неопределено Тогда
		КешСоединений.Вставить(ДанныеДляОтправкиЗапросаНаПлощадку, Соединение);
	КонецЕсли;
	
	АдресСервера = ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки;
	
	РезультатОтправкиЗапроса = ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	Если Не РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		// ответ не получен, либо таймаут, либо иные проблемы, продолжить в рамках исходного таймера проход по площадкам
		ВозвращаемоеЗначение.ПерейтиКСледующейПлощадке = Истина;
		
		Если Не ТаймаутНаПродажу Тогда
			
			ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(
				ДанныеДляОтправкиЗапросаНаПлощадку.URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
		ПараметрыЗаписиВЛог = ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(АдресСервера, "Таймаут", ДанныеШтрихкода, РезультатОтправкиЗапроса.ТекстОшибки, РезультатЗапроса.HTTPЗапрос.ПолучитьТелоКакСтроку());
		ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЗаписиВЛог);
		
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
	Если Не РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
		
		ПараметрыЗаписиВЛог = ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(АдресСервера, Формат(РезультатЗапроса.HTTPОтвет.КодСостояния, "ЧГ=0;"), ДанныеШтрихкода, РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON, РезультатЗапроса.HTTPЗапрос.ПолучитьТелоКакСтроку());
		ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЗаписиВЛог);
		
		Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
			
			// если нет ключа сессии, остальные коды можно не проверять
			ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = Истина;
			Возврат ВозвращаемоеЗначение;
			
		ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = 429
			Или Лев(Строка(РезультатОтправкиЗапроса.КодСостояния), 1) = "5" Тогда
			
			Если ЭтоМолочкаИзБеларуси Тогда
				
				// получение первого ответа 500 по коду молочки из Беларуси
				Если КешОбработаннойМолочкиИзБеларуси = Неопределено Тогда
					
					КешОбработаннойМолочкиИзБеларуси = Новый Массив;
					КешОбработаннойМолочкиИзБеларуси.Добавить(ДанныеШтрихкода);
				
					РезультатОтправкиНаПлощадку = ОтправитьЗапросПоКодуМаркировкиНаПлощадку(ДанныеДляОтправкиЗапросаНаПлощадку, МассивПлощадокКБлокировке, ДанныеШтрихкода, СтруктураДополнительныхПараметров, КешСоединений, ЭтоМолочкаИзБеларуси, КешОбработаннойМолочкиИзБеларуси, ТаймаутНаПродажу);
					
					ВозвращаемоеЗначение.АварийныйРежим                 = РезультатОтправкиНаПлощадку.АварийныйРежим;
					ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = РезультатОтправкиНаПлощадку.ТребуетсяОбновлениеКлючаСессии;
					
					Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии Тогда
						Возврат ВозвращаемоеЗначение;
					КонецЕсли;
					
					Если ВозвращаемоеЗначение.АварийныйРежим Тогда
						Возврат ВозвращаемоеЗначение;
					КонецЕсли;
					
					// если повторный запрос по молочке вернул ответ, то он будет действующим
					ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = РезультатОтправкиНаПлощадку.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ;
					ВозвращаемоеЗначение.ПараметрыКодаМаркировки                = РезультатОтправкиНаПлощадку.ПараметрыКодаМаркировки;
					
					ВозвращаемоеЗначение.ПерейтиКСледующейПлощадке = РезультатОтправкиНаПлощадку.ПерейтиКСледующейПлощадке;
					ВозвращаемоеЗначение.ПерейтиКСледующемуКМ      = РезультатОтправкиНаПлощадку.ПерейтиКСледующемуКМ;
					
				Иначе
					
					// получение повторной ошибки 500 по молочке из Беларуси,
					// разрешить продажу
					Если КешОбработаннойМолочкиИзБеларуси.Найти(ДанныеШтрихкода) <> Неопределено Тогда
						
						ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
						ВозвращаемоеЗначение.ПерейтиКСледующемуКМ                   = Истина;
						
					КонецЕсли;
					
				КонецЕсли;
				
				Если Не ТаймаутНаПродажу Тогда
			
					ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(
						ДанныеДляОтправкиЗапросаНаПлощадку.URLЗапроса,
						РезультатОтправкиЗапроса);
					
				КонецЕсли;
				
				Возврат ВозвращаемоеЗначение;
				
			Иначе
			
				// если ошибки обмена, запомнить ошибку и перейти к следующей площадке
				ТекущиеПлощадкиСОшибкамиОбмена = ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаИСМП.Получить();
				
				Если ТекущиеПлощадкиСОшибкамиОбмена = Неопределено Тогда
					ТекущиеПлощадкиСОшибкамиОбмена = Новый Массив;
				КонецЕсли;
				
				// получение первого ответа 500
				Если ТекущиеПлощадкиСОшибкамиОбмена.Найти(ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки) = Неопределено Тогда
					
					ТекущиеПлощадкиСОшибкамиОбмена.Добавить(ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки);
					ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаИСМП = Новый ХранилищеЗначения(ТекущиеПлощадкиСОшибкамиОбмена);
					
					РезультатОтправкиНаПлощадку = ОтправитьЗапросПоКодуМаркировкиНаПлощадку(ДанныеДляОтправкиЗапросаНаПлощадку, МассивПлощадокКБлокировке, ДанныеШтрихкода, СтруктураДополнительныхПараметров, КешСоединений, ЭтоМолочкаИзБеларуси,, ТаймаутНаПродажу);
					
					ВозвращаемоеЗначение.АварийныйРежим                 = РезультатОтправкиНаПлощадку.АварийныйРежим;
					ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессии = РезультатОтправкиНаПлощадку.ТребуетсяОбновлениеКлючаСессии;
					ВозвращаемоеЗначение.ЗапросыДляЛогирования          = РезультатОтправкиНаПлощадку.ЗапросыДляЛогирования;
					
					Если РезультатОтправкиНаПлощадку.ТребуетсяОбновлениеКлючаСессии Тогда
						Возврат ВозвращаемоеЗначение;
					КонецЕсли;
					
					Если ВозвращаемоеЗначение.АварийныйРежим Тогда
						Возврат ВозвращаемоеЗначение;
					КонецЕсли;
					
					ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = РезультатОтправкиНаПлощадку.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ;
					ВозвращаемоеЗначение.ПараметрыКодаМаркировки                = РезультатОтправкиНаПлощадку.ПараметрыКодаМаркировки;
					
					ВозвращаемоеЗначение.ПерейтиКСледующейПлощадке = РезультатОтправкиНаПлощадку.ПерейтиКСледующейПлощадке;
					ВозвращаемоеЗначение.ПерейтиКСледующемуКМ      = РезультатОтправкиНаПлощадку.ПерейтиКСледующемуКМ;
					
				Иначе
					
					// получение повторной ошибки 500
					// разрешить продажу и заблокировать площадку
					МассивПлощадокКБлокировке.Добавить(ДанныеДляОтправкиЗапросаНаПлощадку.АдресПлощадки);
					
					ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
					ВозвращаемоеЗначение.ПерейтиКСледующейПлощадке              = Истина;
					
				КонецЕсли;
				
				Если Не ТаймаутНаПродажу Тогда
			
					ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(
						ДанныеДляОтправкиЗапросаНаПлощадку.URLЗапроса,
						РезультатОтправкиЗапроса);
					
				КонецЕсли;
				
				Возврат ВозвращаемоеЗначение;
				
			КонецЕсли;
			
		ИначеЕсли РезультатОтправкиЗапроса.КодСостояния = АварийныйРежимКодОтветаСервисаГИСМТ() Тогда
			
			// если аварийный режим, остальные коды можно не проверять
			ВключитьАварийныйРежимРазрешительнойСистемы();
			
			ВозвращаемоеЗначение.АварийныйРежим                         = Истина;
			ВозвращаемоеЗначение.ПродажаРазрешенаВОтсутствиеОтветаГИСМТ = Истина;
			ВозвращаемоеЗначение.ПерейтиКСледующемуКМ                   = Истина;
			
			Возврат ВозвращаемоеЗначение;
			
		Иначе
			
			ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(
				ДанныеДляОтправкиЗапросаНаПлощадку.URLЗапроса,
				РезультатОтправкиЗапроса);
				
			Возврат ВозвращаемоеЗначение;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ДанныеОбработки = ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON, Истина);
	
	Если ДанныеОбработки = Неопределено Тогда
		
		ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(
			ДанныеДляОтправкиЗапросаНаПлощадку.URLЗапроса,
			РезультатОтправкиЗапроса);
			
		ВозвращаемоеЗначение.ПерейтиКСледующейПлощадке = Истина;
		Возврат ВозвращаемоеЗначение;
		
	Иначе
		
		ДанныеПоКодамМаркировки = ДанныеОбработки.Получить("codes");
		Если ТипЗнч(ДанныеПоКодамМаркировки) = Тип("Массив") Тогда
			
			Для Каждого ЭлементДанных Из ДанныеПоКодамМаркировки Цикл
				
				КодОшибки         = ЭлементДанных["errorCode"];
				СообщениеОбОшибке = ЭлементДанных["message"];
				ТекстОшибки       = "";
				
				Если ЗначениеЗаполнено(КодОшибки) Тогда
					
					Если КодОшибки = 1 Тогда
						ТекстОшибки = НСтр("ru = 'Ошибка валидации КМ в ГИС МТ.'");
					ИначеЕсли КодОшибки = 2 Тогда
						ТекстОшибки = НСтр("ru = 'КМ не содержит GTIN.'");
					ИначеЕсли КодОшибки = 3 Тогда
						ТекстОшибки = НСтр("ru = 'КМ не содержит серийный номер.'");
					ИначеЕсли КодОшибки = 4 Тогда
						ТекстОшибки = НСтр("ru = 'КМ содержит недопустимые символы.'");
					ИначеЕсли КодОшибки = 5 Тогда
						ТекстОшибки = НСтр("ru = 'Ошибка верификации крипто-подписи КМ в ГИС МТ (формат крипто-подписи не соответствует типу КМ).'");
					ИначеЕсли КодОшибки = 6 Тогда
						ТекстОшибки = НСтр("ru = 'Ошибка верификации крипто-подписи КМ в ГИС МТ (крипто-подпись не валидная).'");
					ИначеЕсли КодОшибки = 7 Тогда
						ТекстОшибки = НСтр("ru = 'Ошибка верификации крипто-подписи КМ в ГИС МТ (крипто-ключ не валиден).'");
					ИначеЕсли КодОшибки = 8 Тогда
						ТекстОшибки = НСтр("ru = 'КМ не прошел верификацию в стране эмитента.'");
					ИначеЕсли КодОшибки = 9 Тогда
						ТекстОшибки = НСтр("ru = 'Найденные AI в КМ не поддерживаются.'");
					ИначеЕсли КодОшибки = 10 Тогда
						ТекстОшибки = НСтр("ru = 'КМ не найден в ГИС МТ.'");
					Иначе
						
						ШаблонПодсказки   = НСтр("ru = 'Неклассифицированная ошибка отправки запроса по КМ в ГИС МТ.
						|Описание из сервиса: %1.'");
						
						Если СообщениеОбОшибке <> Неопределено Тогда
							ТекстИзГИСМТ = СтрЗаменить(СообщениеОбОшибке, Символ(29), "");
						Иначе
							ТекстИзГИСМТ = "отсутствует";
						КонецЕсли;
						
						ТекстОшибки = СтрШаблон(ШаблонПодсказки, ТекстИзГИСМТ);
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ТекстОшибки) И ТаймаутНаПродажу Тогда
						
						ДанныеШтрихкода.ТекстОшибки               = ТекстОшибки;
						ДанныеШтрихкода.КонтролиРазрешительногоРежима.Добавить(ТекстОшибки);
						
					КонецЕсли;
					
					ВозвращаемоеЗначение.ПерейтиКСледующемуКМ = Истина;
					
				Иначе
					
					ПараметрыКодаМаркировки = ПараметрыКодаМаркировкиМОТП(ЭлементДанных, ДанныеШтрихкода.ВидПродукции, СтруктураДополнительныхПараметров);
					ТекстОшибки = "";
					
					Если Не ЗначениеЗаполнено(ДанныеШтрихкода.ВидПродукции)
						И ЗначениеЗаполнено(ПараметрыКодаМаркировки.ВидПродукции) Тогда
						ДанныеШтрихкода.ВидПродукции = ПараметрыКодаМаркировки.ВидПродукции;
					КонецЕсли;
					
					//+ОЛИМП Проверка срока годности для Молочная продукция, Пиво и слабоалкогольные напитки, Упакованная вода
					Если ДанныеШтрихкода.ВидПродукции = Перечисления.ВидыПродукцииИС.Пиво 
						Или ДанныеШтрихкода.ВидПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС
						Или ДанныеШтрихкода.ВидПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС
						Или ДанныеШтрихкода.ВидПродукции = Перечисления.ВидыПродукцииИС.УпакованнаяВода
					Тогда
						Если ПараметрыКодаМаркировки.ГоденДо < ТекущаяДатаСеанса() Тогда
							ТекстОшибки = Нстр("ru = 'Истек срок годности.'");
						КонецЕсли;
					КонецЕсли;
					//-ОЛИМП
					
					Если ЭлементДанных["valid"] = Ложь Тогда
						
						ТекстОшибки = НСтр("ru = 'Структура данных кода маркировки некорректна.'");
						
					ИначеЕсли ЭлементДанных["verified"] = Ложь Тогда
						
						ТекстОшибки = НСтр("ru = 'Проверка крипто-подписи кода маркировки в ГИС МТ завершилась с ошибкой.'");
						
					ИначеЕсли ЭлементДанных["found"] = Ложь Тогда
						
						ТекстОшибки = НСтр("ru = 'Код маркировки не найден в ГИС МТ.'");
						
					//+ОЛИМП ДопПроверки по методичке
					ИначеЕсли ЭлементДанных["utilised"] = Ложь Тогда
						
						ТекстОшибки = НСтр("ru = 'Код маркировки не нанесен на упаковку по данным ГИС МТ.'");
						
					ИначеЕсли ЭлементДанных["sold"] = Истина Тогда
						
						ТекстОшибки = НСтр("ru = 'Код маркировки выведен из оборота.'");
						
					ИначеЕсли ЭлементДанных["realizable"] = Ложь Тогда
						
						ТекстОшибки = НСтр("ru = 'Нет информации о вводе в оборот по данным ГИС МТ.'");
					//-ОЛИМП
						
					ИначеЕсли СообщениеОбОшибке <> Неопределено Тогда
						
						ШаблонПодсказки   = НСтр("ru = 'Неклассифицированная ошибка отправки запроса по КМ в ГИС МТ.
						|Описание из сервиса: %1.'");
						
						ТекстОшибки = СтрШаблон(ШаблонПодсказки, СтрЗаменить(СообщениеОбОшибке, Символ(29), ""));
						
					КонецЕсли;
						
					Если ПараметрыКодаМаркировки.ПродажаЗаблокирована
						И ПараметрыКодаМаркировки.СписокОрганизацийБлокировкиКМ.Количество() Тогда
						
						ШаблонОшибки = НСтр("ru = 'Оборот товара был заблокирован.
											//|
											|Организации, принявшие решение о блокировке товара: 
											|%1.'");
						
						МассивПредставленийОрганизацийПоИдентификаторам = 
							ОрганыВластиУстанавливающиеБлокировкуНаКМПоДаннымГИСМТ(ПараметрыКодаМаркировки.СписокОрганизацийБлокировкиКМ);
					
						ТекстОшибки = СтрШаблон(ШаблонОшибки,
							СтрСоединить(МассивПредставленийОрганизацийПоИдентификаторам, ", "));
						
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ТекстОшибки) И ТаймаутНаПродажу Тогда
						
						ДанныеШтрихкода.ТекстОшибки = ТекстОшибки;
						ДанныеШтрихкода.КонтролиРазрешительногоРежима.Добавить(ТекстОшибки);
						
					КонецЕсли;
					
					РазрешительныйРежимДатаЗапросаГИСМТ = ДанныеОбработки.Получить("reqTimestamp");
					ПараметрыКодаМаркировки.РазрешительныйРежимДатаЗапросаГИСМТ          = Формат(РазрешительныйРежимДатаЗапросаГИСМТ, "ЧГ=;"); 
					
					ПараметрыКодаМаркировки.РазрешительныйРежимИдентификаторЗапросаГИСМТ = ДанныеОбработки.Получить("reqId");
					ПараметрыКодаМаркировки.РазрешительныйРежимАдресСервера              = АдресСервера;
					ПараметрыКодаМаркировки.РазрешительныйРежимТелоЗапросаJSON           = РезультатЗапроса.HTTPЗапрос.ПолучитьТелоКакСтроку();
					ПараметрыКодаМаркировки.РазрешительныйРежимТелоОтветаJSON            = РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON;
					ПараметрыКодаМаркировки.РазрешительныйРежимКодОтвета                 = Формат(РезультатЗапроса.HTTPОтвет.КодСостояния, "ЧГ=0;");
					
					ВозвращаемоеЗначение.ПараметрыКодаМаркировки = ПараметрыКодаМаркировки;
					ВозвращаемоеЗначение.ПерейтиКСледующемуКМ    = Истина;
					
					Если СтруктураДополнительныхПараметров.ЛогироватьУспешныеПроверки Тогда
						
						ПараметрыЗаписиВЛог = ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(АдресСервера,
							РезультатОтправкиЗапроса.КодСостояния, ДанныеШтрихкода, ПараметрыКодаМаркировки.РазрешительныйРежимТелоОтветаJSON, 
							ПараметрыКодаМаркировки.РазрешительныйРежимТелоЗапросаJSON, ПараметрыКодаМаркировки.РазрешительныйРежимДатаЗапросаГИСМТ,
							ПараметрыКодаМаркировки.РазрешительныйРежимИдентификаторЗапросаГИСМТ);
						
						ВозвращаемоеЗначение.ЗапросыДляЛогирования.Добавить(ПараметрыЗаписиВЛог);
					
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ОтправитьДанныеВСервис(АдресЗапроса, ТелоЗапроса, КлючСессии, HTTPМетод, ПараметрыОтправкиHTTPЗапросов, ЗаголовокHTTP = Неопределено, HTTPОтветЭмуляция = Неопределено, Соединение = Неопределено) Экспорт
	
	//РасширенныеОбработкиОтправкиДанныхВСервис(ПараметрыОтправкиHTTPЗапросов);
	
	ЭтоДвоичныеДанные = ТипЗнч(ТелоЗапроса) = Тип("ДвоичныеДанные");
	ЭтоФайл           = ТипЗнч(ТелоЗапроса) = Тип("Файл");
	
	Если ТелоЗапроса <> Неопределено И ТипЗнч(ТелоЗапроса) = Тип("Строка") Тогда
		ТелоЗапросаJSON = ТелоЗапроса;
	ИначеЕсли ТелоЗапроса <> Неопределено И Не ЭтоДвоичныеДанные И Не ЭтоФайл Тогда
		ТелоЗапросаJSON = ОбъектВТекстJSON(ТелоЗапроса, Истина);
	КонецЕсли;
	
	Если ЗаголовокHTTP = Неопределено Тогда
		ЗаголовокHTTP = Новый Соответствие();
		ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
		ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
		Если КлючСессии <> Неопределено Тогда
			ЗаголовокHTTP.Вставить("Authorization", СтрШаблон("Bearer %1", КлючСессии));
		КонецЕсли;
	КонецЕсли;
	
	HTTPЗапрос  = Новый HTTPЗапрос(АдресЗапроса, ЗаголовокHTTP);
	Если ТелоЗапроса <> Неопределено Тогда
		Если ЭтоДвоичныеДанные Тогда
			HTTPЗапрос.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);
		ИначеЕсли ЭтоФайл Тогда
			HTTPЗапрос.УстановитьИмяФайлаТела(ТелоЗапроса.ПолноеИмя);
		Иначе
			HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапросаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		КонецЕсли;
	КонецЕсли;
	HTTPОтвет   = Неопределено;
	ТекстОшибки = "";
	
	Если ПараметрыОтправкиHTTPЗапросов.ИспользоватьЗащищенноеСоединение Тогда
		ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("HTTPS");
		ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
	Иначе
		ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("HTTP");
		ЗащищенноеСоединение = Неопределено;
	КонецЕсли;
	
	Если HTTPОтветЭмуляция = Неопределено Тогда
		
		Попытка
			
			Если Соединение = Неопределено Тогда
				
				Соединение = Новый HTTPСоединение(
					ПараметрыОтправкиHTTPЗапросов.Сервер,
					ПараметрыОтправкиHTTPЗапросов.Порт,,,
					ИнтернетПрокси,
					ПараметрыОтправкиHTTPЗапросов.Таймаут,
					ЗащищенноеСоединение);
					
			КонецЕсли;
			
			Если HTTPМетод = "POST" Тогда
				HTTPОтвет = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
			Иначе
				HTTPОтвет = Соединение.ВызватьHTTPМетод(HTTPМетод, HTTPЗапрос);
			КонецЕсли;
			
		Исключение
			
			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'ИСМП'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,
				СтрШаблон(
					НСтр("ru = 'Ошибка при выполнении запроса POST %1 в ИС МП %2'"),
					АдресЗапроса, АдресСервера()) + Символы.ПС +
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		КонецПопытки;
		
	Иначе
		
		HTTPОтвет = HTTPОтветЭмуляция;
		
	КонецЕсли;
	
	ПутьКФайлу = Неопределено;
	
	//+ОЛИМП Логируем только в регистр в файл не логируем!
	////ОбщегоНазначенияИСМППереопределяемый.ПриОпределенииПутиКФайлуЛогирования(ПутьКФайлу);
	//Если ПутьКФайлу <> Неопределено Тогда
	//	ВывестиHTTPЗапросВЛог(HTTPЗапрос, ПараметрыОтправкиHTTPЗапросов, HTTPМетод, ПутьКФайлу);
	//	ВывестиHTTPЗапросВЛог(HTTPОтвет,  Неопределено, Неопределено, ПутьКФайлу, ТекстОшибки);
	//КонецЕсли;
	//
	//ПараметрыЛогированияЗапросов = ЛогированиеЗапросовИСМП.ПараметрыЛогированияЗапросов();
	//ДанныеЗаписи                 = ЛогированиеЗапросовИС.НоваяСтруктураДанныхЗаписи();
	//ДанныеЗаписи.HTTPЗапросОтвет = HTTPЗапрос;
	//ДанныеЗаписи.АдресРесурса    = URLЗапроса(HTTPЗапрос, ПараметрыОтправкиHTTPЗапросов, HTTPМетод);
	//ДанныеЗаписи.HTTPМетод       = HTTPМетод;
	//ЛогированиеЗапросовИС.Вывести(ДанныеЗаписи, ПараметрыЛогированияЗапросов);
	//
	//ДанныеЗаписи                 = ЛогированиеЗапросовИС.НоваяСтруктураДанныхЗаписи();
	//ДанныеЗаписи.HTTPЗапросОтвет = HTTPОтвет;
	//ДанныеЗаписи.ТекстОшибки     = ТекстОшибки;
	//ЛогированиеЗапросовИС.Вывести(ДанныеЗаписи, ПараметрыЛогированияЗапросов);
	//
	//Если ПараметрыОтправкиHTTPЗапросов.Свойство("ДатаПоследнегоЗапроса") Тогда
	//	ПараметрыОтправкиHTTPЗапросов.ДатаПоследнегоЗапроса = ТекущаяДатаСеанса();
	//КонецЕсли;
	//
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ПараметрыОтправкиHTTPЗапросов", ПараметрыОтправкиHTTPЗапросов);
	ВозвращаемоеЗначение.Вставить("HTTPМетод",                     HTTPМетод);
	ВозвращаемоеЗначение.Вставить("HTTPЗапрос",                    HTTPЗапрос);
	ВозвращаемоеЗначение.Вставить("HTTPОтвет",                     HTTPОтвет);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                   ТекстОшибки);
	
	//+ОЛИМП Логируем только в регистр в файл не логируем!
	//ЛогированиеЗапросовИСМП.ВывестиДанныеДляПротоколаОбмена(ВозвращаемоеЗначение);

	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса) Экспорт
	
	ВозвращаемоеЗначение = Неопределено;
	
	РезультатОтправкиHTTPЗапроса = РезультатHTTPЗапроса();
	РезультатОтправкиHTTPЗапроса.ТекстОшибки = РезультатЗапроса.ТекстОшибки;
	Если РезультатЗапроса.HTTPОтвет <> Неопределено Тогда
		РезультатОтправкиHTTPЗапроса.КодСостояния = РезультатЗапроса.HTTPОтвет.КодСостояния;
		РезультатОтправкиHTTPЗапроса.Заголовки    = РезультатЗапроса.HTTPОтвет.Заголовки;
		Если ТипЗнч(РезультатЗапроса.HTTPОтвет) = Тип("Структура") Тогда
			РезультатОтправкиHTTPЗапроса.ТекстОтвета = РезультатЗапроса.HTTPОтвет.Тело;
		Иначе
			РезультатОтправкиHTTPЗапроса.ТекстОтвета = РезультатЗапроса.HTTPОтвет.ПолучитьТелоКакСтроку();
		КонецЕсли;
	КонецЕсли;
	
	КодСостояния = РезультатОтправкиHTTPЗапроса.КодСостояния;
	ТекстОтвета  = РезультатОтправкиHTTPЗапроса.ТекстОтвета;
	
	Если ЗначениеЗаполнено(ТекстОтвета) Тогда
		
		ВозвращаемоеЗначение = HTTPОтветПолучен(ТекстОтвета, КодСостояния, Ложь, РезультатЗапроса);
		
	Иначе
		
		Если Не ЗначениеЗаполнено(КодСостояния) Тогда
			ТекстСообщенияXMLОтправлен = Ложь;
			ЗаголовокОшибки = НСтр("ru = 'HTTP-запрос не отправлен.'");
		Иначе
			ТекстСообщенияXMLОтправлен = Истина;
			ЗаголовокОшибки = СтрШаблон(НСтр("ru = 'Код состояния HTTP: %1.'"), КодСостояния);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РезультатОтправкиHTTPЗапроса.ТекстОшибки) Тогда
			ТекстОшибки = ЗаголовокОшибки + Символы.ПС + РезультатОтправкиHTTPЗапроса.ТекстОшибки;
		Иначе
			ТекстОшибки = ЗаголовокОшибки;
		КонецЕсли;
		
		ВозвращаемоеЗначение = HTTPОтветНеПолучен(
			ТекстОшибки,
			ТекстСообщенияXMLОтправлен,
			КодСостояния,
			Ложь, РезультатЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция РезультатHTTPЗапроса() Экспорт
	
	РезультатHTTPЗапроса = Новый Структура;
	РезультатHTTPЗапроса.Вставить("КодСостояния");
	РезультатHTTPЗапроса.Вставить("Заголовки");
	РезультатHTTPЗапроса.Вставить("ТекстОтвета");
	РезультатHTTPЗапроса.Вставить("ТекстОшибки");
	
	Возврат РезультатHTTPЗапроса;
	
КонецФункции

Функция HTTPОтветПолучен(ТекстВходящегоСообщенияJSON, КодСостояния = 200, КакФайл = Ложь, ДополнительныеПараметры = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	ВозвращаемоеЗначение.Вставить("ЗапросОтправлен",         Истина);
	ВозвращаемоеЗначение.Вставить("ОтветПолучен",            Истина);
	
	ВозвращаемоеЗначение.Вставить("КодСостояния", КодСостояния);
	ВозвращаемоеЗначение.Вставить("Объект",       Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",  "");
	
	Если КакФайл Тогда
		ВозвращаемоеЗначение.Вставить("ИмяФайла", ТекстВходящегоСообщенияJSON);
	Иначе
		Попытка
			ВозвращаемоеЗначение.Объект = ТекстJSONВОбъект(ТекстВходящегоСообщенияJSON, Ложь);
		Исключение
			ВозвращаемоеЗначение.Объект = ТекстJSONВОбъект(ТекстВходящегоСообщенияJSON, Истина);
		КонецПопытки;
		
		ВозвращаемоеЗначение.Вставить("ТекстВходящегоСообщения", ТекстВходящегоСообщенияJSON);
		Если ВозвращаемоеЗначение.Объект <> Неопределено Тогда
			ВозвращаемоеЗначение.Вставить("ТекстВходящегоСообщенияJSON", ОбъектВТекстJSON(ВозвращаемоеЗначение.Объект));
		Иначе
			ВозвращаемоеЗначение.Вставить("ТекстВходящегоСообщенияJSON", ТекстВходящегоСообщенияJSON);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ТекстJSONВОбъект(ТекстJSON, ПреобразовыватьВСоответствие = Ложь) Экспорт
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	
	Попытка
		РезультатРазбора = ПрочитатьJSON(Чтение, ПреобразовыватьВСоответствие);
	Исключение
		РезультатРазбора = Неопределено;
	КонецПопытки;
	
	Возврат РезультатРазбора;
	
КонецФункции

// Инициализирует структуру результата обработки HTTP-запроса после отправки сообщения, но до получения ответа.
// 
// Возвращаемое значение:
// Структура:
//   ЗапросОтправлен             - Булево - признак того, что сообщение отправлено.
//   ОтветПолучен                - Булево - признак того, что сообщение получено.
//   КодСостояния                - Число  - Код состояния HTTP-запроса.
//   ТекстОшибки                 - Строка - текст ошибки, если таковая возникла.
//   ТекстВходящегоСообщенияJSON - Строка - текст ответа, на отправленное сообщение.
//
Функция HTTPОтветНеПолучен(Ошибка, ЗапросОтправлен, КодСостояния = Неопределено, КакФайл = Ложь, ДополнительныеПараметры = Неопределено)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	ВозвращаемоеЗначение.Вставить("ЗапросОтправлен",         ЗапросОтправлен);
	ВозвращаемоеЗначение.Вставить("ОтветПолучен",            Ложь);
	
	ВозвращаемоеЗначение.Вставить("КодСостояния", КодСостояния);
	ВозвращаемоеЗначение.Вставить("Объект",       Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",  Строка(Ошибка));
	
	Если КакФайл Тогда
		ВозвращаемоеЗначение.Вставить("ИмяФайла", "");
	Иначе
		ВозвращаемоеЗначение.Вставить("ТекстВходящегоСообщения",     "");
		ВозвращаемоеЗначение.Вставить("ТекстВходящегоСообщенияJSON", "");
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ТекстОшибкиПоРезультатуОтправкиЗапроса(URLЗапроса, РезультатОтправкиЗапроса) Экспорт
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда

		ТекстОшибки = СтрШаблон(
			НСтр("ru='При выполнении запроса %1 возникла ошибка.
				     |Код состояния HTTP: %2.
				     |Текст ошибки: %3.'"),
			URLЗапроса,
			РезультатОтправкиЗапроса.КодСостояния,
			ПредставлениеОшибкиИзJSON(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON));
			
	Иначе
		
		ТекстОшибки = СтрШаблон(
			НСтр("ru='При отправке запроса %1 возникла ошибка.
				     |Текст ошибки: %2.'"),
			URLЗапроса,
			РезультатОтправкиЗапроса.ТекстОшибки);

	КонецЕсли;
	
	Возврат ТекстОшибки;

КонецФункции

// Конвертирует входящий текст JSON содержащий globalErrors в представление ошибки.
// 
// Параметры:
// 	ТекстВходящегоСообщенияJSON - Строка - Текст сообщения JSON.
// Возвращаемое значение:
// 	Строка - Представление ошибки.
Функция ПредставлениеОшибкиИзJSON(ТекстВходящегоСообщенияJSON)
	
	ДанныеJSON = ТекстJSONВОбъект(ТекстВходящегоСообщенияJSON);
	
	Если ДанныеJSON <> Неопределено
		И ТипЗнч(ДанныеJSON) = Тип("Структура")
		И ДанныеJSON.Свойство("globalErrors")
		И ТипЗнч(ДанныеJSON.globalErrors) = Тип("Массив") Тогда
		
		ТекстыОшибок = Новый Массив;
		Для Каждого СтрокаОшибки Из ДанныеJSON.globalErrors Цикл
			
			Если Не (ТипЗнч(СтрокаОшибки) = Тип("Строка") Или ТипЗнч(СтрокаОшибки) = Тип("Структура")) Тогда
				Возврат ТекстВходящегоСообщенияJSON;
			КонецЕсли;
			
			Если ТипЗнч(СтрокаОшибки) = Тип("Строка") И ЗначениеЗаполнено(СтрокаОшибки) Тогда
				ТекстыОшибок.Добавить(ТекстПредставленияОшибки(СтрокаОшибки));
			ИначеЕсли ТипЗнч(СтрокаОшибки) = Тип("Структура") Тогда
				
				ТекстОшибки = Неопределено;
				КодОшибки   = Неопределено;
				СтрокаОшибки.Свойство("error",     ТекстОшибки);
				СтрокаОшибки.Свойство("errorCode", КодОшибки);
				ПредставлениеОшибки = СокрЛП(СтрШаблон("%1: %2", КодОшибки, ТекстОшибки));
				Если ЗначениеЗаполнено(КодОшибки) Или ЗначениеЗаполнено(ТекстОшибки) Тогда
					ТекстыОшибок.Добавить(ПредставлениеОшибки);
				Иначе
					Возврат ТекстВходящегоСообщенияJSON;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ДанныеJSON.Свойство("fieldErrors") И ТипЗнч(ДанныеJSON.fieldErrors) = Тип("Массив") Тогда
			
			Для Каждого СтрокаОшибкиПоля Из ДанныеJSON.fieldErrors Цикл
				
				ИмяПоля     = Неопределено;
				ТекстОшибки = Неопределено;
				СтрокаОшибкиПоля.Свойство("fieldName",  ИмяПоля);
				СтрокаОшибкиПоля.Свойство("fieldError", ТекстОшибки);
				
				ПредставлениеОшибки = СокрЛП(СтрШаблон("%1: %2", ИмяПоля, ТекстОшибки));
				Если ЗначениеЗаполнено(ИмяПоля) Или ЗначениеЗаполнено(ТекстОшибки) Тогда
					ТекстыОшибок.Добавить(ПредставлениеОшибки);
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Возврат СтрСоединить(ТекстыОшибок, Символы.ПС);
		
	ИначеЕсли ДанныеJSON <> Неопределено
		И ТипЗнч(ДанныеJSON) = Тип("Массив") Тогда
		
		ТекстыОшибок = Новый Массив;
		Для Каждого СтрокаОшибки Из ДанныеJSON Цикл
			
			Если Не ТипЗнч(СтрокаОшибки) = Тип("Структура")
				Или Не СтрокаОшибки.Свойство("cisInfo")
				Или Не СтрокаОшибки.Свойство("errorMessage") Тогда
				Возврат ТекстВходящегоСообщенияJSON;
			КонецЕсли;
			
			ТекстыОшибок.Добавить(ТекстПредставленияОшибки(СтрокаОшибки.errorMessage));
			
		КонецЦикла;
		
		Возврат СтрСоединить(ТекстыОшибок, Символы.ПС);
		
	Иначе
		Возврат ТекстВходящегоСообщенияJSON;
	КонецЕсли;
	
КонецФункции

// Возвращает код ответа, зафиксированный ГИС МТ как код ответа, означающий наступление аварийного режима
// 
// Возвращаемое значение:
//  Число - Код ответа аварийного режима
Функция АварийныйРежимКодОтветаСервисаГИСМТ() Экспорт
	
	Возврат 203;
	
КонецФункции

// Включает аварийный режим на определенное пользователем время;
// Аварийный режим подразумевает полное отключение запросов к ГИС МТ и розничную продажу
// отслеживаемых товарных групп без проверок разрешительного режима
// 
// Параметры:
//  СрокДействияВЧасах - Число - Срок включения аварийного режима в часах
Процедура ВключитьАварийныйРежимРазрешительнойСистемы(СрокДействияВЧасах = 0) Экспорт
	
	УниверсальнаяДатаТекущая = ТекущаяУниверсальнаяДата();
	
	Если СрокДействияВЧасах = 0 Тогда
		СрокДействияВЧасах = 6;
	КонецЕсли;
	
	ДатаОкончанияАварийногоРежима = УниверсальнаяДатаТекущая + СрокДействияВЧасах * 3600;
	
	Константы.ДатаОкончанияРазрешительногоАварийногоРежима.Установить(ДатаОкончанияАварийногоРежима);
	
КонецПроцедуры

#Область ПокаНеНужно

// Возвращает структуру данных кода маркировки.
// Параметры:
// 	ЭлементДанных - Соответствие из КлючИЗначение, Структура, Неопределено - Данные ГИС МТ
// 	ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС, Неопределено - Вид продукции.
// 	ДополнительныеПараметры - Структура:
// 		* НастройкиРазбора - см. РазборКодаМаркировкиИССлужебный.НастройкиРазбораКодаМаркировки.
// 		* Организация - ОпределяемыйТип.Организация
// 		* КешОрганизаций - Соответствие из КлючИЗначение - кеш для получения ИНН организаций-владельцев кода:
// 			** Ключ - ОпределяемыйТип.Организация - организация
// 			** Значение - Строка - ИНН организации
//
// Возвращаемое значение:
//  см. ИнициализироватьПараметрыКодаМаркировкиМОТП
Функция ПараметрыКодаМаркировкиМОТП(ЭлементДанных = Неопределено, ВидПродукции = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ПараметрыКодаМаркировки = ИнициализироватьПараметрыКодаМаркировкиМОТП();
	
	Если ЭлементДанных = Неопределено Тогда
		Возврат ПараметрыКодаМаркировки;
	КонецЕсли;
	
	ТипЭлементаДанных = ТипЗнч(ЭлементДанных);
	Если ТипЭлементаДанных = Тип("Соответствие") Тогда
		ИсточникДанных = ЭлементДанных;
	ИначеЕсли ТипЭлементаДанных = Тип("КлючИЗначение") Тогда	
		ИсточникДанных = ЭлементДанных.Значение;
	ИначеЕсли ТипЭлементаДанных = Тип("Структура") Тогда
		ИсточникДанных = Новый Соответствие();
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(ИсточникДанных, ЭлементДанных);
	КонецЕсли;
	
	Значение = ИсточникДанных["productGroup"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ВидПродукции = ТоварнаяГруппа(Значение, ВидПродукции);
	Иначе
		
		Значение = ИсточникДанных["groupIds"];
		
		Если Значение <> Неопределено И Значение.Количество() Тогда
			ПараметрыКодаМаркировки.ВидПродукции = ТоварнаяГруппаЧислом(Значение[0]);
		КонецЕсли;
		
	КонецЕсли;
	
	ВидПродукцииДляРазбораКода = ВидПродукции;
	Если ЗначениеЗаполнено(ПараметрыКодаМаркировки.ВидПродукции) Тогда
		ВидПродукцииДляРазбораКода = ПараметрыКодаМаркировки.ВидПродукции;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидПродукцииДляРазбораКода) Тогда
		ВызватьИсключение НСтр("ru = 'Вид продукции определить не удалось'");
	КонецЕсли;
	
	Статус = ИсточникДанных["status"];
	Если Статус <> Неопределено Тогда
	
		Если ЭтоПродукцияМОТП(ВидПродукцииДляРазбораКода) Тогда
			
			ПараметрыКодаМаркировки.Статус = СтатусКодаМаркировкиМОТП(Статус);
			
			Если ЗначениеЗаполнено(ИсточникДанных["statusEx"]) Тогда
				ПараметрыКодаМаркировки.ОсобоеСостояние = СтатусКодаМаркировкиМОТП(ИсточникДанных["statusEx"]);
			КонецЕсли;
			
		Иначе
			
			ПараметрыКодаМаркировки.Статус          = СтатусКодаМаркировкиИСМП(Статус);
			
			Если ЗначениеЗаполнено(ИсточникДанных["statusEx"]) Тогда
				ПараметрыКодаМаркировки.ОсобоеСостояние = СтатусКодаМаркировкиИСМП(ИсточникДанных["statusEx"]);
			КонецЕсли;
			
		КонецЕсли;
	
	Иначе
		
		СтруктураДанныхСтатуса = Новый Структура();
		СтруктураДанныхСтатуса.Вставить("Валидность",                    ИсточникДанных["valid"]);
		СтруктураДанныхСтатуса.Вставить("Наличие",                       ИсточникДанных["found"]);
		СтруктураДанныхСтатуса.Вставить("УспешнаяПроверкаКриптоподписи", ИсточникДанных["verified"]);
		СтруктураДанныхСтатуса.Вставить("Нанесен",                       ИсточникДанных["utilised"]);
		СтруктураДанныхСтатуса.Вставить("ВозможностьРеализации",         ИсточникДанных["realizable"]);
		СтруктураДанныхСтатуса.Вставить("Продано",                       ИсточникДанных["sold"]);
		
		ПараметрыКодаМаркировки.Статус = СтатусКодаМаркировкиПоДаннымГИСМТ(СтруктураДанныхСтатуса, ЭтоПродукцияМОТП(ВидПродукцииДляРазбораКода));
		
	КонецЕсли;
	
	Значение    = ИсточникДанных["packageType"];
	ЗначениеДоп = ИсточникДанных["generalPackageType"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ВидУпаковки = ВидУпаковки(Значение, ВидПродукцииДляРазбораКода, ЗначениеДоп);
	КонецЕсли;
	
	Значение = ИсточникДанных["ownerInn"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ИННВладельца = Значение;
	Иначе
		
		Значение = ИсточникДанных["isOwner"];
		Если Значение <> Неопределено И (Значение Или ИсточникДанных["isTracking"] = Ложь) Тогда
			
			Если ДополнительныеПараметры.Свойство("Организация") Тогда
				
				Организация    = ДополнительныеПараметры.Организация;
				ИННОрганизации = Неопределено;
				
				Если ДополнительныеПараметры.Свойство("КешОрганизаций") Тогда
					ИННОрганизации = ДополнительныеПараметры.КешОрганизаций.Получить(Организация);
				КонецЕсли;
				
				Если ИННОрганизации = Неопределено Тогда
					ИННОрганизации = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Организация, "ИНН");
				КонецЕсли;
				
				ПараметрыКодаМаркировки.ИННВладельца = ИННОрганизации;
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Значение = ИсточникДанных["gtin"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.GTIN = Значение;
	КонецЕсли;
	
	Значение = ИсточникДанных["lastDocId"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ИдентификаторДокумента = Значение;
	КонецЕсли;
	
	Значение = ИсточникДанных["producerInn"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ИННПроизводителя = Значение;
	КонецЕсли;
	
	Значение = ИсточникДанных["productName"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ПредставлениеНоменклатуры = Значение;
	КонецЕсли;
	
	Значение = ИсточникДанных["producerName"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.НаименованиеПроизводителя = Значение;
	КонецЕсли;
	
	Значение = ИсточникДанных["grayZone"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ВСеройЗоне = Значение;
	Иначе
		ПараметрыКодаМаркировки.ВСеройЗоне = Ложь;
	КонецЕсли;
	
	Значение = ИсточникДанных["innerUnitCount"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.КоличествоВПотребительскойУпаковке = Значение;
	КонецЕсли;
	
	Значение = ИсточникДанных["maxRetailPrice"];
	Если Значение <> Неопределено Тогда
		
		ПараметрыКодаМаркировки.МРЦ = Значение;
		ПривестиЗначениеМРЦ(ПараметрыКодаМаркировки);
		
	Иначе
		
		Значение = ИсточникДанных["mrp"];
		Если Значение <> Неопределено Тогда
			
			ПараметрыКодаМаркировки.МРЦ = Значение;
			ПривестиЗначениеМРЦ(ПараметрыКодаМаркировки);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Значение = ИсточникДанных["expirationDate"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ГоденДо = ДатаИзСтроки(Значение);
	Иначе
		Значение = ИсточникДанных["expireDate"];
		Если Значение <> Неопределено Тогда
			ПараметрыКодаМаркировки.ГоденДо = ДатаИзСтроки(Значение);
		КонецЕсли;
	КонецЕсли;
	
	Значение = ИсточникДанных["emissionDate"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ДатаЭмиссии = ДатаИзСтроки(Значение);
	КонецЕсли;
	
	Значение = ИсточникДанных["emissionType"];
	
	Значение = ИсточникДанных["producedDate"];
	Если Значение <> Неопределено Тогда
		
		Если ЭтоПродукцияМОТП(ПараметрыКодаМаркировки.ВидПродукции) Тогда
			ПараметрыКодаМаркировки.ДатаПроизводства = ДатаИзСтроки(Значение);
		Иначе
			ПараметрыКодаМаркировки.ДатаВводаВОборот = ДатаИзСтроки(Значение);
		КонецЕсли;
		
	Иначе
		
		Значение = ИсточникДанных["productionDate"];
		Если Значение <> Неопределено Тогда
			
			ПараметрыКодаМаркировки.ДатаПроизводства = ДатаИзСтроки(Значение);
			
		КонецЕсли;
	
	КонецЕсли;
	
	Значение = ИсточникДанных["introducedDate"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ДатаВводаВОборот = ДатаИзСтроки(Значение);
	КонецЕсли;
	
	Значение = ИсточникДанных["connectDate"];
	Если Значение <> Неопределено Тогда
		ПараметрыКодаМаркировки.ДатаПодключения = ДатаИзСтроки(Значение);
	КонецЕсли;
	
	ДанныеЧастичногоВыбытия = ИсточникДанных["partialSaleInfo"];
	Если ДанныеЧастичногоВыбытия <> Неопределено Тогда
		ПараметрыКодаМаркировки.ЕмкостьПотребительскойУпаковки = ДанныеЧастичногоВыбытия["innerUnitCount"];
		ПараметрыКодаМаркировки.ЧастичноеВыбытиеВыведено       = ДанныеЧастичногоВыбытия["soldUnitCount"];
		ПараметрыКодаМаркировки.ЧастичноеВыбытиеОстатокГИСМТ   = ДанныеЧастичногоВыбытия["rest"];
		КорректностьОстатка                                    = ДанныеЧастичногоВыбытия["correctRest"];
		Если КорректностьОстатка <> Неопределено Тогда
			ПараметрыКодаМаркировки.ЧастичноеВыбытиеНеКорректно = Не (КорректностьОстатка);
		КонецЕсли;
	Иначе
		
		ДанныеЧастичногоВыбытия = Новый Структура();
		ДанныеЧастичногоВыбытия.Вставить("ЕмкостьПотребительскойУпаковки", 0);
		ДанныеЧастичногоВыбытия.Вставить("ЧастичноеВыбытиеВыведено",       0);
		ДанныеЧастичногоВыбытия.Вставить("ЧастичноеВыбытиеОстатокГИСМТ",   0);
		ДанныеЧастичногоВыбытия.Вставить("ЕстьДанныеЧастичногоВыбытия",    Ложь);
			
		Если ИсточникДанных["innerUnitCount"] <> Неопределено Тогда
			
			ДанныеЧастичногоВыбытия.ЕмкостьПотребительскойУпаковки = ИсточникДанных["innerUnitCount"];
			ДанныеЧастичногоВыбытия.ЕстьДанныеЧастичногоВыбытия    = Истина;
			
		КонецЕсли;
		
		Если ИсточникДанных["soldUnitCount"] <> Неопределено Тогда
			
			ДанныеЧастичногоВыбытия.ЧастичноеВыбытиеВыведено       = ИсточникДанных["soldUnitCount"];
			ДанныеЧастичногоВыбытия.ЕстьДанныеЧастичногоВыбытия    = Истина;
			
		КонецЕсли;
		
		Если ДанныеЧастичногоВыбытия.ЕстьДанныеЧастичногоВыбытия Тогда
			
			Если ПараметрыКодаМаркировки.ВидПродукции = Перечисления.ВидыПродукцииИС.Пиво Тогда
				КоэффициентПересчета = 0.001;
			Иначе
				КоэффициентПересчета = 1;
			КонецЕсли;
			
			ПараметрыКодаМаркировки.ЕмкостьПотребительскойУпаковки = ДанныеЧастичногоВыбытия.ЕмкостьПотребительскойУпаковки * КоэффициентПересчета;
			ПараметрыКодаМаркировки.ЧастичноеВыбытиеВыведено       = ДанныеЧастичногоВыбытия.ЧастичноеВыбытиеВыведено * КоэффициентПересчета;
			ДанныеЧастичногоВыбытия.ЧастичноеВыбытиеОстатокГИСМТ   = ПараметрыКодаМаркировки.ЕмкостьПотребительскойУпаковки - ПараметрыКодаМаркировки.ЧастичноеВыбытиеВыведено;
			ПараметрыКодаМаркировки.ЧастичноеВыбытиеОстатокГИСМТ   = ДанныеЧастичногоВыбытия.ЧастичноеВыбытиеОстатокГИСМТ;
			КорректностьОстатка                                    = ПараметрыКодаМаркировки.ЧастичноеВыбытиеОстатокГИСМТ > 0;
			Если КорректностьОстатка <> Неопределено Тогда
				ПараметрыКодаМаркировки.ЧастичноеВыбытиеНеКорректно = Не (КорректностьОстатка);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИсточникДанных["parent"] <> Неопределено Тогда
		ПараметрыКодаМаркировки.РодительскаяУпаковка = ИсточникДанных["parent"];
	КонецЕсли;
	
	ПараметрыКодаМаркировки.СписокОрганизацийБлокировкиКМ = Новый Массив;
	
	Если ИсточникДанных["isBlocked"] <> Неопределено Тогда
		
		ПараметрыКодаМаркировки.ПродажаЗаблокирована = ИсточникДанных["isBlocked"];
		
		Значение = ИсточникДанных["ogvs"];
		
		Если Значение <> Неопределено Тогда
			ПараметрыКодаМаркировки.СписокОрганизацийБлокировкиКМ = Значение;
		КонецЕсли;
		
	Иначе
		ПараметрыКодаМаркировки.ПродажаЗаблокирована = Ложь;
	КонецЕсли;
	
	Если ИсточникДанных["child"] <> Неопределено
		И ИсточникДанных["child"].Количество() > 0 Тогда
		
		//+ОЛИМП не используется
		//Если ДополнительныеПараметры.Свойство("НастройкиРазбора")
		//	И Не ДополнительныеПараметры.НастройкиРазбора = Неопределено Тогда
		//	НастройкиРазбораКодаМаркировки = ДополнительныеПараметры.НастройкиРазбора;
		//Иначе
		//	ПользовательскиеПараметрыРазбораКодаМаркировки = ПользовательскиеПараметрыРазбораКодаМаркировки();
		//	ПользовательскиеПараметрыРазбораКодаМаркировки.ПроверятьАлфавитЭлементов = Ложь;
		//	
		//	НастройкиРазбораКодаМаркировки = Новый Структура;
		//	НастройкиРазбораКодаМаркировки.Вставить("Кеш",              ИнициализироватьНастройкиИспользующиеРезультатыПредыдущихРазборов());
		//	НастройкиРазбораКодаМаркировки.Вставить("Общие",            РазборКодаМаркировкиИССлужебный.НастройкиРазбораКодаМаркировки(, Ложь));
		//	НастройкиРазбораКодаМаркировки.Вставить("Пользовательские", ПользовательскиеПараметрыРазбораКодаМаркировки);

		//КонецЕсли;
		//
		//ПараметрыКодаМаркировки.ВложенныеУпаковки = Новый Соответствие();
		//Для Каждого ВложенныйКодМаркировки Из ИсточникДанных["child"] Цикл
		//	
		//	СтрокаКодаМаркировки = ШтрихкодированиеОбщегоНазначенияИС.НоваяСтруктураОбработкиШтрихкодаУпрощенныйРазбор(
		//		ВложенныйКодМаркировки, ВидПродукцииДляРазбораКода, НастройкиРазбораКодаМаркировки);
		//	
		//	Если ПараметрыКодаМаркировки.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая
		//		И Не ЗначениеЗаполнено(СтрокаКодаМаркировки.ВидУпаковки)
		//		И РазборКодаМаркировкиИССлужебныйКлиентСервер.ВидУпаковкиСоответствуетРазбору(
		//			ВидПродукции,
		//			Перечисления.ВидыУпаковокИС.Потребительская,
		//			СтрокаКодаМаркировки.ДанныеРазбора) Тогда
		//		СтрокаКодаМаркировки.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская;
		//	КонецЕсли;
		//	
		//	Если ПараметрыКодаМаркировки.ВидУпаковки = Перечисления.ВидыУпаковокИС.Набор
		//		И Не ЗначениеЗаполнено(СтрокаКодаМаркировки.ВидУпаковки)
		//		И РазборКодаМаркировкиИССлужебныйКлиентСервер.ВидУпаковкиСоответствуетРазбору(
		//			ВидПродукции,
		//			Перечисления.ВидыУпаковокИС.Потребительская,
		//			СтрокаКодаМаркировки.ДанныеРазбора) Тогда
		//		СтрокаКодаМаркировки.ВидУпаковки = Перечисления.ВидыУпаковокИС.Потребительская;
		//	КонецЕсли;
		//	
		//	СтрокаКодаМаркировки.Вставить("РодительскаяУпаковка", ИсточникДанных["cis"]);
		//	ШтрихкодированиеОбщегоНазначенияМОТП.РассчитатьХэшСуммуНормализации(
		//		СтрокаКодаМаркировки,
		//		СтрокаКодаМаркировки.ДанныеРазбора);
		//	
		//	ПараметрыКодаМаркировки.ВложенныеУпаковки.Вставить(
		//		СтрокаКодаМаркировки,
		//		ВложенныйКодМаркировки);
		//	
		//КонецЦикла;
		
	ИначеЕсли ПараметрыКодаМаркировки.ВидУпаковки <> Перечисления.ВидыУпаковокИС.Потребительская Тогда
		ПараметрыКодаМаркировки.ВложенныеУпаковки = Новый Соответствие;
	КонецЕсли;
	
	Возврат ПараметрыКодаМаркировки;
	
КонецФункции

Функция ИнициализироватьПараметрыКодаМаркировкиМОТП() Экспорт
	
	ПараметрыКодаМаркировки = Новый Структура;
	ПараметрыКодаМаркировки.Вставить("РезультатРазбора");
	
	ПараметрыКодаМаркировки.Вставить("Статус");
	ПараметрыКодаМаркировки.Вставить("ОсобоеСостояние");
	
	ПараметрыКодаМаркировки.Вставить("ИННВладельца");
	ПараметрыКодаМаркировки.Вставить("НаименованиеВладельца");
	ПараметрыКодаМаркировки.Вставить("НаименованиеПроизводителя");
	ПараметрыКодаМаркировки.Вставить("ИННПроизводителя");
	ПараметрыКодаМаркировки.Вставить("GTIN");
	ПараметрыКодаМаркировки.Вставить("ПредставлениеНоменклатуры");
	
	ПараметрыКодаМаркировки.Вставить("ИдентификаторДокумента");
	
	ПараметрыКодаМаркировки.Вставить("ДатаЭмиссии",      '00010101');
	ПараметрыКодаМаркировки.Вставить("ДатаПроизводства", '00010101');
	ПараметрыКодаМаркировки.Вставить("ДатаВводаВОборот", '00010101');
	ПараметрыКодаМаркировки.Вставить("ДатаСписания",     '00010101');
	ПараметрыКодаМаркировки.Вставить("ГоденДо",          '00010101');
	ПараметрыКодаМаркировки.Вставить("ДатаПодключения",  '00010101');
	
	ПараметрыКодаМаркировки.Вставить("РодительскаяУпаковка");
	ПараметрыКодаМаркировки.Вставить("ВложенныеУпаковки");
	ПараметрыКодаМаркировки.Вставить("ВидУпаковки");
	ПараметрыКодаМаркировки.Вставить("ВидПродукции");
	ПараметрыКодаМаркировки.Вставить("СпособВводаВОборот");
	
	ПараметрыКодаМаркировки.Вставить("МРЦ");
	ПараметрыКодаМаркировки.Вставить("ДатаПроизводства");
	
	ПараметрыКодаМаркировки.Вставить("ЕмкостьПотребительскойУпаковки");
	ПараметрыКодаМаркировки.Вставить("ЧастичноеВыбытиеВыведено");
	ПараметрыКодаМаркировки.Вставить("ЧастичноеВыбытиеОстатокГИСМТ");
	ПараметрыКодаМаркировки.Вставить("ЧастичноеВыбытиеНеКорректно");
	
	ПараметрыКодаМаркировки.Вставить("ПродажаЗаблокирована");
	ПараметрыКодаМаркировки.Вставить("СписокОрганизацийБлокировкиКМ");
	ПараметрыКодаМаркировки.Вставить("ВСеройЗоне");
	ПараметрыКодаМаркировки.Вставить("КоличествоВПотребительскойУпаковке");
	ПараметрыКодаМаркировки.Вставить("РазрешительныйРежимИдентификаторЗапросаГИСМТ");
	ПараметрыКодаМаркировки.Вставить("РазрешительныйРежимДатаЗапросаГИСМТ");
	ПараметрыКодаМаркировки.Вставить("РазрешительныйРежимАдресСервера");
	ПараметрыКодаМаркировки.Вставить("РазрешительныйРежимТелоЗапросаJSON");
	ПараметрыКодаМаркировки.Вставить("РазрешительныйРежимТелоОтветаJSON");
	ПараметрыКодаМаркировки.Вставить("РазрешительныйРежимКодОтвета");
	
	Возврат ПараметрыКодаМаркировки;
	
КонецФункции

// Преобразовывает текстовое представление товарной группы в значение перечисления и наоборот.
//
// Параметры:
//  ЗначениеПоиска - ПеречислениеСсылка.ВидыПродукцииИС, Строка - значение для перекодировки
//  ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции для уточнения неоднозначности 
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыПродукцииИС, Строка - Товарная группа.
Функция ТоварнаяГруппа(Знач ЗначениеПоиска, ВидПродукции = Неопределено) Экспорт
	
	Если ЗначениеПоиска = Неопределено Тогда
		Возврат Перечисления.ВидыПродукцииИС.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеПоиска) = Тип("Строка") Тогда
		ЗначениеПоиска = НРег(ЗначениеПоиска);
		Если ЗначениеПоиска = "lp" Или ЗначениеПоиска = "clothes" Тогда
			Возврат Перечисления.ВидыПродукцииИС.ЛегкаяПромышленность;
		ИначеЕсли ЗначениеПоиска = "shoes" Тогда
			Возврат Перечисления.ВидыПродукцииИС.Обувь;
		ИначеЕсли ЗначениеПоиска = "perfumery" Тогда
			Возврат Перечисления.ВидыПродукцииИС.Духи;
		ИначеЕсли ЗначениеПоиска = "tires" Тогда
			Возврат Перечисления.ВидыПродукцииИС.Шины;
		ИначеЕсли ЗначениеПоиска = "electronics" Тогда
			Возврат Перечисления.ВидыПродукцииИС.Фотоаппараты;
		ИначеЕсли ЗначениеПоиска = "milk" Тогда
			Если ВидПродукции = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС Тогда
				Возврат Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС;
			Иначе
				Возврат Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС;
			КонецЕсли;
		ИначеЕсли ЗначениеПоиска = "bicycle" Тогда
			Возврат Перечисления.ВидыПродукцииИС.Велосипеды;
		ИначеЕсли ЗначениеПоиска = "wheelchairs" Тогда
			Возврат Перечисления.ВидыПродукцииИС.КреслаКоляски;
		ИначеЕсли ЗначениеПоиска = "otp" Тогда
			Возврат Перечисления.ВидыПродукцииИС.АльтернативныйТабак;
		ИначеЕсли ЗначениеПоиска = "water" Тогда
			Возврат Перечисления.ВидыПродукцииИС.УпакованнаяВода;
		ИначеЕсли ЗначениеПоиска = "tobacco" Тогда
			Возврат Перечисления.ВидыПродукцииИС.Табак;
		ИначеЕсли ЗначениеПоиска = "beer" Тогда
			Возврат Перечисления.ВидыПродукцииИС.Пиво;
		ИначеЕсли ЗначениеПоиска = "ncp" Тогда
			Возврат Перечисления.ВидыПродукцииИС.НикотиносодержащаяПродукция;
		ИначеЕсли ЗначениеПоиска = "bio" Тогда
			Возврат Перечисления.ВидыПродукцииИС.БАДы;
		ИначеЕсли ЗначениеПоиска = "antiseptic" Тогда
			Возврат Перечисления.ВидыПродукцииИС.Антисептики;
		ИначеЕсли ЗначениеПоиска = "seafood" Тогда
			Возврат Перечисления.ВидыПродукцииИС.МорепродуктыПодконтрольныеВЕТИС;
		ИначеЕсли ЗначениеПоиска = "furs" Тогда
			Возврат Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха;
		ИначеЕсли ЗначениеПоиска = "softdrinks" Тогда
			Возврат Перечисления.ВидыПродукцииИС.СоковаяПродукция;
		ИначеЕсли ЗначениеПоиска = "nabeer" Тогда
			Возврат Перечисления.ВидыПродукцииИС.БезалкогольноеПиво;
		ИначеЕсли ЗначениеПоиска = "petfood" Тогда
			Возврат Перечисления.ВидыПродукцииИС.КормаДляЖивотныхПодконтрольныеВЕТИС;
		ИначеЕсли ЗначениеПоиска = "meat" Тогда
			Возврат Перечисления.ВидыПродукцииИС.МясоПодконтрольноеВЕТИС;
		ИначеЕсли ЗначениеПоиска = "vetpharma" Тогда
			Возврат Перечисления.ВидыПродукцииИС.ВетеринарныеПрепараты;
		ИначеЕсли ЗначениеПоиска = "toys" Тогда
			Возврат Перечисления.ВидыПродукцииИС.ИгрыИИгрушкиДляДетей;
		ИначеЕсли ЗначениеПоиска = "radio" Тогда
			Возврат Перечисления.ВидыПродукцииИС.РадиоэлектроннаяПродукция;
		ИначеЕсли ЗначениеПоиска = "titan" Тогда
			Возврат Перечисления.ВидыПродукцииИС.ТитановаяМеталлопродукция;
		ИначеЕсли ЗначениеПоиска = "conserve" Тогда
			Возврат Перечисления.ВидыПродукцииИС.КонсервированнаяПродукцияПодконтрольнаяВЕТИС;
		ИначеЕсли ЗначениеПоиска = "vegetableoil" Тогда
			Возврат Перечисления.ВидыПродукцииИС.РастительныеМасла;
		ИначеЕсли ЗначениеПоиска = "opticfiber" Тогда
			Возврат Перечисления.ВидыПродукцииИС.ОптоволокноИОптоволоконнаяПродукция;
		ИначеЕсли ЗначениеПоиска = "chemistry" Тогда
			Возврат Перечисления.ВидыПродукцииИС.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия;
		Иначе
			Возврат Перечисления.ВидыПродукцииИС.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЗначениеПоиска) = Тип("ПеречислениеСсылка.ВидыПродукцииИС") Тогда
		Если ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ЛегкаяПромышленность Тогда
			Возврат "lp";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Обувь Тогда
			Возврат "shoes";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Духи Тогда
			Возврат "perfumery";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Шины Тогда
			Возврат "tires";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Фотоаппараты Тогда
			Возврат "electronics";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС
				Или ЗначениеПоиска = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС Тогда
			Возврат "milk";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Велосипеды Тогда
			Возврат "bicycle";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КреслаКоляски Тогда
			Возврат "wheelchairs";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.АльтернативныйТабак Тогда
			Возврат "otp";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.УпакованнаяВода Тогда
			Возврат "water";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Табак Тогда
			Возврат "tobacco";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Пиво Тогда
			Возврат "beer";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.НикотиносодержащаяПродукция Тогда
			Возврат "ncp";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.БАДы Тогда
			Возврат "bio";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Антисептики Тогда
			Возврат "antiseptic";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.МорепродуктыПодконтрольныеВЕТИС Тогда
			Возврат "seafood";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
			Возврат "furs";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.СоковаяПродукция Тогда
			Возврат "softdrinks";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.БезалкогольноеПиво Тогда
			Возврат "nabeer";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КормаДляЖивотныхПодконтрольныеВЕТИС
			Или ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КормаДляЖивотныхБезВЕТИС Тогда
			Возврат "petfood";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.МясоПодконтрольноеВЕТИС Тогда
			Возврат "meat";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ВетеринарныеПрепараты Тогда
			Возврат "vetpharma";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ИгрыИИгрушкиДляДетей Тогда
			Возврат "toys";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.РадиоэлектроннаяПродукция Тогда
			Возврат "radio";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ТитановаяМеталлопродукция Тогда
			Возврат "titan";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КонсервированнаяПродукцияПодконтрольнаяВЕТИС
			Или ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КонсервированнаяПродукцияБезВЕТИС Тогда
			Возврат "conserve";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.РастительныеМасла Тогда
			Возврат "vegetableoil";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ОптоволокноИОптоволоконнаяПродукция Тогда
			Возврат "opticfiber";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия Тогда
			Возврат "chemistry";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

// Преобразовывает текстовое представление товарной группы в значение перечисления и наоборот.
//
// Параметры:
//  ЗначениеПоиска - ПеречислениеСсылка.ВидыПродукцииИС, Строка - значение для перекодировки
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыПродукцииИС, Строка - Товарная группа.
Функция ТоварнаяГруппаЧислом(Знач ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = Неопределено Тогда
		Возврат Перечисления.ВидыПродукцииИС.ПустаяСсылка();
	КонецЕсли;
	
	ИсходноеЗначениеПоиска = ЗначениеПоиска;
	
	Если ТипЗнч(ЗначениеПоиска) = Тип("Строка") Тогда
		ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
		ЗначениеПоиска = ОписаниеТипаЧисло.ПривестиЗначение(ЗначениеПоиска);
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеПоиска) = Тип("Число") Тогда
		Если ЗначениеПоиска = 1 Тогда
			Возврат Перечисления.ВидыПродукцииИС.ЛегкаяПромышленность;
		ИначеЕсли ЗначениеПоиска = 2 Тогда
			Возврат Перечисления.ВидыПродукцииИС.Обувь;
		ИначеЕсли ЗначениеПоиска = 3 Тогда
			Возврат Перечисления.ВидыПродукцииИС.Табак;
		ИначеЕсли ЗначениеПоиска = 4 Тогда
			Возврат Перечисления.ВидыПродукцииИС.Духи;
		ИначеЕсли ЗначениеПоиска = 5 Тогда
			Возврат Перечисления.ВидыПродукцииИС.Шины;
		ИначеЕсли ЗначениеПоиска = 6 Тогда
			Возврат Перечисления.ВидыПродукцииИС.Фотоаппараты;
		ИначеЕсли ЗначениеПоиска = 8 Тогда
			Возврат Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС;
		ИначеЕсли ЗначениеПоиска = 9 Тогда
			Возврат Перечисления.ВидыПродукцииИС.Велосипеды;
		ИначеЕсли ЗначениеПоиска = 10 Тогда
			Возврат Перечисления.ВидыПродукцииИС.КреслаКоляски;
		ИначеЕсли ЗначениеПоиска = 12 Тогда
			Возврат Перечисления.ВидыПродукцииИС.АльтернативныйТабак;
		ИначеЕсли ЗначениеПоиска = 13 Тогда
			Возврат Перечисления.ВидыПродукцииИС.УпакованнаяВода;
		ИначеЕсли ЗначениеПоиска = 14 Тогда
			Возврат Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха;
		ИначеЕсли ЗначениеПоиска = 15 Тогда
			Возврат Перечисления.ВидыПродукцииИС.Пиво;
		ИначеЕсли ЗначениеПоиска = 16 Тогда
			Возврат Перечисления.ВидыПродукцииИС.НикотиносодержащаяПродукция;
		ИначеЕсли ЗначениеПоиска = 17 Тогда
			Возврат Перечисления.ВидыПродукцииИС.БАДы;
		ИначеЕсли ЗначениеПоиска = 19 Тогда
			Возврат Перечисления.ВидыПродукцииИС.Антисептики;
		ИначеЕсли ЗначениеПоиска = 21 Тогда
			Возврат Перечисления.ВидыПродукцииИС.МорепродуктыПодконтрольныеВЕТИС;
		ИначеЕсли ЗначениеПоиска = 22 Тогда
			Возврат Перечисления.ВидыПродукцииИС.БезалкогольноеПиво;
		ИначеЕсли ЗначениеПоиска = 23 Тогда
			Возврат Перечисления.ВидыПродукцииИС.СоковаяПродукция;
		ИначеЕсли ЗначениеПоиска = 20 Тогда
			Возврат Перечисления.ВидыПродукцииИС.КормаДляЖивотныхПодконтрольныеВЕТИС;
		ИначеЕсли ЗначениеПоиска = 25 Тогда
			Возврат Перечисления.ВидыПродукцииИС.МясоПодконтрольноеВЕТИС;
		ИначеЕсли ЗначениеПоиска = 26 Тогда
			Возврат Перечисления.ВидыПродукцииИС.ВетеринарныеПрепараты;
		ИначеЕсли ЗначениеПоиска = 27 Тогда
			Возврат Перечисления.ВидыПродукцииИС.ИгрыИИгрушкиДляДетей;
		ИначеЕсли ЗначениеПоиска = 28 Тогда
			Возврат Перечисления.ВидыПродукцииИС.РадиоэлектроннаяПродукция;
		ИначеЕсли ЗначениеПоиска = 31 Тогда
			Возврат Перечисления.ВидыПродукцииИС.ТитановаяМеталлопродукция;
		ИначеЕсли ЗначениеПоиска = 32 Тогда
			Возврат Перечисления.ВидыПродукцииИС.КонсервированнаяПродукцияПодконтрольнаяВЕТИС;
		ИначеЕсли ЗначениеПоиска = 33 Тогда
			Возврат Перечисления.ВидыПродукцииИС.РастительныеМасла;
		ИначеЕсли ЗначениеПоиска = 34 Тогда
			Возврат Перечисления.ВидыПродукцииИС.ОптоволокноИОптоволоконнаяПродукция;
		ИначеЕсли ЗначениеПоиска = 35 Тогда
			Возврат Перечисления.ВидыПродукцииИС.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЗначениеПоиска) = Тип("ПеречислениеСсылка.ВидыПродукцииИС") Тогда
		Если ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ЛегкаяПромышленность Тогда
			Возврат 1;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Обувь Тогда
			Возврат 2;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Табак Тогда
			Возврат 3;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Духи Тогда
			Возврат 4;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Шины Тогда
			Возврат 5;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Фотоаппараты Тогда
			Возврат 6;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияПодконтрольнаяВЕТИС
				Или ЗначениеПоиска = Перечисления.ВидыПродукцииИС.МолочнаяПродукцияБезВЕТИС Тогда
			Возврат 8;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Велосипеды Тогда
			Возврат 9;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КреслаКоляски Тогда
			Возврат 10;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.АльтернативныйТабак Тогда
			Возврат 12;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.УпакованнаяВода Тогда
			Возврат 13;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ПродукцияИзНатуральногоМеха Тогда
			Возврат 14;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Пиво Тогда
			Возврат 15;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.НикотиносодержащаяПродукция Тогда
			Возврат 16;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.БАДы Тогда
			Возврат 17;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.Антисептики Тогда
			Возврат 19;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.МорепродуктыПодконтрольныеВЕТИС Тогда
			Возврат 21;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.БезалкогольноеПиво Тогда
			Возврат 22;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.СоковаяПродукция Тогда
			Возврат 23;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КормаДляЖивотныхПодконтрольныеВЕТИС
			Или ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КормаДляЖивотныхБезВЕТИС Тогда
			Возврат 20;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.МясоПодконтрольноеВЕТИС Тогда
			Возврат 25;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ВетеринарныеПрепараты Тогда
			Возврат 26;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ИгрыИИгрушкиДляДетей Тогда
			Возврат 27;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.РадиоэлектроннаяПродукция Тогда
			Возврат 28;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ТитановаяМеталлопродукция Тогда
			Возврат 31;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КонсервированнаяПродукцияПодконтрольнаяВЕТИС
			Или ЗначениеПоиска = Перечисления.ВидыПродукцииИС.КонсервированнаяПродукцияБезВЕТИС Тогда
			Возврат 32;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.РастительныеМасла Тогда
			Возврат 33;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ОптоволокноИОптоволоконнаяПродукция Тогда
			Возврат 34;
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыПродукцииИС.ПарфюмерныеИКосметическиеСредстваИБытоваяХимия Тогда
			Возврат 35;
		КонецЕсли;
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестная товарная группа: %1'"),
			ИсходноеЗначениеПоиска);
	
КонецФункции

// Возвращает признак принадлежности переданного в параметре вида продукции к виду продукции МОТП.
//
// Параметры:
//  ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции для анализа
// Возвращаемое значение:
//  Булево - Принадлежность к виду продукции МОТП.
//
Функция ЭтоПродукцияМОТП(ВидПродукции) Экспорт
	Возврат ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Табак")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.АльтернативныйТабак")
		Или ВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.НикотиносодержащаяПродукция");
КонецФункции

// Преобразовывает текстовое представление статуса кода маркировки МОТП в значение перечисления.
//
// Параметры:
//  ЗначениеПоиска - Строка - значение для перекодировки
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыКодовМаркировкиМОТП - статус кода маркировки.
//
Функция СтатусКодаМаркировкиМОТП(Знач ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = Неопределено Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.Неопределен;
	КонецЕсли;
	
	ЗначениеПоиска = ВРег(ЗначениеПоиска);
	
	Если ЗначениеПоиска = "EMITTED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.Эмитирован;
	ИначеЕсли ЗначениеПоиска = "APPLIED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.Нанесен;
	ИначеЕсли ЗначениеПоиска = "APPLIED_PAID" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.НанесенОплачен;
	ИначеЕсли ЗначениеПоиска = "APPLIED_NOT_PAID" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.НанесенНеОплачен;
	ИначеЕсли ЗначениеПоиска = "INTRODUCED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.ВведенВОборот;
	ИначеЕсли ЗначениеПоиска = "RECYCLED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.Утилизирован;
	ИначеЕсли ЗначениеПоиска = "RETIRED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.ВыведенИзОборота;
	ИначеЕсли ЗначениеПоиска = "RESERVED_NOT_USED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.Неопределен;
	ИначеЕсли ЗначениеПоиска = "WRITTEN_OFF" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.Списан;
	ИначеЕсли ЗначениеПоиска = "WITHDRAWN" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.Продан;
	ИначеЕсли ЗначениеПоиска = "INTRODUCED_RETURNED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.ВведенВОборотВозвращен;
	ИначеЕсли ЗначениеПоиска = "DISAGGREGATED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.Разагрегирован;
	ИначеЕсли ЗначениеПоиска = "WAIT_SHIPMENT" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.ОжидаетДоставки;
	ИначеЕсли ЗначениеПоиска = "EXPORTED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.Экспортирован;
	ИначеЕсли ЗначениеПоиска = "LOAN_RETIRED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.ВыведенИзОборотаПоДоговоруРассрочки;
	ИначеЕсли ЗначениеПоиска = "REMARK_RETIRED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.ВыведенИзОборотаПриПеремаркировке;
	ИначеЕсли ЗначениеПоиска = "UNDEFINED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.Неопределен;
	ИначеЕсли ЗначениеПоиска = "EMPTY" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.Неопределен;
	ИначеЕсли ЗначениеПоиска = "ELIMINATED" Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиМОТП.НеИспользован;
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный статус кода маркировки: %1'"),
			ЗначениеПоиска);
	
КонецФункции

// Преобразовывает текстовое представление статуса кода маркировки ИСМП в значение перечисления и наоборот.
//
// Параметры:
//  ЗначениеПоиска - ПеречислениеСсылка.СтатусыКодовМаркировкиИСМП, Строка - значение для перекодировки
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыКодовМаркировкиИСМП, Строка - статус кода маркировки.
Функция СтатусКодаМаркировкиИСМП(Знач ЗначениеПоиска) Экспорт
	
	Если ЗначениеПоиска = Неопределено Тогда
		Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ПустаяСсылка();
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеПоиска) = Тип("Строка") Тогда
		
		ЗначениеПоиска = ВРег(ЗначениеПоиска);
		Если ЗначениеПоиска = "EMITTED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Эмитирован;
		ИначеЕсли ЗначениеПоиска = "APPLIED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Нанесен;
		ИначеЕсли ЗначениеПоиска = "INTRODUCED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборот;
		ИначеЕсли ЗначениеПоиска = "RETIRED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота;
		ИначеЕсли ЗначениеПоиска = "DISAGGREGATED" Или ЗначениеПоиска = "DISAGGREGATION" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Разагрегирован;
		ИначеЕсли ЗначениеПоиска = "WRITTEN_OFF" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Списан;
			
		// Расширенные статусы
		ИначеЕсли ЗначениеПоиска = "RESERVED_NOT_USED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен;
		ИначеЕсли ЗначениеПоиска = "INTRODUCED_RETURNED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате;
		ИначеЕсли ЗначениеПоиска = "EXPORTED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Экспортирован;
		ИначеЕсли ЗначениеПоиска = "WAIT_REMARK" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетПовторнойМаркировки;
		ИначеЕсли ЗначениеПоиска = "WAIT_SHIPMENT" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетДоставки;
		ИначеЕсли ЗначениеПоиска = "WAIT_TRANSFER_TO_OWNER" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетПередачуСобственнику;
		ИначеЕсли ЗначениеПоиска = "EMPTY" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен;
		
		ИначеЕсли ЗначениеПоиска = "REMARK_RETIRED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриПеремаркировке;
		ИначеЕсли ЗначениеПоиска = "LOAN_RETIRED" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПоДоговоруРассрочки;
		ИначеЕсли ЗначениеПоиска = "RETIRED_CANCELLATION" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаВРезультатеСписания;
		ИначеЕсли ЗначениеПоиска = "RETIRED_EEC_EXPORT" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЭкспортированВСтраныЕАЭС;
		ИначеЕсли ЗначениеПоиска = "RETIRED_BEYOND_EEC_EXPORT" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЭкспортированЗаПределыСтранЕАЭС;
		ИначеЕсли ЗначениеПоиска = "RETIRED_RETURN" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаВозвращенФизическомуЛицу;
		ИначеЕсли ЗначениеПоиска = "RETIRED_DAMAGE_LOSS" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриУтратеИлиПовреждении;
		ИначеЕсли ЗначениеПоиска = "RETIRED_DESTRUCTION" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриУничтожении;
		ИначеЕсли ЗначениеПоиска = "RETIRED_CONFISCATION" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаКонфискация;
		ИначеЕсли ЗначениеПоиска = "RETIRED_LIQUIDATION" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЛиквидацияПредприятия;
		ИначеЕсли ЗначениеПоиска = "RETIRED_ENTERPRISE_USE" Или ЗначениеПоиска = "RETIRED_NO_RETAIL_USE" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаИспользованДляСобственныхНуждПредприятия;
		ИначеЕсли ЗначениеПоиска = "RETIRED_DONATION" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаБезвозмезднаяПередача;
		ИначеЕсли ЗначениеПоиска = "RETIRED_STATE_ENTERPRISE" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриобретенГосударственнымПредприятием;
		ИначеЕсли ЗначениеПоиска = "RETIRED_REMOTE_SALE" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриДистанционнойПродаже;
		
		ИначеЕсли ЗначениеПоиска = "FTS_RESPOND_NOT_OK" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ОтрицательноеРешениеФТС;
		ИначеЕсли ЗначениеПоиска = "FTS_RESPOND_WAITING" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетПодтверждениеФТС;
		ИначеЕсли ЗначениеПоиска = "FTS_CONTROL" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.НаКонтролеФТС;
		ИначеЕсли ЗначениеПоиска = "IN_GRAY_ZONE" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.НаходитсяВСеройЗоне;
		ИначеЕсли ЗначениеПоиска = "NON_INDIVIDUAL" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.НеИндивидуализирован;
		ИначеЕсли ЗначениеПоиска = "INDIVIDUAL" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Индивидуализирован;
		ИначеЕсли ЗначениеПоиска = "CONNECT_TAP" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ПодключенКОборудованиюРозлива;
		ИначеЕсли ЗначениеПоиска = "PRIM_RESPONSE_WAITING" Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетОтветОтВЕТИС;
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.Эмитирован Тогда
			Возврат "EMITTED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.Нанесен Тогда
			Возврат "APPLIED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборот Тогда
			Возврат "INTRODUCED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота Тогда
			Возврат "RETIRED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.Разагрегирован Тогда
			Возврат "DISAGGREGATED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.Списан Тогда
			Возврат "WRITTEN_OFF";
		
		// Расширенные статусы
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен Тогда
			Возврат "RESERVED_NOT_USED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборотПриВозврате Тогда
			Возврат "INTRODUCED_RETURNED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.Экспортирован Тогда
			Возврат "EXPORTED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетПовторнойМаркировки Тогда
			Возврат "WAIT_REMARK";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетДоставки Тогда
			Возврат "WAIT_SHIPMENT";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетПередачуСобственнику Тогда
			Возврат "WAIT_TRANSFER_TO_OWNER";
		
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриПеремаркировке Тогда
			Возврат "REMARK_RETIRED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПоДоговоруРассрочки Тогда
			Возврат "LOAN_RETIRED";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаВРезультатеСписания Тогда
			Возврат "RETIRED_CANCELLATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаРозничнаяПродажа Тогда
			Возврат "RETIRED_RETAIL";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЭкспортированВСтраныЕАЭС Тогда
			Возврат "RETIRED_EEC_EXPORT";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЭкспортированЗаПределыСтранЕАЭС Тогда
			Возврат "RETIRED_BEYOND_EEC_EXPORT";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаВозвращенФизическомуЛицу Тогда
			Возврат "RETIRED_RETURN";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриУтратеИлиПовреждении Тогда
			Возврат "RETIRED_DAMAGE_LOSS";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриУничтожении Тогда
			Возврат "RETIRED_DESTRUCTION";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаКонфискация Тогда
			Возврат "RETIRED_CONFISCATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаЛиквидацияПредприятия Тогда
			Возврат "RETIRED_LIQUIDATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаИспользованДляСобственныхНуждПредприятия Тогда
			Возврат "RETIRED_ENTERPRISE_USE";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаБезвозмезднаяПередача Тогда
			Возврат "RETIRED_DONATION";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриобретенГосударственнымПредприятием Тогда
			Возврат "RETIRED_STATE_ENTERPRISE";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборотаПриДистанционнойПродаже Тогда
			Возврат "RETIRED_REMOTE_SALE";
		
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ОтрицательноеРешениеФТС Тогда
			Возврат "FTS_RESPOND_NOT_OK";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетПодтверждениеФТС Тогда
			Возврат "FTS_RESPOND_WAITING";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.НаКонтролеФТС Тогда
			Возврат "FTS_CONTROL";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.НаходитсяВСеройЗоне Тогда
			Возврат "IN_GRAY_ZONE";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.НеИндивидуализирован Тогда
			Возврат "NON_INDIVIDUAL";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.Индивидуализирован Тогда
			Возврат "INDIVIDUAL";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ПодключенКОборудованиюРозлива Тогда
			Возврат "CONNECT_TAP";
		ИначеЕсли ЗначениеПоиска = Перечисления.СтатусыКодовМаркировкиИСМП.ОжидаетОтветОтВЕТИС Тогда
			Возврат "PRIM_RESPONSE_WAITING";
		КонецЕсли;
		
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный статус кода маркировки: %1'"),
			ЗначениеПоиска);
	
КонецФункции

Функция СтатусКодаМаркировкиПоДаннымГИСМТ(Знач СтруктураКода, ЭтоПродукцияМОТП = Ложь) Экспорт
	
	Если ЭтоПродукцияМОТП Тогда
		
		Если СтруктураКода.Продано Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиМОТП.Продан;
		ИначеЕсли СтруктураКода.ВозможностьРеализации Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиМОТП.ВведенВОборот;
		ИначеЕсли Не СтруктураКода.ВозможностьРеализации
			И СтруктураКода.Нанесен Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиМОТП.Нанесен;
		ИначеЕсли Не СтруктураКода.Нанесен Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиМОТП.Эмитирован;
		Иначе
			Возврат Перечисления.СтатусыКодовМаркировкиМОТП.Неопределен;
		КонецЕсли;
		
	Иначе
	
		Если СтруктураКода.Продано Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВыведенИзОборота;
		ИначеЕсли СтруктураКода.ВозможностьРеализации Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.ВведенВОборот;
		ИначеЕсли Не СтруктураКода.ВозможностьРеализации
			И СтруктураКода.Нанесен Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Нанесен;
		ИначеЕсли Не СтруктураКода.Нанесен Тогда
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Эмитирован;
		Иначе
			Возврат Перечисления.СтатусыКодовМаркировкиИСМП.Неопределен;
		КонецЕсли;
	
	КонецЕсли;
	
КонецФункции

// Преобразовывает текстовое представление вида упаковки в значение перечисления.
//
// Параметры:
//  ЗначениеПоиска - Строка - значение для перекодировки
//  ВидПродукции   - ПеречислениеСсылка.ВидыПродукцииИС  - Вид продукции.
//  ЗначениеПоискаДополнительное - Строка
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВидыУпаковокИС - вид упаковки.
//
Функция ВидУпаковки(Знач ЗначениеПоиска, ВидПродукции, ЗначениеПоискаДополнительное = Неопределено) Экспорт
	
	Если ТипЗнч(ЗначениеПоиска) = Тип("Строка") Тогда
		
		ЗначениеПоиска = ВРег(ЗначениеПоиска);
		
		Если ЭтоПродукцияМОТП(ВидПродукции) Тогда
			
			Если ЗначениеПоиска = "UNIT" Тогда
				Возврат Перечисления.ВидыУпаковокИС.Потребительская;
			ИначеЕсли ЗначениеПоиска = "GROUP" Или ЗначениеПоискаДополнительное = "GROUP" Тогда
				Возврат Перечисления.ВидыУпаковокИС.Групповая;
			ИначеЕсли ЗначениеПоиска = "SET" Или ЗначениеПоискаДополнительное = "SET" Или ЗначениеПоиска = "PRODUCT_SET" Тогда
				Возврат Перечисления.ВидыУпаковокИС.Набор;
			ИначеЕсли ЗначениеПоиска = "LEVEL1" Тогда
				Возврат Перечисления.ВидыУпаковокИС.Групповая;
			ИначеЕсли СтрНайти(ЗначениеПоиска, "LEVEL") > 0 Тогда
				Возврат Перечисления.ВидыУпаковокИС.Логистическая;
			ИначеЕсли ЗначениеПоиска = "BOX" Тогда
				Возврат Перечисления.ВидыУпаковокИС.Логистическая;
			КонецЕсли;
			
			ВызватьИсключение
				СтрШаблон(
					НСтр("ru = 'Неизвестный вид упаковки: %1'"),
					ЗначениеПоиска);
			
		КонецЕсли;
		
		Если ЗначениеПоиска = "UNIT" Тогда
			Возврат Перечисления.ВидыУпаковокИС.Потребительская;
		ИначеЕсли ЗначениеПоиска = "GROUP" Или ЗначениеПоискаДополнительное = "GROUP" Тогда
			Возврат Перечисления.ВидыУпаковокИС.Групповая;
		ИначеЕсли ЗначениеПоиска = "SET" Или ЗначениеПоискаДополнительное = "SET" Или ЗначениеПоиска = "PRODUCT_SET" Тогда
			Возврат Перечисления.ВидыУпаковокИС.Набор;
		ИначеЕсли СтрНайти(ЗначениеПоиска, "LEVEL") > 0 Тогда
			Возврат Перечисления.ВидыУпаковокИС.Логистическая;
		ИначеЕсли ЗначениеПоиска = "BUNDLE" Или ЗначениеПоиска = "KIT"Тогда
			Возврат Перечисления.ВидыУпаковокИС.Потребительская;
		ИначеЕсли ЗначениеПоиска = "ATK" Тогда
			Возврат Перечисления.ВидыУпаковокИС.АгрегированныйТаможенныйКод;
		ИначеЕсли ЗначениеПоиска = "BOX" Тогда
			Возврат Перечисления.ВидыУпаковокИС.Логистическая;
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеПоиска = Перечисления.ВидыУпаковокИС.Потребительская Тогда
			Возврат "UNIT";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыУпаковокИС.Групповая Тогда
			Возврат "GROUP";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыУпаковокИС.Набор Тогда
			Возврат "SET";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыУпаковокИС.АгрегированныйТаможенныйКод Тогда
			Возврат "АТК";
		ИначеЕсли ЗначениеПоиска = Перечисления.ВидыУпаковокИС.Логистическая Тогда
			Возврат "BOX";
		КонецЕсли;
		
	КонецЕсли;
	
	ВызватьИсключение
		СтрШаблон(
			НСтр("ru = 'Неизвестный вид упаковки: %1'"),
			ЗначениеПоиска);

КонецФункции


Процедура ПривестиЗначениеМРЦ(СтрокаДанных)
	
	Если ТипЗнч(СтрокаДанных.МРЦ) = Тип("Число") Тогда
		СтрокаДанных.МРЦ = СтрокаДанных.МРЦ / 100;
	КонецЕсли;
	
КонецПроцедуры

Функция ДатаИзСтроки(Значение, Делитель = 1000, ПриводитьКМестномуВремени = Истина) Экспорт
	
	Если СтрНайти(Значение, "T") > 0 Тогда
		Возврат ДатаИзСтрокиISO(Значение);
	Иначе
		Возврат ДатаИзСтрокиUNIX(Значение, Делитель, ПриводитьКМестномуВремени);
	КонецЕсли;
	
КонецФункции

Функция ДатаИзСтрокиISO(Значение) Экспорт
	
	СтрДата = Значение;
	
	Рез = Дата(1,1,1);
	
	//2018-03-19T23:59:59
	СтрГод = Сред(СтрДата, 1, 4);
	СтрМесяц = Сред(СтрДата, 6, 2);
	СтрЧисло = Сред(СтрДата, 9, 2);
	СтрЧас = Сред(СтрДата, 12, 2);
	СтрМинута = Сред(СтрДата, 15, 2);
	СтрСекунда = Сред(СтрДата, 18, 2);
	
	Попытка
		Рез = Дата(Число(СтрГод), Число(СтрМесяц), Число(СтрЧисло), Число(СтрЧас), Число(СтрМинута), Число(СтрСекунда));
	Исключение
	КонецПопытки;
	
	Возврат Рез;
	
	//Конвертор = ОбъектXDTOПоИмениСвойства("http://gosis.1c.ru/Convertor", "query");
	//Конвертор.ХранилищеДаты = ОбъектXDTOПоИмениТипа(Конвертор, "ХранилищеДаты");
	//
	//Попытка
	//	Конвертор.ХранилищеДаты.Значение = Значение;
	//	Возврат Конвертор.ХранилищеДаты.Значение;
	//Исключение
	//	Возврат Дата(1, 1, 1);
	//КонецПопытки;
	
КонецФункции

// Создает ОбъектXDTO из пространства имен по имени свойства.
//
// Возвращаемое значение:
//   ОбъектXDTO
Функция ОбъектXDTOПоИмениТипа(ОбъектXDTOРодитель, ИмяТипа) Экспорт
	
	Если ТипЗнч(ОбъектXDTOРодитель) = Тип("СписокXDTO") Тогда
		ТипОбъекта = ОбъектXDTOРодитель.ВладеющееСвойство.Тип.Свойства.Получить(ИмяТипа).Тип;
	Иначе
		ТипОбъекта = ОбъектXDTOРодитель.Тип().Свойства.Получить(ИмяТипа).Тип;
	КонецЕсли; 
	
	Возврат ФабрикаXDTO.Создать(ТипОбъекта);
	
КонецФункции

Функция ДатаИзСтрокиUNIX(Знач Значение, Делитель = 1000, ПриводитьКМестномуВремени = Истина) Экспорт
	
	Значение = '19700101' + Цел(Значение / Делитель);
	
	Если ПриводитьКМестномуВремени Тогда
		Возврат МестноеВремя(Значение);
	Иначе
		Возврат Значение;
	КонецЕсли;
	
КонецФункции

// Настройки влияющие на процесс разбора кода маркировки.
//
// Возвращаемое значение:
//    Структура:
//     * ПроверятьАлфавитЭлементов - Булево - Выполнять проверку символовсчитанных кодов маркировки на вхождение в множество допустимых символов GS1.
//     * РасширеннаяДетализация - Булево - Служебный параметр.
//     * ВалидироватьШтрихкодЛогистическойУпаковкиGS1128БезРазделителей - Булево - Служебный параметр. Позволяет отсекать логистические упаковки формата GS1 без разделителей, не прошедшие проверки.
//     * ВалидироватьШтрихкодЛогистическойУпаковкиGS1128СОшибками - Булево - Служебный параметр. Позволяет отсекать логистические упаковки формата GS1, не прошедшие проверки.
//
Функция ПользовательскиеПараметрыРазбораКодаМаркировки() Экспорт
	
	ПользовательскиеПараметры = Новый Структура;
	ПользовательскиеПараметры.Вставить("ПроверятьАлфавитЭлементов",                                      Истина);
	ПользовательскиеПараметры.Вставить("РасширеннаяДетализация",                                         Ложь);
	ПользовательскиеПараметры.Вставить("ВалидироватьШтрихкодЛогистическойУпаковкиGS1128БезРазделителей", Истина);
	ПользовательскиеПараметры.Вставить("ВалидироватьШтрихкодЛогистическойУпаковкиGS1128СОшибками",       Истина);
	
	Возврат ПользовательскиеПараметры;
	
КонецФункции

// Набор коллекций необходимых для "упрощенного" разбора с использованием предыдущих результатов.
//
// Возвращаемое значение:
//    Структура:
//     * ШаблоныПоИдентификатору - Соответствие из КлючИЗначение:
//        ** Ключ     - Строка - ИнициализироватьНастройкиШаблонаРазобранногоКодаМаркировки.ИдентификаторДопустимыхШаблонов
//        ** Значение - см. ИнициализироватьНастройкиШаблонаРазобранногоКодаМаркировки.
//     * ПараметрыШаблонаПоПолномуХешуШаблонаСУчетомGTIN - Соответствие из КлючИЗначение:
//        ** Ключ     - Строка.
//        ** Значение - Булево.
//     * ПустоеПримечаниеКРезультатуРазбора - Структура - примечание к результату успешного разбора
//
Функция ИнициализироватьНастройкиИспользующиеРезультатыПредыдущихРазборов() Экспорт
	
	ПримечаниеКРезультатуРазбора = Новый Структура("ИдентификаторОшибки, ТекстОшибки, РезультатРазбора", "", "", Неопределено);
	
	КешНастроекРазбораКодаМаркировки = Новый Структура;
	КешНастроекРазбораКодаМаркировки.Вставить("ШаблоныПоИдентификатору",                         Новый Соответствие);
	КешНастроекРазбораКодаМаркировки.Вставить("ПараметрыШаблонаПоПолномуХешуШаблонаСУчетомGTIN", Новый Соответствие);
	КешНастроекРазбораКодаМаркировки.Вставить("ПустоеПримечаниеКРезультатуРазбора",              ПримечаниеКРезультатуРазбора);
	
	Возврат КешНастроекРазбораКодаМаркировки;
	
КонецФункции

#КонецОбласти

// Возвращает параметры для отправки HTTP запросов ИС МП.
//
// Параметры:
//   ВидПродукции - ПеречислениеСсылка.ВидыПродукцииИС - Вид продукции (В тестовом контуре адреса серверов
//                                                       могут отличаться для различных видов продукции).
//   ИспользоватьTrueAPI - Булево - Использовать true-api.
//   ЗагрузкаCDNПлощадок - Булево - Загрузка CDN-площадок
//
// Возвращаемое значение:
//  Структура - Описание:
//   * ИспользоватьЗащищенноеСоединение - Булево - Признак использования SSL.
//   * Таймаут - Число - Таймаут соединения.
//   * Порт - Число - Порт соединения.
//   * Сервер - Строка - Адрес сервера.
//   * ПредставлениеСервиса - Строка - Представления сервиса.
//
// Функция преобразовывает список переданных сокращенных наименований гос. органов, устанавливающих
//  блокировку на реализацию конкретных кодов маркировки по данным ГИС МТ, в читаемое представление
// 
// Параметры:
//  МассивИдентификаторов - Массив из Строка - список сокращенных наименований организаций
// 
// Возвращаемое значение:
//  Массив из Строка - список полных наименований организаций
Функция ОрганыВластиУстанавливающиеБлокировкуНаКМПоДаннымГИСМТ(МассивИдентификаторов) Экспорт
	
	МассивПредставлений = Новый Массив;
	
	Если Не ТипЗнч(МассивИдентификаторов) = Тип("Массив") Тогда
		Возврат МассивПредставлений;
	КонецЕсли;
	
	СоответствиеПредставлений = Новый Соответствие();
	СоответствиеПредставлений.Вставить("RAR",  НСтр("ru = 'Росалкогольрегулирование'"));
	СоответствиеПредставлений.Вставить("FTS",  НСтр("ru = 'ФТС России'"));
	СоответствиеПредставлений.Вставить("FNS",  НСтр("ru = 'ФНС России'"));
	СоответствиеПредставлений.Вставить("RSHN", НСтр("ru = 'Россельхознадзор (РСХН)'"));
	СоответствиеПредставлений.Вставить("RPN",  НСтр("ru = 'Роспотребнадзор (РПН)'"));
	СоответствиеПредставлений.Вставить("MVD",  НСтр("ru = 'МВД России'"));
	СоответствиеПредставлений.Вставить("RZN",  НСтр("ru = 'Росздравнадзор'"));
	
	Для Каждого Идентификатор Из МассивИдентификаторов Цикл
		
		ЗначениеПредставления = СоответствиеПредставлений.Получить(Идентификатор);
		
		Если ЗначениеПредставления = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		МассивПредставлений.Добавить(ЗначениеПредставления);
		
	КонецЦикла;
	
	Возврат МассивПредставлений;
	
КонецФункции

// Блокирует список CDN-площадок на время, указанное пользователем, 
//  или стандартный срок из настроек ИС МП
// 
// Параметры:
//  МассивПлощадок - Массив из Строка - Массив площадок к блокировке
//  ВремяБлокировки - Число - Время блокировки, если 0, то берется стандартное время блокировки
Процедура ЗаблокироватьСписокПлощадок(МассивПлощадок, ВремяБлокировки = 0) Экспорт
	
	Если МассивПлощадок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ВремяБлокировки = 0 Тогда
		ВремяБлокировки = 15;
	КонецЕсли;
	
	Для Каждого АдресПлощадки Из МассивПлощадок Цикл
		
		МенеджерЗаписи = РегистрыСведений.СостоянияCDNПлощадокИСМП.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.АдресПлощадки = АдресПлощадки;
		МенеджерЗаписи.Прочитать();
		
		Если Не МенеджерЗаписи.Выбран() Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи.ДатаНедоступнаДоУниверсальная = ТекущаяУниверсальнаяДата() + ВремяБлокировки * 60;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает найденое значение во внутреннем соответствии текстов ошибок.
// Если значение в соответствии не найдено, то возвращается исходное значение.
// 
// Параметры:
// 	ИсходноеСообщение - Строка - Исходный текст.
// Возвращаемое значение:
// 	Строка - Найденое значение или сходнное.
Функция ТекстПредставленияОшибки(ИсходноеСообщение)
	
	ЗначениеПоиска = СокрЛП(НРег(ИсходноеСообщение));
	
	ТекстыОшибок = Новый Соответствие();
	
	ТекстыОшибок.Вставить(
		НРег("Not enough balance"),
		НСтр("ru = 'Недостаточно средств на балансе для получения кодов маркировки из СУЗ'"));
	
	ВозвращаемоеЗначение = ТекстыОшибок.Получить(ЗначениеПоиска);
	
	Если ВозвращаемоеЗначение = Неопределено Тогда
		ВозвращаемоеЗначение = ИсходноеСообщение;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Процедура ЛогироватьРезультатыОперацийПроверкиКМ(ДанныеДляЛогирования) Экспорт
	
	Если Истина Тогда
	
		Для Каждого ДанныеПоКМ Из ДанныеДляЛогирования Цикл
			
			//@skip-check wrong-string-literal-content
			МодульМенеджерОборудованияМаркировка = ОбщегоНазначения.ОбщийМодуль("МенеджерОборудованияМаркировка");
			//@skip-check unknown-method-property
			МодульМенеджерОборудованияМаркировка.ДобавитьЗаписьВЖурналОперацийПроверкиКМ(ДанныеПоКМ);
			
		КонецЦикла;
		
	Иначе
		
		ИмяСобытияЖурналРегистрации = НСтр("ru = 'Разрешительный режим.Операция проверки КМ'", ОбщегоНазначения.КодОсновногоЯзыка());
		ШаблонИнформацииПоКМ = 
			НСтр("ru = 'Код ответа: %1
				|Адрес сервера: %2
				|Текст запроса: %3
				|Текст ответа: %4
				|Идентификатор запроса: %5
				|Время запроса: %6'");
		
		Для Каждого ДанныеПоКМ Из ДанныеДляЛогирования Цикл
			
			ТекстИнформацииПоКМ = СтрШаблон(ШаблонИнформацииПоКМ, ДанныеПоКМ.КодОтветаРазрешения, ДанныеПоКМ.АдресСервераЗапросаРазрешения, ДанныеПоКМ.ТекстЗапросаРазрешения, ДанныеПоКМ.РезультатЗапросаРазрешения,
				ДанныеПоКМ.ИдентификаторЗапросаРазрешения, ДанныеПоКМ.ВремяЗапросаРазрешения);
			
			ЗаписьЖурналаРегистрации(ИмяСобытияЖурналРегистрации, УровеньЖурналаРегистрации.Информация,, ДанныеПоКМ.НормализованныйШтрихкод, ТекстИнформацииПоКМ);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаписатьВЛогОтветРазрешительногоРежимаГИСМТ(АдресСервера, КодОшибки, ДанныеШтрихкода, ТекстОтвета, ТекстЗапроса, ДатаПолученияЗапроса = Неопределено, ИдентификаторЗапросаРазрешения = "")
	
	ПараметрыЗаписиВЛог = ПараметрыЗаписиОперацииПроверкиКМ();
	
	Если ДатаПолученияЗапроса = Неопределено Тогда
		ДатаПолученияЗапроса = ТекущаяУниверсальнаяДата();
	КонецЕсли;
	
	ПараметрыЗаписиВЛог.АдресСервераЗапросаРазрешения  = АдресСервера;
	ПараметрыЗаписиВЛог.ИдентификаторЗапросаРазрешения = ИдентификаторЗапросаРазрешения;
	ПараметрыЗаписиВЛог.ВремяЗапросаРазрешения         = ДатаПолученияЗапроса;
	ПараметрыЗаписиВЛог.ЗапросРазрешенияПродажиКМ      = Истина;
	ПараметрыЗаписиВЛог.КодОтветаРазрешения            = КодОшибки;
	ПараметрыЗаписиВЛог.КонтрольнаяМарка               = ДанныеШтрихкода.ПолныйКодМаркировки;
	ПараметрыЗаписиВЛог.НормализованныйШтрихкод        = ДанныеШтрихкода.НормализованныйШтрихкод;
	ПараметрыЗаписиВЛог.Наименование                   = ДанныеШтрихкода.ПредставлениеНоменклатуры;
	ПараметрыЗаписиВЛог.РезультатЗапросаРазрешения     = ТекстОтвета;
	ПараметрыЗаписиВЛог.ТекстЗапросаРазрешения         = ТекстЗапроса;
	
	Возврат ПараметрыЗаписиВЛог;
	
КонецФункции

Функция ПараметрыЗаписиОперацииПроверкиКМ() Экспорт
	
	Если Истина Тогда
		
		//@skip-check wrong-string-literal-content
		МодульМенеджерОборудованияМаркировка = ОбщегоНазначения.ОбщийМодуль("МенеджерОборудованияМаркировка");
		//@skip-check unknown-method-property
		Результат = МодульМенеджерОборудованияМаркировка.ПараметрыЗаписиОперацииПроверкиКМ();
		
		Результат.Вставить("НормализованныйШтрихкод",        "");
		
	Иначе
		
		Результат = Новый Структура();
		Результат.Вставить("Наименование",                   "");
		Результат.Вставить("КонтрольнаяМарка",               "");
		Результат.Вставить("ЗапросРазрешенияПродажиКМ",      Истина);
		Результат.Вставить("АдресСервераЗапросаРазрешения",  "");
		Результат.Вставить("ТекстЗапросаРазрешения",         "");
		Результат.Вставить("КодОтветаРазрешения",            "");
		Результат.Вставить("РезультатЗапросаРазрешения",     "");
		Результат.Вставить("ИдентификаторЗапросаРазрешения", "");
		Результат.Вставить("ВремяЗапросаРазрешения",         Неопределено);
		Результат.Вставить("НормализованныйШтрихкод",        "");
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Вывести HTTP-Запрос в лог
//
// Параметры:
//  HTTPЗапрос - HTTPЗапрос - HTTP-запрос для вывода в файл.
//             - HTTPОтвет  - HTTP-ответ для вывода в файл.
//  ПараметрыОтправкиHTTPЗапросов - Структура из КлючИЗначение - дополнительные параметры отправки
//  HTTPМетод - Строка - PUT, GET, POST и проч.
//  ПутьКФайлу - Строка - Путь к файлу для записи лога.
//  ТекстОшибки - Строка - текст ошибки выполнения
//
// Возвращаемое значение:
//  Строка - Представление протокола
Функция ВывестиHTTPЗапросВЛог(HTTPЗапрос, ПараметрыОтправкиHTTPЗапросов, HTTPМетод, ПутьКФайлу = Неопределено, ТекстОшибки = "") Экспорт
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	
	Если ПутьКФайлу <> Неопределено Тогда
		ТекстовыйДокумент.Прочитать(ПутьКФайлу, КодировкаТекста.UTF8);
	КонецЕсли;
	
	Если HTTPЗапрос <> Неопределено Тогда
		Если ТипЗнч(HTTPЗапрос) = Тип("HTTPЗапрос") Тогда
			
			Если ТекстовыйДокумент.КоличествоСтрок() > 0 Тогда
				ТекстовыйДокумент.ДобавитьСтроку("");
			КонецЕсли;
			
			URLЗапроса = URLЗапроса(HTTPЗапрос, ПараметрыОтправкиHTTPЗапросов, HTTPМетод);
			
			ТекстовыйДокумент.ДобавитьСтроку(URLЗапроса);
		ИначеЕсли ТипЗнч(HTTPЗапрос) = Тип("HTTPОтвет") Тогда
			ТекстовыйДокумент.ДобавитьСтроку("");
			ТекстовыйДокумент.ДобавитьСтроку(СтрШаблон("Код состояния: %1", HTTPЗапрос.КодСостояния));
		ИначеЕсли ТипЗнч(HTTPЗапрос) = Тип("Структура") Тогда
			ТекстовыйДокумент.ДобавитьСтроку("");
			ТекстовыйДокумент.ДобавитьСтроку(НСтр("ru = 'Запрос проксирован через сервис интернет-поддержки'"));
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из HTTPЗапрос.Заголовки Цикл
			
			ЗначениеЗаголовка = КлючИЗначение.Значение;
			
			ТекстовыйДокумент.ДобавитьСтроку(
				СтрШаблон("%1: %2", КлючИЗначение.Ключ, ЗначениеЗаголовка));
			
		КонецЦикла;
		
		Если ТипЗнч(HTTPЗапрос) = Тип("Структура") Тогда
			Тело = HTTPЗапрос.Тело;
		Иначе
			Тело = HTTPЗапрос.ПолучитьТелоКакСтроку();
		КонецЕсли;
		
		Если Не ПустаяСтрока(Тело) Тогда
			ТекстовыйДокумент.ДобавитьСтроку(Тело);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ТекстОшибки) Тогда
		ТекстовыйДокумент.ДобавитьСтроку(ТекстОшибки);
	КонецЕсли;
	
	Если ПутьКФайлу <> Неопределено Тогда
		ТекстовыйДокумент.Записать(ПутьКФайлу, КодировкаТекста.UTF8);
	КонецЕсли;
	
	Возврат ТекстовыйДокумент.ПолучитьТекст();
	
КонецФункции

Функция URLЗапроса(HTTPЗапрос, ПараметрыОтправкиHTTPЗапросов, HTTPМетод) Экспорт

	Если ПараметрыОтправкиHTTPЗапросов.ИспользоватьЗащищенноеСоединение Тогда
		Протокол = "https";
	Иначе
		Протокол = "http";
	КонецЕсли;
	
	URLЗапроса = СтрШаблон(
		"%1 %2://%3:%4/%5",
		HTTPМетод,
		Протокол,
		ПараметрыОтправкиHTTPЗапросов.Сервер,
		Формат(ПараметрыОтправкиHTTPЗапросов.Порт, "ЧГ=0;"),
		HTTPЗапрос.АдресРесурса);
	
	Возврат URLЗапроса;

КонецФункции

#КонецОбласти

#Область ОбновлениеCDNПлощадок

// Длительная операция актуализации списка и времени отклика CDN-площадок
// 
// Параметры:
//  ПараметрыФоновогоЗадания - Структура - Параметры запуска фонового задания
//  АдресРезультата - Строка - адрес возврата результата
Функция ВыполнитьАктуализациюCDNПлощадокДлительнаяОперация(ПараметрыФоновогоЗадания) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ЕстьОшибки",                            Ложь);
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессииРозница", Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                           "");
	
	//+ОЛИМП Не логируем
	//Если ПараметрыФоновогоЗадания.Свойство("ПараметрыЛогированияЗапросовИСМП") Тогда
	//	
	//	ЛогированиеЗапросовИСМП.УстановитьПараметрыЛогированияЗапросов(ПараметрыФоновогоЗадания.ПараметрыЛогированияЗапросовИСМП);
	//	ЛогированиеЗапросовИС.НастроитьПараметрыЛогированияВФоновомЗадании(ПараметрыФоновогоЗадания.ПараметрыЛогированияЗапросовИСМП);
	//	ВыполнятьЛогирование = Истина;
	//	
	//КонецЕсли;
	
	Если ПараметрыФоновогоЗадания.Свойство("ОбновлятьБезПроверкиДатыОбновления") И ПараметрыФоновогоЗадания.ОбновлятьБезПроверкиДатыОбновления Тогда
		ТребуетсяОбновлениеCDNПлощадок = Истина;
	Иначе
		ТребуетсяОбновлениеCDNПлощадок = ТребуетсяОбновлениеСпискаCDNПлощадок();
	КонецЕсли;
	
	РезультатОбновления = АктуализацияСпискаCDNПлощадок(ПараметрыФоновогоЗадания.КлючСессии);
	
	//+ОЛИМП Не логируем
	//Если ВыполнятьЛогирование Тогда
	//	ЛогированиеЗапросовИСМП.ЗаполнитьВозвращаемыеДанныеФоновогоЗадания(РезультатОбновления);
	//КонецЕсли;
	
	Если РезультатОбновления.СписокПлощадок.Количество() Тогда
		
		РезультатЗаписи = ЗаписатьДанныеСостоянияCDNПлощадокВРегистр(РезультатОбновления.СписокПлощадок);
		
		Если РезультатЗаписи.Отказ Тогда
			
			ВозвращаемоеЗначение.ЕстьОшибки  = Истина;
			ВозвращаемоеЗначение.ТекстОшибки = РезультатЗаписи.ТекстОшибки;
			
		ИначеЕсли ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки) Тогда
			
			ВозвращаемоеЗначение.ЕстьОшибки  = Истина;
			ВозвращаемоеЗначение.ТекстОшибки = РезультатОбновления.ТекстОшибки;
			
		КонецЕсли;
		
	Иначе
		
		ВозвращаемоеЗначение.ЕстьОшибки                            = ЗначениеЗаполнено(РезультатОбновления.ТекстОшибки);
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = РезультатОбновления.ТребуетсяОбновлениеКлючаСессииРозница;
		ВозвращаемоеЗначение.ТекстОшибки                           = РезультатОбновления.ТекстОшибки;
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ТребуетсяОбновлениеСпискаCDNПлощадок() Экспорт
	
	//Если ОбщегоНазначенияИСМПВызовСервера.СписокУчитываемойПродукцииТребующейОбязательнойПроверкиПриПродажеВРозницуНаДату().Количество() = 0 Тогда
	//	Возврат Ложь;
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИСТИНА КАК ЕстьАктивныеПлощадки
		|ИЗ
		|	РегистрСведений.СостоянияCDNПлощадокИСМП КАК CDNПлощадкиИСМП
		|ГДЕ
		|	ДОБАВИТЬКДАТЕ(CDNПлощадкиИСМП.ДатаОбновленияУниверсальная, СЕКУНДА, &ВремяОбновленияПлощадок) >= &ТекущаяУниверсальнаяДата";
	
	Запрос.УстановитьПараметр("ВремяОбновленияПлощадок",  6 * 3600);
	Запрос.УстановитьПараметр("ТекущаяУниверсальнаяДата", ТекущаяУниверсальнаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	ТребуетсяОбновление = РезультатЗапроса.Пустой();
	
	Возврат ТребуетсяОбновление;
	
КонецФункции


// Актуализация списка CDN-площадок для обращения в ГИС МТ методом розничной продажи.
//  При своевременной актуализации списка гарантируется максимально быстрое получение идентификаторов
//  разрешительного режима для ускорения розничной продажи.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации - Организация
// 
// Возвращаемое значение:
//  Структура - результат обновления площадок:
// * ТребуетсяОбновлениеКлючаСессииРозница - Булево - признак необходимости обновления ключа сессии
// * РезультатОтправкиЗапроса - (См. ОбщегоНазначенияИСМП.ОбработатьРезультатОтправкиHTTPЗапросаКакJSON).
// * СписокПлощадок - Соответствие Из КлючИЗначение - полученные CDN-площадки:
//		** Ключ - Строка - Адрес площадки.
//		** Значение - (см. ЗамерыСкоростиCDNПлощадок)
// * ТекстОшибки - Строка - текст ошибки, полученной от ГИС МТ
Функция АктуализацияСпискаCDNПлощадок(КлючСессии) Экспорт
	
	////КлючСессии = ПроверитьОбновитьКлючСессии(Организация);
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессииРозница", КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("РезультатОтправкиЗапроса",              Неопределено);
	ВозвращаемоеЗначение.Вставить("СписокПлощадок",                        Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                           "");
	
	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type",   "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовокHTTP.Вставить("X-API-KEY",      КлючСессии);
	
	URLЗапроса = "api/v4/true-api/cdn/info";
	
	ПараметрыЗапросов         = ПараметрыОтправкиHTTPЗапросов(, Истина, Истина);
	
	РезультатЗапроса = ОтправитьДанныеВСервис(
		URLЗапроса,
		,
		КлючСессии,
		"GET",
		ПараметрыЗапросов,
		ЗаголовокHTTP);
	
	РезультатОтправкиЗапроса = ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
	
	ВозвращаемоеЗначение.РезультатОтправкиЗапроса = РезультатОтправкиЗапроса;
	
	КоличествоЗапросовПоОднойПлощадкеДляУсредненияРезультата = 3;
	
	Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
		
		Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
			
			ДанныеОбработки = ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON, Истина);
			КодОтвета       = ДанныеОбработки.Получить("code") <> 0;
			
			Если КодОтвета <> 0 Тогда
				
				ШаблонОтвета = НСтр("ru = 'Получен неверный запрос. Код ответа - %1: %2'");
				ВозвращаемоеЗначение.ТекстОшибки = СтрШаблон(ШаблонОтвета, КодОтвета, ДанныеОбработки.Получить("description"));
				
				Возврат ВозвращаемоеЗначение;
				
			КонецЕсли;
			
			СписокПлощадок = ДанныеОбработки.Получить("hosts");
			
			Для Каждого Площадка Из СписокПлощадок Цикл
				
				АдресПлощадки = Площадка.Получить("host");
				URLЗапроса    = "api/v4/true-api/cdn/health/check";
				
				СтруктураАдреса = РегистрыСведений.СостоянияCDNПлощадокИСМП.РазобратьАдресПлощадкиНаСерверИПорт(АдресПлощадки);
				
				ПараметрыЗапросов = ПараметрыОтправкиHTTPЗапросов(, Истина);
				ПараметрыЗапросов.Сервер                           = СтруктураАдреса.Сервер;
				ПараметрыЗапросов.Порт                             = СтруктураАдреса.Порт;
				ПараметрыЗапросов.ИспользоватьЗащищенноеСоединение = СтруктураАдреса.ЗащищенноеСоединение;
				
				ЗамерыПоПлощадке               = Новый Массив();
				
				Для Индекс = 1 По КоличествоЗапросовПоОднойПлощадкеДляУсредненияРезультата Цикл
					
					НачалоЗамеровУниверсальнаяДата = ТекущаяУниверсальнаяДатаВМиллисекундах();
					
					РезультатЗапроса = ОтправитьДанныеВСервис(
						URLЗапроса,
						,
						КлючСессии,
						"GET",
						ПараметрыЗапросов,
						ЗаголовокHTTP);
					
					РезультатОтправкиЗапроса = ОбработатьРезультатОтправкиHTTPЗапросаКакJSON(РезультатЗапроса);
					
					Если РезультатОтправкиЗапроса.ОтветПолучен Тогда
						
						Если РезультатОтправкиЗапроса.КодСостояния = 200 Тогда
							
							ДанныеОбработки = ТекстJSONВОбъект(РезультатОтправкиЗапроса.ТекстВходящегоСообщенияJSON, Истина);
							СреднееВремяОбработкиКМ = 0;
							
							Если ДанныеОбработки.Получить("avgTimeMs") <> Неопределено Тогда
								СреднееВремяОбработкиКМ = ДанныеОбработки.Получить("avgTimeMs");
							КонецЕсли;
							
							ЗамерПоПлощадке = Новый Структура("НачалоЗамера, КонецЗамера, СреднееВремяОбработкиКМ",
								НачалоЗамеровУниверсальнаяДата,
								ТекущаяУниверсальнаяДатаВМиллисекундах(),
								СреднееВремяОбработкиКМ);
								
							ЗамерыПоПлощадке.Добавить(ЗамерПоПлощадке);
							
						Иначе
							
							Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
								
								ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = Истина;
								Возврат ВозвращаемоеЗначение;
								
							КонецЕсли;
							
							ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(
								АдресПлощадки + "/" + URLЗапроса,
								РезультатОтправкиЗапроса);
							// вернулась ошибка в ответе по площадке
							// такую площадку не записываем, переходим к следующей
							Прервать;
							
						КонецЕсли;
						
					Иначе
						
						ВозвращаемоеЗначение.ТекстОшибки = ВозвращаемоеЗначение.ТекстОшибки
							+ ?(ЗначениеЗаполнено(ВозвращаемоеЗначение.ТекстОшибки), Символы.ПС + Символы.ПС, "")
							+ ТекстОшибкиПоРезультатуОтправкиЗапроса(
								АдресПлощадки + "/" + URLЗапроса,
								РезультатОтправкиЗапроса);
						// не получен ответ от площадки
						// такую площадку не записываем, переходим к следующей
						Прервать;
						
					КонецЕсли;
					
				КонецЦикла;
				
				ОбщееВремяПроверкиКМ = 0;
				ОбщееВремяОтвета     = 0;
				
				Для Каждого ЗамерВремени Из ЗамерыПоПлощадке Цикл
					
					ОбщееВремяПроверкиКМ = ОбщееВремяПроверкиКМ + ЗамерВремени.СреднееВремяОбработкиКМ;
					ОбщееВремяОтвета     = ОбщееВремяОтвета + (ЗамерВремени.КонецЗамера - ЗамерВремени.НачалоЗамера);
					
				КонецЦикла;
				
				СтруктураЗамеров = ЗамерыСкоростиCDNПлощадок();
				
				Если ЗамерыПоПлощадке.Количество() = 0 Тогда
					
					// ответа от площадок не получено, площадка получает минимальный рейтинг в списке
					СтруктураЗамеров.СреднееВремяПроверкиКМ = -1;
					СтруктураЗамеров.СреднееВремяОтвета     = -1;
					
				Иначе
					
					СтруктураЗамеров.СреднееВремяПроверкиКМ = ОбщееВремяПроверкиКМ / КоличествоЗапросовПоОднойПлощадкеДляУсредненияРезультата;
					СтруктураЗамеров.СреднееВремяОтвета     = ОбщееВремяОтвета / КоличествоЗапросовПоОднойПлощадкеДляУсредненияРезультата;
					
				КонецЕсли;
				
				ВозвращаемоеЗначение.СписокПлощадок.Вставить(АдресПлощадки, СтруктураЗамеров);
				
			КонецЦикла;
			
		Иначе
			
			Если РезультатОтправкиЗапроса.КодСостояния = 401 Тогда
				
				ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = Истина;
				
			КонецЕсли;
			
			ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(
				URLЗапроса,
				РезультатОтправкиЗапроса);
			
		КонецЕсли;
		
	Иначе
		
		// не получен список площадок, таймаут или иные проблемы
		ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибкиПоРезультатуОтправкиЗапроса(
			URLЗапроса,
			РезультатОтправкиЗапроса);
		
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗамерыСкоростиCDNПлощадок()
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("СреднееВремяПроверкиКМ", 0);
	СтруктураВозврата.Вставить("СреднееВремяОтвета",     0);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Запись данных площадок в регистр СостоянияCDNПлощадокИСМП
// 
// Параметры:
//  СписокПлощадок - Соответствие Из КлючИЗначение - полученные CDN-площадки:
//   * Ключ - Строка - Адрес площадки.
//   * Значение - (см. ИнтерфейсИСМП.ЗамерыСкоростиCDNПлощадок)
// Возвращаемое значение:
//   - Структура из КлючИЗначение:
//     * Отказ - Булево
//     * ТекстОшибки - Строка - заполнено, если Отказ = Истина
Функция ЗаписатьДанныеСостоянияCDNПлощадокВРегистр(СписокПлощадок) Экспорт
	
	РезультатВозврата = Новый Структура("Отказ, ТекстОшибки", Ложь, "");
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.СостоянияCDNПлощадокИСМП");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		
		Блокировка.Заблокировать();
	
		НаборЗаписей = РегистрыСведений.СостоянияCDNПлощадокИСМП.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		
		Для Каждого СтрокаСпискаПлощадок Из СписокПлощадок Цикл
			
			ЗаписьРегистра = РегистрыСведений.СостоянияCDNПлощадокИСМП.СоздатьМенеджерЗаписи();
			
			ЗаписьРегистра.АдресПлощадки          = СтрокаСпискаПлощадок.Ключ;
			ЗаписьРегистра.СреднееВремяОтвета     = СтрокаСпискаПлощадок.Значение.СреднееВремяОтвета;
			ЗаписьРегистра.СреднееВремяПроверкиКМ = СтрокаСпискаПлощадок.Значение.СреднееВремяПроверкиКМ;
			
			ЗаписьРегистра.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		РезультатВозврата.Отказ       = Истина;
		РезультатВозврата.ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат РезультатВозврата;
	
КонецФункции

#КонецОбласти

#Область ПолучениеКлючаСессии

// Возвращает ключ сессии для обмена с МОТП.
// 
// Параметры:
// 	ПараметрыЗапроса - См. ИнтерфейсАвторизацииИСМПКлиентСервер.ПараметрыЗапросаКлючаСессии
// 	СрокДействия - Дата, Неопределено - Срок действия ключа сессии
// 	ОбновлятьКлючСессииНаСервере - Булево - Признак необходимости обновления ключа сессии на сервере
// Возвращаемое значение:
// 	Строка, Неопределено - Действующий ключ сессии для организации.
Функция ПроверитьОбновитьКлючСессии(ПараметрыЗапроса, Знач СрокДействия = Неопределено, ОбновлятьКлючСессииНаСервере = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиРазрешительногоРежима.ТокенАвторизации КАК ТокенАвторизации
		|ИЗ
		|	РегистрСведений.НастройкиРазрешительногоРежима КАК НастройкиРазрешительногоРежима
		|ГДЕ
		|	НастройкиРазрешительногоРежима.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", ПараметрыЗапроса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ТокенАвторизации;
	Иначе
		ВызватьИсключение "Для работы разрешительного режима необходимо указать токен для данной организации.";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

Процедура РазрешительныйРежимОбновлениеCDNПлощадок() Экспорт // РегЗадание обновление CDN площадок
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиРазрешительногоРежима.ТокенАвторизации КАК ТокенАвторизации
		|ИЗ
		|	РегистрСведений.НастройкиРазрешительногоРежима КАК НастройкиРазрешительногоРежима
		|ГДЕ
		|	НастройкиРазрешительногоРежима.Используется = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат = ВыполнитьАктуализациюCDNПлощадокДлительнаяОперация(Новый Структура("КлючСессии, ОбновлятьБезПроверкиДатыОбновления", ВыборкаДетальныеЗаписи.ТокенАвторизации, Истина));
		Если Не ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
