#Область ПрограммныйИнтерфейс

#Область Заявки_И_Бронь
// Процедура - Создать заявку перед записью
//
// Параметры:
//  ДокументЗаявка	 - ДокументОбъект.Заявка	- Заполненный объект Заявка до момента попытки записи
//  ДопПараметры	 - Структура, Неопределено	- Структура всех параметров, что были переданы в запрос для создания заявки.
//		В параметрах всегда будет свойство "НастройкиОбмена", содержащая ссылку на используемый элемент справочника "Настройки обмена с сайтом"
//
Процедура СоздатьЗаявку_ПередЗаписью(ДокументЗаявка, ДопПараметры) Экспорт

КонецПроцедуры

// Процедура - Получить статус заявки перед возвратом
//
// Параметры:
//  ОписаниеРезультата	 - Строка	- Расшифровка кода статуса
//  КодСтатуса			 - Строка	- Код статуса строкой
//  ДопПараметры		 - Структура, Неопределено	- Структура всех параметров, что были переданы в запрос. В параметрах всегда будет
//		свойство "НастройкиОбмена", содержащая ссылку на используемый элемент справочника "Настройки обмена с сайтом"
//
Процедура ПолучитьСтатусЗаявки_ПередВозвратом(ОписаниеРезультата, КодСтатуса, ДопПараметры) Экспорт	

КонецПроцедуры

// Процедура - Отменить заявку после пометки на удаление
//
// Параметры:
//  ЗаявкаСсылка	 - ДокументСсылка.Заявка	- Документ заявки, который попытались пометить на удаление 
//  Результат		 - Булево	- Истина - документ успешно пометили на удаление, Ложь - произошла ошибка 
//  ОписаниеОшибки	 - Строка	- Описание ошибки, произошедшей при попытке удаления или до неё
//  ДопПараметры	 - Структура, Неопределено	- Структура всех параметров, что были переданы в запрос. В параметрах всегда будет
//		свойство "НастройкиОбмена", содержащая ссылку на используемый элемент справочника "Настройки обмена с сайтом" 
//
Процедура ОтменитьЗаявку_ПослеПометкиНаУдаление(ЗаявкаСсылка, Результат, ОписаниеОшибки, ДопПараметры) Экспорт	

КонецПроцедуры

// Процедура - Создать бронь перед возвратом
//
// Параметры:
//  Бронь			 - ДокументОбъект.Заявка	- Заполненный объект Заявка до момента попытки записи
//  Результат		 - Булево	- Истина - документ успешно записан, Ложь - произошла ошибка 
//  ОписаниеОшибки	 - Строка	- Описание ошибки, произошедшей при попытке записи или до неё
//  ДопПараметры	 - Структура, Неопределено	- Структура всех параметров, что были переданы в запрос. В параметрах всегда будет
//		свойство "НастройкиОбмена", содержащая ссылку на используемый элемент справочника "Настройки обмена с сайтом" 
//
Процедура СоздатьБронь_ПередВозвратом(Бронь, Результат, ОписаниеОшибки, ДопПараметры) Экспорт

КонецПроцедуры

#КонецОбласти

#Область ЛистыОжидания

// Процедура - Создать лист ожидания перед записью
//
// Параметры:
//  ДокументЛистОжидания - ДокументОбъект.ЛистОжидания	- Заполненный объект Лист Ожидания до момента попытки записи 
//  ДопПараметры		 - Структура, Неопределено	- Структура всех параметров, что были переданы в запрос для создания заявки.
//		В параметрах всегда будет свойство "НастройкиОбмена", содержащая ссылку на используемый элемент справочника "Настройки обмена с сайтом"
//
Процедура СоздатьЛистОжидания_ПередЗаписью(ДокументЛистОжидания, ДопПараметры) Экспорт

КонецПроцедуры

#КонецОбласти

#Область Графики

// Процедура - Получить укрупненный график перед возвратом
//
// Параметры:
//  ТаблицаГрафиков		 - ТаблицаЗначений - Таблица расписания сотрудников без учёта наложения и занятого времени 
//  ТаблицаСотрудников	 - ТаблицаЗначений - Таблица сотрудников
//  ДопПараметры		 - Структура, Неопределено	- Структура всех параметров, что были переданы в запрос для создания заявки.
//		В параметрах всегда будет свойство "НастройкиОбмена", содержащая ссылку на используемый элемент справочника "Настройки обмена с сайтом"
//
Процедура ПолучитьУкрупненныйГрафик_ПередВозвратом(ТаблицаГрафиков, ТаблицаСотрудников, ДопПараметры) Экспорт	

КонецПроцедуры

// Процедура - Получить графики работы перед возвратом
//
// Параметры:
//  ТаблицаГрафиков	- ТаблицаЗначений - Таблица расписания сотрудников с учётом наложения и занятого времени
//  ДопПараметры	- Структура, Неопределено - Структура всех параметров, что были переданы в запрос для создания заявки.
//		В параметрах всегда будет свойство "НастройкиОбмена", содержащая ссылку на используемый элемент справочника "Настройки обмена с сайтом"
//
Процедура ПолучитьГрафикиРаботы_ПередВозвратом(ТаблицаГрафиков, ДопПараметры) Экспорт

КонецПроцедуры

#КонецОбласти

#Область ДанныеИзБазы

// Процедура - Получить список номенклатуры и цен перед возвратом
//
// Параметры:
//  СписокНоменклатуры	 - ОбъектXDTO - Список номенклатуры и цен как ОбъектXDTO
//  ДопПараметры		 - Структура, Неопределено	- Структура всех параметров, что были переданы в запрос для создания заявки.
//		В параметрах всегда будет свойство "НастройкиОбмена", содержащая ссылку на используемый элемент справочника "Настройки обмена с сайтом"
//
Процедура ПолучитьСписокНоменклатурыИЦен_ПередВозвратом(СписокНоменклатуры, ДопПараметры) Экспорт

КонецПроцедуры

// Процедура - Получить список сотрудников перед возвратом
//
// Параметры:
//  СписокСотрудников	 - ОбъектXDTO - Список сотрудников как ОбъектXDTO
//  ДопПараметры		 - Структура, Неопределено	- Структура всех параметров, что были переданы в запрос для создания заявки.
//		В параметрах всегда будет свойство "НастройкиОбмена", содержащая ссылку на используемый элемент справочника "Настройки обмена с сайтом"
//
Процедура ПолучитьСписокСотрудников_ПередВозвратом(СписокСотрудников, ДопПараметры) Экспорт

КонецПроцедуры

#КонецОбласти

#КонецОбласти