#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Клиент", Клиент) Тогда
		
		Параметры.Свойство("Дата", Дата);
		Параметры.Свойство("Филиал", Филиал);
		
		Если Не ЗначениеЗаполнено(Клиент) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ПерезаполнитьЗаявкиПоПродажеНаСервере(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерезаполнитьЗаявкиПоПродаже(Команда)
	Заявки.Очистить();
	ПерезаполнитьЗаявкиПоПродажеНаСервере();		
КонецПроцедуры
	
&НаКлиенте
Процедура ОК(Команда)
	
	ВыбранныеЗаявки = Новый Массив;
	Для Каждого СтрокаЗаявки Из Заявки Цикл
		Если СтрокаЗаявки.Пометка Тогда
			ВыбранныеЗаявки.Добавить(СтрокаЗаявки.Заявка);
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(ВыбранныеЗаявки);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметки(Команда)
	УстановитьОтметкиСпискаЗаявок(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметки(Команда)
	УстановитьОтметкиСпискаЗаявок(Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЗаявкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.Заявки.ТекущийЭлемент <> Элементы.ЗаявкиПометка
		И Элементы.Заявки.ТекущиеДанные <> Неопределено
	Тогда
		ОткрытьЗначение(Элементы.Заявки.ТекущиеДанные.Заявка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПерезаполнитьЗаявкиПоПродажеНаСервере(ПриОткрытии = Ложь)
	
	Перем ЗаявкиДокументаПродажи;       
	
	Параметры.Свойство("ЗаявкиДокументаПродажи", ЗаявкиДокументаПродажи);
	
	Сотрудник = Неопределено;
	
	Если Параметры.Свойство("Сотрудник") и ЗначениеЗаполнено(Параметры.Сотрудник) Тогда
		 Сотрудник = Параметры.Сотрудник
	КонецЕсли;
	
	Если ПриОткрытии И Параметры.Заявки <> Неопределено Тогда
		ЗаявкиКлиента = Параметры.Заявки;
	ИначеЕсли не Сотрудник = Неопределено Тогда
		ЗаявкиКлиента = ПолучитьЗаявкиКлиента(Клиент, Дата, Филиал, Сотрудник);
	Иначе
		ЗаявкиКлиента = УправлениеЗаявками.ПолучитьЗаявкиКлиентаЗаДеньСостояниеДоПродажи(Клиент, Дата, Филиал);
	КонецЕсли;
	
	Для Каждого Заявка Из ЗаявкиКлиента Цикл
		СтрокаЗаявки = Заявки.Добавить();
		Если не Сотрудник = Неопределено Тогда 
			СтрокаЗаявки.Пометка = Ложь
		иначе
			СтрокаЗаявки.Пометка = ЗаявкиДокументаПродажи <> Неопределено И ЗаявкиДокументаПродажи.Найти(Заявка) <> Неопределено;
		КонецЕсли;
		СтрокаЗаявки.Заявка = Заявка;
	КонецЦикла;
	
	Если ЗаявкиДокументаПродажи <> Неопределено Тогда
		
		Если не Сотрудник = Неопределено Тогда
			 ЗаявкиДокументаПродажи.Очистить();
		КонецЕсли;
	
		Для Каждого Заявка Из ЗаявкиДокументаПродажи Цикл
			Если Заявки.НайтиСтроки(Новый Структура("Заявка", Заявка)).Количество() = 0 Тогда
				СтрокаЗаявки = Заявки.Добавить();
				СтрокаЗаявки.Пометка = Ложь;
				СтрокаЗаявки.Заявка = Заявка;
				Индекс = Параметры.ВыбранныеЗаявкиДокументаПродажи.Найти(Заявка);
				Если Индекс <> Неопределено Тогда
				СтрокаЗаявки.Пометка = Истина;	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;   
					
	КонецЕсли;
	
	// Заполнение описания сотрудников и работ
	УправлениеЗаявками.ЗаполнитьСотрудниковНоменклатуруТаблицыЗаявок(Заявки);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметкиСпискаЗаявок(Пометка)
	
	Для Каждого СтрокаЗаявки Из Заявки Цикл
		СтрокаЗаявки.Пометка = Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗаявкиКлиента(Клиент, Дата, Филиал,Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаРаботы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Заявка.Работы КАК ЗаявкаРаботы
		|ГДЕ
		|	ЗаявкаРаботы.Ссылка.Клиент = &Клиент
		//|	И (ЗаявкаРаботы.Ссылка.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
		//|			ИЛИ ЗаявкаРаботы.Ссылка.ДатаОкончания МЕЖДУ &ДатаНачала И &ДатаОкончания)
		|	И ЗаявкаРаботы.Ссылка.Филиал В ИЕРАРХИИ(&Филиал)
		//|	И ЗаявкаРаботы.Ссылка.Состояние В(&СостоянияДоПродажи)
		|	И НЕ ЗаявкаРаботы.Ссылка.ПометкаУдаления
		|	И ЗаявкаРаботы.Сотрудник = &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаРаботы.Ссылка";
	
	Запрос.УстановитьПараметр("СостоянияДоПродажи", УправлениеЗаявками.СостоянияЗаявкиДопродажи());
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата));
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Запрос.УстановитьПараметр("Клиент", Клиент);  
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
КонецФункции	
#КонецОбласти
