
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не СтрНайти(ПараметрыВыполненияКоманды.Источник.ИмяФормы, "ФормаСписка") = 0 Тогда
		ОбновитьСтатусыНаСервере(Неопределено);
		ПараметрыВыполненияКоманды.Источник.Элементы.Список.Обновить();
	Иначе
		ОбновитьСтатусыНаСервере(ПараметрКоманды);
		ПараметрыВыполненияКоманды.Источник.Прочитать();
		Если ПараметрыВыполненияКоманды.Источник.Объект.Статус = ПредопределенноеЗначение("Перечисление.iga_СтатусыПодтвержденияШаблонов.ОшибкаШаблона") Тогда
			ПараметрыВыполненияКоманды.Источник.Элементы.ОшибкаШаблона.Видимость = Истина;
		Иначе
			ПараметрыВыполненияКоманды.Источник.Элементы.ОшибкаШаблона.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыНаСервере(ШаблонСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ШаблоныСообщений.ИмяШаблона КАК ИмяШаблона,
	               |	iga_ШаблоныСообщений.Ссылка КАК Ссылка,
	               |	iga_ШаблоныСообщений.Идентификатор КАК Идентификатор,
	               |	iga_ШаблоныСообщений.Статус КАК Статус
	               |ИЗ
	               |	Справочник.iga_ШаблоныСообщений КАК iga_ШаблоныСообщений
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &Ссылка = НЕОПРЕДЕЛЕНО
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ iga_ШаблоныСообщений.Ссылка = &Ссылка
	               |		КОНЕЦ
	               |	И НЕ iga_ШаблоныСообщений.Идентификатор = """"
	               |	И НЕ iga_ШаблоныСообщений.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ссылка", ШаблонСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	
	Если ШаблонСсылка = Неопределено Тогда
		СписокШаблонов = Бот.ПолучитьСписокШаблонов();
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Если ШаблонСсылка = Неопределено Тогда
			Для Каждого ДанныеШаблона Из СписокШаблонов.templates Цикл
				Если ДанныеШаблона.templateId = Выборка.Идентификатор Тогда
					Результат = Новый Структура("template", ДанныеШаблона);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Результат = Бот.ПолучитьИнформациюОШаблоне(Выборка.Идентификатор);
		КонецЕсли;
		Если Не ТипЗнч(Результат) = Тип("Структура") Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось обновить статус шаблона """ + Выборка.Ссылка + """";
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		
		ТекущийСтатус = Перечисления.iga_СтатусыПодтвержденияШаблонов.ПолучитьПеречислениеПоСтатусу(Результат.template.status);
		
		Если Результат.template.status = "FAILED" Тогда
			ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ШаблонОбъект.Статус = Перечисления.iga_СтатусыПодтвержденияШаблонов.ОшибкаШаблона;
			Если Результат.template.Свойство("reason") Тогда
				ШаблонОбъект.ОшибкаШаблона = Результат.template.reason;
			КонецЕсли;
			ШаблонОбъект.Записать();
		Иначе
			ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ШаблонОбъект.Категория = ?(Результат.template.category = "MARKETING", Перечисления.iga_КатегорииШаблонов.Маркетинг, Перечисления.iga_КатегорииШаблонов.Утилита);
			ШаблонОбъект.Статус = ТекущийСтатус;
			ШаблонОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
