
&НаСервере
Процедура НоменклатураПриИзмененииНаСервере() 
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	омг_ОстаткиНоменклатурыАптека.Аптека КАК Аптека,
	//	|	омг_ОстаткиНоменклатурыАптека.омг_ЕдиницаХраненияАптеки КАК омг_ЕдиницаХраненияАптеки,
	//	|	омг_ОстаткиНоменклатурыАптека.Количество КАК Количество
	//	|ИЗ
	//	|	РегистрСведений.омг_ОстаткиНоменклатурыАптека КАК омг_ОстаткиНоменклатурыАптека
	//	|ГДЕ
	//	|	омг_ОстаткиНоменклатурыАптека.Номенклатура = &Номенклатура и  омг_ОстаткиНоменклатурыАптека.Аптека = &Аптека
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	омг_ОстаткиНоменклатурыАптека.ДатаОстатков УБЫВ";
	//
	//Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	//Запрос.УстановитьПараметр("Аптека", Аптека);
	//
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	//	// Вставить обработку выборки ВыборкаДетальныеЗаписи
	//КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)  

	Если не ЗначениеЗаполнено(Номенклатура) или не ЗначениеЗаполнено(Количество) Тогда
	Возврат	
	КонецЕсли;	
	СтрВозврата = Новый Структура;
	СтрВозврата.Вставить("Номенклатура",Номенклатура); 
	СтрВозврата.Вставить("Количество",Количество);
	СтрВозврата.Вставить("ЕдиницаИзмерения",ЕдиницаИзмерения);
	СтрВозврата.Вставить("СпособПрименения",СпособПрименения);
	СтрВозврата.Вставить("РазВдень",РазВдень);
	СтрВозврата.Вставить("СколькоДней",СколькоДней);
	СтрВозврата.Вставить("Дозировка",Дозировка);
	СтрВозврата.Вставить("Дополнение",Дополнение); 
    СтрВозврата.Вставить("ТекСТрока",ТекСТрока);
	СтрВозврата.Вставить("ЭтоПодбор",ЭтоПодбор);
	
	ОповеститьОВыборе(СтрВозврата);  
	
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьВручную(Команда)
	Закрыть();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтотОбъект.ТекСТрока = 0; 
	ЭтоПодбор = Ложь;

	Если Параметры.Свойство("Номенклатура") Тогда	
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры,"Номенклатура,Количество,ЕдиницаИзмерения,СпособПрименения,РазВдень,СколькоДней,Дозировка,Дополнение")  
	КонецЕсли; 
	
	Если Параметры.Свойство("ТекСТрока") Тогда	
		ЭтотОбъект.ТекСТрока = Параметры.ТекСТрока;  
	КонецЕсли;   
	
	Если Параметры.Свойство("ЭтоПодбор") Тогда	
		ЭтоПодбор = Истина;  
	КонецЕсли;   


	
КонецПроцедуры
