
Процедура ФУ_КомандаВыполнитьЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	омг_ПечатьНаправленияСервер.УдалитьВременныеНастройкиПечати(РезультатВыполнения.ИдентификаторУстройства);
	
КонецПроцедуры

Процедура НачатьПодключениеОборудованиеПоИдентификаторуЗавершение(Данные, ДопПараметры) Экспорт
	
	Оборудование = ДопПараметры.ПодключенноеУстройство;
	Заявка = ДопПараметры.Заявка;
	УникальныйИдентификатор = ДопПараметры.УникальныйИдентификатор;
	
	ПараметрыУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьДанныеУстройства(Оборудование);

	ОбъектДрайвер = глПодключаемоеОборудование.ДрайвераПодключаемогоОборудования.Получить(ПараметрыУстройства.ДрайверОборудования);
	
	ШиринаСтроки = омг_ПечатьНаправленияСервер.ПолучитьШиринуЛенты();
	
	Если ШиринаСтроки = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не установлена ширина строки принтера!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Шаблон = омг_ПечатьНаправленияСервер.ПолучитьШаблонНаправления();

	Если Шаблон = "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не установлен шаблон направления!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ШаблонЗаполненный = омг_ПечатьНаправленияСервер.СформироватьШаблон(Заявка, Шаблон, ШиринаСтроки);
	
	ИтоговыйТекст = "";
	
	Для НСтроки = 1 По СтрЧислоСтрок(ШаблонЗаполненный) Цикл
		ТекущаяСтрока = СтрПолучитьСтроку(ШаблонЗаполненный, НСтроки);
		
		Если СтрНайти(ТекущаяСтрока, "Штрихкод") = 0 Тогда
			ТекущаяСтрока = МенеджерОборудованияКлиентСервер.ПостроитьПолеПереносом(ТекущаяСтрока, ШиринаСтроки);
		КонецЕсли;
		
		ИтоговыйТекст =  ИтоговыйТекст + ?(ИтоговыйТекст = "", "", Символы.ПС) + ТекущаяСтрока;
	КонецЦикла;
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФУ_КомандаВыполнитьЗавершение", омг_ПечатьНаправления);
	
	омг_ПечатьНаправленияСервер.ЗаписатьВременныеНастройкиПечати(Оборудование);

	МенеджерОборудованияКлиент.НачатьПечатьТекста(ОповещениеПриЗавершении, УникальныйИдентификатор, ИтоговыйТекст, Оборудование);
	
КонецПроцедуры

Процедура ПечатьНаправленияПоЗаявке(Заявка, Форма) Экспорт

	РабочееМесто = МенеджерОборудованияКлиентПовтИсп.ПолучитьРабочееМестоКлиента();
	
	ТипыОборудования = Новый Массив;
	ТипыОборудования.Добавить("ПринтерЧеков");
	
	Если Не ЗначениеЗаполнено(РабочееМесто) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не настроено рабочее место!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	СписокДоступныхУстройств =  омг_ПечатьНаправленияСервер.ОборудованиеПоПараметрам(ТипыОборудования,, РабочееМесто);
	
	Если СписокДоступныхУстройств.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет доступных принтеров для печати!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПодключенноеУстройство = МенеджерОборудованияКлиент.ПолучитьПодключенноеУстройство(глПодключаемоеОборудование.ПараметрыПодключенияПО, 
		СписокДоступныхУстройств[0].Ссылка);
		
	ДопПараметры = Новый Структура("ПодключенноеУстройство, Заявка, УникальныйИдентификатор", ПодключенноеУстройство, Заявка, Форма.УникальныйИдентификатор);
		
	Если ПодключенноеУстройство = Неопределено Тогда
	
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоИдентификатору(
			Новый ОписаниеОповещения("НачатьПодключениеОборудованиеПоИдентификаторуЗавершение", омг_ПечатьНаправления, 
			ДопПараметры),
			Форма.УникальныйИдентификатор,
			ПодключенноеУстройство);
	Иначе
		НачатьПодключениеОборудованиеПоИдентификаторуЗавершение(Неопределено, ДопПараметры);
	КонецЕсли;

КонецПроцедуры
