#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Дозировка) Тогда 
		Значение = Параметры.Дозировка;
	КонецЕсли;
	
	Если Параметры.Свойство("ЕдиницаИзмерения") Тогда
		ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;	
	КонецЕсли;
	
	Если Параметры.Свойство("СкладСписания") Тогда
		СкладСписания = Параметры.СкладСписания;	
	КонецЕсли;
	
	Элементы.ХарактеристикаНоменклатуры.Видимость = Ложь;
	Элементы.СерияНоменклатуры.Видимость = Ложь;
	
	Если ТипЗнч(Параметры.ДействиеСтационара) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Номенклатура = Параметры.ДействиеСтационара;
		
		ЭтаФорма.Заголовок = Строка(Номенклатура);
		
		Если Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал Тогда
			Если УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ВестиУчетПоХарактеристикам")
				И Номенклатура.ВестиУчетПоХарактеристикам
			Тогда
				Элементы.ХарактеристикаНоменклатуры.Видимость = Истина;
			КонецЕсли;
			
			Если Номенклатура.ВестиУчетПоСериям Тогда
				Элементы.СерияНоменклатуры.Видимость = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.Значение.АвтоОтметкаНезаполненного = Не Параметры.РазрешитьПустоеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Истина // ИспользоватьПодключаемоеОборудование Проверка на включенную ФО "Использовать ВО"
	   И МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда // Проверка на определенность рабочего места ВО.
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);    
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	// МеханизмВнешнегоОборудования
	ПоддерживаемыеТипыВО = Новый Массив();
	ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	// Конец МеханизмВнешнегоОборудования

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ScanData" Тогда
		Если ВводДоступен() Тогда
			ТипШК = Неопределено;
			РаботаСТорговымОборудованиемКлиент.ОбработатьСобытиеСШКФормы(ЭтаФорма, Параметр, ТипШК);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:
				|""%ОписаниеОшибки%"".'" );
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	// Изменения Макеевв 13-12-2025 (
	Если омг_ОстатокНаСкладе < Значение Тогда
		ПоказатьПредупреждение(, "Недостаточно количества на складе! Необходимо еще " + (Значение - омг_ОстатокНаСкладе) + " " + Строка(ЕдиницаИзмерения));
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Значение) 
		И Не Параметры.РазрешитьПустоеЗначение
	Тогда
		Предупреждение("Значение не заполнено!", 10, "Ошибка ввода значения");
		Возврат;
	КонецЕсли;
	
	Если ХарактеристикаНоменклатуры.Пустая()
		И СерияНоменклатуры.Пустая()
	Тогда
		// Основное поведение
		Закрыть(Значение);
	Иначе
		Закрыть(Новый Структура("Значение, ХарактеристикаНоменклатуры, СерияНоменклатуры",
								 Значение, ХарактеристикаНоменклатуры, СерияНоменклатуры));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СерияНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	// Изменения Макеев 13-12-2025 (
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Номенклатура, ЕдиницаИзмерения, Склад, ЭтоПодбор", Номенклатура, ЕдиницаИзмерения, СкладСписания, Истина);
	Оповещение = Новый ОписаниеОповещения("СерияНоменклатурыКонецВыбора", ЭтотОбъект); 
	
	ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаПодбораСерийНоменклатуры", ПараметрыФормы,ЭтотОбъект,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция осуществляет обработку считывания штрих-кода номенклатуры.
//
// Параметры:
//  Номенклатура   - <СправочникСсылка.Номенклатура>
//                 - Номенклатура, штрих-код которой был отсканирован.
//
//  Единица        - <СправочникСсылка.ЕдиницыИзмерения>
//                 - Единица измерения отсканированной номенклатуры.
//
//  Количество     - <Число>
//                 - Количество отсканированной номенклатуры.
//
//  СШК            - <Строка>
//                 - Идентификатор сканера штрих-кода, с которым связано данное
//                   событие.
//
// Возвращаемое значение:
//  <Булево>       - Данная ситуация обработана.
//
&НаКлиенте
Функция СШКНоменклатура(ДанныеНоменклатуры, СШК) Экспорт
	НоменклатураШК				 = ДанныеНоменклатуры.Номенклатура;
	ХарактеристикаНоменклатурыШК = ДанныеНоменклатуры.ХарактеристикаНоменклатуры;
	СерияНоменклатурыШК			 = ДанныеНоменклатуры.СерияНоменклатуры;
	
	Если НоменклатураШК = Номенклатура Тогда
		Если ЗначениеЗаполнено(ХарактеристикаНоменклатурыШК)
			И Элементы.ХарактеристикаНоменклатуры.Видимость
		Тогда
			ХарактеристикаНоменклатуры = ХарактеристикаНоменклатурыШК;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СерияНоменклатурыШК)
			И Элементы.СерияНоменклатуры.Видимость
		Тогда
			СерияНоменклатуры = СерияНоменклатурыШК;
		КонецЕсли;
	КонецЕсли;

	Возврат Истина;
	
КонецФункции // СШКНоменклатура()

&НаКлиенте
Процедура СерияНоменклатурыКонецВыбора(Результат, ДополнительныеПараметры) Экспорт

	// Изменения Макеев 13-12-2025 (
	Если Результат <> Неопределено Тогда
		Если ТипЗнч(Результат) = Тип("СправочникСсылка.СерииНоменклатуры") Тогда
			СерияНоменклатуры = Результат;
		ИначеЕсли ТипЗнч(Результат) = Тип("Структура") Тогда
			СерияНоменклатуры = Результат.СерияНоменклатуры;			
			омг_ОстатокНаСкладе = Результат.КоличествоОстаток;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
