
// Преобразует строку версии (н-р, "1.05.0.30") в сравнимое число.
//
// Параметры:
//  СтрокаВерсии - Строка - Версия в формате "Мажор.Минор.Сборка.Ревизия"
//
// Возвращаемое значение:
//  Число - Вес версии для сравнения через > или <.
//
Функция ВесВерсии(Знач СтрокаВерсии) Экспорт
	
	Результат = 0;
	
	// Разделяем строку на части по точке
	Части = СтрРазделить(СтрокаВерсии, ".");
	
	// Множитель для первой (самой значимой) части. 
	// Каждая часть будет занимать 5 знаков: 10^15, 10^10, 10^5, 10^0
	Множитель = 1000000000000000; 
	
	Для Каждого Часть Из Части Цикл
		
		ЗначениеЧасти = 0;
		Попытка
			// Очищаем от лишних пробелов и конвертируем в число
			ЗначениеЧасти = Число(СокрЛП(Часть));
		Исключение
			// Если в версии встретятся буквы (н-р, 1.0b), 
			// можно либо вызвать ошибку, либо просто считать за 0
			ЗначениеЧасти = 0;
		КонецПопытки;
		
		Результат = Результат + (ЗначениеЧасти * Множитель);
		
		// Сдвигаем множитель на 5 разрядов вправо для следующей части
		Множитель = Множитель / 100000;
		
		// Если в строке больше 4 частей, выходим (стандарт 1С - 4 части)
		Если Множитель < 1 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗапускОбновленияРасширения() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущаяВерсия = Константы.iga_ТекущаяВерсия.Получить();
	
	НоваяВерсия = РасширенияКонфигурации.Получить(Новый Структура("Имя", "iga_ИнтеграцияСGreenAPI"))[0].Версия;
	
	Если ТекущаяВерсия = "" Тогда
		ПервоначальноеЗаполнение = Истина;
	Иначе
		ПервоначальноеЗаполнение = Ложь;
	КонецЕсли;
	
	Если ВесВерсии(НоваяВерсия) > ВесВерсии(ТекущаяВерсия) Тогда
		Если ПервоначальноеЗаполнение Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	iga_НастройкиИнстансов.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.iga_НастройкиИнстансов КАК iga_НастройкиИнстансов";
			Если Запрос.Выполнить().Пустой() Тогда
				НовыйИнстанс = Справочники.iga_НастройкиИнстансов.СоздатьЭлемент();
				НовыйИнстанс.iga_ApiToken = Константы.iga_ApiToken.Получить();
				НовыйИнстанс.iga_apiUrl = Константы.iga_apiUrl.Получить();
				НовыйИнстанс.iga_IdInstance = Константы.iga_IdInstance.Получить();
				НовыйИнстанс.iga_mediaUrl = Константы.iga_mediaUrl.Получить();
				НовыйИнстанс.iga_webhookUrl = Константы.iga_webhookUrl.Получить();
				НовыйИнстанс.iga_ПользовательВебХука = Константы.iga_ПользовательВебХука.Получить();
				НовыйИнстанс.iga_ПарольВебхука = Константы.iga_ПарольВебхука.Получить();
				НовыйИнстанс.iga_ПортВебХука = Константы.iga_ПортВебХука.Получить();
				НовыйИнстанс.Наименование = "Основной инстанс";
				НовыйИнстанс.Записать();
				
				Константы.iga_ТекущийИнстанс.Установить(НовыйИнстанс.Ссылка);
			КонецЕсли;      
		КонецЕсли;
		
		Если ВесВерсии(ТекущаяВерсия) < ВесВерсии("1.0.01.40")
			И ВесВерсии(НоваяВерсия) >= ВесВерсии("1.0.01.40")Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	iga_ИсторияСообщений.Чат КАК Чат,
			               |	МАКСИМУМ(iga_ИсторияСообщений.ДатаСообщения) КАК ДатаСообщения
			               |ИЗ
			               |	РегистрСведений.iga_ИсторияСообщений КАК iga_ИсторияСообщений
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	iga_ИсторияСообщений.Чат";
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаписьПоследнегоСообщения = РегистрыСведений.iga_ПоследниеСообщенияЧатов.СоздатьМенеджерЗаписи();
				ЗаписьПоследнегоСообщения.Чат = Выборка.Чат;
				ЗаписьПоследнегоСообщения.ДатаСообщения = Выборка.ДатаСообщения;
				ЗаписьПоследнегоСообщения.Записать();
			КонецЦикла;
		КонецЕсли;
		
		Если ВесВерсии(ТекущаяВерсия) < ВесВерсии("1.0.01.53")
			И ВесВерсии(ТекущаяВерсия) >= ВесВерсии("1.0.01.53") Тогда
			Язык = Справочники.iga_ЯзыкиЧатов.Казахский.ПолучитьОбъект();
			Язык.КодЯзыка = "kk";
			Язык.Записать();
			
			Язык = Справочники.iga_ЯзыкиЧатов.Русский.ПолучитьОбъект();
			Язык.КодЯзыка = "ru";
			Язык.Записать();
		КонецЕсли;
		Если ВесВерсии(ТекущаяВерсия) < ВесВерсии("1.0.01.65")
			И ВесВерсии(НоваяВерсия) >= ВесВерсии("1.0.01.65") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	iga_НастройкиОператоров.Оператор КАК Оператор
			               |ИЗ
			               |	РегистрСведений.iga_НастройкиОператоров КАК iga_НастройкиОператоров
			               |ГДЕ
			               |	iga_НастройкиОператоров.Подразделение = &ПустоеПодразделение";
			Запрос.УстановитьПараметр("ПустоеПодразделение", Справочники.iga_ПодразделенияОператоров.ПустаяСсылка());
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Запись = РегистрыСведений.iga_НастройкиОператоров.СоздатьМенеджерЗаписи();
				Запись.Оператор = Выборка.Оператор;
				Запись.Прочитать();;
				Если Запись.Выбран() Тогда
					Попытка
						Запись.Подразделение = Справочники.iga_ПодразделенияОператоров.КоллЦентр;
					Исключение
						КоллЦентр = Справочники.iga_ПодразделенияОператоров.СоздатьЭлемент();
						КоллЦентр.ИмяПредопределенныхДанных = "КоллЦентр";
						КоллЦентр.Наименование = "Колл-Центр";
						КоллЦентр.Записать();
						Запись.Подразделение = КоллЦентр.Ссылка;
					КонецПопытки;
					Запись.Записать();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
			
		Если ВесВерсии(ТекущаяВерсия) < ВесВерсии("1.0.01.66")
			И ВесВерсии(НоваяВерсия) >= ВесВерсии("1.0.01.66") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	iga_ПодразделенияОператоров.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.iga_ПодразделенияОператоров КАК iga_ПодразделенияОператоров
			               |ГДЕ
			               |	iga_ПодразделенияОператоров.НомерПодразделения = 0
			               |			И НЕ iga_ПодразделенияОператоров.Ссылка = &КоллЦентр
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	iga_ПодразделенияОператоров.Код";
			Запрос.УстановитьПараметр("КоллЦентр", Справочники.iga_ПодразделенияОператоров.КоллЦентр);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Нумератор = 0;
			Пока Выборка.Следующий() Цикл
				Нумератор = Нумератор + 1;
				
				СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
				СправочникОбъект.НомерПодразделения = Нумератор;
				СправочникОбъект.Записать();
			КонецЦикла;
		КонецЕсли;  
		
		Если ВесВерсии(ТекущаяВерсия) < ВесВерсии("1.0.01.83")
			И ВесВерсии(НоваяВерсия) >= ВесВерсии("1.0.01.83") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	iga_Чаты.Ссылка КАК Чат,
			               |	iga_Чаты.Клиент КАК Клиент
			               |ИЗ
			               |	Справочник.iga_Чаты КАК iga_Чаты
			               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ЧатыКлиентов КАК iga_ЧатыКлиентов
			               |		ПО iga_ЧатыКлиентов.Чат = iga_Чаты.Ссылка
			               |ГДЕ
			               |	iga_Чаты.Клиент <> &ПустойКлиент
			               |	И iga_ЧатыКлиентов.Клиент ЕСТЬ NULL";
			Запрос.УстановитьПараметр("ПустойКлиент", Справочники.Клиенты.ПустаяСсылка());
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаписьСвязиСКлиентом = РегистрыСведений.iga_ЧатыКлиентов.СоздатьМенеджерЗаписи();
				ЗаписьСвязиСКлиентом.Чат = Выборка.Чат;
				ЗаписьСвязиСКлиентом.Клиент = Выборка.Клиент;
				ЗаписьСвязиСКлиентом.Записать();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Константы.iga_ТекущаяВерсия.Установить(НоваяВерсия);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры