#Область ПрограммныйИнтерфейс

// Экспортировать шаблон в двоичные данные.
//
// Параметры:
//  Шаблон	 - СправочникСсылка.ШаблоныПечати	 - ссылка на экспортируемый элемент.
// 
// Возвращаемое значение:
//  ДвоичныеДанные - данные выгрузки.
//
Функция Экспортировать(Шаблон) Экспорт
	
	ПутьКФайлуПравил = ПолучитьИмяВременногоФайла("xml");
	ДвоичныеДанныеПравилОбмена = Справочники.ШаблоныПечати.ПолучитьМакет("ПравилаОбмена");
	ДвоичныеДанныеПравилОбмена.Записать(ПутьКФайлуПравил);
	
	ПутьКФайлуВыгрузки = ПолучитьИмяВременногоФайла("xml");
	
	УниверсальныйОбмен 							= Обработки.УниверсальныйОбменДаннымиXML.Создать();
	УниверсальныйОбмен.ИмяФайлаПравилОбмена 	= ПутьКФайлуПравил;
	УниверсальныйОбмен.ИмяФайлаОбмена 			= ПутьКФайлуВыгрузки;
	УниверсальныйОбмен.РежимОтладкиАлгоритмов 	= Истина;
	УниверсальныйОбмен.РежимОбмена 				= "Выгрузка";
	
	УниверсальныйОбмен.ЗагрузитьПравилаОбмена();	
	СтрокаПараметра = УниверсальныйОбмен.ТаблицаНастройкиПараметров.Найти("Ссылка", "Имя");
	Если СтрокаПараметра <> Неопределено Тогда
		СтрокаПараметра.Значение = Шаблон;
		СТрокаПараметра.ПередаватьПараметрПриВыгрузке = Ложь; 
	КонецЕсли;
	УниверсальныйОбмен.ВыполнитьВыгрузку();
	
	ДанныеВыгрузки 								= Новый ДвоичныеДанные(ПутьКФайлуВыгрузки);			
	
	Возврат ДанныеВыгрузки;
КонецФункции

// Импортировать шаблон из двоичных данных экспорта.
//
// Параметры:
//  Данные	 - ДвоичныеДанные	 - данные файла для загрузки.
//
Процедура Импортировать(Данные) Экспорт
	ПутьКФайлуВыгрузки 							= ПолучитьИмяВременногоФайла("xml");
	УниверсальныйОбмен 							= Обработки.УниверсальныйОбменДаннымиXML.Создать();
	УниверсальныйОбмен.ИмяФайлаОбмена 			= ПутьКФайлуВыгрузки;
	УниверсальныйОбмен.РежимОтладкиАлгоритмов 	= Истина;
	УниверсальныйОбмен.РежимОбмена 				= "Загрузка";
	
	Данные.Записать(ПутьКФайлуВыгрузки);
	УниверсальныйОбмен.ВыполнитьЗагрузку();
КонецПроцедуры

// Формироует параметры по алгоритму из реквизита ПередФормированием
//
// Параметры:
//  Шаблон		 - СправочникСсылка.ШаблоныПечати - Шаблон печати
//	ОбъектПечати - ДокументСсылка				  - Доукумент печати
// 
// Возвращаемое значение:
//  Структура - Структура параметров
//
Функция ПолучитьПараметрыПередФормированием(Шаблон, ОбъектПечати) Экспорт

	ОбщиеПеременныеАлгоритмов = Новый Структура;
	
	Дата	 = ОбщегоНазначенияКлиентСервер.СвойствоОбъекта(ОбъектПечати, "Дата", Дата(1,1,1));
	Клиент	 = ОбщегоНазначенияКлиентСервер.СвойствоОбъекта(ОбъектПечати, "Клиент", Справочники.Клиенты.ПустаяСсылка());
	Филиал	 = РаботаСДокументамиСервер.ФилиалДокумента(ОбъектПечати);
	
	Выполнить(Шаблон.ПередФормированием);	
	
	Возврат ОбщиеПеременныеАлгоритмов;
	
КонецФункции

// Возвращает стандартные алгоритмы параметров печати Word 
// 
// Возвращаемое значение:
//  Структура - Ключ - текст параметра, Значение - алгоритм параметра 
//
Функция ПолучитьСтандартныеАлгоритмыПараметров(СтандартныйПрефиксВИмени = Ложь) Экспорт

	СтруктураАлгоритмов = Новый Структура;
	Если СтандартныйПрефиксВИмени Тогда
		СтандартныйПрефикс = РаботаСШаблонамиПечатиКлиентСервер.ПрефиксСтандартныхАлгоритмов();	
	КонецЕсли;
	
	ТабДокОбразцы = Справочники.ШаблоныПечати.ПолучитьМакет("ОбразцыПараметровШаблонаПечати");
	Для Сч = 1 По ТабДокОбразцы.ВысотаТаблицы Цикл
		
		ИмяПараметра = ТабДокОбразцы.Область(Сч, 1, Сч, 1).Текст;
		Если ПустаяСтрока(ИмяПараметра) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтандартныйПрефиксВИмени Тогда
			ИмяПараметра = СтандартныйПрефикс + ИмяПараметра;	
		КонецЕсли;
		
		СтруктураАлгоритмов.Вставить(ИмяПараметра, ТабДокОбразцы.Область(Сч, 2).Текст); 
		
	КонецЦикла;
	
	Возврат СтруктураАлгоритмов;
	
КонецФункции

// Возвращает стандартный алгоритм параметра Word
//
// Параметры:
//  Параметр - Строка	 - Имя параметра
// 
// Возвращаемое значение:
//  Строка - Стандартный алгоритм параметра
//
Функция ПолучитьСтандартныйАлгоритмПараметра(Параметр) Экспорт

	ТабДокОбразцы = Справочники.ШаблоныПечати.ПолучитьМакет("ОбразцыПараметровШаблонаПечати");
	Для Сч = 1 По ТабДокОбразцы.ВысотаТаблицы Цикл
		
		ИмяПараметра = ТабДокОбразцы.Область(Сч, 1, Сч, 1).Текст;
		Если ЗначениеЗаполнено(ИмяПараметра) И ИмяПараметра = Параметр Тогда
			Возврат ТабДокОбразцы.Область(Сч, 2).Текст;
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

// Возвращает параметр Word по его стандартному алгоритму
//
// Параметры:
//  Параметр - Строка	 - Имя параметра
// 
// Возвращаемое значение:
//  Строка - Стандартный алгоритм параметра
//
Функция ПолучитьПараметрПоСтандартномуАлгоритму(Алгоритм) Экспорт
	
	СокрАлгоритм = СтрЗаменить(СтрЗаменить(СокрЛП(Алгоритм), Символы.ПС, ""), Символы.ВК, "");
	
	ТабДокОбразцы = Справочники.ШаблоныПечати.ПолучитьМакет("ОбразцыПараметровШаблонаПечати");
	Для Сч = 1 По ТабДокОбразцы.ВысотаТаблицы Цикл
		
		ИмяПараметра = ТабДокОбразцы.Область(Сч, 1, Сч, 1).Текст;
		Если ЗначениеЗаполнено(ИмяПараметра) И СокрАлгоритм = СтрЗаменить(СтрЗаменить(СокрЛП(ТабДокОбразцы.Область(Сч, 2).Текст), Символы.ПС, ""), Символы.ВК, "") Тогда
			Возврат ИмяПараметра;
		Иначе
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат "";
	
КонецФункции

#КонецОбласти