#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	////////////////////////////////////////////////////
	// ОМГ  
	
	
	Если Параметры.Свойство("Владелец") Тогда 
		Объект.Владелец = Параметры.Владелец;
	КонецЕсли; 
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("СтавкаНДС", Тип("ПолеФормы"),Элементы.ДанныеДоговора);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.омг_ВидДоговораНДС";   
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("омг_Менеджер", Тип("ПолеФормы"),Элементы.ДанныеДоговора);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.омг_Менеджер";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	
	//Если РольДоступна("омг_ДобавлениеРедактированиеДоговоров") Тогда
	//	 НовыйЭлемент.ТолькоПросмотр = Ложь
	//КонецЕсли;
	
	Если РольДоступна("омг_ДобавлениеРедактированиеДоговоров") или РольДоступна("ПолныеПрава") Тогда
		
		НовыйЭлемент.ТолькоПросмотр = Ложь
		
	иначе
		
		Если Объект.Ссылка.Пустая() Тогда
			Отказ = Истина
		иначе
			ЭтаФорма.ТолькоПросмотр = Истина
		КонецЕсли;          
		
	КонецЕсли;

	// ОМГ
    ////////////////////////////////////////////////////
	
	Если Объект.Ссылка.Пустая()
		И Не ЗначениеЗаполнено(Объект.Организация)
	Тогда
		Объект.Организация = Справочники.Организации.ЕдинственнаяОрганизация();
		Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти