
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогФыбораФайла.Фильтр = "(*.xml)|*.xml"; 
	
	ДиалогФыбораФайла.Заголовок = "Выберите файл";
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		
		ДанныеКарты = ЭкспортироватьСервер(ПараметрКоманды);
		ДанныеКарты.Записать(ДиалогФыбораФайла.ПолноеИмяФайла);
		
	КонецЕсли;
 	
КонецПроцедуры

&НаСервере
Функция ЭкспортироватьСервер(ПараметрКоманды)
	
	Возврат Справочники.стомВидыЗубныхКарт.Экспортировать(ПараметрКоманды);
		
КонецФункции