
#Область ОбщаяОбработкаКоманд

// Общая функция, которая по имени команды определяет что делать, настройкиDICOM передаются в команду
//
// Параметры:
//  ИмяКоманды			 - Строка	 - Значение, которое определяет какая функция будет вызвана
//  ВидЗапроса			 - Строка	 - Значение вида запроса, такие как GET, PUT, DELETE и т.д.
//  НастройкиСистемыDICOM - Список значений	 -  Список, сформированный на основе регистра сведений DICOMНастройкаСистемы,
//		В т.ч. и расшифровка AETL - Его порт и хост, в формате PACS - AETLМенеджера, AETLМенеджераХост, AETLМенеджераПорт
//  КлассификацияСервера - Строка	 - Значение "AETLЛистов" или "AETLМенеджера", используется для спецификации названия расшифровки AETL
//	ПараметрыКоманды	 - Структура - Структура заранее известных параметров, которые нужны для работы команды (смотреть по команде)
// 
// Возвращаемое значение:
//   HTTPОтвет, Неопределено - Ответ, сформированный на основе ИмяКоманды или Неопределено, если что-то пошло не так
//
Функция ПолучитьОтветПоЗапросуDICOM(ИмяКоманды, ВидЗапроса = "GET", НастройкиСистемыDICOM, КлассификацияСервера = "AETLЛистов", ПараметрыКоманды, Каталог = Неопределено) Экспорт
		
	// Получение соединения едино для всех
	AETLХоста = НастройкиСистемыDICOM.НайтиПоЗначению((КлассификацияСервера + "Хост")).Представление;
	AETLПорта = НастройкиСистемыDICOM.НайтиПоЗначению((КлассификацияСервера + "Порт")).Представление;
	
	Соединение = ПолучитьСоединениеDICOM(AETLХоста,AETLПорта); 
	Если Соединение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;	

	Запрос = ПередатьСоответствующемуМодулюКомандуЗапроса(НастройкиСистемыDICOM.НайтиПоЗначению("ИмяСистемыDICOM").Представление,
															ИмяКоманды, НастройкиСистемыDICOM, ПараметрыКоманды);
	Если Запрос = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	РезультатОтветHTTP = ПолучитьHTTPОтветDICOM(Соединение, Запрос, ВидЗапроса,, Каталог);

	Возврат РезультатОтветHTTP;
КонецФункции

#Область РаспределениеМеждуРазнымиСистемами

Функция ПередатьСоответствующемуМодулюКомандуЗапроса(ИмяСистемыDICOM, ИмяКоманды, НастройкиDICOM, ПараметрыКоманды)

	Если ИмяСистемыDICOM = "DCM4CHEE" Тогда	
		Возврат DCM4CHEEКлиент.ОбработатьКомандуПоИмени(ИмяКоманды, НастройкиDICOM, ПараметрыКоманды);		
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции
	
Функция ПолучитьКоррекныйПоОСфайл(ИмяФайла) Экспорт

	// Получаем корректно расширение по ОС
	Если ОбщегоНазначения.ЭтоWindowsСервер() Тогда
		РасширениеИсполняемогоФайла = "bat";
	ИначеЕсли ОбщегоНазначения.ЭтоLinuxСервер() Тогда
		РасширениеИсполняемогоФайла = "sh";
	Иначе
		// Пока нет других вариантов, используем bat расширение. 
		РасширениеИсполняемогоФайла = "bat";
	КонецЕсли;
	
    Возврат СтрШаблон("%1.%2",ИмяФайла,РасширениеИсполняемогоФайла);
КонецФункции

#КонецОбласти

#КонецОбласти


#Область СериализацияДанных

// Заполняем постоянные данные MWL
// Формируем массив структур для заполнения таблицы статических данных для формирования 
Функция СформироватьМассивСтатичнойСериализации(КлиентСсылка, СотрудникСсылка) Экспорт
	
	ДанныеDICOM = Новый Массив;
	
	// Сразу заполняем ID пациента и в уникальных и в текущих данных
	ВычПромежДанныеWL = Строка(КлиентСсылка.УникальныйИдентификатор());
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","а00100020", "LO","PatientID", ВычПромежДанныеWL));

	// Patient Name, имя пациента имеет три значения 
	ВычПромежДанныеWL = СтрШаблон("%1 %2 %3",DICOMОбщий.ПрямаяТранслитерация(ДопСерверныеФункции.ПолучитьРеквизит(КлиентСсылка,"Фамилия")),
						DICOMОбщий.ПрямаяТранслитерация(ДопСерверныеФункции.ПолучитьРеквизит(КлиентСсылка,"Имя")),
						DICOMОбщий.ПрямаяТранслитерация(ДопСерверныеФункции.ПолучитьРеквизит(КлиентСсылка,"Отчество")));	
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","а00100010", "PN","PatientName", ВычПромежДанныеWL));	
			
	// 	Patient's Birth Date, Дата рождения пациента 
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","а00100030", "DA","PatientBirthDate", Формат(ДопСерверныеФункции.ПолучитьРеквизит(КлиентСсылка,"ДатаРождения"), "ДФ=yyyyMMdd")));
		     
	// 	Patient's Sex, Пол пациента, может быть неизвестным
	ВычПромежДанныеWL = ДопСерверныеФункции.ПолучитьРеквизит(КлиентСсылка,"Пол");
	Если ВычПромежДанныеWL = ПредопределенноеЗначение("Перечисление.ПолФизическихЛиц.Женский") Тогда
		ВычПромежДанныеWL = "F";
	ИначеЕсли ВычПромежДанныеWL = ПредопределенноеЗначение("Перечисление.ПолФизическихЛиц.Мужской") Тогда
		ВычПромежДанныеWL = "M";
	Иначе
		ВычПромежДанныеWL = "Undefine";
	КонецЕсли;	
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","а00100040", "CS","PatientSex", ВычПромежДанныеWL));	
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","а00100021", "LO","IssuerOfPatientID", "1C"));
	
	// Данные по сотрудникам
	// Requesting Physician и Scheduled Performing Physicians Name 
	// Врач, назначенный на исплнение заявки  и Врач, назначенный на исплнение заявки
	ВычПромежДанныеWL = DICOMОбщий.ПрямаяТранслитерация(ДопСерверныеФункции.ПолучитьРеквизит(СотрудникСсылка,"Наименование"));
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","б00321032", "PN","RequestingPhysician", ВычПромежДанныеWL));
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения,ТегРодитель","б00400006", "PN","ScheduledPerformingPhysiciansName", ВычПромежДанныеWL,"р00400100"));

	
	// Заносим в таблицу неизменные статичные данные
	// ScheduledProcedureStepID формируется на стороне dcm4chee, но указывать придётся, поэтому при получении обратно ответа необходимо запоминать его значение
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения,ТегРодитель","в00400009", "SH","ScheduledProcedureStepID", "0","р00400100"));
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","в00401003", "SH","RequestedProcedurePriority", "ROUTINE"));
	
	// Input Readiness State. Введённое состояние готовности. Обычно должно быть READY
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","н00404041","CS","InputReadinessState","READY"));	
	
	// (0074,1000) - дефолтное значение WL, без него будут ошибки отказа
    ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения,ТегРодитель","н00400020","CS","ProcedureStepState", "SCHEDULED","р00400100"));	     
	
	//(0074,1200)  Scheduled Procedure Step Priority. Введённое состояние приоритета. Может быть LOW, MEDIUM, HIGH
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","н00741200", "CS","RequestedProcedurePriority", "MEDIUM"));
	//(0074,1204) Procedure Step Label. Обозначение процедуры, используется для понимания врачей. К примеру, "CT Scan - Chest" или "Blood Culture Analysis - Urgent"
	// В базе такая инфа не хранится, подумать над её значимостью. Для ворклистов она необходима
	ДанныеDICOM.Добавить(Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","н00741204","LO","ProcedureStepLabel","No info"));	
	
	//Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеDICOM);  
    Возврат ДанныеDICOM;

КонецФункции

// ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеDICOM)
Функция СформироватьМассивДинамическойСериализации(Знач ТаблицаСтатичных, СсылкаНоменклатура, СсылкаОборудование) Экспорт
	
	Возврат DICOMОбщий.СформироватьМассивСериализации(ТаблицаСтатичных,СсылкаНоменклатура, СсылкаОборудование, ТекущаяДата());	

КонецФункции

#КонецОбласти

#Область ФормированиеЗапроса

Функция ПолучитьСоединениеDICOM(НестандартныйХост = Неопределено,НестандартныйПорт = Неопределено, Таймаут = 5) Экспорт		
	
	Если ТипЗнч(НестандартныйПорт) = Тип("Строка")
		И Не ПустаяСтрока(НестандартныйПорт)
	Тогда 
		Порт = Число(НестандартныйПорт);	
	Иначе
		Порт = ?(НестандартныйПорт = Неопределено,8080,НестандартныйПорт);
	КонецЕсли;
	
	Если НестандартныйХост = Неопределено
		Или ПустаяСтрока(НестандартныйХост)
	Тогда 
		Хост = "localhost";	
	Иначе
		Хост = НестандартныйХост;
	КонецЕсли;
	
	Попытка
		Возврат Новый HTTPСоединение(Хост,Порт,,,,Таймаут);				
	Исключение
		СообщениеОбОшибке = СтрШаблон(НСтр("ru='Не удалось установить соединение. Причина: %1'"), ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(СообщениеОбОшибке);
	КонецПопытки;
	
КонецФункции

// Функция возвращающая соответствующее значение для атрибута в запросе 
//
// Параметры:
//  ФорматРендера  - Строка - Строка-значение желаемого расширения файла
//                 
// Возвращаемое значение:
//   Строка   - Строка, подходящая для вставки в атрибут "accept="
//
Функция ФорматРендераДляЗапроса(ФорматРасширения) Экспорт
	
	СоответствиеРасширений = Новый Соответствие;
	
	// Рендеры
	СоответствиеРасширений.Вставить("jpeg","multipart/related;type=image/jpeg");
	СоответствиеРасширений.Вставить("jpg","multipart/related;type=image/jpeg");
	СоответствиеРасширений.Вставить("png","multipart/related;type=image/png");
	СоответствиеРасширений.Вставить("gif","multipart/related;type=image/gif");
	СоответствиеРасширений.Вставить("html","multipart/related;type=text/html");
	СоответствиеРасширений.Вставить("xml","multipart/related;type=text/xml");
	СоответствиеРасширений.Вставить("txt","multipart/related;type=text/plain");
	СоответствиеРасширений.Вставить("mpeg","multipart/related;type=video/mpeg");
	СоответствиеРасширений.Вставить("mp4","multipart/related;type=video/mp4");
	СоответствиеРасширений.Вставить("pdf","multipart/related;type=application/pdf");
	
	//Исследования
	СоответствиеРасширений.Вставить("dcm","multipart/related;type=application/dicom");
	СоответствиеРасширений.Вставить("bin","multipart/related;type=application/octet-stream");
	СоответствиеРасширений.Вставить("zip","application/zip");
	
    ФорматРендераДляЗапроса = СоответствиеРасширений.Получить(НРег(ФорматРасширения));
	Возврат ?(ФорматРендераДляЗапроса = Неопределено,ФорматРасширения,ФорматРендераДляЗапроса);
	
	#Область ВозможныеФорматы
	//retrive study
	// Может иметь несколько разных форм, опробуем каждую и сделаем вывод
	// Структура заголовков меняется в зависимости от требования в запросу
	
	//Задаваемые типы получения данных
	//multipart/related;type=application/dicom
	//multipart/related;type=application/octet-stream
	//multipart/related;type=application/pdf
	//multipart/related;type=image/jpeg
	//multipart/related;type=image/jp2
	//multipart/related;type=image/jpx
	//multipart/related;type=image/dicom-rle
	//multipart/related;type=image/jis
	//multipart/related;type=text/xml
	//multipart/related;type=video/mpeg
	//multipart/related;type=video/mp4
	//application/zip
	
	//Отрендеренные изображения (если несколько, то мультипарт, иначе - единичное) 
	// ошибка 406 - это не ошибка - файл рендера просто нельзя скачать такого формата
	// (т.е. файл является другого формата, а не выбранного). Если при этом мы передаём туда ссылку, то значит
	//
	//multipart/related;type=application/pdf
	//multipart/related;type=image/jpeg
	//multipart/related;type=image/png
	//multipart/related;type=image/gif
	//multipart/related;type=text/html
	//multipart/related;type=text/plain
	//multipart/related;type=video/mpeg
	//multipart/related;type=video/mp4
	//application/pdf
	//image/png
	//image/jpeg
	//image/gif
	//text/html
	//text/plain
	//video/mpeg
	//video/mp4 
	
	#КонецОбласти
	
КонецФункции
	
#КонецОбласти

#Область ОбработкаОтветаЗапроса

// Функция - Получить HTTPОтвет DCM4CHEE, если соединение не было получено выводится ошибка
//
// Параметры:
//  Соединение			 - HTTPСоединение	 -  Готовое соединение по которому отправляет запрос
//  Запрос				 - HTTPЗапрос	 -   Готовый HTTP запрос который должен быть отправлен
//  ВидОтправкиЗапроса	 - Строка	 - Вид отправки запроса, ЗАГЛАВНЫМИ БУКВАМИ. К примеру, GET для получения данных, смотреть документацию API
//  СообщатьОбОшибке	 - Булево	 - Должно ли выводится предупреждение пользователю
//  ДирективаСохранения	 - Строка	 - Имя Выходного Файла (полное), куда идёт запись. Файл должен быть указан с расширением!
//  
// Возвращаемое значение: HTTPОтвет в случае успеха, Неопределено в случае ошибки. ВАЖНО проверить сначала на Неопределено
//
Функция ПолучитьHTTPОтветDICOM(Соединение, Запрос, ВидОтправкиЗапроса = "GET", СообщатьОбОшибке = Истина, ДирективаСохранения = Неопределено) Экспорт
	
	// При попытке получить ответHTTP при лежачем сервере или отсутствия интернета будет выдано исключение
	Попытка
		// Есть разные виды запросов: get, put, post, delete и т.д.
		Если (ВидОтправкиЗапроса = "GET") Тогда
			
			Если ДирективаСохранения <> Неопределено Тогда
				Ответ = Соединение.Получить(Запрос,ДирективаСохранения);
			Иначе
				Ответ = Соединение.Получить(Запрос);
			КонецЕсли;
			
		ИначеЕсли (ВидОтправкиЗапроса = "POST") Тогда
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
			
		ИначеЕсли (ВидОтправкиЗапроса = "PUT") Тогда
			Ответ = Соединение.Записать(Запрос);
			
		ИначеЕсли (ВидОтправкиЗапроса = "DELETE") Тогда
			Ответ = Соединение.Удалить(Запрос);
			
		ИначеЕсли (ВидОтправкиЗапроса = "PATCH") Тогда
			Ответ = Соединение.Изменить(Запрос);	
		КонецЕсли;	
	Исключение
		Если СообщатьОбОшибке Тогда
			СообщениеОбОшибке = СтрШаблон(НСтр("ru='Не удалось установить соединение. Причина: %1'"), ОписаниеОшибки());
			ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(СообщениеОбОшибке);
		КонецЕсли;
		
		Ответ = Неопределено;	
	КонецПопытки;
	
	Возврат Ответ;			
КонецФункции

// Функция - КодВозвратаУспех, определяет попадает ли код ответаHTTP в диапазон правильных
//
// Параметры:
//  КодСостояния - HTTPОтвет.КодСостояния - Код состояния ответа на  запрос
// 
// Возвращаемое значение: Код в границе с 200 до 299 является выполнением запроса без ошибки 
//
Функция КодВозвратаУспех(КодСостояния,КонкретныйКод = Неопределено) Экспорт
	
	Если КонкретныйКод = Неопределено Тогда		
		Возврат (КодСостояния >= 200 И КодСостояния <=299);	
	Иначе			
		Возврат КодСостояния = КонкретныйКод;				
	КонецЕсли;
	
КонецФункции

// Возвращает значение, полученное из тела http-ответа, представленного в виде JSON-текста.
//
// Параметры:
//  Ответ - HTTPОтвет - ответ сервера, из которого нужно получить возвращаемое значение.
//
// Возвращаемое значение:
//  Произвольный - значение тела ответа после десериализации.
Функция ПрочитатьJSONОбъектаHTTP(ОбъектHTTP, ПрочитатьВСоответствие = Ложь) Экспорт
	
	ТекстJSON = ОбъектHTTP.ПолучитьТелоКакСтроку();
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	
	Попытка
		Возврат ПрочитатьJSON(Чтение, ПрочитатьВСоответствие);
	Исключение
		// Ошибка чтения JSON.
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

// Функция получения задаваемых значений раздилителей в искомом соответствии заголовков из HTTPОтвета
//
// Параметры:
//  ЗаголовкиHTTPОтвета  - Соответствие - Соответствие из заголовков HTTPОтвета
//  СтрокаИскомыхТипов  - Строка - Строка всех искомых тегов, перечисленных через запятую без лишних пробелов. Прим: "boundary,type"
//  КлючСоответствияПоиска  - Строка - Значение ключа соответствия, в чьих данных будет проводится поиск  
//  ПроводитьАтомарно  - Булево - Возвращать данные только если все заданные типы были найдены 
// Возвращаемое значение:
//   Структура   - с искомыми свойствами, либо Неопределено
//
Функция ПолучитьТипИРазделительОтвета(ЗаголовкиHTTPОтвета, СтрокаИскомыхТипов, КлючСоответствияПоиска = "Content-Type", ПроводитьАтомарно = Истина) Экспорт
	
	//multipart/related;start="<a718a98b-98a6-4838-bcf1-56bf6df49cb1@resteasy-multipart>";transfer-syntax=1.2.840.10008.1.2.1;type="application/dicom"; boundary=05243897-df37-4014-88bd-81f6b133dc30
	ТипСодержимого = ЗаголовкиHTTPОтвета.Получить(КлючСоответствияПоиска);
	
	Свойства = СтрРазделить(ТипСодержимого, ";", Ложь);
	ИскомыеЗначения = СтрРазделить(СтрокаИскомыхТипов,",",Ложь);
	
	СтруктураРазделителей = Новый Структура();
	
	Для Каждого Свойство Из Свойства Цикл
		
		Части = СтрРазделить(Свойство, "=", Ложь);		
		ИмяСвойства = СокрЛП(Части[0]);
		Если ИскомыеЗначения.Найти(ИмяСвойства) = Неопределено Тогда			
			Продолжить;	
		КонецЕсли; 
		
		ЗначениеТега = СтрЗаменить(СокрЛП(Части[1]),"""","");
		СтруктураРазделителей.Вставить(ИмяСвойства,ЗначениеТега);
		
	КонецЦикла;
	
	Если ПроводитьАтомарно И 
		СтруктураРазделителей.Количество() <>  ИскомыеЗначения.Количество()
		Тогда
	
		Возврат Неопределено;
	ИначеЕсли СтруктураРазделителей.Количество() = 0 Тогда
		
		Возврат Неопределено;	
	Иначе
	   	Возврат СтруктураРазделителей;
	КонецЕсли;
	
КонецФункции

#КонецОбласти  

#Область РаботаСФайлами

// Получить все заданные заранее расширения и какое для них должно быть представление.
// Если нет представления - значит файл невозможно предпоказать
//
// Возвращаемое значение:
//   Соответствие   - заполненное соответствие разных расширений для работы
// 
// рендеры	
//multipart/related;type=application/pdf
//multipart/related;type=image/jpeg
//multipart/related;type=image/png
//multipart/related;type=image/gif
//multipart/related;type=text/html
//multipart/related;type=text/plain
//multipart/related;type=video/mpeg
//multipart/related;type=video/mp4
//application/pdf
//image/png
//image/jpeg
//image/gif
//text/html
//text/plain
//video/mpeg
//video/mp4
//
//Задаваемые типы получения данных
//multipart/related;type=application/dicom
//multipart/related;type=application/octet-stream
//multipart/related;type=application/pdf
//multipart/related;type=image/jpeg
//multipart/related;type=image/jp2
//multipart/related;type=image/jpx
//multipart/related;type=image/dicom-rle
//multipart/related;type=image/jis
//multipart/related;type=text/xml
//multipart/related;type=video/mpeg
//multipart/related;type=video/mp4
//application/zip
Функция ПолучитьСоответствиеРасширения() Экспорт
	
	Расширения = Новый Соответствие;
	
	// Изображения
	Расширения.Вставить("jpeg", "Картинка");  
	Расширения.Вставить("jpg", "Картинка");
	Расширения.Вставить("png", "Картинка");
	Расширения.Вставить("gif", "Картинка");
	Расширения.Вставить("jp2", "Картинка");
	Расширения.Вставить("jpx", "Картинка");
	Расширения.Вставить("jis", "Картинка");
	Расширения.Вставить("rle", "Картинка");

	// Текст
	Расширения.Вставить("txt", "Текст");
	Расширения.Вставить("xml", "Текст");
	
	//HTML
	//Расширения.Вставить(".html", "HTML");
	
	//PDF
	Расширения.Вставить("pdf", "PDF");

	Возврат Расширения;

КонецФункции 

// Функция - Сформировать адрес нового файла. Получаем после расшифровки MIME файла или одно файла
//ДЛЯ РАЗРАБОТКИ - изменить на уникальное расположение? Или изменять это в Директиве?
//
// Параметры:
//  ТипДанных	 - Строка	 - Строка-обозначение типа данных. Находится в Content-Type, либо изначально задавалась пользователем
//  Директива	 - Строка	 - Строка-директива папки, где будут храниться файлы
//  Количество	 - Число	 - ПорядковоеЧислоФайла
// 
// Возвращаемое значение:
// Строка  -  Адрес расположения файла
//
Функция СформироватьПолноеИмяФайла(ТипДанных, Директива, Количество)

	СтрокаРасположенияФайла = СтрШаблон("%1_%2",Директива,Строка(Количество));
	СтрокаРасшифровкиТипа = СтрРазделить(ТипДанных,"/")[1];
	
	//задаём расширения для некоторых расшифровок, остальные варианты имеют готовое правильное расширение
	Если СтрокаРасшифровкиТипа = "dicom" Тогда
		СтрокаРасшифровкиТипа = "dcm";	
	ИначеЕсли СтрокаРасшифровкиТипа = "dicom-rle" Тогда
		//СтрокаРасшифровкиТипа = "drle";
		СтрокаРасшифровкиТипа = "rle";
	ИначеЕсли СтрокаРасшифровкиТипа = "octet-stream" Тогда
		СтрокаРасшифровкиТипа = "bin";
	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаРасположенияФайла,СтрокаРасшифровкиТипа,".");	
	
	Возврат СтрокаРасположенияФайла;
	
КонецФункции

// Читаем сообщение MIME и записываем в файл (ТОЛЬКО для файлов .dcm) Экспорт
Функция ПрочитатьСообщениеMIMEФайлDCM(Разделитель,ТипДанных,СтрокаАдресаФайла,ТелоДвоичныеДанные) Экспорт
	
	МассивИменВременныхФайлов = Новый Массив;
	
	// Создаём массив возможных маркеров-буферов
	Маркеры = Новый Массив();
	Маркеры.Добавить(ПолучитьБуферДвоичныхДанныхИзСтроки("--" + Разделитель));
	Маркеры.Добавить(ПолучитьБуферДвоичныхДанныхИзСтроки("--" + Разделитель + Символы.ПС));	
	Маркеры.Добавить(ПолучитьБуферДвоичныхДанныхИзСтроки("--" + Разделитель + Символы.ВК));
	Маркеры.Добавить(ПолучитьБуферДвоичныхДанныхИзСтроки("--" + Разделитель + Символы.ВК + Символы.ПС));
	Маркеры.Добавить(ПолучитьБуферДвоичныхДанныхИзСтроки("--" + Разделитель + "--"));
		
	// Текст ответа в двоичных данных, от 1 до n блоков одного заранее известного типа
	// Перейдём сразу к началу первой части. 
	ЧтениеДанныхОтвета = Новый ЧтениеДанных(ТелоДвоичныеДанные);       
	ЧтениеДанныхОтвета.ПропуститьДо(Маркеры);

	БуферДвоичныхДанных = ЧтениеДанныхОтвета.ПрочитатьВБуферДвоичныхДанных();
	РазделенныеБуферыДанных = БуферДвоичныхДанных.Разделить(Маркеры);
		
	СчетчикФайлов = 1;
	Для каждого БлокДанныхБуфер Из РазделенныеБуферыДанных Цикл
		
		Если БлокДанныхБуфер.Размер = 0 Тогда		
			Продолжить;	
		КонецЕсли;
		
		ИмяФайла = СформироватьПолноеИмяФайла(ТипДанных,СтрокаАдресаФайла,СчетчикФайлов);
		МассивИменВременныхФайлов.Добавить(ИмяФайла);
		
		// Переведём в UTF-16, дабы 00 не стало 20. Кто удалит - самолично найду дикого опоссума и кину виновнику в лицо 
		ПотокБлокаДанных = Новый ПотокВПамяти(БлокДанныхБуфер);
		ЧтениеБлокаДанных = Новый ЧтениеДанных(ПотокБлокаДанных,"UTF-16",,,"");	
		ДвоичныеДанныеНаЗапись = ЧтениеБлокаДанных.Прочитать().ПолучитьДвоичныеДанные();	
		ЧетноеКоличествоБайтов = (ДвоичныеДанныеНаЗапись.Размер()%2 = 0);
		МассивРазделенныхДвоичныхДанных = РазделитьДвоичныеДанные(ДвоичныеДанныеНаЗапись,?(ЧетноеКоличествоБайтов,2,1));
		
		// Убираем заведомо известные данные. В dcm эти байты формируют добавочный заголовок к файлу. Работает только
		// с файлами dcm, они всегда одинаково формируются. Сильно оптимизирует время выполнения кода.
		ИндексМассива = 0;
		Для ИндексМассива = 1 По ?(ЧетноеКоличествоБайтов,70,140) Цикл
			МассивРазделенныхДвоичныхДанных.Удалить(0);	
		КонецЦикла; 
		
		// Убираем заголовок неопределённой длинны (он оканчивается 0D0A, после которого идут 0000)
		Для ИндексМассива = 0 По МассивРазделенныхДвоичныхДанных.Количество() - 1 Цикл
			Если МассивРазделенныхДвоичныхДанных[0] = Base64Значение(?(ЧетноеКоличествоБайтов,"AAA=","AA==")) Тогда			
				// Мы дошли до конца заголовка - подготовим данные на следующую проверку и уходим
				ИндексМассива = МассивРазделенныхДвоичныхДанных.Количество() - 1;
				Прервать;	
			Иначе                               
				МассивРазделенныхДвоичныхДанных.Удалить(0);
			КонецЕсли;	
		КонецЦикла;
				                     
		// Убираем приписываемый в процессе считывания 0D0A в самом конце, если он был добавлен
		Если ЧетноеКоличествоБайтов Тогда	
			Если МассивРазделенныхДвоичныхДанных[ИндексМассива] = Base64Значение("DQo=") Тогда		
				МассивРазделенныхДвоичныхДанных.Удалить(ИндексМассива); 
			КонецЕсли;		
		Иначе			
			Если МассивРазделенныхДвоичныхДанных[ИндексМассива] = Base64Значение("Cg==") Тогда		
				МассивРазделенныхДвоичныхДанных.Удалить(ИндексМассива); 
				ИндексМассива = МассивРазделенныхДвоичныхДанных.Количество() - 1;
			КонецЕсли;
			Если МассивРазделенныхДвоичныхДанных[ИндексМассива] = Base64Значение("DQ==") Тогда		
				МассивРазделенныхДвоичныхДанных.Удалить(ИндексМассива); 
			КонецЕсли;
		КонецЕсли;
				
		ДвоичныеДанныеНаЗапись = СоединитьДвоичныеДанные(МассивРазделенныхДвоичныхДанных);	
		ДвоичныеДанныеНаЗапись.Записать(ИмяФайла);
	
		ЧтениеБлокаДанных.Закрыть();
		ПотокБлокаДанных.Закрыть();
		СчетчикФайлов = СчетчикФайлов + 1;		
	КонецЦикла;
	
	ЧтениеДанныхОтвета.Закрыть();
	Возврат МассивИменВременныхФайлов;
	
КонецФункции

// Читаем сообщение MIME и записываем в файл (для любых вариантов рендеров)
Функция ПрочитатьСообщениеMIMEУниверсальное(Разделитель,ТипДанных,СтрокаАдресаФайла,ТелоПотоковыеДанные) Экспорт
	
	МассивИменВременныхФайлов = Новый Массив;
	
	// Создаём массив возможных маркеров разделения блоков
	Маркеры = Новый Массив();
	Маркеры.Добавить("--" + Разделитель);
	Маркеры.Добавить("--" + Разделитель + Символы.ПС);
	Маркеры.Добавить("--" + Разделитель + Символы.ВК);
	Маркеры.Добавить("--" + Разделитель + Символы.ВК + Символы.ПС);
	Маркеры.Добавить("--" + Разделитель + "--");	
	
	// Текст ответа в двоичных данных, от 1 до n блоков одного заранее известного типа
	// Перейдём сразу к началу первой части. 
	ЧтениеДанныхОтвета = Новый ЧтениеДанных(ТелоПотоковыеДанные,,,"","");       
	ЧтениеДанныхОтвета.ПропуститьДо(Маркеры);
	
	СчетчикФайлов = 1;
	// Прочитать в цикле все части тела сообщения.	
	Пока Истина Цикл
				
		БлокДанных = ЧтениеДанныхОтвета.ПрочитатьДо(Маркеры);
		Если Не БлокДанных.МаркерНайден Тогда
			// Неправильно сформированное сообщение или конец
			Прервать;
		КонецЕсли;
		
		ИмяФайла = СформироватьПолноеИмяФайла(ТипДанных,СтрокаАдресаФайла,СчетчикФайлов);
		МассивИменВременныхФайлов.Добавить(ИмяФайла);
		ЧтениеБлокаДанных = Новый ЧтениеДанных(БлокДанных.ОткрытьПотокДляЧтения(),,,"","");		
		
		// Убираем заголовок
		Пока Истина Цикл
			Строка = ЧтениеБлокаДанных.ПрочитатьСтроку();			
			Если Строка = "" Тогда	
				Прервать;
			КонецЕсли;			
		КонецЦикла;		                             

		// Переведём в UTF-16, дабы 00 не стало 20. Кто удалит - самолично найду дикого опоссума и кину виновнику в лицо 
		ЧтениеОбрезанногоБлока = Новый ЧтениеДанных(ЧтениеБлокаДанных.Прочитать().ОткрытьПотокДляЧтения(),"UTF-16",,"","");
		ДвоичныеДанныеНаЗапись = ЧтениеОбрезанногоБлока.Прочитать().ПолучитьДвоичныеДанные();		
		
		МассивРазделённый = РазделитьДвоичныеДанные(ДвоичныеДанныеНаЗапись,2);
		МассивРазделённый.Удалить(МассивРазделённый.Количество() - 1);
		ДвоичныеДанныеНаЗапись = СоединитьДвоичныеДанные(МассивРазделённый);	
		ДвоичныеДанныеНаЗапись.Записать(ИмяФайла);
		
		ЧтениеБлокаДанных.Закрыть();
		СчетчикФайлов = СчетчикФайлов + 1;		
	КонецЦикла;
	
	ЧтениеДанныхОтвета.Закрыть(); 
	Возврат МассивИменВременныхФайлов;
	
КонецФункции

#КонецОбласти