
Процедура ПередЗаписью(Отказ, Замещение)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовыеЗаписи = ЭтотОбъект.Выгрузить();
	ЭтотОбъект.Прочитать();
	КоличествоСтарые = ЭтотОбъект.Количество();
	ЭтотОбъект.Загрузить(НовыеЗаписи);
	
	Если КоличествоСтарые > НовыеЗаписи.Количество() Тогда  // Если удаляем, то вычистим и сопутствующие значения
		НачатьТранзакцию();
		РегистрыСведений.СеансовыеДанныеGoogle.ПометитьИлиУдалитьСопутствующиеЗаписи(ЭтотОбъект.Отбор.Пользователь.Значение);
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры
