
&НаСервере
Процедура ОткрытьКалендарьНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКалендарь(Команда) 
	
	ДанныеАРМ = Новый Структура;
	ДанныеАРМ.Вставить("ФормаВызова", "Обработка.омг_АРМ_Врача.Форма.Форма_85");
	
	ПараметрыФормы = Новый Структура("Данные");
	ПараметрыФормы.Данные = ДанныеАРМ;
	
	ОткрытьФорму("Отчет.КалендарьПланирования.Форма.ФормаОтчетаУпр_85", ПараметрыФормы);
	//ОткрытьКалендарьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокКлиентов(Команда)
	ОткрытьФорму("Справочник.Клиенты.Форма.ФормаСписка_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЗаявок(Команда)
	ОткрытьФорму("Документ.Заявка.Форма.ФормаСписка_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетДинамикаПоказателейОсмотров(Команда)
	ОткрытьФорму("Отчет.ДинамикаПоказателей.Форма");
КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьОтчетПоИсходамЗаболеваний(Команда)
	ОткрытьФорму("Отчет.ОтчетПоИсходамЗаболеваний.Форма");
КонецПроцедуры  

&НаКлиенте
Процедура ОткрытьПрайсЛист(Команда)
	ОткрытьФорму("Отчет.ПрайсЛистПоНоменклатуре.Форма");
КонецПроцедуры 

&НаКлиенте
Процедура ОткрытьСписокПриходныхОрдеров(Команда)
	ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.Форма.ФормаСпискаУпр_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокПриемовВрачей(Команда)
	ОткрытьФорму("Документ.Прием.Форма.ФормаСписка85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокОплатПлатежнойКартой(Команда)
	ОткрытьФорму("Документ.ОплатаПлатежнойКартой.Форма.ФормаСпискаУпр_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокВозвратовНаПлатежнуюКарту(Команда)
	ОткрытьФорму("Документ.ВозвратПоПлатежнойКарте.Форма.ФормаСпискаУпр_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокОказанийУслуг(Команда)
	ОткрытьФорму("Документ.ОказаниеУслуг.Форма.ФормаСписка_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПоВыявляемымДиагнозам(Команда)
	ОткрытьФорму("Отчет.ОтчетПоВыявляемымДиагнозам.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПрименениеВнутреннихСтандартовЛечения(Команда)
	ОткрытьФорму("Отчет.ПрименениеВнутреннихСтандартовЛечения.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПрименениеРегламентированныхСтандартовЛечения(Команда)
	ОткрытьФорму("Отчет.ПрименениеРегламентированныхСтандартовЛечения.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУправлениеФискальнымУстройством(Команда)
	ОткрытьФорму("ОбщаяФорма.УправлениеФискальнымУстройством");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбучение(Команда)
	ОткрытьФорму("Обработка.омг_Обучение.Форма.Форма_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокГрафиковРаботы(Команда)
	ОткрытьФорму("Документ.УстановкаГрафиковРаботы.Форма.ФормаСписка_8_5");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетВыработкаСотрудников(Команда)
	ОткрытьФорму("Отчет.ВыработкаСотрудников.Форма");
КонецПроцедуры    

&НаКлиенте
Процедура ОткрытьОтчетПоПриемам(Команда)
	ОткрытьФорму("Отчет.омг_ОтчетПоПриемам.Форма");
КонецПроцедуры   

&НаКлиенте
Процедура ОткрытьОтчетДанныеМедицинскихЛицензий(Команда)
	ОткрытьФорму("Отчет.омг_ДанныеМедицинскихЛицензий.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрМедицинскихКарт(Команда)
	ОткрытьФорму("Обработка.ПросмотрМедКарт.Форма.ФормаАмбулаторнаяМК85");
КонецПроцедуры

&НаКлиенте
Процедура СменаПароля(Команда)
	ОткрытьФорму("ОбщаяФорма.СменаПароля", , ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМаршрутыЛечения(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборВрач", ПолучитьСотрудникаПользователя());
	ОткрытьФорму("Отчет.МаршрутЛеченияПациента.Форма.ФормаОтчета_85", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудникаПользователя()
	Пользователь = Пользователи.ТекущийПользователь();
	Врач =  Пользователь.Сотрудник;
	Возврат Врач; 
КонецФункции


&НаКлиенте
Процедура ОткрытьСтандартыЛечения(Команда)
	ОткрытьФорму("Справочник.СтандартыЛечения.Форма.ФормаСписка_85");
КонецПроцедуры

