Перем ВторичныеВидыНачисления;
Перем ФормулыФиксированныхНачислений;

Функция ПолучитьСписокСотрудниковПоОтборам(ПостроительОтчета)
	
	Если ТипЗнч(ПостроительОтчета) = Тип("ПостроительОтчета") Тогда
		
		Если ПостроительОтчета = Неопределено Тогда
			
			ПостроительОтчета = Новый ПостроительОтчета;	
			ПостроительОтчета.Текст = 
			"ВЫБРАТЬ
			|	Сотрудники.Ссылка КАК Сотрудник
			|ИЗ
			|	Справочник.Сотрудники КАК Сотрудники";
			
		КонецЕсли;
		
		ПостроительОтчета.Выполнить();
		ТабРезультат = ПостроительОтчета.Результат.Выгрузить();
		
		Возврат ТабРезультат.ВыгрузитьКолонку("Сотрудник");
		
	ИначеЕсли ТипЗнч(ПостроительОтчета) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		
		СхемаКомпоновкиДанных = ПолучитьМакет("СхемаКомпоновкиДанных");
		
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
		
		МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ПостроительОтчета.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		Запрос = Новый Запрос(МакетКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос);
		
		Для Каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл
			
			Запрос.Параметры.Вставить(Параметр.Имя, Параметр.Значение);
			
		КонецЦикла;
		
		ТабРезультат = Запрос.Выполнить().Выгрузить();
		
		Возврат ТабРезультат.ВыгрузитьКолонку("Сотрудник");
		
	КонецЕсли;	
КонецФункции

Процедура ПолучитьДанныеПоСдельнымНачислениям(Запрос, ТаблицаВсехНачислений, ПорядокРасчета)
	
	ТаблицаНачислений = ТаблицаВсехНачислений.СкопироватьКолонки();
	ТаблицаВсехНачисленийПорядка = ТаблицаВсехНачислений.НайтиСтроки(Новый Структура("ПорядокРасчета", ПорядокРасчета));
	
	Для Каждого Строка Из ТаблицаВсехНачисленийПорядка Цикл
		
		// Оставить только не фиксированные (условно - сдельные).
		Если ФормулыФиксированныхНачислений.Найти(Строка.Начисление) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаНачисления = ТаблицаНачислений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНачисления, Строка);
		
		Для Сч = 1 По 3 Цикл
			Если СтрокаНачисления.Начисление["ВидПараметра" + Сч] = Перечисления.ВидыПараметровРасчетаНачислений.ВсеНачисления Тогда
				СтрокаНачисления["Параметр" + Сч] = ПланыВидовРасчета.Начисления.ПустаяСсылка();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Возврат результата
	ДопСерверныеФункции.УничтожитьВременнуюТаблицуЗапроса(Запрос, "Начисления");
	
	Запрос.Текст = "ВЫБРАТЬ	*
	               |ПОМЕСТИТЬ Начисления
	               |ИЗ  &ТаблицаНачислений КАК ТаблицаНачислений";
	Запрос.УстановитьПараметр("ТаблицаНачислений",ТаблицаНачислений);
	Запрос.Выполнить();
				   
КонецПроцедуры				   

Процедура ЗаполнитьБазуРасчетаПоСдельнымНачислениям(Запрос, МассивСотрудниковДляРасчетаБазы, ПорядокРасчета)
	
	Запрос.Текст="ВЫБРАТЬ
	             |	Начисления.Сотрудник,
	             |	Начисления.ТрудоваяРоль КАК ТрудоваяРоль,
	             |	Начисления.Параметр1 КАК Показатель,
	             |	Начисления.Период КАК ПериодНачала,
	             |	Начисления.ПериодПрекращения,
	             |	Начисления.Начисление КАК ВидРасчета,
	             |	Начисления.Начисление.ВидПараметра1 КАК ВидПараметра,
	             |	Начисления.Начисление.ПоказательРасчета1 КАК ПоказательРасчета,
				 |	Начисления.Начисление.ИсточникБазы КАК ИсточникБазы,
				 |	Начисления.Начисление.Периодичность КАК Периодичность
	             |ИЗ
	             |	Начисления КАК Начисления
	             |
	             |ОБЪЕДИНИТЬ
	             |
	             |ВЫБРАТЬ
	             |	Начисления.Сотрудник,
	             |	Начисления.ТрудоваяРоль,
	             |	Начисления.Параметр2,
	             |	Начисления.Период,
	             |	Начисления.ПериодПрекращения,
	             |	Начисления.Начисление,
	             |	Начисления.Начисление.ВидПараметра2,
	             |	Начисления.Начисление.ПоказательРасчета2,
				 |	Начисления.Начисление.ИсточникБазы,
				 |	Начисления.Начисление.Периодичность
	             |ИЗ
	             |	Начисления КАК Начисления
	             |
	             |ОБЪЕДИНИТЬ
	             |
	             |ВЫБРАТЬ
	             |	Начисления.Сотрудник,
	             |	Начисления.ТрудоваяРоль,
	             |	Начисления.Параметр3,
	             |	Начисления.Период,
	             |	Начисления.ПериодПрекращения,
	             |	Начисления.Начисление,
	             |	Начисления.Начисление.ВидПараметра3,
	             |	Начисления.Начисление.ПоказательРасчета3,
				 |	Начисления.Начисление.ИсточникБазы,
				 |	Начисления.Начисление.Периодичность
	             |ИЗ
	             |	Начисления КАК Начисления";
				 
	ТаблицаПараметровРасчета = Запрос.Выполнить().Выгрузить();
	ТаблицаПараметровРасчета.Свернуть("Сотрудник,ТрудоваяРоль,Показатель,ПериодНачала,ПериодПрекращения,ВидПараметра,ПоказательРасчета, ИсточникБазы, Периодичность","");
		
	// Вот тут вставить замену общей роли на сотрудников
	// Необходимо проверить есть ли эта роль для данного сотрудника в нашей таблице (если есть значит что-то её перекрывает и по общему начислению мы не будем начислять).
	
	ТаблицаДляСчитывания = ТаблицаПараметровРасчета.Скопировать();
	
	Для Каждого СтрокаТаблицыПараметров Из ТаблицаДляСчитывания Цикл
		Если СтрокаТаблицыПараметров.Сотрудник = Справочники.Сотрудники.ПустаяСсылка() И СтрокаТаблицыПараметров.ТрудоваяРоль <> Справочники.ТрудовыеРоли.ПустаяСсылка() Тогда
			
			Для Каждого СотрудникМассива Из МассивСотрудниковДляРасчетаБазы Цикл				
				Если СотрудникМассива <> Справочники.Сотрудники.ПустаяСсылка() Тогда
					
					ОтборПоРолиИСотруднику = Новый Структура("Сотрудник,ТрудоваяРоль",СотрудникМассива,СтрокаТаблицыПараметров.ТрудоваяРоль);
					НайденныеСтроки = ТаблицаДляСчитывания.НайтиСтроки(ОтборПоРолиИСотруднику);
					
					Если НайденныеСтроки.Количество() = 0 Тогда
						
						НоваяСтрока = ТаблицаПараметровРасчета.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыПараметров);
						НоваяСтрока.Сотрудник = СотрудникМассива;
						
					КонецЕсли;
					
				КонецЕсли;				
			КонецЦикла;
			
		КонецЕсли;		
	КонецЦикла;
	
	мОбрИнд = ТаблицаПараметровРасчета.Количество()-1;
	Для сч = 0 по мОбрИнд Цикл
		
		СтрокаТЗ = ТаблицаПараметровРасчета[мОбрИнд-сч];
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ВидПараметра) ИЛИ Не ЗначениеЗаполнено(СтрокаТЗ.Сотрудник) Тогда
			ТаблицаПараметровРасчета.Удалить(мОбрИнд-сч);
		КонецЕсли;
		
	КонецЦикла;
		
	ВыборкаПоказателиПрямойВыработки = СформироватьВыборкуПрямойВыработки(Запрос, ТаблицаПараметровРасчета);
	ТаблицаТабельныхДанные			 = СформироватьТаблицуТабельныхДанных(ТаблицаПараметровРасчета);
	ТаблицаНормыПоГрафику	 		 = СформироватьНормыПоГрафику(ТаблицаПараметровРасчета);
	ПодготовитьДанныеДляОценкиПоПрейскуранту(Запрос, ТаблицаПараметровРасчета);
	
	СтруктураДанныхДляРасчета = Новый Структура;
	СтруктураДанныхДляРасчета.Вставить("ВыборкаПоказателиПрямойВыработки",	ВыборкаПоказателиПрямойВыработки);
	СтруктураДанныхДляРасчета.Вставить("ТаблицаТабельныхДанные",			ТаблицаТабельныхДанные);
	СтруктураДанныхДляРасчета.Вставить("ТаблицаНормыПоГрафику",	ТаблицаНормыПоГрафику);
	
	СформироватьВременнуюТаблицуНепрямойВыработки(Запрос);
	
	// Заполнение значений параметров расчета	
	ТаблицаЗначенийПараметровРасчета = ТаблицаПараметровРасчета.Скопировать();
	ТаблицаЗначенийПараметровРасчета.Колонки.Добавить("Период"	,Новый ОписаниеТипов("Дата"));
	ТаблицаЗначенийПараметровРасчета.Колонки.Добавить("Значение",Новый ОписаниеТипов("Число"));
	
	////////////////////////////////////////////////////////////////////////
	// омг + 
	омг_ТаблицаПараметровРасчетаВспомогательная = ТаблицаПараметровРасчета.СкопироватьКолонки();
	Для Каждого СтрокаПараметраРасчета Из ТаблицаПараметровРасчета Цикл 
		Если ТипЗнч(СтрокаПараметраРасчета.Показатель) = Тип("СправочникСсылка.ПараметрыРасчетаЗП") Тогда
			Если омг_РасчетЗаработнойПлатыСервер.ПроверкаНаПриоритизациюУслуг(СтрокаПараметраРасчета.Показатель) Тогда
				ЗаполнитьЗначенияСвойств(омг_ТаблицаПараметровРасчетаВспомогательная.Добавить(),СтрокаПараметраРасчета)			
			иначе	
				ВычислитьЗначениеПараметраРасчета(СтрокаПараметраРасчета, СтруктураДанныхДляРасчета, Запрос, ТаблицаЗначенийПараметровРасчета, ПорядокРасчета);
			КонецЕсли;	
		иначе	
			ВычислитьЗначениеПараметраРасчета(СтрокаПараметраРасчета, СтруктураДанныхДляРасчета, Запрос, ТаблицаЗначенийПараметровРасчета, ПорядокРасчета);
		КонецЕсли;	
	КонецЦикла; 
	
	омг_ТаблицаПараметровРасчетаВспомогательная.Сортировать("Сотрудник Возр");
	омг_ВычислитьЗначениеПараметраРасчета(омг_ТаблицаПараметровРасчетаВспомогательная, СтруктураДанныхДляРасчета, Запрос, ТаблицаЗначенийПараметровРасчета, ПорядокРасчета);
	
	//ПараметрыОтбора = Новый Структура("Значение", 0); 
	//НайденныеСтроки = ТаблицаЗначенийПараметровРасчета.НайтиСтроки(ПараметрыОтбора);
	//
	//Для Каждого СтрокаТЗ Из НайденныеСтроки Цикл
	//	ТаблицаЗначенийПараметровРасчета.Удалить(СтрокаТЗ);
	//КонецЦикла;

	// омг -
	////////////////////////////////////////////////////////////////////////

	// Собственно заполнение базы расчета
	ТаблицаБазаРасчета = БазаРасчета.Выгрузить();
	
	Запрос.Текст="ВЫБРАТЬ
	             |	Начисления.Сотрудник КАК Сотрудник,
	             |	Начисления.ТрудоваяРоль КАК ТрудоваяРоль,
	             |	Начисления.Начисление КАК ВидРасчета,
	             |	Начисления.Параметр1 КАК Показатель1,
	             |	Начисления.Параметр2 КАК Показатель2,
	             |	Начисления.Параметр3 КАК Показатель3,
	             |	Начисления.Период КАК ПериодНачала,
	             |	Начисления.ПериодПрекращения КАК ПериодПрекращения
	             |ИЗ
	             |	Начисления КАК Начисления 
	////////////////////////////////////////////////////
	// ОМГ
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Начисления.ТрудоваяРоль,
	             |	Начисления.Параметр2,
	             |	Начисления.Начисление,
	             |	Начисления.Сотрудник,
	             |	Начисления.Параметр3,
	             |	Начисления.Параметр1,
	             |	Начисления.ПериодПрекращения,
	             |	Начисления.Период";
	// ОМГ
	////////////////////////////////////////////////////
	
	ВидыРасчетаСотрудников = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДляСчитывания = ВидыРасчетаСотрудников.Скопировать();
	
	Для Каждого СтрокаТаблицыПараметров Из ТаблицаДляСчитывания Цикл
		Если СтрокаТаблицыПараметров.Сотрудник = Справочники.Сотрудники.ПустаяСсылка() И СтрокаТаблицыПараметров.ТрудоваяРоль <> Справочники.ТрудовыеРоли.ПустаяСсылка() Тогда
			
			Для Каждого СотрудникМассива Из МассивСотрудниковДляРасчетаБазы Цикл				
				Если СотрудникМассива <> Справочники.Сотрудники.ПустаяСсылка() Тогда
					
					ОтборПоРолиИСотруднику = Новый Структура("Сотрудник,ТрудоваяРоль",СотрудникМассива,СтрокаТаблицыПараметров.ТрудоваяРоль);
					НайденныеСтроки = ТаблицаДляСчитывания.НайтиСтроки(ОтборПоРолиИСотруднику);
					
					Если НайденныеСтроки.Количество() = 0 Тогда
						
						НоваяСтрока = ВидыРасчетаСотрудников.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыПараметров);
						НоваяСтрока.Сотрудник = СотрудникМассива;
						
					КонецЕсли;
					
				КонецЕсли;				
			КонецЦикла;
			
		КонецЕсли;		
	КонецЦикла;
	
	Для каждого ВыбВидыРасчетаСотрудников из ВидыРасчетаСотрудников Цикл
		
		ЧислоПараметров = РасчетЗаработнойПлаты.ПолучитьЧислоПараметровВидаНачисления(ВыбВидыРасчетаСотрудников.ВидРасчета);
		
		ТаблицыЗначенийПараметровВидаРасчета = Новый Структура;
		МассивПериодов	= Новый Массив;
		Для НомерПараметра = 1 По ЧислоПараметров Цикл
			ПолучитьТаблицуЗначенийПараметраВидаРасчета(ВыбВидыРасчетаСотрудников,
														НомерПараметра,
														ТаблицаЗначенийПараметровРасчета,
														ТаблицыЗначенийПараметровВидаРасчета,
														МассивПериодов);
		КонецЦикла;
		
		Для Каждого Период Из МассивПериодов Цикл
			
			Если Не ПериодРасчетаПопадаетВПериодДокумента(Период, ВыбВидыРасчетаСотрудников.ВидРасчета.Периодичность) Тогда Продолжить; КонецЕсли;
			
			НоваяСтрокаБазы = ТаблицаБазаРасчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаБазы, ВыбВидыРасчетаСотрудников);
			НоваяСтрокаБазы.ПериодНачисления = Период;
			                 
			// Поиск и подстановка значений
			Для НомерПараметра = 1 По ЧислоПараметров Цикл			
				ТаблицаЗначенийПараметра = ТаблицыЗначенийПараметровВидаРасчета["ЗначенияПараметра"+НомерПараметра];
				СтрокаЗначенияПараметра	= ТаблицаЗначенийПараметра.Найти(Период,"Период");
				Если СтрокаЗначенияПараметра <> Неопределено Тогда
					НоваяСтрокаБазы["ЗначениеПоказателя" + НомерПараметра] = СтрокаЗначенияПараметра.Значение;
				КонецЕсли;
			КонецЦикла;
				
			// Подбор категории выработки отнесения затрат на з/п
			Для НомерПараметра = 1 По ЧислоПараметров Цикл			
				Если ТипЗнч(ВыбВидыРасчетаСотрудников["Показатель"+НомерПараметра]) = Тип("СправочникСсылка.КатегорииВыработки") Тогда
					НоваяСтрокаБазы.КатегорияВыработки = ВыбВидыРасчетаСотрудников["Показатель"+НомерПараметра];
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;	
	СвернутьТаблицуБазыРасчета(ТаблицаБазаРасчета);
	
	// Расчет показателей, вычисляемых на втором обходе: шкалы.
	Для Каждого СтрокаБазы Из ТаблицаБазаРасчета Цикл
		                                           
		ПеречислениеПоказатели		= Перечисления.ПоказателиРасчетаНачислений;
		НомерОцениваемогоПараметра	= 0;
		ЧислоПараметров = РасчетЗаработнойПлаты.ПолучитьЧислоПараметровВидаНачисления(СтрокаБазы.ВидРасчета);
		Для НомерПараметра = 1 По ЧислоПараметров Цикл
			     
			ВидПараметра = СтрокаБазы.ВидРасчета["ВидПараметра"+НомерПараметра];
			Если ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.Шкала Тогда
				ПоказательРасчета = СтрокаБазы.ВидРасчета["ПоказательРасчета"+НомерПараметра];
				Если ПоказательРасчета = ПеречислениеПоказатели.Параметр1 Тогда
					НомерОцениваемогоПараметра = 1;
				ИначеЕсли ПоказательРасчета = ПеречислениеПоказатели.Параметр2 Тогда
					НомерОцениваемогоПараметра = 2;
				ИначеЕсли ПоказательРасчета = ПеречислениеПоказатели.Параметр3 Тогда
					НомерОцениваемогоПараметра = 3;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(НомерОцениваемогоПараметра) Тогда 
					//////////////////////////////////////////////////////
					// омг
					СтрокаБазы["ЗначениеПоказателя"+НомерПараметра] = РасчетЗаработнойПлаты.ОценитьЗначениеПоШкале(	СтрокаБазы["ЗначениеПоказателя"+НомерОцениваемогоПараметра],
																													СтрокаБазы["Показатель"+НомерПараметра],НачалоПериода );  
					// омг
					//////////////////////////////////////////////////////
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	БазаРасчета.Загрузить(ТаблицаБазаРасчета);
	
КонецПроцедуры	                                                      

Процедура ЗаполнитьБазуРасчетаПоЕжемесячнымНачислениям(Запрос, ТаблицаВсехНачислений, ПорядокРасчета)
	
	ТаблицаНачислений = ТаблицаВсехНачислений.СкопироватьКолонки();
	ТаблицаВсехНачисленийПорядка = ТаблицаВсехНачислений.НайтиСтроки(Новый Структура("ПорядокРасчета", ПорядокРасчета));
	
	Для Каждого Строка Из ТаблицаВсехНачисленийПорядка Цикл
		
		// Оставить только не фиксированные (условно - сдельные).
		Если ФормулыФиксированныхНачислений.Найти(Строка.Начисление) <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаНачислений.Добавить(), Строка);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаНачислений Цикл
		
		ПериодыРасчета = ПериодыВидаРасчетаВИнтервалеДокумента(Строка.Начисление.Периодичность, Строка.Период, Строка.ПериодПрекращения);
		
		Для Каждого ПериодРасчета Из ПериодыРасчета Цикл
			НоваяСтрока = БазаРасчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.ВидРасчета			 = Строка.Начисление;
			НоваяСтрока.Показатель1			 = Строка.Параметр1;
			НоваяСтрока.ЗначениеПоказателя1	 = Строка.Параметр1;
			НоваяСтрока.ПериодНачисления	 = ПериодРасчета.НачалоПериода;
			
			ВыровнятьПериодПоПериодичностиВидаРасчета(НоваяСтрока.ВидРасчета,НоваяСтрока.ПериодНачисления);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры	
	
Функция РассчитатьРезультат(СтрокаБазыРасчета)
	
	Результат = 0;
	
	ФормулыРасчета = Перечисления.ФормулыРасчетаЗаработнойПлаты;
	
	Формула = СтрокаБазыРасчета.ВидРасчета.ФормулаРасчета;
	
	Зн1 = СтрокаБазыРасчета.ЗначениеПоказателя1;
	Зн2 = СтрокаБазыРасчета.ЗначениеПоказателя2;
	Зн3 = СтрокаБазыРасчета.ЗначениеПоказателя3;
	
	Если	Формула = ФормулыРасчета.ФиксированнаяСумма
		Или Формула = ФормулыРасчета.ОдинПараметр
	Тогда
		Результат = Зн1;
		
	ИначеЕсли Формула = ФормулыРасчета.Процент Тогда
		Результат = Зн1 * Зн2 / 100;
		
	ИначеЕсли Формула = ФормулыРасчета.ПроцентОдинПараметр Тогда
		Результат = Зн1 / 100;
		
	ИначеЕсли Формула = ФормулыРасчета.Произведение Тогда
		Результат = Зн1 * Зн2;
		
	ИначеЕсли Формула = ФормулыРасчета.Разность Тогда
		Результат = Зн1 - Зн2;
		
	ИначеЕсли Формула = ФормулыРасчета.ПроцентОтРазности Тогда
		Результат = (Зн1 - Зн2) * Зн3/100;
		
	ИначеЕсли Формула = ФормулыРасчета.ТройноеПроизведение Тогда
		Результат = Зн1 * Зн2 * Зн3;
		
	ИначеЕсли Формула = ФормулыРасчета.Деление Тогда
		Если ЗначениеЗаполнено(Зн2) Тогда
			Результат = Зн1 / Зн2;
		Иначе
			Результат = 0;
		КонецЕсли;
	ИначеЕсли Формула = ФормулыРасчета.ДелениеПроизведения Тогда
		Если ЗначениеЗаполнено(Зн3) Тогда
			Результат = (Зн1 * Зн2) / Зн3;
		Иначе
			Результат = 0;
		КонецЕсли;
	Иначе
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВычислитьЗначениеПараметраРасчета(СтрокаПараметраРасчета, СтруктураДанныхДляРасчета, Запрос, ТаблицаЗначенийПараметровРасчета, ПорядокРасчета)
	
	ВидПараметра	= СтрокаПараметраРасчета.ВидПараметра;
	ПеречислениеВидыПараметров = Перечисления.ВидыПараметровРасчетаНачислений;
	
	ВыборкаПоказателиПрямойВыработки = СтруктураДанныхДляРасчета.ВыборкаПоказателиПрямойВыработки;
	ТаблицаНормыПоГрафику = СтруктураДанныхДляРасчета.ТаблицаНормыПоГрафику;
	
	Если	ВидПараметра = ПеречислениеВидыПараметров.КатегорияВыработки
		Или ВидПараметра = ПеречислениеВидыПараметров.ВсеТовары
		Или ВидПараметра = ПеречислениеВидыПараметров.ВсеУслуги
	Тогда
		// Подготовка отбора из выборки запроса по сдельной выработке
		Отбор = Новый Структура("Сотрудник, ТрудоваяРоль, ПериодНачала, ПериодПрекращения, ВидПараметра, ПоказательРасчета");
		
		Если ВидПараметра = ПеречислениеВидыПараметров.КатегорияВыработки Тогда
			Отбор.Вставить("Показатель"); // Отбор по специальности 
			
		ИначеЕсли ВидПараметра = ПеречислениеВидыПараметров.ВсеТовары
			  Или ВидПараметра = ПеречислениеВидыПараметров.ВсеУслуги
		Тогда
			// Отбор по разделению Услуга (ложь) / Материал (истина). 
			Отбор.Вставить("Материал", ?(ВидПараметра = ПеречислениеВидыПараметров.ВсеТовары, Истина, ?(ВидПараметра = ПеречислениеВидыПараметров.ВсеУслуги, Ложь, NULL)));
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаПараметраРасчета);
	
		// Обход выборки по отбору
		ВыборкаПоказателиПрямойВыработки.Сбросить();
		Пока ВыборкаПоказателиПрямойВыработки.НайтиСледующий(Отбор) Цикл
			СтрокаЗначенияПараметраРасчета = ТаблицаЗначенийПараметровРасчета.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗначенияПараметраРасчета, СтрокаПараметраРасчета);
			СтрокаЗначенияПараметраРасчета.Период	= ВыборкаПоказателиПрямойВыработки.Период;
			СтрокаЗначенияПараметраРасчета.Значение = ПолучитьЗначениеПоВарификатору(ВыборкаПоказателиПрямойВыработки, СтрокаПараметраРасчета.ПоказательРасчета);
		КонецЦикла;
	
	ИначеЕсли ВидПараметра = ПеречислениеВидыПараметров.ОценкаПоПрейскуранту Тогда
		
		ПериодыНачисления = ПериодыВидаРасчетаВИнтервалеДокумента(СтрокаПараметраРасчета.Периодичность, СтрокаПараметраРасчета.ПериодНачала, СтрокаПараметраРасчета.ПериодПрекращения);
		Для Каждого СтруктураПериодНачисления Из ПериодыНачисления Цикл
			ЗначениеПоказателя = ВыработкаДляОценкиПоПрейскуранту(Запрос, СтрокаПараметраРасчета.Сотрудник, СтрокаПараметраРасчета.ТрудоваяРоль,
															СтрокаПараметраРасчета.Показатель, СтрокаПараметраРасчета.ПоказательРасчета,
															СтруктураПериодНачисления.НачалоПериода, СтруктураПериодНачисления.КонецПериода);
			
			СтрокаЗначенияПараметраРасчета = ТаблицаЗначенийПараметровРасчета.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗначенияПараметраРасчета, СтрокаПараметраРасчета);
			СтрокаЗначенияПараметраРасчета.Период	= СтруктураПериодНачисления.НачалоПериода;
			СтрокаЗначенияПараметраРасчета.Значение = ЗначениеПоказателя;
		КонецЦикла;
		
	ИначеЕсли ВидПараметра = ПеречислениеВидыПараметров.Число Тогда
		СтрокаЗначенияПараметраРасчета = ТаблицаЗначенийПараметровРасчета.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЗначенияПараметраРасчета, СтрокаПараметраРасчета);
		СтрокаЗначенияПараметраРасчета.Значение = СтрокаПараметраРасчета.Показатель;
		СтрокаЗначенияПараметраРасчета.Период = Макс(СтрокаПараметраРасчета.ПериодНачала, НачалоПериода);
	
	ИначеЕсли ВидПараметра = ПеречислениеВидыПараметров.Шкала Тогда
		// Вычисляется при втором обходе 
		
	ИначеЕсли ВидПараметра = ПеречислениеВидыПараметров.ВидНачисления
		  Или ВидПараметра = ПеречислениеВидыПараметров.ВсеНачисления
	Тогда
		ВидНачисления = ?(ВидПараметра = ПеречислениеВидыПараметров.ВсеНачисления, Неопределено, СтрокаПараметраРасчета.Показатель);
		ПериодыНачисления = ПериодыВидаРасчетаВИнтервалеДокумента(СтрокаПараметраРасчета.Периодичность, СтрокаПараметраРасчета.ПериодНачала, СтрокаПараметраРасчета.ПериодПрекращения);
		
		Для Каждого СтруктураПериодНачисления Из ПериодыНачисления Цикл
			
	        СуммаБазы = ПолучитьБазуРасчетаВторичногоНачисления(Запрос, ,
																СтрокаПараметраРасчета.ИсточникБазы, ПорядокРасчета,
																СтруктураПериодНачисления.НачалоПериода, СтруктураПериодНачисления.КонецПериода,
																СтрокаПараметраРасчета.Сотрудник, ВидНачисления);
			
			СтрокаЗначенияПараметраРасчета = ТаблицаЗначенийПараметровРасчета.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗначенияПараметраРасчета, СтрокаПараметраРасчета);
			СтрокаЗначенияПараметраРасчета.Период	= СтруктураПериодНачисления.НачалоПериода;
			СтрокаЗначенияПараметраРасчета.Значение = СуммаБазы;
			
		КонецЦикла;
		
	ИначеЕсли ВидПараметра = ПеречислениеВидыПараметров.Ответственный Тогда
		ВыборкаНепрямойВыработки = ПолучитьВыборкуНепрямойВыработки(Запрос, "Ответственный", СтрокаПараметраРасчета);
		Пока ВыборкаНепрямойВыработки.Следующий() Цикл
			СтрокаЗначенияПараметраРасчета = ТаблицаЗначенийПараметровРасчета.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗначенияПараметраРасчета, СтрокаПараметраРасчета);
			СтрокаЗначенияПараметраРасчета.Период	 = ВыборкаНепрямойВыработки.Период;
			СтрокаЗначенияПараметраРасчета.Значение = ПолучитьЗначениеПоВарификатору(ВыборкаНепрямойВыработки, СтрокаПараметраРасчета.ПоказательРасчета);
		КонецЦикла;
		
	ИначеЕсли ВидПараметра = ПеречислениеВидыПараметров.Филиал Тогда
		Если ПроцедурыСпециализацииПоставки.ПоддерживаетсяУчетПоНесколькимФилиалам() Тогда
			ВыборкаНепрямойВыработки = ПолучитьВыборкуНепрямойВыработки(Запрос, "Филиал", СтрокаПараметраРасчета);
		Иначе
			ВыборкаНепрямойВыработки = ПолучитьВыборкуНепрямойВыработки(Запрос, , СтрокаПараметраРасчета);
		КонецЕсли;
		Пока ВыборкаНепрямойВыработки.Следующий() Цикл
			СтрокаЗначенияПараметраРасчета = ТаблицаЗначенийПараметровРасчета.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗначенияПараметраРасчета, СтрокаПараметраРасчета);
			СтрокаЗначенияПараметраРасчета.Период	 = ВыборкаНепрямойВыработки.Период;
			СтрокаЗначенияПараметраРасчета.Значение = ПолучитьЗначениеПоВарификатору(ВыборкаНепрямойВыработки, СтрокаПараметраРасчета.ПоказательРасчета);
		КонецЦикла;
		
	ИначеЕсли ВидПараметра = ПеречислениеВидыПараметров.ДанныеТабеля Тогда
		
		Если СтрокаПараметраРасчета.ПоказательРасчета = Перечисления.ПоказателиРасчетаНачислений.КоличествоДнейПоТабелю 
			ИЛИ СтрокаПараметраРасчета.ПоказательРасчета = Перечисления.ПоказателиРасчетаНачислений.КоличествоЧасовПоТабелю 
		Тогда
			Отбор = Новый Структура("Сотрудник", СтрокаПараметраРасчета.Сотрудник);
			мсСтрокиТабельныхДанных = СтруктураДанныхДляРасчета.ТаблицаТабельныхДанные.НайтиСтроки(Отбор);
			Для Каждого СтрокаТабельныхДанных Из мсСтрокиТабельныхДанных Цикл
				Если СтрокаТабельныхДанных.День >= СтрокаПараметраРасчета.ПериодНачала
					И СтрокаТабельныхДанных.День <= СтрокаПараметраРасчета.ПериодПрекращения
				Тогда
					СтрокаЗначенияПараметраРасчета = ТаблицаЗначенийПараметровРасчета.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЗначенияПараметраРасчета, СтрокаПараметраРасчета);
					СтрокаЗначенияПараметраРасчета.Период	= СтрокаТабельныхДанных.День;
					СтрокаЗначенияПараметраРасчета.Значение = ПолучитьЗначениеПоВарификатору(СтрокаТабельныхДанных, СтрокаПараметраРасчета.ПоказательРасчета);
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого СтрокаНормПоГрафику Из ТаблицаНормыПоГрафику Цикл
				Если СтрокаНормПоГрафику.Месяц >= НачалоМесяца(СтрокаПараметраРасчета.ПериодНачала)
					И СтрокаНормПоГрафику.Месяц <= КонецМесяца(СтрокаПараметраРасчета.ПериодПрекращения)
					И СтрокаНормПоГрафику.ВидГрафика = СтрокаПараметраРасчета.Показатель
				Тогда
					ПоказателиРасчета = Новый Структура("КоличествоДнейПоТабелю, КоличествоЧасовПоТабелю, 
														|ДнейПоНорме,	ДнейОтработаноПоНорме,	ДнейОтработаноСверхНормы, 
														|ЧасовПоНорме,	ЧасовОтработаноПоНорме,	ЧасовОтработаноСверхНормы",
														0,0,0,0,0,0,0,0);
														
					ПоказателиРасчета.ДнейПоНорме = СтрокаНормПоГрафику.ДнейПоНорме;
				    ПоказателиРасчета.ЧасовПоНорме = СтрокаНормПоГрафику.ЧасовПоНорме;
					
					// Определяем количество дней и часов, отработанных в этом месяце по табелю
					Отбор = Новый Структура("Сотрудник", СтрокаПараметраРасчета.Сотрудник);
					СтрокиТабельныхДанных = СтруктураДанныхДляРасчета.ТаблицаТабельныхДанные.НайтиСтроки(Отбор);
					Для Каждого СтрокаТабельныхДанных Из СтрокиТабельныхДанных Цикл
						Если СтрокаТабельныхДанных.День >= СтрокаПараметраРасчета.ПериодНачала
							И СтрокаТабельныхДанных.День <= СтрокаПараметраРасчета.ПериодПрекращения
							И НачалоМесяца(СтрокаТабельныхДанных.День) = СтрокаНормПоГрафику.Месяц
						Тогда
							ПоказателиРасчета.КоличествоДнейПоТабелю = ПоказателиРасчета.КоличествоДнейПоТабелю  + СтрокаТабельныхДанных.КоличествоДнейПоТабелю;
							ПоказателиРасчета.КоличествоЧасовПоТабелю = ПоказателиРасчета.КоличествоЧасовПоТабелю + СтрокаТабельныхДанных.КоличествоЧасовПоТабелю;
						КонецЕсли;	
					КонецЦикла;
														
					ПоказателиРасчета.ДнейОтработаноПоНорме	 = Мин(ПоказателиРасчета.КоличествоДнейПоТабелю, СтрокаНормПоГрафику.ДнейПоНорме);
					ПоказателиРасчета.ЧасовОтработаноПоНорме = Мин(ПоказателиРасчета.КоличествоЧасовПоТабелю, СтрокаНормПоГрафику.ЧасовПоНорме);
					
					ПоказателиРасчета.ДнейОтработаноСверхНормы  = Макс(0, ПоказателиРасчета.КоличествоДнейПоТабелю  - ПоказателиРасчета.ДнейОтработаноПоНорме);
					ПоказателиРасчета.ЧасовОтработаноСверхНормы = Макс(0, ПоказателиРасчета.КоличествоЧасовПоТабелю - ПоказателиРасчета.ЧасовОтработаноПоНорме);
					
					СтрокаЗначенияПараметраРасчета = ТаблицаЗначенийПараметровРасчета.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЗначенияПараметраРасчета, СтрокаПараметраРасчета);
					СтрокаЗначенияПараметраРасчета.Период = СтрокаНормПоГрафику.Месяц;
					СтрокаЗначенияПараметраРасчета.Значение = ПолучитьЗначениеПоВарификатору(ПоказателиРасчета, СтрокаПараметраРасчета.ПоказательРасчета);

				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ВидПараметра = ПеречислениеВидыПараметров.ДополнительныйПараметр Тогда
		
		ДатаНачала = Макс(ЭтотОбъект.НачалоПериода, СтрокаПараметраРасчета.ПериодНачала);
		ДатаОкончания = Мин(ЭтотОбъект.КонецПериода, СтрокаПараметраРасчета.ПериодПрекращения);
		
		ТекущийМесяц = НачалоМесяца(ДатаНачала);
		Пока ТекущийМесяц < КонецМесяца(ДатаОкончания) Цикл
			
			ТекущееНачалоПериода = Макс(ТекущийМесяц, ДатаНачала);
			ТекущийКонецПериода = Мин(КонецМесяца(ТекущийМесяц), ДатаОкончания);
			
			ПараметрыВычисления = Новый Структура;
			ПараметрыВычисления.Вставить("ПараметрРасчета", СтрокаПараметраРасчета.Показатель);
			ПараметрыВычисления.Вставить("Сотрудник", 		СтрокаПараметраРасчета.Сотрудник);
			ПараметрыВычисления.Вставить("НачалоПериода", 	ТекущееНачалоПериода);
			ПараметрыВычисления.Вставить("КонецПериода", 	КонецДня(ТекущийКонецПериода));
			#Если Клиент Тогда
			ПараметрыВычисления.Вставить("Документ", ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект));
			#Иначе
			ПараметрыВычисления.Вставить("Документ", ЭтотОбъект);
			#КонецЕсли   
		
			Результат = РасчетЗаработнойПлаты.ПолучитьЗначениеДополнительногоПараметра(ПараметрыВычисления);
			
			Если ЗначениеЗаполнено(Результат) Тогда
				
				СтрокаЗначенияПараметраРасчета = ТаблицаЗначенийПараметровРасчета.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаЗначенияПараметраРасчета, СтрокаПараметраРасчета);
				СтрокаЗначенияПараметраРасчета.Период	= ТекущийМесяц;
				СтрокаЗначенияПараметраРасчета.Значение = Результат;
				
			КонецЕсли;
			
			ТекущийМесяц = ДобавитьМесяц(ТекущийМесяц, 1);
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

// Получает расход материалов на выработку по непустой трудовой роли (форме участия) 
//	для встройки в общий запрос прямой выработки - только выработка по услугам.
Функция ПолучитьТаблицуРасходаМатериаловНаДополнительныеФормыУчастия()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыработкаСотрудниковОбороты.Сотрудник КАК Сотрудник,
	|	ВыработкаСотрудниковОбороты.Номенклатура КАК Номенклатура,
	|	ВыработкаСотрудниковОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВыработкаСотрудниковОбороты.ТрудоваяРоль КАК ТрудоваяРоль,
	|	ВыработкаСотрудниковОбороты.Регистратор КАК Регистратор,
	|	ВыработкаСотрудниковОбороты.КоличествоОборот КАК Количество,
	|	ВыработкаСотрудниковОбороты.Период КАК Период
	|ПОМЕСТИТЬ Выработка
	|ИЗ
	|	РегистрНакопления.ВыработкаСотрудников.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|				И ТрудоваяРоль <> ЗНАЧЕНИЕ(Справочник.ТрудовыеРоли.ПустаяСсылка)) КАК ВыработкаСотрудниковОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходМатериаловОбороты.Регистратор КАК Регистратор,
	|	РасходМатериаловОбороты.Номенклатура КАК Номенклатура,
	|	РасходМатериаловОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	РасходМатериаловОбороты.Материал КАК Материал,
	|	РасходМатериаловОбороты.ХарактеристикаМатериала КАК ХарактеристикаМатериала,
	|	РасходМатериаловОбороты.РасходФактическийОборот КАК РасходФактическийОборот
	|ПОМЕСТИТЬ Расход
	|ИЗ
	|	РегистрНакопления.РасходМатериалов.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК РасходМатериаловОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Выработка.Номенклатура КАК Номенклатура,
	|	Выработка.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(Выработка.Количество) КАК Количество,
	|	Выработка.Регистратор КАК Регистратор,
	|	Выработка.ТрудоваяРоль КАК ТрудоваяРоль
	|ПОМЕСТИТЬ ВсегоВыработка
	|ИЗ
	|	Выработка КАК Выработка
	|
	|СГРУППИРОВАТЬ ПО
	|	Выработка.Номенклатура,
	|	Выработка.ХарактеристикаНоменклатуры,
	|	Выработка.Регистратор,
	|	Выработка.ТрудоваяРоль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Выработка.Сотрудник КАК Сотрудник,
	|	Выработка.ТрудоваяРоль КАК ТрудоваяРоль,
	|	Выработка.Номенклатура.КатегорияВыработки КАК КатегорияВыработки,
	|	Выработка.Регистратор КАК Регистратор,
	|	Выработка.Период КАК Период,
	|	Расход.Материал КАК Материал,
	|	Расход.ХарактеристикаМатериала КАК ХарактеристикаМатериала,
	|	СУММА(Расход.РасходФактическийОборот * ВЫБОР
	|			КОГДА ВсегоВыработка.Количество = 0
	|				ТОГДА 1
	|			ИНАЧЕ Выработка.Количество / ВсегоВыработка.Количество
	|		КОНЕЦ) КАК Количество
	|ИЗ
	|	Выработка КАК Выработка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВсегоВыработка КАК ВсегоВыработка
	|		ПО Выработка.Номенклатура = ВсегоВыработка.Номенклатура
	|			И Выработка.ХарактеристикаНоменклатуры = ВсегоВыработка.ХарактеристикаНоменклатуры
	|			И Выработка.Регистратор = ВсегоВыработка.Регистратор
	|			И Выработка.ТрудоваяРоль = ВсегоВыработка.ТрудоваяРоль
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Расход КАК Расход
	|		ПО Выработка.Номенклатура = Расход.Номенклатура
	|			И Выработка.ХарактеристикаНоменклатуры = Расход.ХарактеристикаНоменклатуры
	|			И Выработка.Регистратор = Расход.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Расход.ХарактеристикаМатериала,
	|	Выработка.Период,
	|	Выработка.Сотрудник,
	|	Выработка.Регистратор,
	|	Выработка.ТрудоваяРоль,
	|	Расход.Материал,
	|	Выработка.Номенклатура.КатегорияВыработки"
	;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СформироватьВыборкуПрямойВыработки(Запрос, ТаблицаПараметровРасчета)
	
	Если Не СформироватьВыборкуПрямойВыработки_ВыборкаТребуется(ТаблицаПараметровРасчета) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаПараметровРасчетаПрямойВыработки = ТаблицаПараметровРасчета.Скопировать();
	мОбрИнд = ТаблицаПараметровРасчетаПрямойВыработки.Количество()-1;
	Для сч = 0 по мОбрИнд Цикл
		СтрокаТЗ = ТаблицаПараметровРасчетаПрямойВыработки[мОбрИнд-сч];
		Если СтрокаТЗ.ВидПараметра <> Перечисления.ВидыПараметровРасчетаНачислений.КатегорияВыработки 
			И СтрокаТЗ.ВидПараметра <> Перечисления.ВидыПараметровРасчетаНачислений.ВсеТовары 
			И СтрокаТЗ.ВидПараметра <> Перечисления.ВидыПараметровРасчетаНачислений.ВсеУслуги Тогда
			ТаблицаПараметровРасчетаПрямойВыработки.Удалить(мОбрИнд-сч);
		КонецЕсли;
	КонецЦикла;
	
	ДопСерверныеФункции.ПоместитьТаблицуЗначенийВоВременнуюТаблицу(ТаблицаПараметровРасчетаПрямойВыработки, "ПараметрыСдельныхНачислений", Запрос, "Сотрудник, ТрудоваяРоль, Показатель, ВидПараметра, ПоказательРасчета, ПериодНачала, ПериодПрекращения");
	ДопСерверныеФункции.ПоместитьТаблицуЗначенийВоВременнуюТаблицу(ПолучитьТаблицуРасходаМатериаловНаДополнительныеФормыУчастия(),"РасходТМЦУслугиТрудовыхРолей", Запрос, "Сотрудник, ТрудоваяРоль, КатегорияВыработки, Регистратор, Период, Материал, ХарактеристикаМатериала, Количество");
	
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	РасходТМЦ.Сотрудник КАК Сотрудник,
	             |	РасходТМЦ.КатегорияВыработки КАК КатегорияВыработки,
	             |	РасходТМЦ.Номенклатура КАК Номенклатура,
	             |	РасходТМЦ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	             |	СУММА(РасходТМЦ.Количество) КАК Количество,
	             |	НАЧАЛОПЕРИОДА(РасходТМЦ.Период, ДЕНЬ) КАК Дата,
	             |	РасходТМЦ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК НоменклатураЕХОКоэффициент,
	             |	РасходТМЦ.Регистратор КАК Регистратор,
	             |	РасходТМЦ.РасходНаТМЦ КАК РасходНаТМЦ,
	             |	РасходТМЦ.ТрудоваяРоль КАК ТрудоваяРоль
	             |ПОМЕСТИТЬ РасходТМЦ
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		РасходМатериаловОбороты.Сотрудник КАК Сотрудник,
	             |		РасходМатериаловОбороты.Номенклатура.КатегорияВыработки КАК КатегорияВыработки,
	             |		РасходМатериаловОбороты.Материал КАК Номенклатура,
	             |		РасходМатериаловОбороты.ХарактеристикаМатериала КАК ХарактеристикаНоменклатуры,
	             |		РасходМатериаловОбороты.РасходФактическийОборот КАК Количество,
	             |		РасходМатериаловОбороты.Период КАК Период,
	             |		РасходМатериаловОбороты.Регистратор КАК Регистратор,
	             |		ВЫБОР
	             |			КОГДА РасходМатериаловОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Материал)
	             |				ТОГДА ИСТИНА
	             |			КОГДА РасходМатериаловОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	             |				ТОГДА ЛОЖЬ
	             |			ИНАЧЕ NULL
	             |		КОНЕЦ КАК РасходНаТМЦ,
	             |		ЗНАЧЕНИЕ(Справочник.ТрудовыеРоли.ПустаяСсылка) КАК ТрудоваяРоль
	             |	ИЗ
	             |		РегистрНакопления.РасходМатериалов.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК РасходМатериаловОбороты
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		ВыработкаСотрудниковОбороты.Сотрудник,
	             |		ВыработкаСотрудниковОбороты.Номенклатура.КатегорияВыработки,
	             |		ВыработкаСотрудниковОбороты.Номенклатура,
	             |		ВыработкаСотрудниковОбороты.ХарактеристикаНоменклатуры,
	             |		ВыработкаСотрудниковОбороты.КоличествоОборот,
	             |		НАЧАЛОПЕРИОДА(ВыработкаСотрудниковОбороты.Период, ДЕНЬ),
	             |		ВыработкаСотрудниковОбороты.Регистратор,
	             |		ИСТИНА,
	             |		ВыработкаСотрудниковОбороты.ТрудоваяРоль
	             |	ИЗ
	             |		РегистрНакопления.ВыработкаСотрудников.Обороты(&НачалоПериода, &КонецПериода, Запись, ТипВыработки = ЗНАЧЕНИЕ(Перечисление.ТипыВыработки.Товары)) КАК ВыработкаСотрудниковОбороты
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		РасходТМЦ.Сотрудник,
	             |		РасходТМЦ.КатегорияВыработки,
	             |		РасходТМЦ.Материал,
	             |		РасходТМЦ.ХарактеристикаМатериала,
	             |		РасходТМЦ.Количество,
	             |		НАЧАЛОПЕРИОДА(РасходТМЦ.Период, ДЕНЬ),
	             |		РасходТМЦ.Регистратор,
	             |		ЛОЖЬ,
	             |		РасходТМЦ.ТрудоваяРоль
	             |	ИЗ
	             |		РасходТМЦУслугиТрудовыхРолей КАК РасходТМЦ) КАК РасходТМЦ
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	РасходТМЦ.КатегорияВыработки,
	             |	РасходТМЦ.ХарактеристикаНоменклатуры,
	             |	РасходТМЦ.Сотрудник,
	             |	РасходТМЦ.Номенклатура,
	             |	НАЧАЛОПЕРИОДА(РасходТМЦ.Период, ДЕНЬ),
	             |	РасходТМЦ.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	             |	РасходТМЦ.Регистратор,
	             |	РасходТМЦ.РасходНаТМЦ,
	             |	РасходТМЦ.ТрудоваяРоль
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ЦеныНоменклатуры.Период КАК Период,
	             |	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	             |	ЦеныНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	             |	ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент КАК ЕдиницаИзмеренияКоэффициент,
	             |	ЦеныНоменклатуры.Цена КАК Цена,
	             |	ЦеныНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	             |ПОМЕСТИТЬ ЦеныНоменклатуры
	             |ИЗ
	             |	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |		РасходТМЦ.Номенклатура КАК Номенклатура
	             |	ИЗ
	             |		РасходТМЦ КАК РасходТМЦ) КАК НоменклатураРасхода
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	             |		ПО НоменклатураРасхода.Номенклатура = ЦеныНоменклатуры.Номенклатура
	             |			И (ЦеныНоменклатуры.Прейскурант = &ПрейскурантРасчетаСтоимостиМатериалов)
	             |			И (ЦеныНоменклатуры.Активность)
	             |			И (ЦеныНоменклатуры.Период <= &КонецПериода)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	НоменклатураСС.Номенклатура КАК Номенклатура,
	             |	НоменклатураСС.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	             |	НоменклатураСС.Дата КАК Дата,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(Цены.Цена, ЦеныБХ.Цена) ЕСТЬ NULL
	             |			ТОГДА 0
	             |		ИНАЧЕ ЕСТЬNULL(Цены.Цена, ЦеныБХ.Цена)
	             |	КОНЕЦ КАК Цена,
	             |	ЕСТЬNULL(Цены.ЕдиницаИзмерения, ЦеныБХ.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(Цены.ЕдиницаИзмерения, ЦеныБХ.ЕдиницаИзмерения) ЕСТЬ NULL
	             |			ТОГДА ЛОЖЬ
	             |		ИНАЧЕ ВЫБОР
	             |				КОГДА ЕСТЬNULL(Цены.ЕдиницаИзмерения, ЦеныБХ.ЕдиницаИзмерения) = НоменклатураСС.Номенклатура.ЕдиницаХраненияОстатков
	             |					ТОГДА ИСТИНА
	             |				ИНАЧЕ ЛОЖЬ
	             |			КОНЕЦ
	             |	КОНЕЦ КАК ЭтоЦенаЕХО
	             |ПОМЕСТИТЬ РасценкиТМЦ_Предварительная
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		РасходТМЦ.Номенклатура КАК Номенклатура,
	             |		РасходТМЦ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	             |		РасходТМЦ.Дата КАК Дата
	             |	ИЗ
	             |		РасходТМЦ КАК РасходТМЦ
	             |	
	             |	СГРУППИРОВАТЬ ПО
	             |		РасходТМЦ.ХарактеристикаНоменклатуры,
	             |		РасходТМЦ.Номенклатура,
	             |		РасходТМЦ.Дата) КАК НоменклатураСС
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			РасходЦены.Номенклатура КАК Номенклатура,
	             |			РасходЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	             |			РасходЦены.Дата КАК Дата,
	             |			ЦеныНоменклатуры.Цена * РасходЦены.НоменклатураЕХОКоэффициент / ВЫБОР
	             |				КОГДА ЦеныНоменклатуры.ЕдиницаИзмеренияКоэффициент = 0
	             |					ТОГДА 1
	             |				ИНАЧЕ ЦеныНоменклатуры.ЕдиницаИзмеренияКоэффициент
	             |			КОНЕЦ КАК Цена,
	             |			ЦеныНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	             |		ИЗ
	             |			(ВЫБРАТЬ
	             |				РасходТМЦ.Номенклатура КАК Номенклатура,
	             |				РасходТМЦ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	             |				РасходТМЦ.Дата КАК Дата,
	             |				РасходТМЦ.НоменклатураЕХОКоэффициент КАК НоменклатураЕХОКоэффициент,
	             |				МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	             |			ИЗ
	             |				РасходТМЦ КАК РасходТМЦ
	             |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	             |					ПО РасходТМЦ.Номенклатура = ЦеныНоменклатуры.Номенклатура
	             |						И РасходТМЦ.Дата >= ЦеныНоменклатуры.Период
	             |						И РасходТМЦ.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.ХарактеристикаНоменклатуры
	             |			
	             |			СГРУППИРОВАТЬ ПО
	             |				РасходТМЦ.Дата,
	             |				РасходТМЦ.Номенклатура,
	             |				РасходТМЦ.ХарактеристикаНоменклатуры,
	             |				РасходТМЦ.НоменклатураЕХОКоэффициент) КАК РасходЦены
	             |				ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	             |				ПО РасходЦены.Номенклатура = ЦеныНоменклатуры.Номенклатура
	             |					И РасходЦены.Период = ЦеныНоменклатуры.Период
	             |					И РасходЦены.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.ХарактеристикаНоменклатуры) КАК Цены
	             |		ПО НоменклатураСС.Номенклатура = Цены.Номенклатура
	             |			И НоменклатураСС.ХарактеристикаНоменклатуры = Цены.ХарактеристикаНоменклатуры
	             |			И НоменклатураСС.Дата = Цены.Дата
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			РасходЦены.Номенклатура КАК Номенклатура,
	             |			РасходЦены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	             |			РасходЦены.Дата КАК Дата,
	             |			ЦеныНоменклатуры.Цена * РасходЦены.НоменклатураЕХОКоэффициент / ВЫБОР
	             |				КОГДА ЦеныНоменклатуры.ЕдиницаИзмеренияКоэффициент = 0
	             |					ТОГДА 1
	             |				ИНАЧЕ ЦеныНоменклатуры.ЕдиницаИзмеренияКоэффициент
	             |			КОНЕЦ КАК Цена,
	             |			ЦеныНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	             |		ИЗ
	             |			(ВЫБРАТЬ
	             |				РасходТМЦ.Номенклатура КАК Номенклатура,
	             |				РасходТМЦ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	             |				РасходТМЦ.Дата КАК Дата,
	             |				РасходТМЦ.НоменклатураЕХОКоэффициент КАК НоменклатураЕХОКоэффициент,
	             |				МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период
	             |			ИЗ
	             |				РасходТМЦ КАК РасходТМЦ
	             |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	             |					ПО РасходТМЦ.Номенклатура = ЦеныНоменклатуры.Номенклатура
	             |						И РасходТМЦ.Дата >= ЦеныНоменклатуры.Период
	             |						И (ЦеныНоменклатуры.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	             |			
	             |			СГРУППИРОВАТЬ ПО
	             |				РасходТМЦ.Дата,
	             |				РасходТМЦ.Номенклатура,
	             |				РасходТМЦ.ХарактеристикаНоменклатуры,
	             |				РасходТМЦ.НоменклатураЕХОКоэффициент) КАК РасходЦены
	             |				ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	             |				ПО РасходЦены.Номенклатура = ЦеныНоменклатуры.Номенклатура
	             |					И РасходЦены.Период = ЦеныНоменклатуры.Период
	             |					И (ЦеныНоменклатуры.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))) КАК ЦеныБХ
	             |		ПО НоменклатураСС.Номенклатура = ЦеныБХ.Номенклатура
	             |			И НоменклатураСС.ХарактеристикаНоменклатуры = ЦеныБХ.ХарактеристикаНоменклатуры
	             |			И НоменклатураСС.Дата = ЦеныБХ.Дата
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	РасценкиТМЦ_Предварительная.Номенклатура КАК Номенклатура,
	             |	РасценкиТМЦ_Предварительная.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	             |	РасценкиТМЦ_Предварительная.Дата КАК Дата,
	             |	РасценкиТМЦ_Предварительная.Цена КАК Цена
	             |ПОМЕСТИТЬ РасценкиТМЦ
	             |ИЗ
	             |	РасценкиТМЦ_Предварительная КАК РасценкиТМЦ_Предварительная
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			РасценкиТМЦ_Предварительная.Номенклатура КАК Номенклатура,
	             |			РасценкиТМЦ_Предварительная.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	             |			РасценкиТМЦ_Предварительная.Дата КАК Дата,
	             |			МИНИМУМ(РасценкиТМЦ_Предварительная.ЕдиницаИзмерения) КАК ЕдиницаИзмерения
	             |		ИЗ
	             |			РасценкиТМЦ_Предварительная КАК РасценкиТМЦ_Предварительная
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			РасценкиТМЦ_Предварительная.Номенклатура,
	             |			РасценкиТМЦ_Предварительная.ХарактеристикаНоменклатуры,
	             |			РасценкиТМЦ_Предварительная.Дата) КАК МаксимальныеЕдиницыЦенРасходаТМЦ
	             |		ПО РасценкиТМЦ_Предварительная.Номенклатура = МаксимальныеЕдиницыЦенРасходаТМЦ.Номенклатура
	             |			И РасценкиТМЦ_Предварительная.ХарактеристикаНоменклатуры = МаксимальныеЕдиницыЦенРасходаТМЦ.ХарактеристикаНоменклатуры
	             |			И РасценкиТМЦ_Предварительная.ХарактеристикаНоменклатуры = МаксимальныеЕдиницыЦенРасходаТМЦ.ХарактеристикаНоменклатуры
	             |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	             |			РасценкиТМЦ_Предварительная.Номенклатура КАК Номенклатура,
	             |			РасценкиТМЦ_Предварительная.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	             |			РасценкиТМЦ_Предварительная.Дата КАК Дата,
	             |			МАКСИМУМ(РасценкиТМЦ_Предварительная.ЭтоЦенаЕХО) КАК ЭтоЦенаЕХО
	             |		ИЗ
	             |			РасценкиТМЦ_Предварительная КАК РасценкиТМЦ_Предварительная
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			РасценкиТМЦ_Предварительная.Номенклатура,
	             |			РасценкиТМЦ_Предварительная.ХарактеристикаНоменклатуры,
	             |			РасценкиТМЦ_Предварительная.Дата) КАК РасценкиПоЕХО
	             |		ПО РасценкиТМЦ_Предварительная.Номенклатура = РасценкиПоЕХО.Номенклатура
	             |			И РасценкиТМЦ_Предварительная.ХарактеристикаНоменклатуры = РасценкиПоЕХО.ХарактеристикаНоменклатуры
	             |			И РасценкиТМЦ_Предварительная.Дата = РасценкиПоЕХО.Дата
	             |ГДЕ
	             |	ВЫБОР
	             |			КОГДА РасценкиПоЕХО.ЭтоЦенаЕХО ЕСТЬ NULL
	             |					ИЛИ РасценкиПоЕХО.ЭтоЦенаЕХО = ЛОЖЬ
	             |				ТОГДА ВЫБОР
	             |						КОГДА НЕ МаксимальныеЕдиницыЦенРасходаТМЦ.ЕдиницаИзмерения ЕСТЬ NULL
	             |								И МаксимальныеЕдиницыЦенРасходаТМЦ.ЕдиницаИзмерения = РасценкиТМЦ_Предварительная.ЕдиницаИзмерения
	             |							ТОГДА ИСТИНА
	             |						ИНАЧЕ ЛОЖЬ
	             |					КОНЕЦ
	             |			ИНАЧЕ ВЫБОР
	             |					КОГДА РасценкиТМЦ_Предварительная.ЭтоЦенаЕХО = ИСТИНА
	             |						ТОГДА ИСТИНА
	             |					ИНАЧЕ ЛОЖЬ
	             |				КОНЕЦ
	             |		КОНЕЦ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |УНИЧТОЖИТЬ ЦеныНоменклатуры
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	РасходТМЦ.Сотрудник КАК Сотрудник,
	             |	РасходТМЦ.КатегорияВыработки КАК КатегорияВыработки,
	             |	СУММА(РасходТМЦ.Количество * РасценкиТМЦ.Цена) КАК Себестоимость,
	             |	РасходТМЦ.Дата КАК Дата,
	             |	РасходТМЦ.ТрудоваяРоль КАК ТрудоваяРоль,
	             |	РасходТМЦ.Регистратор КАК Регистратор,
	             |	РасходТМЦ.РасходНаТМЦ КАК РасходНаТМЦ
	             |ПОМЕСТИТЬ СебестоимостьВыработки
	             |ИЗ
	             |	РасценкиТМЦ КАК РасценкиТМЦ
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РасходТМЦ КАК РасходТМЦ
	             |		ПО РасценкиТМЦ.Номенклатура = РасходТМЦ.Номенклатура
	             |			И РасценкиТМЦ.ХарактеристикаНоменклатуры = РасходТМЦ.ХарактеристикаНоменклатуры
	             |			И РасценкиТМЦ.Дата = РасходТМЦ.Дата
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	РасходТМЦ.Сотрудник,
	             |	РасходТМЦ.КатегорияВыработки,
	             |	РасходТМЦ.Дата,
	             |	РасходТМЦ.ТрудоваяРоль,
	             |	РасходТМЦ.Регистратор,
	             |	РасходТМЦ.РасходНаТМЦ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |УНИЧТОЖИТЬ РасценкиТМЦ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |УНИЧТОЖИТЬ РасценкиТМЦ_Предварительная
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |УНИЧТОЖИТЬ РасходТМЦ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВыработкаСотрудников.Сотрудник КАК Сотрудник,
	             |	ВыработкаСотрудников.Период КАК Период,
	             |	ВыработкаСотрудников.КатегорияВыработки КАК КатегорияВыработки,
	             |	ВыработкаСотрудников.Ответственный КАК Ответственный,
	             |	ВыработкаСотрудников.Филиал КАК Филиал,
	             |	ВыработкаСотрудников.Сумма КАК Сумма,
	             |	ВыработкаСотрудников.СуммаБезСкидок КАК СуммаБезСкидок,
	             |	ВыработкаСотрудников.Количество КАК Количество,
	             |	ВыработкаСотрудников.Себестоимость КАК Себестоимость,
	             |	ВыработкаСотрудников.СтоимостьПоПрайсу КАК СтоимостьПоПрайсу,
	             |	ВыработкаСотрудников.Материал КАК Материал,
	             |	ВыработкаСотрудников.ТрудоваяРоль КАК ТрудоваяРоль
	             |ПОМЕСТИТЬ Выработка
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		ВыработкаСотрудников.Сотрудник КАК Сотрудник,
	             |		ВыработкаСотрудников.КатегорияВыработки КАК КатегорияВыработки,
	             |		СУММА(ВыработкаСотрудников.Сумма) КАК Сумма,
	             |		СУММА(ВыработкаСотрудников.СуммаБезСкидок) КАК СуммаБезСкидок,
	             |		СУММА(ВыработкаСотрудников.Количество) КАК Количество,
	             |		СУММА(ЕСТЬNULL(СебестоимостьВыработки.Себестоимость, 0)) КАК Себестоимость,
	             |		ВыработкаСотрудников.Период КАК Период,
	             |		ВыработкаСотрудников.Ответственный КАК Ответственный,
	             |		ВыработкаСотрудников.Филиал КАК Филиал,
	             |		СУММА(ВыработкаСотрудников.СтоимостьПоПрайсу) КАК СтоимостьПоПрайсу,
	             |		ВыработкаСотрудников.Материал КАК Материал,
	             |		ВыработкаСотрудников.ТрудоваяРоль КАК ТрудоваяРоль
	             |	ИЗ
	             |		(ВЫБРАТЬ
	             |			ВыработкаСотрудников.Сотрудник КАК Сотрудник,
	             |			СУММА(ВыработкаСотрудников.СуммаОборот) КАК Сумма,
	             |			СУММА(ВыработкаСотрудников.СуммаБезСкидокОборот) КАК СуммаБезСкидок,
	             |			СУММА(ВыработкаСотрудников.КоличествоОборот) КАК Количество,
	             |			ВыработкаСотрудников.Номенклатура.КатегорияВыработки КАК КатегорияВыработки,
	             |			НАЧАЛОПЕРИОДА(ВыработкаСотрудников.Период, ДЕНЬ) КАК Период,
	             |			ВыработкаСотрудников.Регистратор.Ответственный КАК Ответственный,
	             |			ВыработкаСотрудников.Филиал КАК Филиал,
	             |			СУММА(ЕСТЬNULL(ЦеныНоменклатуры.Цена * ВыработкаСотрудников.КоличествоОборот, 0)) КАК СтоимостьПоПрайсу,
	             |			ВЫБОР
	             |				КОГДА ВыработкаСотрудников.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Материал)
	             |					ТОГДА ИСТИНА
	             |				КОГДА ВыработкаСотрудников.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	             |					ТОГДА ЛОЖЬ
	             |				ИНАЧЕ NULL
	             |			КОНЕЦ КАК Материал,
	             |			ВыработкаСотрудников.ТрудоваяРоль КАК ТрудоваяРоль,
	             |			ВыработкаСотрудников.Регистратор КАК Регистратор
	             |		ИЗ
	             |			РегистрНакопления.ВыработкаСотрудников.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК ВыработкаСотрудников
	             |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	             |						&КонецПериода,
	             |						Прейскурант = &ПрейскурантРасчетаСтоимостиМатериалов
	             |							И (НЕ Номенклатура ССЫЛКА Справочник.Номенклатура
	             |								ИЛИ Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	             |								ИЛИ Номенклатура.ЕдиницаХраненияОстатков = ЕдиницаИзмерения)) КАК ЦеныНоменклатуры
	             |				ПО ВыработкаСотрудников.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.ХарактеристикаНоменклатуры
	             |					И ВыработкаСотрудников.Номенклатура = ЦеныНоменклатуры.Номенклатура
				 |					И (ЦеныНоменклатуры.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
				 |						ИЛИ ВыработкаСотрудников.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга))
	             |		
	             |		СГРУППИРОВАТЬ ПО
	             |			ВыработкаСотрудников.Сотрудник,
	             |			ВыработкаСотрудников.Номенклатура.КатегорияВыработки,
	             |			НАЧАЛОПЕРИОДА(ВыработкаСотрудников.Период, ДЕНЬ),
	             |			ВыработкаСотрудников.Регистратор.Ответственный,
	             |			ВыработкаСотрудников.Филиал,
	             |			ВЫБОР
	             |				КОГДА ВыработкаСотрудников.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Материал)
	             |					ТОГДА ИСТИНА
	             |				КОГДА ВыработкаСотрудников.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	             |					ТОГДА ЛОЖЬ
	             |				ИНАЧЕ NULL
	             |			КОНЕЦ,
	             |			ВыработкаСотрудников.ТрудоваяРоль,
	             |			ВыработкаСотрудников.Регистратор) КАК ВыработкаСотрудников
	             |			ЛЕВОЕ СОЕДИНЕНИЕ СебестоимостьВыработки КАК СебестоимостьВыработки
	             |			ПО ВыработкаСотрудников.КатегорияВыработки = СебестоимостьВыработки.КатегорияВыработки
	             |				И (НАЧАЛОПЕРИОДА(ВыработкаСотрудников.Период, ДЕНЬ) = СебестоимостьВыработки.Дата)
	             |				И ВыработкаСотрудников.Сотрудник = СебестоимостьВыработки.Сотрудник
	             |				И ВыработкаСотрудников.ТрудоваяРоль = СебестоимостьВыработки.ТрудоваяРоль
	             |				И ВыработкаСотрудников.Материал = СебестоимостьВыработки.РасходНаТМЦ
	             |				И ВыработкаСотрудников.Регистратор = СебестоимостьВыработки.Регистратор
	             |	
	             |	СГРУППИРОВАТЬ ПО
	             |		ВыработкаСотрудников.Сотрудник,
	             |		ВыработкаСотрудников.КатегорияВыработки,
	             |		ВыработкаСотрудников.Период,
	             |		ВыработкаСотрудников.Ответственный,
	             |		ВыработкаСотрудников.Филиал,
	             |		ВыработкаСотрудников.Материал,
	             |		ВыработкаСотрудников.ТрудоваяРоль) КАК ВыработкаСотрудников
	             |
	             |ИНДЕКСИРОВАТЬ ПО
	             |	Сотрудник,
	             |	ТрудоваяРоль,
	             |	Ответственный,
	             |	Филиал
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |УНИЧТОЖИТЬ СебестоимостьВыработки
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ПараметрыСдельныхНачислений.Сотрудник КАК Сотрудник,
	             |	ПараметрыСдельныхНачислений.ТрудоваяРоль КАК ТрудоваяРоль,
	             |	ПараметрыСдельныхНачислений.Показатель КАК Показатель,
	             |	ПараметрыСдельныхНачислений.ПериодНачала КАК ПериодНачала,
	             |	ПараметрыСдельныхНачислений.ПериодПрекращения КАК ПериодПрекращения,
	             |	ПараметрыСдельныхНачислений.ВидПараметра КАК ВидПараметра,
	             |	ПараметрыСдельныхНачислений.ПоказательРасчета КАК ПоказательРасчета,
	             |	Выработка.Период КАК Период,
	             |	Выработка.КатегорияВыработки КАК КатегорияВыработки,
	             |	Выработка.Ответственный КАК Ответственный,
	             |	Выработка.Филиал КАК Филиал,
	             |	Выработка.Сумма КАК Сумма,
	             |	Выработка.СуммаБезСкидок КАК СуммаБезСкидок,
	             |	Выработка.Количество КАК Количество,
	             |	Выработка.Себестоимость КАК Себестоимость,
	             |	Выработка.СтоимостьПоПрайсу КАК СтоимостьПоПрайсу,
	             |	Выработка.Материал КАК Материал
	             |ИЗ
	             |	ПараметрыСдельныхНачислений КАК ПараметрыСдельныхНачислений
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Выработка КАК Выработка
	             |		ПО (Выработка.Сотрудник = ПараметрыСдельныхНачислений.Сотрудник
	             |				И (Выработка.Период МЕЖДУ ПараметрыСдельныхНачислений.ПериодНачала И ПараметрыСдельныхНачислений.ПериодПрекращения)
	             |				И (Выработка.КатегорияВыработки = ПараметрыСдельныхНачислений.Показатель
	             |					ИЛИ ПараметрыСдельныхНачислений.ВидПараметра = ЗНАЧЕНИЕ(Перечисление.ВидыПараметровРасчетаНачислений.ВсеУслуги)
	             |					ИЛИ ПараметрыСдельныхНачислений.ВидПараметра = ЗНАЧЕНИЕ(Перечисление.ВидыПараметровРасчетаНачислений.ВсеТовары))
	             |				И Выработка.ТрудоваяРоль = ПараметрыСдельныхНачислений.ТрудоваяРоль)
	             |			И (&Филиал = НЕОПРЕДЕЛЕНО
	             |				ИЛИ Выработка.Филиал = &Филиал)";
				 
	ВыборкаПоказателиПрямойВыработки = Запрос.Выполнить().Выбрать();
	
	ДопСерверныеФункции.УничтожитьВременнуюТаблицуЗапроса(Запрос, "Выработка");
	
	Возврат ВыборкаПоказателиПрямойВыработки;
	
КонецФункции

Процедура ПодготовитьДанныеДляОценкиПоПрейскуранту(Запрос, ТаблицаПараметровРасчета)
	
	// Получение сотрудников и прейскурантов
	Сотрудники = Новый Массив;
	Прейскуранты = Новый Массив;
	ПараметрыОценка = ТаблицаПараметровРасчета.НайтиСтроки(Новый Структура("ВидПараметра", Перечисления.ВидыПараметровРасчетаНачислений.ОценкаПоПрейскуранту));
	Для Каждого ПараметрОценка Из ПараметрыОценка Цикл
		ОбщегоНазначенияКлиентСервер.ДобавитьВМассивБезДублей(Сотрудники, ПараметрОценка.Сотрудник);
		ОбщегоНазначенияКлиентСервер.ДобавитьВМассивБезДублей(Прейскуранты, ПараметрОценка.Показатель);
	КонецЦикла;
	
	Если Сотрудники.Количество() <> 0 Тогда
		ПодготовитьВыработкуДляОценкиПоПрейскуранту(Запрос, Сотрудники);
		ПодготовитьЦеныДляОценкиПоПрейскуранту(Запрос, Прейскуранты);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьВыработкуДляОценкиПоПрейскуранту(Запрос, Сотрудники)
	
	// Помещение выработки под оценку во временную таблицу запроса.
	Запрос.УстановитьПараметр("Сотрудники", Сотрудники);
	Запрос.УстановитьПараметр("Филиал", ?(ПоОдномуФилиалу, Филиал, Неопределено));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыработкаСотрудников.Сотрудник КАК Сотрудник,
	|	СУММА(ВыработкаСотрудников.СуммаОборот) КАК Сумма,
	|	СУММА(ВыработкаСотрудников.СуммаБезСкидокОборот) КАК СуммаБезСкидок,
	|	СУММА(ВыработкаСотрудников.КоличествоОборот) КАК Количество,
	|	НАЧАЛОПЕРИОДА(ВыработкаСотрудников.Период, ДЕНЬ) КАК Дата,
	|	ВыработкаСотрудников.Номенклатура КАК Номенклатура,
	|	ВыработкаСотрудников.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВыработкаСотрудников.Номенклатура.КатегорияВыработки КАК Специализация,
	|	ВыработкаСотрудников.ТрудоваяРоль КАК ТрудоваяРоль
	|ПОМЕСТИТЬ ВыработкаСНоменклатурой
	|ИЗ
	|	РегистрНакопления.ВыработкаСотрудников.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			ДЕНЬ,
	|			Сотрудник В (&Сотрудники)
	|				И (&Филиал = НЕОПРЕДЕЛЕНО
	|					ИЛИ Филиал В (&Филиал))) КАК ВыработкаСотрудников
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыработкаСотрудников.Сотрудник,
	|	ВыработкаСотрудников.Номенклатура,
	|	ВыработкаСотрудников.ХарактеристикаНоменклатуры,
	|	НАЧАЛОПЕРИОДА(ВыработкаСотрудников.Период, ДЕНЬ),
	|	ВыработкаСотрудников.Номенклатура.КатегорияВыработки,
	|	ВыработкаСотрудников.ТрудоваяРоль"
	;
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ПодготовитьЦеныДляОценкиПоПрейскуранту(Запрос, Прейскуранты)
	
	// Помещение выработки под оценку во временную таблицу запроса.
	Запрос.УстановитьПараметр("Прейскурант", Прейскуранты);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрез.Период КАК Период,
	|	ЦеныНоменклатурыСрез.Прейскурант КАК Прейскурант,
	|	ЦеныНоменклатурыСрез.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрез.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЦеныНоменклатурыСрез.ЕдиницаИзмерения.Коэффициент КАК ЕдиницаИзмеренияКоэффициент,
	|	ЦеныНоменклатурыСрез.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК ЕХОКоэффициент,
	|	ЦеныНоменклатурыСрез.Цена КАК Цена
	|ПОМЕСТИТЬ ПрейскурантыДляОценкиПоПрейскуранту
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НачалоПериода, Прейскурант В (&Прейскурант)) КАК ЦеныНоменклатурыСрез
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныНоменклатуры.Период,
	|	ЦеныНоменклатуры.Прейскурант,
	|	ЦеныНоменклатуры.Номенклатура,
	|	ЦеныНоменклатуры.ХарактеристикаНоменклатуры,
	|	ЦеныНоменклатуры.ЕдиницаИзмерения.Коэффициент,
	|	ЦеныНоменклатуры.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент,
	|	ЦеныНоменклатуры.Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|ГДЕ
	|	ЦеныНоменклатуры.Прейскурант В(&Прейскурант)
	|	И ЦеныНоменклатуры.Период МЕЖДУ &НачалоПериода И &КонецПериода"
	;
	Запрос.Выполнить();
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныСпециализацийСрез.Период КАК Период,
	|	ЦеныСпециализацийСрез.Прейскурант КАК Прейскурант,
	|	ЦеныСпециализацийСрез.Цена КАК Цена,
	|	ЦеныСпециализацийСрез.Специализация КАК Специализация
	|ПОМЕСТИТЬ ПрейскурантыСпециализацийДляОценкиПоПрейскуранту
	|ИЗ
	|	РегистрСведений.ЦеныСпециализаций.СрезПоследних(&НачалоПериода, Прейскурант В (&Прейскурант)) КАК ЦеныСпециализацийСрез
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЦеныСпециализаций.Период,
	|	ЦеныСпециализаций.Прейскурант,
	|	ЦеныСпециализаций.Цена,
	|	ЦеныСпециализаций.Специализация
	|ИЗ
	|	РегистрСведений.ЦеныСпециализаций КАК ЦеныСпециализаций
	|ГДЕ
	|	ЦеныСпециализаций.Прейскурант В(&Прейскурант)
	|	И ЦеныСпециализаций.Период МЕЖДУ &НачалоПериода И &КонецПериода"
	;
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ВыработкаДляОценкиПоПрейскуранту(Запрос, Сотрудник, ТрудоваяРоль, Прейскурант, Показатель, НачалоПериодаРасчета, КонецПериодаРасчета)
	
	Запрос.УстановитьПараметр("Сотрудник",		 Сотрудник);
	Запрос.УстановитьПараметр("НачалоПериода",	 Макс(НачалоПериода, НачалоПериодаРасчета));
	Запрос.УстановитьПараметр("КонецПериода",	 Мин(КонецПериода,	 КонецПериодаРасчета));
	Запрос.УстановитьПараметр("ТрудоваяРоль",	 ТрудоваяРоль);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВН.Сумма) КАК Сумма,
	|	СУММА(ВН.СуммаБезСкидок) КАК СуммаБезСкидок,
	|	СУММА(ВН.Количество) КАК Количество,
	|	ВН.Дата КАК Дата,
	|	ВН.Номенклатура КАК Номенклатура,
	|	ВН.ХарактеристикаНоменклатуры КАК Характеристика,
	|	ВН.Специализация КАК Специализация
	|ИЗ
	|	ВыработкаСНоменклатурой КАК ВН
	|ГДЕ
	|	ВН.Сотрудник = &Сотрудник
	|	И ВН.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВН.ТрудоваяРоль = &ТрудоваяРоль
	|
	|СГРУППИРОВАТЬ ПО
	|	ВН.Номенклатура,
	|	ВН.ХарактеристикаНоменклатуры,
	|	ВН.Дата,
	|	ВН.Специализация"
	;
	ВыбВыработка = Запрос.Выполнить().Выбрать();
	
	Выработка = 0;
	ТипНоменклатура = Тип("СправочникСсылка.Номенклатура");
	
	Пока ВыбВыработка.Следующий() Цикл
		
		ЗначениеПоказателя = ПолучитьЗначениеПоВарификатору(ВыбВыработка, Показатель);
		
		Цена = ВыработкаДляОценкиПоПрейскуранту_ОценитьПоПрейскуранту(Запрос, Прейскурант, ВыбВыработка.Дата, ВыбВыработка.Номенклатура, ВыбВыработка.Характеристика);
		Если Цена = Неопределено
			И ТипЗнч(ВыбВыработка.Номенклатура) = ТипНоменклатура
		Тогда
			Цена = ВыработкаДляОценкиПоПрейскуранту_ОценитьПоПрейскурантуСпециализаций(Запрос, Прейскурант, ВыбВыработка.Дата, ВыбВыработка.Специализация);
		КонецЕсли;
		
		Если Цена <> Неопределено Тогда
			Выработка = Выработка + ЗначениеПоказателя * Цена;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Выработка;
	
КонецФункции

Функция ВыработкаДляОценкиПоПрейскуранту_ОценитьПоПрейскуранту(Запрос, Прейскурант, Дата, Номенклатура, Характеристика)
	
	Цена = Неопределено;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Цены.Номенклатура КАК Номенклатура,
	|	Цены.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	Цены.Цена КАК Цена,
	|	Цены.ЕдиницаИзмеренияКоэффициент КАК ЕдиницаИзмеренияКоэффициент,
	|	Цены.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК ЕХОКоэффициент
	|ИЗ
	|	ПрейскурантыДляОценкиПоПрейскуранту КАК Цены
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(Цены.Период) КАК Период
	|		ИЗ
	|			ПрейскурантыДляОценкиПоПрейскуранту КАК Цены
	|		ГДЕ
	|			Цены.Номенклатура = &Номенклатура
	|			И (&Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) ИЛИ Цены.ХарактеристикаНоменклатуры = &Характеристика)
	|			И Цены.Период <= &Дата И Цены.Прейскурант = &Прейскурант) КАК ПериодМаксимум
	|		ПО Цены.Период = ПериодМаксимум.Период
	|			И Цены.Номенклатура = &Номенклатура И Цены.Прейскурант = &Прейскурант
	|			И (&Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) ИЛИ Цены.ХарактеристикаНоменклатуры = &Характеристика)"
	;
	Запрос.УстановитьПараметр("Дата",			 Дата);
	Запрос.УстановитьПараметр("Прейскурант",	 Прейскурант);
	Запрос.УстановитьПараметр("Номенклатура",	 Номенклатура);
	
	Сочетания = Новый Массив;
	Сочетания.Добавить(Новый Структура("Характеристика", Характеристика));
	Если ЗначениеЗаполнено(Характеристика) Тогда
		Сочетания.Добавить(Новый Структура("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка())); // Если не получится, то далее поищем цену для пустой характеристики.
	КонецЕсли;
	
	Для Каждого Сочетание Из Сочетания Цикл
		Для Каждого КлючЗначение Из Сочетание Цикл
			Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
		ВыбЦены = Запрос.Выполнить().Выбрать();
		Если ВыбЦены.Следующий() Тогда
			
			Если ВыбЦены.Цена = Ценообразование.КонстантаОтмененнаяЦена() Тогда
				Продолжить;
			КонецЕсли;
			
			Цена = ВыбЦены.Цена;
			
			Если ЗначениеЗаполнено(ВыбЦены.ЕдиницаИзмеренияКоэффициент)
				И ЗначениеЗаполнено(ВыбЦены.ЕХОКоэффициент)
			Тогда
				Цена = Цена * ВыбЦены.ЕХОКоэффициент / ВыбЦены.ЕдиницаИзмеренияКоэффициент;
			КонецЕсли;
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Цена;
	
КонецФункции

Функция ВыработкаДляОценкиПоПрейскуранту_ОценитьПоПрейскурантуСпециализаций(Запрос, Прейскурант, Дата, Специализация)
	
	Цена = Неопределено;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Цены.Специализация КАК Специализация,
	|	Цены.Цена КАК Цена
	|ИЗ
	|	ПрейскурантыСпециализацийДляОценкиПоПрейскуранту КАК Цены
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(Цены.Период) КАК Период
	|		ИЗ
	|			ПрейскурантыСпециализацийДляОценкиПоПрейскуранту КАК Цены
	|		ГДЕ
	|			Цены.Специализация = &Специализация
	|			И Цены.Период <= &Дата
	|			И Цены.Прейскурант = &Прейскурант) КАК ПериодМаксимум
	|		ПО Цены.Период = ПериодМаксимум.Период
	|			И (Цены.Специализация = &Специализация)
	|			И (Цены.Прейскурант = &Прейскурант)"
	;
	Запрос.УстановитьПараметр("Дата",			 Дата);
	Запрос.УстановитьПараметр("Прейскурант",	 Прейскурант);
	Запрос.УстановитьПараметр("Специализация",	 Специализация);
	
	Сочетания = Новый Массив;
	Сочетания.Добавить(Новый Структура("Специализация", Специализация));
	Если ЗначениеЗаполнено(Специализация) Тогда
		Сочетания.Добавить(Новый Структура("Специализация", Справочники.КатегорииВыработки.ПустаяСсылка()));
	КонецЕсли;
	
	Для Каждого Сочетание Из Сочетания Цикл
		Для Каждого КлючЗначение Из Сочетание Цикл
			Запрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
		КонецЦикла;
		
		ВыбЦены = Запрос.Выполнить().Выбрать();
		Если ВыбЦены.Следующий() Тогда
			
			Если ВыбЦены.Цена = Ценообразование.КонстантаОтмененнаяЦена() Тогда
				Продолжить;
			КонецЕсли;
			
			Цена = ВыбЦены.Цена;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Цена;
	
КонецФункции

Функция СформироватьВыборкуПрямойВыработки_ВыборкаТребуется(ТаблицаПараметровРасчета)
	
	ВидыПараметровТребующиеВыборку = Новый Массив;
	ВидыПараметровТребующиеВыборку.Добавить(Перечисления.ВидыПараметровРасчетаНачислений.КатегорияВыработки);
	ВидыПараметровТребующиеВыборку.Добавить(Перечисления.ВидыПараметровРасчетаНачислений.ВсеТовары);
	ВидыПараметровТребующиеВыборку.Добавить(Перечисления.ВидыПараметровРасчетаНачислений.ВсеУслуги);
	
	ВыборкаТребуется = Ложь;
	Для Каждого Строка Из ТаблицаПараметровРасчета Цикл
		Если ВидыПараметровТребующиеВыборку.Найти(Строка.ВидПараметра) <> Неопределено Тогда
			ВыборкаТребуется = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВыборкаТребуется;
	
КонецФункции

Функция СформироватьНормыПоГрафику(ТаблицаПараметровРасчета)
	
	ТаблицаПараметровРасчетаОкладПоГрафику = ТаблицаПараметровРасчета.Скопировать();
	мОбрИнд = ТаблицаПараметровРасчетаОкладПоГрафику.Количество()-1;
	Для сч = 0 по мОбрИнд Цикл
		СтрокаТЗ = ТаблицаПараметровРасчетаОкладПоГрафику[мОбрИнд-сч];
		Если СтрокаТЗ.ВидПараметра <> Перечисления.ВидыПараметровРасчетаНачислений.ДанныеТабеля 
			ИЛИ СтрокаТЗ.Показатель = Перечисления.ПоказателиРасчетаНачислений.КоличествоДнейПоТабелю
			ИЛИ СтрокаТЗ.Показатель = Перечисления.ПоказателиРасчетаНачислений.КоличествоЧасовПоТабелю
		Тогда
			ТаблицаПараметровРасчетаОкладПоГрафику.Удалить(мОбрИнд-сч);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	ДопСерверныеФункции.ПоместитьТаблицуЗначенийВоВременнуюТаблицу(ТаблицаПараметровРасчетаОкладПоГрафику, "ПараметрыСдельныхНачислений", Запрос, "Сотрудник, Показатель, ВидПараметра, ПоказательРасчета");
	
	Запрос.Текст="ВЫБРАТЬ
	             |	НормыГрафиков.ВидГрафика,
	             |	НормыГрафиков.Дней КАК ДнейПоНорме,
	             |	НормыГрафиков.Часов КАК ЧасовПоНорме,
	             |	НормыГрафиков.Дата КАК Месяц
	             |
	             |ИЗ
	             |	РегистрСведений.НормыГрафиков КАК НормыГрафиков
	             |ГДЕ
	             |	НормыГрафиков.Дата >= &ДатаНачала
	             |	И НормыГрафиков.Дата <= &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(КонецПериода));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция СформироватьТаблицуТабельныхДанных(ТаблицаПараметровРасчета)
	
	СотрудникиДляПолученияТабеля = Новый Массив;
	Для Каждого СтрокаПараметраРасчета Из ТаблицаПараметровРасчета Цикл
		Если (	СтрокаПараметраРасчета.ПоказательРасчета = Перечисления.ПоказателиРасчетаНачислений.КоличествоДнейПоТабелю 
			Или СтрокаПараметраРасчета.ПоказательРасчета = Перечисления.ПоказателиРасчетаНачислений.КоличествоЧасовПоТабелю
			Или СтрокаПараметраРасчета.ПоказательРасчета = Перечисления.ПоказателиРасчетаНачислений.ДнейОтработаноПоНорме
			Или СтрокаПараметраРасчета.ПоказательРасчета = Перечисления.ПоказателиРасчетаНачислений.ЧасовОтработаноПоНорме
			Или СтрокаПараметраРасчета.ПоказательРасчета = Перечисления.ПоказателиРасчетаНачислений.ДнейОтработаноСверхНормы
			Или СтрокаПараметраРасчета.ПоказательРасчета = Перечисления.ПоказателиРасчетаНачислений.ЧасовОтработаноСверхНормы
			)
			И СотрудникиДляПолученияТабеля.Найти(СтрокаПараметраРасчета.Сотрудник) = Неопределено
		Тогда
			СотрудникиДляПолученияТабеля.Добавить(СтрокаПараметраРасчета.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	ТаблицаТабелейПоДням = РасчетЗаработнойПлаты.ПолучитьДанныеТабеляСотрудинков(НачалоПериода, КонецПериода, СотрудникиДляПолученияТабеля, ?(ПоОдномуФилиалу, Филиал, Неопределено));
	
	Возврат ТаблицаТабелейПоДням;
	
КонецФункции

Процедура СформироватьВременнуюТаблицуНепрямойВыработки(Запрос)
	
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти("НепрямаяВыработка") <> Неопределено Тогда
		// Уже сформирована
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоПериода);
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(КонецПериода));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НепрямаяВыработка.Ответственный,
	|	НепрямаяВыработка.Филиал,
	|	СУММА(НепрямаяВыработка.Сумма) КАК Сумма,
	|	СУММА(НепрямаяВыработка.СуммаБезСкидок) КАК СуммаБезСкидок,
	|	СУММА(НепрямаяВыработка.Количество) КАК Количество,
	|	СУММА(НепрямаяВыработка.СуммаОплат) КАК СуммаОплат,
	|	СУММА(НепрямаяВыработка.СуммаПродажУслуги) КАК СуммаПродажУслуги,
	|	СУММА(НепрямаяВыработка.СуммаПродажТовары) КАК СуммаПродажТовары,
	|	СУММА(НепрямаяВыработка.СуммаПродажАбонементы) КАК СуммаПродажАбонементы,
	|	НепрямаяВыработка.Период
	|ПОМЕСТИТЬ НепрямаяВыработка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПродажиОбороты.Регистратор.Ответственный КАК Ответственный,
	|		ПродажиОбороты.Филиал КАК Филиал,
	|		ПродажиОбороты.СуммаОборот КАК Сумма,
	|		ПродажиОбороты.СуммаБезСкидокОборот КАК СуммаБезСкидок,
	|		ПродажиОбороты.КоличествоОборот КАК Количество,
	|		0 КАК СуммаОплат,
	|		НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ) КАК Период,
	|		ВЫБОР
	|			КОГДА ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|				ТОГДА ПродажиОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаПродажУслуги,
	|		ВЫБОР
	|			КОГДА ПродажиОбороты.Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Материал)
	|				ТОГДА ПродажиОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаПродажТовары,
	|		ВЫБОР
	|			КОГДА ПродажиОбороты.Номенклатура ССЫЛКА Справочник.ВидыСертификатов
	|				ТОГДА ПродажиОбороты.СуммаОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК СуммаПродажАбонементы
	|	ИЗ
	|		РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Регистратор, ) КАК ПродажиОбороты
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ОплатыОбороты.Регистратор.Ответственный,
	|		ОплатыОбороты.Филиал,
	|		0,
	|		0,
	|		0,
	|		ОплатыОбороты.СуммаОборот,
	|		НАЧАЛОПЕРИОДА(ОплатыОбороты.Период, ДЕНЬ),
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.Оплаты.Обороты(
	|				&ДатаНач,
	|				&ДатаКон,
	|				Регистратор,
	|				ВидОплаты = ЗНАЧЕНИЕ(перечисление.видыоплаты.наличными)
	|					ИЛИ ВидОплаты = ЗНАЧЕНИЕ(перечисление.видыоплаты.безналичные)) КАК ОплатыОбороты) КАК НепрямаяВыработка
	|
	|СГРУППИРОВАТЬ ПО
	|	НепрямаяВыработка.Филиал,
	|	НепрямаяВыработка.Ответственный,
	|	НепрямаяВыработка.Период"
	;
	Запрос.Выполнить();
	
КонецПроцедуры

// Начисления в базе, используемые для расчета других в этом документе
Процедура СформироватьВременнуюТаблицуПоБазовымВидамРасчета(Запрос, ТаблицаВсехНачислений, ВключатьМинимальныеОклады, ВключатьОбычныеНачисления)
	
	ФормулаМинимальныйОклад = Перечисления.ФормулыРасчетаЗаработнойПлаты.МинимальныйОклад;
	
	Сотрудники = Новый Массив;
	Для Каждого Строка Из ТаблицаВсехНачислений Цикл
		Если Сотрудники.Найти(Строка.Сотрудник) = Неопределено Тогда
			Если (ВключатьОбычныеНачисления И ВторичныеВидыНачисления.Найти(Строка.Начисление) <> Неопределено 
					Или ВключатьМинимальныеОклады И Строка.ФормулаРасчета = ФормулаМинимальныйОклад)
				И Строка.Начисление.ИсточникБазы <> Перечисления.ИсточникБазыВторичногоНачисленияПоСтруктуре.Документ
			Тогда
				Сотрудники.Добавить(Строка.Сотрудник);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Сотрудники.Количество() <> 0 Тогда
	
		Запрос.УстановитьПараметр("НачалоПериода",	 НачалоПериода);
		Запрос.УстановитьПараметр("КонецПериода",	 КонецДня(КонецПериода));
		Запрос.УстановитьПараметр("Сотрудники",		 Сотрудники);
		Запрос.УстановитьПараметр("ЭтотДокумент",	 Ссылка);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	НачисленияСотрудникамОбороты.Сотрудник КАК Сотрудник,
			|	НачисленияСотрудникамОбороты.СуммаОборот КАК Сумма,
			|	НачисленияСотрудникамОбороты.ВидРасчета.ПорядокРасчета КАК ПорядокРасчета,
			|	НачисленияСотрудникамОбороты.ВидРасчета КАК ВидРасчета,
			|	НачисленияСотрудникамОбороты.Регистратор.Филиал КАК Филиал,
			//|	НачисленияСотрудникамОбороты.Регистратор.Филиал.Организация КАК Организация,
			|	НачисленияСотрудникамОбороты.Период КАК Период
			|ПОМЕСТИТЬ ПервичныеНачисления
			|ИЗ
			|	РегистрНакопления.НачисленияСотрудникам.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Сотрудник В (&Сотрудники)) КАК НачисленияСотрудникамОбороты
			|ГДЕ
			|	НачисленияСотрудникамОбороты.ВидРасчета ССЫЛКА ПланВидовРасчета.Начисления
			|	И НачисленияСотрудникамОбороты.Регистратор <> &ЭтотДокумент";
		Запрос.Выполнить();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВыборкуНепрямойВыработки(Запрос, НаименованиеПараметра, СтрокаПараметраРасчета)
	
	Запрос.Текст="ВЫБРАТЬ
	             |"+?(ПустаяСтрока(НаименованиеПараметра),"","	Выработка."+НаименованиеПараметра+",") + "
	             |	СУММА(Выработка.Сумма)			 КАК Сумма,
	             |	СУММА(Выработка.СуммаБезСкидок)	 КАК СуммаБезСкидок,
	             |	СУММА(Выработка.Количество)		 КАК Количество,
	             |	СУММА(Выработка.СуммаОплат)		 КАК СуммаОплат,
				 |	СУММА(Выработка.СуммаПродажУслуги) 		КАК СуммаПродажУслуги,
				 |	СУММА(Выработка.СуммаПродажТовары) 		КАК СуммаПродажТовары,
				 |	СУММА(Выработка.СуммаПродажАбонементы) 	КАК СуммаПродажАбонементы,
				 |	Выработка.Период КАК Период
	             |ИЗ
	             |	НепрямаяВыработка КАК Выработка
	             |ГДЕ
				 |  Выработка.Период МЕЖДУ &ПериодНачала И &ПериодПрекращения  
	             |"+?(ПустаяСтрока(НаименованиеПараметра),"","	И Выработка."+НаименованиеПараметра+" = &ЗначениеПараметраОтбора") + "
	             |СГРУППИРОВАТЬ ПО
				 |	Выработка.Период"+?(ПустаяСтрока(НаименованиеПараметра),"",",
	             |	Выработка."+НаименованиеПараметра);
				 
	Запрос.УстановитьПараметр("ЗначениеПараметраОтбора"	,СтрокаПараметраРасчета.Показатель);
	Запрос.УстановитьПараметр("ПериодНачала"			,СтрокаПараметраРасчета.ПериодНачала);
	Запрос.УстановитьПараметр("ПериодПрекращения"		,СтрокаПараметраРасчета.ПериодПрекращения);
				 
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
	
КонецФункции

Функция ПолучитьЗначениеПоВарификатору(СтруктураВыработки, ТребуемыйПоказатель)
	
	Если ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.Сумма Тогда
		Результат = СтруктураВыработки["Сумма"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.СуммаБезСкидок Тогда
		Результат = СтруктураВыработки["СуммаБезСкидок"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.Себестоимость Тогда
		Результат = СтруктураВыработки["Себестоимость"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.Количество Тогда
		Результат = СтруктураВыработки["Количество"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.СуммаОплат Тогда
		Результат = СтруктураВыработки["СуммаОплат"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.СтоимостьПоПрайсу Тогда
		Результат = СтруктураВыработки["СтоимостьПоПрайсу"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.КоличествоДнейПоТабелю	Тогда
		Результат = СтруктураВыработки["КоличествоДнейПоТабелю"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.КоличествоЧасовПоТабелю Тогда
		Результат = СтруктураВыработки["КоличествоЧасовПоТабелю"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.СуммаПродажУслуг Тогда
		Результат = СтруктураВыработки["СуммаПродажУслуги"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.СуммаПродажТоваров Тогда
		Результат = СтруктураВыработки["СуммаПродажТовары"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.СуммаПродажАбонементов Тогда
		Результат = СтруктураВыработки["СуммаПродажАбонементы"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.ДнейПоНорме Тогда
		Результат = СтруктураВыработки["ДнейПоНорме"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.ДнейОтработаноПоНорме Тогда
		Результат = СтруктураВыработки["ДнейОтработаноПоНорме"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.ДнейОтработаноСверхНормы Тогда
		Результат = СтруктураВыработки["ДнейОтработаноСверхНормы"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.ЧасовПоНорме Тогда
		Результат = СтруктураВыработки["ЧасовПоНорме"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.ЧасовОтработаноПоНорме Тогда
		Результат = СтруктураВыработки["ЧасовОтработаноПоНорме"];
	ИначеЕсли ТребуемыйПоказатель = Перечисления.ПоказателиРасчетаНачислений.ЧасовОтработаноСверхНормы Тогда
		Результат = СтруктураВыработки["ЧасовОтработаноСверхНормы"];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПолучитьТаблицуЗначенийПараметраВидаРасчета(ВыбВидыРасчетаСотрудников,
														НомерПараметра,
														ТаблицаЗначенийПараметровРасчета,
														ТаблицыЗначенийПараметровВидаРасчета,
														МассивПериодов)
														
	Отбор = Новый Структура("Сотрудник,ТрудоваяРоль,Показатель,ПериодНачала,ПериодПрекращения,ПоказательРасчета,ВидПараметра");													
	ЗаполнитьЗначенияСвойств(Отбор, ВыбВидыРасчетаСотрудников);
	Отбор.ПоказательРасчета = ВыбВидыРасчетаСотрудников.ВидРасчета["ПоказательРасчета"+НомерПараметра];
	Отбор.Показатель = ВыбВидыРасчетаСотрудников["Показатель"+НомерПараметра];
	Отбор.ВидПараметра = ВыбВидыРасчетаСотрудников.ВидРасчета["ВидПараметра"+НомерПараметра];
	
	ТаблицаРезультат = ТаблицаЗначенийПараметровРасчета.СкопироватьКолонки();
	
	мсСтрокиЗначенийПараметра = ТаблицаЗначенийПараметровРасчета.НайтиСтроки(Отбор);
	Для Каждого СтрокаЗначенияПараметра Из мсСтрокиЗначенийПараметра Цикл
		СтрокаРезультат = ТаблицаРезультат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРезультат, СтрокаЗначенияПараметра);
		Если ЗначениеЗаполнено(СтрокаРезультат.Период) Тогда
			ВыровнятьПериодПоПериодичностиВидаРасчета(ВыбВидыРасчетаСотрудников.ВидРасчета,СтрокаРезультат.Период);
		КонецЕсли;
	КонецЦикла;
	
	// Свёртка по периодам
	Если ВыбВидыРасчетаСотрудников["Показатель"+НомерПараметра] <> Перечисления.ВидыПараметровРасчетаНачислений.Число Тогда
		СтрокаСвёртки = "";
		Для Каждого Колонка Из ТаблицаРезультат.Колонки Цикл
			Если Колонка.Имя <> "Значение" Тогда
				СтрокаСвёртки = СтрокаСвёртки + ?(ПустаяСтрока(СтрокаСвёртки),"",",") + Колонка.Имя;
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаРезультат.Свернуть(СтрокаСвёртки,"Значение");
		
		Для Каждого СтрокаРезультат Из ТаблицаРезультат Цикл
			Если МассивПериодов.Найти(СтрокаРезультат.Период) = Неопределено И
				 ЗначениеЗаполнено(СтрокаРезультат.Период)
			Тогда
				МассивПериодов.Добавить(СтрокаРезультат.Период);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	ТаблицыЗначенийПараметровВидаРасчета.Вставить("ЗначенияПараметра"+НомерПараметра,ТаблицаРезультат);
														
КонецПроцедуры														

Процедура СвернутьТаблицуБазыРасчета(ТаблицаБазаРасчета)
	
	ТаблицаБазаРасчета.Свернуть("Сотрудник,ТрудоваяРоль,ВидРасчета,Показатель1,Показатель2,Показатель3,ПериодНачисления,КатегорияВыработки","ЗначениеПоказателя1,ЗначениеПоказателя2,ЗначениеПоказателя3");
	
	// Исправление значений числовых показателей, которые завышаются сверткой.
	// Учитывается, что числовые показатели - константа для базы расчета.
	Для Каждого СтрокаРасчета из ТаблицаБазаРасчета Цикл
		Для НомерПоказателя = 1 По 3 Цикл
			Если ТипЗнч(СтрокаРасчета["Показатель"+НомерПоказателя]) = Тип("Число") Тогда
				СтрокаРасчета["ЗначениеПоказателя"+НомерПоказателя] = СтрокаРасчета["Показатель"+НомерПоказателя];
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Заполняет табличную часть "БазаРасчета" по реквизитам документа
//
// Параметры:
// 	ПостроительОтчета - построитель отчета с настройками отборов сотрудинков.
//
Процедура ЗаполнитьБазуРасчета(ПостроительОтчета = Неопределено) Экспорт
	
	БазаРасчета.Очистить();
	Начисления.Очистить();
	
	СписокСотрудников = ПолучитьСписокСотрудниковПоОтборам(ПостроительОтчета);
	
	ВторичныеВидыНачисления = РасчетЗаработнойПлаты.ПолучитьВидыНачисленияОтДругихВидов();
	ФормулыФиксированныхНачислений = ФормулыФиксированныхНачислений();
	
	////////////////////////////////////////////////////////////////////////////
	// ОМГ
	ТаблицаВсехНачислений = РасчетЗаработнойПлаты.ПолучитьСхемыЗП(СписокСотрудников, НачалоПериода, КонецПериода,,Филиал,омг_Организация);
	ТаблицаВсехНачислений.Свернуть("Владелец,Действие,ИсточникБазы,Начисление,Параметр1,Параметр2,Параметр3,Период,ПериодПрекращения,Персональное,ПорядокРасчета,Регистратор,Сотрудник,ТрудоваяРоль,ФормулаРасчета");
    // ОМГ
    //////////////////////////////////////////////////////////////////////////// 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("КонецПериода"	,КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("НачалоПериода"	,НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ПрейскурантРасчетаСтоимостиМатериалов",УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ПрейскурантРасчетаСтоимостиМатериалов"));
	Запрос.УстановитьПараметр("Филиал"			,?(ПоОдномуФилиалу = Истина, Филиал, Неопределено));
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	СформироватьВременнуюТаблицуПоБазовымВидамРасчета(Запрос, ТаблицаВсехНачислений, Ложь, Истина);
	
	// Расчет базы по начислениям с учетом порядка расчета
	ПорядкиРасчета = ВключенныеПорядкиРасчетаДокумента();
	Для Каждого ПорядокРасчета Из ПорядкиРасчета Цикл
		
		Если ВключатьСдельныеНачисления Тогда
			ПолучитьДанныеПоСдельнымНачислениям(Запрос, ТаблицаВсехНачислений, ПорядокРасчета);
	    	ЗаполнитьБазуРасчетаПоСдельнымНачислениям(Запрос, СписокСотрудников, ПорядокРасчета);
		КонецЕсли;
		
		Если ВключатьФиксированныеНачисления Тогда 
			ЗаполнитьБазуРасчетаПоЕжемесячнымНачислениям(Запрос, ТаблицаВсехНачислений, ПорядокРасчета);
		КонецЕсли;
	КонецЦикла;
	
	БазаРасчета.Сортировать("Сотрудник, ПериодНачисления, КатегорияВыработки");
	
КонецПроцедуры

Функция ВключенныеПорядкиРасчетаДокумента()
	
	Порядки = Новый Массив;
	
	Если ВключатьПервичныеНачисления Тогда
		Порядки.Добавить(1);
	КонецЕсли;
	
	Если ВключатьВторичныеНачисления Тогда
		Порядки.Добавить(2);
	КонецЕсли;
	
	Если ВключатьНачисленияТретьегоПорядка Тогда
		Порядки.Добавить(3);
	КонецЕсли;
	
	Если ВключатьНачисленияЧетвертогоПорядка Тогда
		Порядки.Добавить(4);
	КонецЕсли;
	
	Возврат Порядки;
	
КонецФункции

// Заполняет табличную часть "Начисления" по документу
Процедура ЗаполнитьНачисления() Экспорт
	
	Начисления.Очистить();
	
	ВторичныеВидыНачисления = РасчетЗаработнойПлаты.ПолучитьВидыНачисленияОтДругихВидов();
	
	ПорядкиРасчета = ВключенныеПорядкиРасчетаДокумента();
	Для Каждого ПорядокРасчета Из ПорядкиРасчета Цикл
		
		Для Каждого Строка Из БазаРасчета Цикл
			Если  Строка.ВидРасчета.ПорядокРасчета = ПорядокРасчета
				И Строка.ВидРасчета.ФормулаРасчета <> Перечисления.ФормулыРасчетаЗаработнойПлаты.МинимальныйОклад
			Тогда
				Если ВторичныеВидыНачисления.Найти(Строка.ВидРасчета) <> Неопределено Тогда
					// Расчет с учетом начислений в документе, если требуется
					Результат = РасчитатьРезультатНачисленияВторичныхВидовНачисления(Строка, ПорядокРасчета);
				Иначе
					// Обычный расчет строки базы
					Результат = РассчитатьРезультат(Строка);
				КонецЕсли;
				
				Если Результат <> 0 Тогда
					НоваяСтрока = Начисления.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
					НоваяСтрока.Результат = Результат;
					ВыровнятьПериодПоПериодичностиВидаРасчета(НоваяСтрока.ВидРасчета,НоваяСтрока.ПериодНачисления);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		Начисления.Свернуть("Сотрудник,ВидРасчета,ПериодНачисления,КатегорияВыработки","Результат");              
		
		РассчитатьЗначениеМинимальногоОклада(ПорядокРасчета);
		
	КонецЦикла;
	
	Начисления.Сортировать("Сотрудник, ПериодНачисления, КатегорияВыработки");
	
КонецПроцедуры

Функция РасчитатьРезультатНачисленияВторичныхВидовНачисления(СтрокаБазы, ПорядокРасчета)
	
	БазаКопия = БазаРасчета.ВыгрузитьКолонки();
	СтрокаРасчета = БазаКопия.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаРасчета, СтрокаБазы);
	
	НачалоПериодаСтроки = СтрокаРасчета.ПериодНачисления;
	КонецПериодаСтроки	= КонецПериодаНачисления(СтрокаРасчета.ВидРасчета, НачалоПериодаСтроки);
	
	СуммыБазовыхВЭтомДокументе = Новый Структура("Сумма1, Сумма2, Сумма3", 0, 0, 0);
	Для Сч = 1 По 3 Цикл
		Если ТипЗнч(СтрокаБазы["Показатель" + Сч]) = Тип("ПланВидовРасчетаСсылка.Начисления") Тогда
			// Поиск в начислениях документа являющихся базой
			Для Каждого СтрокаНачисления Из Начисления Цикл
				
				Если  Не (СтрокаНачисления.ВидРасчета.ПорядокРасчета < ПорядокРасчета
						И СтрокаНачисления.ПериодНачисления >= НачалоПериодаСтроки
						И СтрокаНачисления.ПериодНачисления <= КонецПериодаСтроки)
				Тогда
					Продолжить;
				КонецЕсли;
				
				Если СтрокаБазы["Показатель" + Сч] = СтрокаНачисления.ВидРасчета
				 Или СтрокаБазы["Показатель" + Сч] = ПланыВидовРасчета.Начисления.ПустаяСсылка()
				Тогда
					СтрокаРасчета["ЗначениеПоказателя" + Сч] = СтрокаРасчета["ЗначениеПоказателя" + Сч] + СтрокаНачисления.Результат;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РассчитатьРезультат(СтрокаРасчета);
	
КонецФункции

Процедура РассчитатьЗначениеМинимальногоОклада(ПорядокРасчета)
	
	НачисленияВДокументе = Начисления.Выгрузить();
	НачисленияВДокументе.Свернуть("Сотрудник, ВидРасчета, ПериодНачисления", "Результат");
	
	МинимальныйОклад = Перечисления.ФормулыРасчетаЗаработнойПлаты.МинимальныйОклад;
	
	// Подготовка кеша
	БазаРасчетаМинОклады = БазаРасчета.ВыгрузитьКолонки();
	
	Для Каждого Строка Из БазаРасчета Цикл
		Если Строка.ВидРасчета.ПорядокРасчета = ПорядокРасчета
			И Строка.ВидРасчета.ФормулаРасчета = МинимальныйОклад
		Тогда
			ЗаполнитьЗначенияСвойств(БазаРасчетаМинОклады.Добавить(), Строка);
		КонецЕсли;
	КонецЦикла;
	
	Если БазаРасчетаМинОклады.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаНачислений = БазаРасчетаМинОклады.Скопировать();
	ТаблицаНачислений.Колонки.ВидРасчета.Имя = "Начисление";
	ТаблицаНачислений.Колонки.Добавить("ФормулаРасчета");
	Для Каждого Строка Из ТаблицаНачислений Цикл
		Строка.ФормулаРасчета = Строка.Начисление.ФормулаРасчета;
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	СформироватьВременнуюТаблицуПоБазовымВидамРасчета(Запрос, ТаблицаНачислений, Истина, Ложь);
	
	// Обсчет базы
	Для Каждого Строка Из БазаРасчетаМинОклады Цикл
			
		ПорядокРасчетаМО = Строка.ВидРасчета.ПорядокРасчета;
		
		КонецПериодаНачисления = КонецПериодаНачисления(Строка.ВидРасчета, Строка.ПериодНачисления);
		
        СуммаБазы = ПолучитьБазуРасчетаВторичногоНачисления(Запрос, НачисленияВДокументе,
															Строка.ВидРасчета.ИсточникБазы, ПорядокРасчетаМО,
															Строка.ПериодНачисления, КонецПериодаНачисления, Строка.Сотрудник);
		
		Если СуммаБазы < Строка.ЗначениеПоказателя1 Тогда
			НовоеНачисление = Начисления.Добавить();
			ЗаполнитьЗначенияСвойств(НовоеНачисление, Строка);
			
			НовоеНачисление.Результат = Строка.ЗначениеПоказателя1 - СуммаБазы;
			НовоеНачисление.ПериодНачисления = Строка.ПериодНачисления;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьБазуРасчетаВторичногоНачисления(Запрос, НачисленияВДокументе = Неопределено, ИсточникБазы, ПорядокРасчета, ПериодНач, ПериодКон, Сотрудник, ВидНачисления = Неопределено)
	
	СуммаБазы = 0;
	
	// Начисления в этом документе
	Если НачисленияВДокументе <> Неопределено Тогда
		Для Каждого СтрокаНачисления Из НачисленияВДокументе.НайтиСтроки(Новый Структура("Сотрудник", Сотрудник)) Цикл
			Если СтрокаНачисления.ВидРасчета.ПорядокРасчета < ПорядокРасчета
				И СтрокаНачисления.ПериодНачисления >= ПериодНач
				И СтрокаНачисления.ПериодНачисления <= ПериодКон
			Тогда
				СуммаБазы = СуммаБазы + СтрокаНачисления.Результат;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Начисления других документов
	Если ИсточникБазы <> Перечисления.ИсточникБазыВторичногоНачисленияПоСтруктуре.Документ Тогда
		
		ПрименитьТекстЗапросаБазы(Запрос, Сотрудник, ПериодНач, ПериодКон, ПорядокРасчета-1, ИсточникБазы, ВидНачисления);
		НачисленияДругихДокументов = Запрос.Выполнить().Выгрузить();
		СуммаБазы = СуммаБазы + НачисленияДругихДокументов.Итог("Сумма");
	КонецЕсли;
	
	Возврат СуммаБазы;
	
КонецФункции

Процедура ПрименитьТекстЗапросаБазы(Запрос, Сотрудник, ПериодНач, ПериодКон, ПорядокРасчетаМакс, ИсточникБазы, ВидНачисления = Неопределено)
	
	Текст = "ВЫБРАТЬ
	        |	ПН.Сумма КАК Сумма
	        |ИЗ
	        |	ПервичныеНачисления КАК ПН
	        |ГДЕ
	        |	ПН.Сотрудник = &Сотрудник
			|	И ПН.ПорядокРасчета <= &ПорядокРасчетаМакс
	        |	И ПН.Период МЕЖДУ &ПериодНач И &ПериодКон";
	
	Если ВидНачисления <> Неопределено Тогда
		Текст = Текст + Символы.ПС + "И ПН.ВидРасчета = &ВидРасчета";
		Запрос.УстановитьПараметр("ВидРасчета", ВидНачисления);
	КонецЕсли;
	
	Если ИсточникБазы = Перечисления.ИсточникБазыВторичногоНачисленияПоСтруктуре.ОбластьДействияДокументаНачисления
		И ЭтотОбъект.ПоОдномуФилиалу
	Тогда
		Текст = Текст + Символы.ПС + "И ПН.Филиал В (&Филиал)";
		Запрос.УстановитьПараметр("Филиал", Филиал);
	КонецЕсли;
	
	// Место возможного отбора по филиалу или организации документа. Не используется, не включено в итоговый релиз за ненадобностью.
	// См. СформироватьВременнуюТаблицуПоБазовымВидамРасчета().
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ПериодНач", ПериодНач);
	Запрос.УстановитьПараметр("ПериодКон", ПериодКон);
	Запрос.УстановитьПараметр("ПорядокРасчетаМакс", ПорядокРасчетаМакс);
	
	Запрос.Текст = Текст;
	
КонецПроцедуры

Функция КонецПериодаНачисления(ВидРасчета, ПериодНачисления)
	
	Если ТипЗнч(ВидРасчета) = Тип("ПеречислениеСсылка.ПериодичностиВидовРасчета") Тогда
		ПериодичностьВидаРасчета = ВидРасчета;
	Иначе
		ПериодичностьВидаРасчета = ВидРасчета.Периодичность;
	КонецЕсли;
	
	Если ПериодичностьВидаРасчета = Перечисления.ПериодичностиВидовРасчета.Месяц Тогда
		Возврат КонецМесяца(ПериодНачисления);
	ИначеЕсли ПериодичностьВидаРасчета = Перечисления.ПериодичностиВидовРасчета.Неделя Тогда
		Возврат КонецНедели(ПериодНачисления);
	Иначе
		Возврат КонецДня(ПериодНачисления);
	КонецЕсли;
	
КонецФункции

// Процедура выравнивает период начисления по периодичности вида начисления
//
// Параметры:
// 	ВидРасчета	- вид расчета
//  Период		- <Дата> - корректируемый период начисления.
//
Процедура ВыровнятьПериодПоПериодичностиВидаРасчета(ВидРасчета,Период) Экспорт
	
	Если ТипЗнч(ВидРасчета) = Тип("ПеречислениеСсылка.ПериодичностиВидовРасчета") Тогда
		ПериодичностьВидаРасчета = ВидРасчета;
	Иначе
		ПериодичностьВидаРасчета = ВидРасчета.Периодичность;
	КонецЕсли;
	
	Если ПериодичностьВидаРасчета = Перечисления.ПериодичностиВидовРасчета.Месяц Тогда   
		Период = НачалоМесяца(Период);	
	ИначеЕсли ПериодичностьВидаРасчета = Перечисления.ПериодичностиВидовРасчета.Неделя Тогда
		Период = НачалоНедели(Период);
	КонецЕсли;
	
КонецПроцедуры

Функция ПериодыВидаРасчетаВИнтервалеДокумента(Периодичность, ДатаНачала, ДатаПрекращения)
	
	Перем ТекущийПериод;
	
	Периоды = Новый Массив;
	
	ТекущийПериод = НачалоПериода;
	ВыровнятьПериодПоПериодичностиВидаРасчета(Периодичность, ТекущийПериод);
	
	Пока ТекущийПериод <= КонецПериода Цикл
		
		КонецТекущегоПериода = КонецПериодаНачисления(Периодичность, ТекущийПериод);
		
		Если ТекущийПериод >= ДатаНачала
			И ТекущийПериод < ДатаПрекращения
		Тогда
			Периоды.Добавить(Новый Структура("НачалоПериода, КонецПериода", ТекущийПериод, КонецТекущегоПериода));
		КонецЕсли;
		
		ТекущийПериод = КонецТекущегоПериода + 1;
		
	КонецЦикла;
	
	Возврат Периоды;
	
КонецФункции

Функция ПериодРасчетаПопадаетВПериодДокумента(Период, Периодичность)
	
	Перем НачалоПериодаПоПериодичности;
	
	НачалоПериодаПоПериодичности = НачалоПериода;
	ВыровнятьПериодПоПериодичностиВидаРасчета(Периодичность, НачалоПериодаПоПериодичности);
	
	Возврат Период >= НачалоПериодаПоПериодичности И Период <= КонецПериода;
	
КонецФункции

Функция ФормулыФиксированныхНачислений()
	
	Формулы = Новый Массив;
	Формулы.Добавить(Перечисления.ФормулыРасчетаЗаработнойПлаты.ФиксированнаяСумма);
	Формулы.Добавить(Перечисления.ФормулыРасчетаЗаработнойПлаты.МинимальныйОклад);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Формулы", Формулы);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Начисления.Ссылка КАК Ссылка
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.ФормулаРасчета В(&Формулы)"
	;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Формирование таблицы начислений и удержаний
	ТаблицаНачислений = Движения.НачисленияСотрудникам.Выгрузить(); 
	ТаблицаНачислений.Очистить();
	
	Для Каждого СтрокаРасчета из Начисления Цикл
		НоваяСтрока = ТаблицаНачислений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасчета);
		НоваяСтрока.Сумма = СтрокаРасчета.Результат;
		НоваяСтрока.Активность = Истина;
	КонецЦикла;
	
	Для Каждого СтрокаРасчета из Удержания Цикл
		НоваяСтрока = ТаблицаНачислений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасчета);
		НоваяСтрока.Сумма = -СтрокаРасчета.Результат;
		НоваяСтрока.Активность = Истина;
	КонецЦикла;
	
	// Формирование движений по регистру "НачисленияСотрудникам".
	Для Каждого СтрокаРасчета Из ТаблицаНачислений Цикл
		
		Движение = Движения.НачисленияСотрудникам.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, СтрокаРасчета);
		Движение.Период	= СтрокаРасчета.ПериодНачисления;
		
	КонецЦикла;
	
	// Формирование движения по регистру "ВзаиморасчетыССотрудниками".
	ТаблицаВзаиморасчетов = ТаблицаНачислений.Скопировать();
	ТаблицаВзаиморасчетов.Свернуть("Сотрудник","Сумма");
	
	Для Каждого СтрокаРасчета Из ТаблицаВзаиморасчетов Цикл
		
		Движение = Движения.ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения			= ?(СтрокаРасчета.Сумма>=0, ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход);
		Движение.Период					= Дата;
		Движение.Сотрудник				= СтрокаРасчета.Сотрудник;
		
		Движение.Сумма					= Макс(СтрокаРасчета.Сумма,-СтрокаРасчета.Сумма);
	
	КонецЦикла;

КонецПроцедуры // ОбработкаПроведения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СтрокаКраткийСоставДокумента = "";
	Сотрудники = Новый ТаблицаЗначений;
	Сотрудники = Начисления.Выгрузить(,"Сотрудник");
	Сотрудники.Свернуть("Сотрудник");
	
	Для Каждого Строка из Сотрудники Цикл
		ФИО = Строка.Сотрудник.Фамилия + " " + Лев(Строка.Сотрудник.Имя,1) + "." + Лев(Строка.Сотрудник.Отчество,1) + ".";
	    СтрокаКраткийСоставДокумента = СтрокаКраткийСоставДокумента + ФИО + ", ";
	КонецЦикла;
	КраткийСоставДокумента = Лев(Лев(СтрокаКраткийСоставДокумента,СтрДлина(СтрокаКраткийСоставДокумента)-2),50);
	
КонецПроцедуры

#КонецОбласти  

////////////////////////////////////////////////////////////////////
// ОМГ
Процедура омг_ВычислитьЗначениеПараметраРасчета(омг_ТаблицаПараметровРасчетаВспомогательная, СтруктураДанныхДляРасчета, Запрос, ТаблицаЗначенийПараметровРасчета, ПорядокРасчета)
	
	ВыборкаПоказателиПрямойВыработки = СтруктураДанныхДляРасчета.ВыборкаПоказателиПрямойВыработки;
	ТаблицаНормыПоГрафику = СтруктураДанныхДляРасчета.ТаблицаНормыПоГрафику;
	
	ПеречислениеВидыПараметров = Перечисления.ВидыПараметровРасчетаНачислений;
	
	Сотрудник = неопределено;
	МассивПараметрыВычисления = Новый Массив;
	Сч = 0; 
	ТекущийМесяц = неопределено; 
	Результат = неопределено;
	Для каждого СтрокаПараметраРасчета из омг_ТаблицаПараметровРасчетаВспомогательная Цикл  
		
		Если Сч = 0 Тогда
			Сотрудник = СтрокаПараметраРасчета.Сотрудник
		ИначеЕсли не Сотрудник = СтрокаПараметраРасчета.Сотрудник Тогда
			
			РезультатВозврата = омг_ПолучитьЗначениеДополнительногоПараметра(МассивПараметрыВычисления);
			Если МассивПараметрыВычисления.Количество() > 0 Тогда 
				
				Для каждого СтрокаРезультатВозврата из РезультатВозврата Цикл	
					
					СтруктураПоиска = Новый Структура;
					СтруктураПоиска.Вставить("Показатель", СтрокаРезультатВозврата.ПараметрРасчета);
					СтруктураПоиска.Вставить("Сотрудник", Сотрудник);
					СтруктураПоиска.Вставить("Значение", 0);
					НайдСтроки = ТаблицаЗначенийПараметровРасчета.НайтиСтроки(СтруктураПоиска); 
					Если НайдСтроки.Количество() > 0 Тогда
					НайдСтрока = НайдСтроки[0];
					СтрокаЗначенияПараметраРасчета = ТаблицаЗначенийПараметровРасчета.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаЗначенияПараметраРасчета, НайдСтрока);
					//СтрокаЗначенияПараметраРасчета.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ДополнительныйПараметр; 
					//СтрокаЗначенияПараметраРасчета.Периодичность = Перечисления.ПериодичностиВидовРасчета.Месяц; 
					//СтрокаЗначенияПараметраРасчета.Показатель = СтрокаРезультатВозврата.ПараметрРасчета;
					СтрокаЗначенияПараметраРасчета.Период	= СтрокаРезультатВозврата.НачалоПериода;
					СтрокаЗначенияПараметраРасчета.Значение = СтрокаРезультатВозврата.Результат;
					МассивПараметрыВычисления = Новый Массив;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			Сотрудник = СтрокаПараметраРасчета.Сотрудник;
		КонецЕсли;
		ДатаНачала = Макс(ЭтотОбъект.НачалоПериода, СтрокаПараметраРасчета.ПериодНачала);
		ДатаОкончания = Мин(ЭтотОбъект.КонецПериода, СтрокаПараметраРасчета.ПериодПрекращения);
		ТекущийМесяц = НачалоМесяца(ДатаНачала);
		
		ВидПараметра	= СтрокаПараметраРасчета.ВидПараметра;
		
		Пока ТекущийМесяц < КонецМесяца(ДатаОкончания) Цикл
			
			ТекущееНачалоПериода = Макс(ТекущийМесяц, ДатаНачала);
			ТекущийКонецПериода = Мин(КонецМесяца(ТекущийМесяц), ДатаОкончания);
			
			ПараметрыВычисления = Новый Структура;
			ПараметрыВычисления.Вставить("ПараметрРасчета", СтрокаПараметраРасчета.Показатель);
			ПараметрыВычисления.Вставить("Сотрудник", 		СтрокаПараметраРасчета.Сотрудник);
			ПараметрыВычисления.Вставить("НачалоПериода", 	ТекущееНачалоПериода);
			ПараметрыВычисления.Вставить("КонецПериода", 	КонецДня(ТекущийКонецПериода));
			#Если Клиент Тогда
				ПараметрыВычисления.Вставить("Документ", ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект));
			#Иначе
				ПараметрыВычисления.Вставить("Документ", ЭтотОбъект);
			#КонецЕсли   
			МассивПараметрыВычисления.Добавить(ПараметрыВычисления);
			ТекущийМесяц = ДобавитьМесяц(ТекущийМесяц, 1);
		КонецЦикла;
		Сч = 1;
	КонецЦикла; 
	
	Если МассивПараметрыВычисления.Количество() > 0 Тогда 
		
		РезультатВозврата = омг_ПолучитьЗначениеДополнительногоПараметра(МассивПараметрыВычисления);
		
		Для каждого СтрокаРезультатВозврата из РезультатВозврата Цикл	
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Показатель", СтрокаРезультатВозврата.ПараметрРасчета);
			СтруктураПоиска.Вставить("Сотрудник", СтрокаРезультатВозврата.Сотрудник);
			СтруктураПоиска.Вставить("Значение", 0); 
			НайдСтроки = ТаблицаЗначенийПараметровРасчета.НайтиСтроки(СтруктураПоиска); 
			Если НайдСтроки.Количество() > 0 Тогда
			НайдСтрока = НайдСтроки[0];
			
			СтрокаЗначенияПараметраРасчета = ТаблицаЗначенийПараметровРасчета.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗначенияПараметраРасчета, НайдСтрока);
			СтрокаЗначенияПараметраРасчета.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ДополнительныйПараметр; 
			СтрокаЗначенияПараметраРасчета.Периодичность = Перечисления.ПериодичностиВидовРасчета.Месяц; 
			СтрокаЗначенияПараметраРасчета.Показатель = СтрокаРезультатВозврата.ПараметрРасчета;
			СтрокаЗначенияПараметраРасчета.Период	= СтрокаРезультатВозврата.НачалоПериода;
			СтрокаЗначенияПараметраРасчета.Значение = СтрокаРезультатВозврата.Результат;
			МассивПараметрыВычисления = Новый Массив;
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры     

Функция омг_ПолучитьЗначениеДополнительногоПараметра(МассивПараметрыВычисления)
	
	МассивПараметров = Новый Массив;  
	
	Для каждого строка из МассивПараметрыВычисления Цикл
		МассивПараметров.Добавить(строка.ПараметрРасчета)	 
	КонецЦикла;	
	Сотрудник = строка.Сотрудник;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыРасчетаЗППараметры.Ссылка.ЭтоПроцент КАК ЭтоПроцент,
	|	ПараметрыРасчетаЗППараметры.Значение КАК Значение,
	|	ПараметрыРасчетаЗППараметры.Ссылка КАК ПараметрРасчета,
	|	омг_СписокУслугПоСотрудникамДляЗП.Услуга КАК Услуга,
	|	омг_СписокУслугПоСотрудникамДляЗП.Приоритет КАК Приоритет,
	|	ПараметрыРасчетаЗППараметры.Ссылка.АлгоритмРасчета КАК АлгоритмРасчета
	|ИЗ
	|	Справочник.ПараметрыРасчетаЗП.Параметры КАК ПараметрыРасчетаЗППараметры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.омг_СписокУслугПоСотрудникамДляЗП КАК омг_СписокУслугПоСотрудникамДляЗП
	|		ПО ПараметрыРасчетаЗППараметры.Значение = омг_СписокУслугПоСотрудникамДляЗП.ДокументСписок
	|ГДЕ
	|	ПараметрыРасчетаЗППараметры.Ссылка В(&МассивПараметров)
	|	И омг_СписокУслугПоСотрудникамДляЗП.Сотрудник = &Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	Услуга,
	|	Приоритет";
	
	Запрос.УстановитьПараметр("МассивПараметров", МассивПараметров);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	 
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить();
	
	ТабРасчета = ВыборкаДетальныеЗаписи.СкопироватьКолонки();
	
	ВыборкаДетальныеЗаписи.Колонки.Добавить("Исп",Новый ОписаниеТипов("Булево"));
	ВыборкаДетальныеЗаписи.Свернуть("ЭтоПроцент,Значение,ПараметрРасчета,Услуга,Приоритет,АлгоритмРасчета");
	ТекУслуга = Неопределено;
	ТекПриоритет = 0;
	Для каждого строка из ВыборкаДетальныеЗаписи Цикл
		
		Если строка.Услуга = ТекУслуга и ТекПриоритет = строка.Приоритет или не строка.Услуга = ТекУслуга Тогда
			ЗаполнитьЗначенияСвойств(ТабРасчета.Добавить(),строка);		
		КонецЕсли;	
		
		ТекУслуга = строка.Услуга;
		ТекПриоритет = строка.Приоритет;
		
	КонецЦикла;	
	
	ТабПараметров = ТабРасчета.Скопировать(,"ПараметрРасчета");
	ТабПараметров.Свернуть("ПараметрРасчета");
	
	МассивТабДляРасчетаПараметра = Новый Массив;   
	
	Для каждого строка из ТабПараметров Цикл   
		
		ПараметрОтбора = Новый Структура; 
		
		ПараметрОтбора.Вставить("ПараметрРасчета",строка.ПараметрРасчета);  
		
		ТабДляРасчетаПараметра = ТабРасчета.Скопировать(ПараметрОтбора);	
		
		МассивТабДляРасчетаПараметра.Добавить(ТабДляРасчетаПараметра)
		
	КонецЦикла;
	МассивВозврата = Новый Массив;
	Для каждого строка из МассивТабДляРасчетаПараметра Цикл   
		
		МассивУслуг = строка.ВыгрузитьКолонку("Услуга"); 
        ПараметрыВычисления = Новый Структура;
		ПараметрыВычисления.Вставить("ПараметрРасчета", строка[0].ПараметрРасчета);
		ПараметрыВычисления.Вставить("Сотрудник", 		Сотрудник);
		ПараметрыВычисления.Вставить("НачалоПериода", 	НачалоДня(ЭтотОбъект.НачалоПериода));
		ПараметрыВычисления.Вставить("КонецПериода", 	КонецДня(ЭтотОбъект.КонецПериода));
		ПараметрыВычисления.Вставить("Результат", 	ВернутьРезультатИзВыработки(МассивУслуг,строка[0].ЭтоПроцент,Сотрудник,строка[0].АлгоритмРасчета)); 
		МассивВозврата.Добавить(ПараметрыВычисления);
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции 

Функция ВернутьРезультатИзВыработки(МассивУслуг,ЭтоПроцент,Сотрудник,АлгоритмРасчета)
	
	Если ЭтоПроцент Тогда
		ТекстПроцента = "омг_СуммаБезНДСОборот";
	Иначе
		ТекстПроцента = "КоличествоОборот";
	КонецЕсли; 
	
	ТекстУсловий = "";	
	
	Если Лев(АлгоритмРасчета,2) = "И " Тогда
	ТекстУсловий = АлгоритмРасчета
	КонецЕсли;
	
	    
	Если ЗначениеЗаполнено(ЭтотОбъект.омг_Организация) Тогда
		
		МассивФилиалов = омг_РасчетЗаработнойПлатыСервер.ВернутьФилиалыПоОрганизации(ЭтотОбъект.омг_Организация); 
		
	Иначе
	МассивФилиалов = Новый Массив;
	МассивФилиалов.Добавить(ЭтотОбъект.Филиал);
	КонецЕсли; 

	Запрос = Новый Запрос;                   
	Запрос.Текст =  
	
		"ВЫБРАТЬ 
		|	СУММА(ВыработкаСотрудниковОбороты."+ ТекстПроцента +") КАК Результат
		|ИЗ
		|	РегистрНакопления.ВыработкаСотрудников.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Авто,
		|			Сотрудник = &Сотрудник
		|				И Филиал В (&Филиал)) КАК ВыработкаСотрудниковОбороты
		|ГДЕ
		|	ВыработкаСотрудниковОбороты.Номенклатура В (&МассивУслуг) " + ТекстУсловий;
	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ЭтотОбъект.КонецПериода));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ЭтотОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("МассивУслуг", МассивУслуг);
	Запрос.УстановитьПараметр("Филиал", МассивФилиалов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат  ВыборкаДетальныеЗаписи.Результат
	КонецЕсли; 
	
	Возврат 0;
		
КонецФункции	
	

		
// ОМГ   
////////////////////////////////////////////////////////////////////
