#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ПолеВладелец = Новый ПолеКомпоновкиДанных("ВладелецКарты");
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.Использование 
			И ЭлементОтбора.ЛевоеЗначение = ПолеВладелец
		Тогда
			Отказ = Истина;
			ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("ВладелецКарты", ЭлементОтбора.ПравоеЗначение));
			ОткрытьФорму("Справочник.КартыСкидок.ФормаОбъекта", ПараметрыФормы);
			Прервать;			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////
// ОМГ 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	Если не РольДоступна("ПолныеПрава") Тогда	
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("омг_Заблокировать");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		ЭлементОтбора.ПравоеЗначение = Ложь;
	КонецЕсли;  

КонецПроцедуры
// ОМГ
////////////////////////////////////////////////////////

#КонецОбласти