#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполнение дерева встроенных образцов параметров.
	ТаблицаОбразцов = Новый ТаблицаЗначений;
	ТаблицаОбразцов.Колонки.Добавить("ИмяПараметра", 			Новый ОписаниеТипов("Строка"));
	ТаблицаОбразцов.Колонки.Добавить("Алгоритм",	 			Новый ОписаниеТипов("Строка"));
	ТаблицаОбразцов.Колонки.Добавить("Описание",	 			Новый ОписаниеТипов("Строка"));
	ТаблицаОбразцов.Колонки.Добавить("Группа",		 			Новый ОписаниеТипов("Строка"));
	ТаблицаОбразцов.Колонки.Добавить("Группа2ур",	 			Новый ОписаниеТипов("Строка"));
	ТаблицаОбразцов.Колонки.Добавить("СтандартныйАлгоритм",		Новый ОписаниеТипов("Булево"));
	
	ТабДокОбразцы = Справочники.ШаблоныПечати.ПолучитьМакет("ОбразцыПараметровШаблонаПечати");
	Для Сч = 1 По ТабДокОбразцы.ВысотаТаблицы Цикл
		
		ИмяПараметра = ТабДокОбразцы.Область(Сч, 1, Сч, 1).Текст;
		Если ПустаяСтрока(ИмяПараметра) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЗ = ТаблицаОбразцов.Добавить();
		СтрокаТЗ.ИмяПараметра = 		ИмяПараметра;
		СтрокаТЗ.Алгоритм	  = 		ТабДокОбразцы.Область(Сч, 2).Текст;
		СтрокаТЗ.Описание	  = 		ТабДокОбразцы.Область(Сч, 3).Текст;
		ТабДокГруппа		  = 		ТабДокОбразцы.Область(Сч, 4).Текст;
		СтрокаТЗ.СтандартныйАлгоритм =	ПустаяСтрока(ТабДокОбразцы.Область(Сч, 5).Текст);
		
		Группы = СтрРазделить(ТабДокГруппа, ".");
		СтрокаТЗ.Группа = СокрЛП(Группы[0]);
		Если Группы.Количество() > 1 Тогда
			СтрокаТЗ.Группа2ур = СокрЛП(Группы[1]);
		КонецЕсли;
		
	КонецЦикла;
	
	//Не ОбщегоНазначенияСервер.ТаблицуЗначенийВДеревоЗначений(), т.к. там ЗначенияКолонкиУровня - соответствие, а не массив, из-за чего элементы добавляются в обратном порядке 
	ДеревоОбразцов = ТаблицуЗначенийВДеревоЗначений(ТаблицаОбразцов, "Группа, Группа2Ур", Истина);
	
	// Перенос трёхуровневого дерева в реквизит формы.
	Для Каждого СтрокаУр1 Из ДеревоОбразцов.Строки Цикл
		СтрокаФормыУр1 = ОбразцыПараметров.ПолучитьЭлементы().Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаФормыУр1, СтрокаУр1);
		СтрокаФормыУр1.ЭтоГруппа = Не ЗначениеЗаполнено(СтрокаФормыУр1.ИмяПараметра);
		
		Для Каждого СтрокаУр2 Из СтрокаУр1.Строки Цикл
			СтрокаФормыУр2 = СтрокаФормыУр1.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаФормыУр2, СтрокаУр2);
			СтрокаФормыУр2.Группа = СтрокаФормыУр2.Группа2Ур;
			СтрокаФормыУр2.ЭтоГруппа = Не ЗначениеЗаполнено(СтрокаФормыУр2.ИмяПараметра);
			
			Для Каждого СтрокаУр3 Из СтрокаУр2.Строки Цикл
				ЗаполнитьЗначенияСвойств(СтрокаФормыУр2.ПолучитьЭлементы().Добавить(), СтрокаУр3);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда = Неопределено)
	
	ТекущиеДанные = Элементы.СписокПараметров.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено
		И ЗначениеЗаполнено(ТекущиеДанные.ИмяПараметра)
	Тогда
		РезультатВыбора = Новый Структура;
		РезультатВыбора.Вставить("ИмяПараметра", 		 ТекущиеДанные.ИмяПараметра);
		РезультатВыбора.Вставить("Алгоритм",	 		 ТекущиеДанные.Алгоритм);
		РезультатВыбора.Вставить("Описание",	 		 ТекущиеДанные.Описание);
		РезультатВыбора.Вставить("СтандартныйАлгоритм",	 ТекущиеДанные.СтандартныйАлгоритм);
		
		ЭтотОбъект.Закрыть(РезультатВыбора);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПараметровВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Выбрать();
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Алгоритм = Элементы.СписокПараметров.ТекущиеДанные.Алгоритм;
	Если ЗначениеЗаполнено(Алгоритм) Тогда
		ПараметрыФормы = Новый Структура("Алгоритм, ТолькоПросмотр", Алгоритм, Истина);
		ОткрытьФорму("Справочник.ШаблоныПечати.Форма.ЗаполнениеАлгоритмаПараметраШаблона", ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

&НаСервереБезКонтекста
Функция ТаблицуЗначенийВДеревоЗначений(Таблица, КолонкиГруппировки, ПодниматьУровеньПустыхГрупп = Ложь)
	
	Перем мКолонкиГруппировки;
	
	Если ТипЗнч(КолонкиГруппировки) = Тип("Строка") Тогда
		мКолонкиГруппировки = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(КолонкиГруппировки, ",");
	Иначе
		мКолонкиГруппировки = КолонкиГруппировки;	
	КонецЕсли;
	
	// Создание дерева
	Дерево = Новый ДеревоЗначений;
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Дерево.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения, Колонка.Заголовок);
	КонецЦикла;
	
	ВерхниеЗначения = Новый Структура;
	Уровень = 0;
	СоздатьУровеньДереваПоТаблице(Таблица, мКолонкиГруппировки, Дерево.Строки, ВерхниеЗначения, Уровень, ПодниматьУровеньПустыхГрупп);
	
	Возврат Дерево;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СоздатьУровеньДереваПоТаблице(Таблица, КолонкиГруппировки, УровеньДерева, ВерхниеЗначения, Уровень, ПодниматьУровеньПустыхГрупп)
	
	Если ВерхниеЗначения.Количество() = 0 Тогда
		СтрокиТаблицы = Таблица;
	Иначе
		СтрокиТаблицы = Таблица.НайтиСтроки(ВерхниеЗначения);
	КонецЕсли;
	
	Если Уровень <= КолонкиГруппировки.Количество() - 1 Тогда
		
		ГруппирующаяКолонка = СокрЛП(КолонкиГруппировки[Уровень]);
		ЗначенияКолонкиУровня = Новый Массив;
		Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
			ОбщегоНазначенияКлиентСервер.ДобавитьВМассивБезДублей(ЗначенияКолонкиУровня, СтрокаТаблицы[ГруппирующаяКолонка]);
		КонецЦикла;	
		
		Для Каждого ЗначениеГруппировки Из ЗначенияКолонкиУровня Цикл
			
			ВерхниеЗначенияКопия = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ВерхниеЗначения);
			ВерхниеЗначенияКопия.Вставить(ГруппирующаяКолонка, ЗначениеГруппировки);
			
			Если ЗначениеЗаполнено(ЗначениеГруппировки) Или Не ПодниматьУровеньПустыхГрупп Тогда
				СтрокаДерева = УровеньДерева.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДерева, ВерхниеЗначения);
				СтрокаДерева[ГруппирующаяКолонка] = ЗначениеГруппировки;
				
				УровеньДляПодчиненных = СтрокаДерева.Строки;
			Иначе
				// Если текущая группировка пустая и Не ПодниматьУровеньПустыхГрупп, то добавляем строки подчиненных
				//	не в пустую подгруппу, а прямо в родительский уровень дерева.
				УровеньДляПодчиненных = УровеньДерева;
			КонецЕсли;
			
			СоздатьУровеньДереваПоТаблице(Таблица, КолонкиГруппировки, УровеньДляПодчиненных, ВерхниеЗначенияКопия, Уровень + 1, ПодниматьУровеньПустыхГрупп);
			
		КонецЦикла;
	Иначе
		Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
			ЗаполнитьЗначенияСвойств(УровеньДерева.Добавить(), СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти