
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Оповещение = Новый ОписаниеОповещения("ОбработкаКомандыПродолжение", ЭтотОбъект, Новый Структура("ПодключаемоеОборудование", ПараметрКоманды));
	ПоказатьВопрос(Оповещение, "Внимание! При отключении оборудования во всех открытых формах оборудование будет не доступно. Продолжить?", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаКомандыПродолжение(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПодключаемоеОборудование = МенеджерОборудованияКлиент.ПодключаемоеОборудование();
		Если ПодключаемоеОборудование = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		
		Если ПодключаемоеОборудование.ПараметрыПодключенияПО <> Неопределено Тогда
			КоличествоУстройств = ПодключаемоеОборудование.ПараметрыПодключенияПО.Количество();
			Для Индекс = 1 По КоличествоУстройств Цикл
				ПодключенноеУстройство = ПодключаемоеОборудование.ПараметрыПодключенияПО[КоличествоУстройств - Индекс];
				Если ПодключенноеУстройство.Ссылка = ДопПараметры.ПодключаемоеОборудование Тогда
					Для Каждого Клиент Из ПодключенноеУстройство.Клиенты Цикл
						МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоИдентификатору(, Клиент, ДопПараметры.ПодключаемоеОборудование); 
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
