#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоляТаблицыИнтерфейса = РаботаСИнтерфейсамиЗаполненияПараметровКлиентСервер.ПоляТаблицыИнтерфейса(Параметры.Идентификатор);
	
	ЗаголовокКнопки = Параметры.ЗаголовокКнопки;
	
	ТекущиеПараметры = Новый Соответствие;
	ТекущиеТаблицыПараметров = Новый Соответствие;
	
	Если Параметры.Свойство("ТекущиеПараметры") Тогда
		ТекущиеПараметры = Параметры.ТекущиеПараметры;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущиеТаблицыПараметров") Тогда
		ТекущиеТаблицыПараметров = Параметры.ТекущиеТаблицыПараметров;
	КонецЕсли;
	
	мРеквизиты = Новый Массив;
	РеквизитыДобавленныхЭлементов = Новый Массив;
	
	СформироватьРеквизитыИнтерфейса(мРеквизиты, РеквизитыДобавленныхЭлементов, ПоляТаблицыИнтерфейса.Иерархия, Элементы.ПараметрыИнтерфейса, Элементы.ПараметрыИнтерфейса);
	
	ИзменитьРеквизиты(мРеквизиты);
	
	Для Каждого СтруктураЭлемента Из РеквизитыДобавленныхЭлементов Цикл
		СтруктураЭлемента.Элемент.ПутьКДанным = СтруктураЭлемента.ИмяРеквизита;
	КонецЦикла;
	
	Для Каждого ПолеИнтерфейса Из ПоляИнтерфейса Цикл
		ИдентификаторПараметраHTML = ТекущиеПараметры.Получить(ПолеИнтерфейса.ИмяПоля);
		Если Не ЗначениеЗаполнено(ИдентификаторПараметраHTML) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ПараметрHTML = ПланыВидовХарактеристик.ПараметрыHTML.ПолучитьСсылку(ИдентификаторПараметраHTML);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ПараметрHTML)
			И ПараметрHTML.ПолучитьОбъект() <> Неопределено
		Тогда
			ЭтотОбъект[ПолеИнтерфейса.ИмяРеквизита] = ПараметрHTML;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТаблицаИнтерфейса Из ТаблицыИнтерфейса Цикл
		ИдентификаторТаблицы = ТекущиеТаблицыПараметров.Получить(ТаблицаИнтерфейса.ИмяТаблицы);
		Если Не ЗначениеЗаполнено(ИдентификаторТаблицы) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ТаблицаШаблонов = Справочники.ТаблицыШаблоновПриема.ПолучитьСсылку(ИдентификаторТаблицы);
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если ЗначениеЗаполнено(ТаблицаШаблонов)
			И ТаблицаШаблонов.ПолучитьОбъект() <> Неопределено
		Тогда
			ЭтотОбъект[ТаблицаИнтерфейса.ИмяРеквизита] = ТаблицаШаблонов;
		КонецЕсли;
	КонецЦикла;
	
	ПроверитьНаличиеПараметровНекорректногоТипа();
	
	ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM(Параметры.ТекущийТекстHTML);
	Для Каждого ЭлементИнтерфейса Из РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(ДокументHTML, Параметры.Идентификатор,, "data-bit-interface-id") Цикл
		Попытка
			ЭлементИнтерфейса.РодительскийУзел.УдалитьДочерний(ЭлементИнтерфейса);
		Исключение КонецПопытки;
	КонецЦикла;
	
	Для Каждого ЭлементТаблицы Из РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(ДокументHTML, Параметры.Идентификатор,, "data-bit-dyntable-id") Цикл
		Попытка
			УИДТаблицы = Новый УникальныйИдентификатор(ЭлементТаблицы.ПолучитьАтрибут("data-bit-dyntable-id"));
			ТаблицыШаблона.Добавить(Справочники.ТаблицыШаблоновПриема.ПолучитьСсылку(УИДТаблицы));
		Исключение КонецПопытки;
	КонецЦикла;
	
	Для Каждого ЭлементНастроекТаблиц Из РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(ДокументHTML,,, "data-bit-interface-dyntables") Цикл
		Для Каждого НастройкаТаблицы Из СтрРазделить(ЭлементНастроекТаблиц.ПолучитьАтрибут("data-bit-interface-dyntables"), ";") Цикл
			ПараметрыНастройкиТаблицы = СтрРазделить(НастройкаТаблицы, ":");
			Если ПараметрыНастройкиТаблицы.Количество() > 1 Тогда
				Попытка
					УИДТаблицы = Новый УникальныйИдентификатор(СокрЛП(ПараметрыНастройкиТаблицы[1]));
					ТаблицыШаблона.Добавить(Справочники.ТаблицыШаблоновПриема.ПолучитьСсылку(УИДТаблицы));
				Исключение КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ВладелецФормы <> Неопределено
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВладелецФормы, "Объект")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВладелецФормы.Объект, "Ссылка")
		И ТипЗнч(ВладелецФормы.Объект.Ссылка) = Тип("СправочникСсылка.ВерсииШаблоновHTML")
	Тогда
		Элементы.ПараметрыИнтерфейса.ТолькоПросмотр = Истина;
		Элементы.ЗаголовокКнопки.ТолькоПросмотр = Истина;
		Элементы.ФормаСохранить.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Если ПроверитьНаличиеПараметровНекорректногоТипа() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПолейИнтерфейса = Новый Соответствие;;
	Для Каждого ПолеИнтерфейса Из ПоляИнтерфейса Цикл
		Если ЗначениеЗаполнено(ПолеИнтерфейса.ИмяРеквизита)
			И ЗначениеЗаполнено(ЭтотОбъект[ПолеИнтерфейса.ИмяРеквизита])
		Тогда
			СтрокаИдентификатора = Строка(ЭтотОбъект[ПолеИнтерфейса.ИмяРеквизита].УникальныйИдентификатор());
			ПараметрыПолейИнтерфейса.Вставить(ПолеИнтерфейса.ИмяПоля, СтрокаИдентификатора);
			//Добавить(Новый Структура("ИмяПоля, ИдентификаторПараметра", ПолеИнтерфейса.ИмяПоля, СтрокаИдентификатора));
		КонецЕсли;
	КонецЦикла;
	
	ДанныеТаблицПараметров = Новый Соответствие;
	Для Каждого ТаблицаИнтерфейса Из ТаблицыИнтерфейса Цикл
		
		Если ЗначениеЗаполнено(ТаблицаИнтерфейса.ИмяРеквизита)
			И ЗначениеЗаполнено(ЭтотОбъект[ТаблицаИнтерфейса.ИмяРеквизита])
		Тогда
			СтрокаИдентификатора = Строка(ЭтотОбъект[ТаблицаИнтерфейса.ИмяРеквизита].УникальныйИдентификатор());
			ДанныеТаблицПараметров.Вставить(ТаблицаИнтерфейса.ИмяТаблицы, СтрокаИдентификатора);
			//Добавить(Новый Структура("ИмяТаблицы, Идентификатор", ТаблицаИнтерфейса.ИмяТаблицы, СтрокаИдентификатора));
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаголовокКнопкиИнтерфейса",	ЗаголовокКнопки);
	Результат.Вставить("ПараметрыПолейИнтерфейса",	ПараметрыПолейИнтерфейса);
	Результат.Вставить("ДанныеТаблицПараметров",	ДанныеТаблицПараметров);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЭлементПоляОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	СтрокиПоляИнтерфейса = ПоляИнтерфейса.НайтиСтроки(Новый Структура("ИмяРеквизита", Элемент.Имя));
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение)
		Или СтрокиПоляИнтерфейса.Количество() = 0
	Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизита = СтрокиПоляИнтерфейса[0].ИмяРеквизита;
	
	ТипПоля = СтрокиПоляИнтерфейса[0].ТипПараметра;
	ТипВыбранногоПараметра = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВыбранноеЗначение, "ТипЗначения");
	
	Если ЗначениеЗаполнено(ТипПоля)
		И Не ТипыДанныхСовпадают(ТипПоля, ТипВыбранногоПараметра)
	Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Тип выбранного параметра не совпадает с требуемым!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементТаблицыОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицыШаблона.НайтиПоЗначению(ВыбранноеЗначение) <> Неопределено Тогда
		ВыбранноеЗначение = Неопределено;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ссылка на данную таблицу уже есть в шаблоне. Её указание в двух таблицах HTML не допускается.'"));
	Иначе
		Для Каждого СтрокаТаблицы Из ТаблицыИнтерфейса Цикл
			Если Элемент.Имя <> СтрокаТаблицы.ИмяРеквизита
				И ЭтотОбъект[СтрокаТаблицы.ИмяРеквизита] = ВыбранноеЗначение
			Тогда
				ВыбранноеЗначение = Неопределено;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ссылка на данную таблицу уже есть в шаблоне. Её указание в двух таблицах HTML не допускается.'"));
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьРеквизитыИнтерфейса(мРеквизиты, РеквизитыДобавленныхЭлементов, Иерархия, РодительскийЭлемент, ЭлементГруппировакиПолей)
	
	Для Каждого СтруктураПоля Из Иерархия.Поля Цикл
		
		ИмяРеквизита = СтрШаблон("Поле_%1_%2", СтруктураПоля.Имя, СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "_"));
		
		РеквизитПоля = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ПараметрыHTML"),, СтруктураПоля.Синоним);
		мРеквизиты.Добавить(РеквизитПоля);
		
		ЭлементПоля = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), ЭлементГруппировакиПолей);
		ЭлементПоля.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементПоля.КнопкаСоздания = Ложь;
		ЭлементПоля.КнопкаОткрытия = Ложь;
		ЭлементПоля.КнопкаВыпадающегоСписка = Ложь;
		ЭлементПоля.КнопкаВыбора = Истина;
		ЭлементПоля.ВыбиратьТип = Ложь;
		ЭлементПоля.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСпискеИВПолеВвода;
		ЭлементПоля.УстановитьДействие("ОбработкаВыбора", "ЭлементПоляОбработкаВыбора");
		ЭлементПоля.АвтоОтметкаНезаполненного = СтруктураПоля.Обязательное;
		
		ЧастиТекстаПодсказки = Новый Массив;
		ТипКлассификатора = Ложь;
		Для Каждого ТипПоля Из СтруктураПоля.ТипЗначения.Типы() Цикл
			Если ТипПоля = Тип("СправочникСсылка.КлассификаторыМинЗдрава") Тогда
				ТипКлассификатора = Истина;
			Иначе
				ЧастиТекстаПодсказки.Добавить(Строка(ТипПоля));
			КонецЕсли;
		КонецЦикла;
		
		Если ТипКлассификатора Тогда
			ЧастиТекстаПодсказки.Добавить(Строка(Тип("СправочникСсылка.КлассификаторыМинЗдрава")));
			Если СтруктураПоля.Свойство("ВидКлассификатора") Тогда
				ЧастиТекстаПодсказки.Добавить(СтруктураПоля.ВидКлассификатора);
				
				ПараметрыВыбора = Новый Массив;
				ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", СтруктураПоля.ВидКлассификатора));
				ЭлементПоля.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
			КонецЕсли;
		КонецЕсли;
		
		Если ЧастиТекстаПодсказки.Количество() > 0 Тогда
			ЭлементПоля.Подсказка = СтрШаблон(НСтр("ru='Тип параметра: %1'"), СтрСоединить(ЧастиТекстаПодсказки, ", "));
			ЭлементПоля.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		КонецЕсли;
		
		РеквизитыДобавленныхЭлементов.Добавить(Новый Структура("Элемент, ИмяРеквизита", ЭлементПоля, ИмяРеквизита));
		
		ПолеИнтерфейса = ПоляИнтерфейса.Добавить();
		ПолеИнтерфейса.ИмяПоля = СтруктураПоля.Имя;
		ПолеИнтерфейса.ИмяРеквизита = ИмяРеквизита;
		ПолеИнтерфейса.ТипПараметра = СтруктураПоля.ТипЗначения;
		
		Если СтруктураПоля.Свойство("ВидКлассификатора") Тогда
			ПолеИнтерфейса.ВидКлассификатора = СтруктураПоля.ВидКлассификатора;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтруктураТаблицы Из Иерархия.Таблицы Цикл
		ГруппаТаблицы = Элементы.Добавить(СтрШаблон("Группа_%1_%2", СтруктураТаблицы.Имя, СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "_")), Тип("ГруппаФормы"), РодительскийЭлемент);
		ГруппаТаблицы.Заголовок = СтруктураТаблицы.Синоним;
		ГруппаТаблицы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаТаблицы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаТаблицы.ОтображатьЗаголовок = Истина;
		ГруппаТаблицы.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
		ГруппаТаблицы.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		
		ИмяРеквизитаТаблицы = СтрШаблон("Таблица_%1_%2", СтруктураТаблицы.Имя, СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "_"));
		
		РеквизитТаблицы = Новый РеквизитФормы(ИмяРеквизитаТаблицы, Новый ОписаниеТипов("СправочникСсылка.ТаблицыШаблоновПриема"),, СтрШаблон(НСтр("ru='Таблица ""%1""'"), СтруктураТаблицы.Синоним));
		мРеквизиты.Добавить(РеквизитТаблицы);
		
		ЭлементТаблицы = Элементы.Добавить(ИмяРеквизитаТаблицы, Тип("ПолеФормы"), ГруппаТаблицы);
		ЭлементТаблицы.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементТаблицы.КнопкаСоздания = Ложь;
		ЭлементТаблицы.КнопкаОткрытия = Ложь;
		ЭлементТаблицы.КнопкаВыпадающегоСписка = Ложь;
		ЭлементТаблицы.КнопкаВыбора = Истина;
		ЭлементТаблицы.ВыбиратьТип = Ложь;
		ЭлементТаблицы.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСпискеИВПолеВвода;
		ЭлементТаблицы.УстановитьДействие("ОбработкаВыбора", "ЭлементТаблицыОбработкаВыбора");
		ЭлементТаблицы.АвтоОтметкаНезаполненного = СтруктураТаблицы.Обязательное;
		
		РеквизитыДобавленныхЭлементов.Добавить(Новый Структура("Элемент, ИмяРеквизита", ЭлементТаблицы, ИмяРеквизитаТаблицы));
		
		ГруппаПолейТаблицы = Элементы.Добавить(СтрШаблон("ПоляГруппы_%1_%2", СтруктураТаблицы.Имя, СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "_")), Тип("ГруппаФормы"), ГруппаТаблицы);
		ГруппаПолейТаблицы.Заголовок = СтрШаблон(НСтр("ru='Поля таблицы ""%1""'"), СтруктураТаблицы.Синоним);
		ГруппаПолейТаблицы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПолейТаблицы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаПолейТаблицы.ОтображатьЗаголовок = Истина;
		ГруппаПолейТаблицы.СквозноеВыравнивание = СквозноеВыравнивание.Использовать;
		
		ТаблицаИнтерфейса = ТаблицыИнтерфейса.Добавить();
		ТаблицаИнтерфейса.ИмяТаблицы = СтруктураТаблицы.Имя;
		ТаблицаИнтерфейса.ИмяРеквизита = ИмяРеквизитаТаблицы;
		
		СформироватьРеквизитыИнтерфейса(мРеквизиты, РеквизитыДобавленныхЭлементов, СтруктураТаблицы.Подчиненные, ГруппаТаблицы, ГруппаПолейТаблицы)
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНаличиеПараметровНекорректногоТипа()
	
	ЕстьПараметрыНекорректногоТипа = Ложь;
	
	Для Каждого СтрокаПоля Из ПоляИнтерфейса Цикл
		Если Не ЗначениеЗаполнено(ЭтотОбъект[СтрокаПоля.ИмяРеквизита]) Тогда
			Продолжить;
		КонецЕсли;
		Если Не ТипыДанныхСовпадают(СтрокаПоля.ТипПараметра, ЭтотОбъект[СтрокаПоля.ИмяРеквизита].ТипЗначения) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru='Тип поля %1 не совпадает с требуемым!'"), СтрокаПоля.ИмяРеквизита));
			ЕстьПараметрыНекорректногоТипа = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьПараметрыНекорректногоТипа;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТипыДанныхСовпадают(Знач ОписаниеДопустимогоТипа, Знач ОписаниеТипаВыбранногоПараметра)
	
	ДопустимыеТипы = ОписаниеДопустимогоТипа.Типы();
	ТипыВыбранногоПараметра = ОписаниеТипаВыбранногоПараметра.Типы();
	
	Для Каждого ТипВыбранногоПараметра Из ТипыВыбранногоПараметра Цикл
		Если ДопустимыеТипы.Найти(ТипВыбранногоПараметра) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти