
Процедура ПередЗаписью(Отказ, Замещение)
		
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Поступление = Запись.ПлатежныйДокумент.ПолучитьОбъект(); 
		
		НаборЗаписей = Поступление.Движения.омг_ОстаткиПредоплаты;
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		Если Запись.Статус = Перечисления.омг_СтатусыПредоплаты.ОплатаПринята Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Клиент = Поступление.Клиент;
			НоваяЗапись.Сумма = Запись.Сумма;
			НоваяЗапись.Регистратор = Поступление.Ссылка; 
			НоваяЗапись.ДокументПоступления = Поступление.Ссылка;
			НоваяЗапись.Период = Поступление.Дата; 
			
			Если ЗначениеЗаполнено(Поступление.ДокументОснование) и ТипЗнч(Поступление.ДокументОснование) = Тип("ДокументСсылка.Заявка") Тогда
				
					ДатаПереходаНаУчетПоЗаявкам = омг_Предоплата.ВернутьДатуПереходаУчетаПоЗаявкам(омг_ДополнительныеАлгоритмы.омг_ВернутьОрганизациюПоФилиалу(Поступление.Филиал));
					
					Если ЗначениеЗаполнено(ДатаПереходаНаУчетПоЗаявкам) и Поступление.Дата >= ДатаПереходаНаУчетПоЗаявкам Тогда
						НоваяЗапись.Заявка = Поступление.ДокументОснование;
					КонецЕсли;
					
			КонецЕсли;
			
			НаборЗаписей.Записать(Истина);
		КонецЕсли;	
	КонецЦИкла;	
			
КонецПроцедуры
