#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ПометкаУдаления Тогда
		МедосмотрыСервер.ОчиститьОтметкиВыполненияДействияМедосмотра(Ссылка);
	Иначе
		ТаблицаОтметок = Новый ТаблицаЗначений;
		ТаблицаОтметок.Колонки.Добавить("Действие");
		ТаблицаОтметок.Колонки.Добавить("Выполнено");
		ТаблицаОтметок.Колонки.Добавить("Изменено");
		Для Каждого СтрокаДействие Из ДействияМедосмотра Цикл
			ТаблицаОтметок.Добавить().Действие = СтрокаДействие.Действие;
		КонецЦикла;
		ТаблицаОтметок.ЗаполнитьЗначения(Истина, "Выполнено, Изменено");
		
		МедосмотрыСервер.ЗаписатьОтметкиВыполненияДействияМедосмотра(Ссылка, ПрохождениеМедОсмотра, ТаблицаОтметок, Дата);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти