#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.НастройкиТекущегоПользователя = Истина Тогда
		ПрочитатьНастройкиПользователя(DICOMРаботаСДрайвером.ТекущийПользователь());
		Элементы.Пользователь.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КаталогФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогВыбораКаталога = Новый ДиалогВыбораФайла(Режим);
	ДиалогВыбораКаталога.МножественныйВыбор = Ложь;
	Если ДиалогВыбораКаталога.Выбрать() Тогда
		Каталог = ДиалогВыбораКаталога.Каталог;
		Если Элемент.Имя = "DCMTK_STORESCP_КаталогФайлов" Тогда
			ЭтаФорма.Запись.DCMTK_STORESCP_КаталогФайлов = Каталог;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьНастройкиПользователя(Пользователь)
	МЗ = РегистрыСведений.НастройкиDICOM.СоздатьМенеджерЗаписи();
	МЗ.Пользователь = Пользователь;
	МЗ.Прочитать();
	Если МЗ.Выбран() Тогда
		ЗначениеВДанныеФормы(МЗ, ЭтаФорма.Запись);
	Иначе
		ЭтаФорма.Запись.Пользователь = Пользователь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
