
&НаСервере
Функция ПолучитьКлиентаПоЗаявке(Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Заявка.Клиент КАК Клиент
	               |ИЗ
	               |	Документ.Заявка КАК Заявка
	               |ГДЕ
	               |	Заявка.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Клиент;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если СтрНайти(ПараметрыВыполненияКоманды.Источник.ИмяФормы, "ФормаДокумента") > 0 Тогда
		Клиент = ПараметрыВыполненияКоманды.Источник.Объект.Клиент;
	Иначе
		Клиент = ПолучитьКлиентаПоЗаявке(ПараметрКоманды);
	КонецЕсли;
	
	Чат = iga_ОбработкаДанныхПоЧатамСервер.ПолучитьЧатКлиента(Клиент);
	
	ОткрытьФорму("Обработка.iga_ChatBot.Форма.ФормаПросмотраЧата", Новый Структура("Чат", Чат), 
		ПараметрыВыполненияКоманды.Источник,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
