#Область РазделОписанияПеременных

&НаКлиенте
Перем ЗаголовокДвиженияПоОтделениям;

&НаКлиенте
Перем ЗаголовокХирургическихОпераций;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма);
	
	НастроитьЭлементыФормыПриСоздании();
	
	УстановитьВидимостьВидОплаты();
	
	Если Параметры.Свойство("Основание")
		И ТипЗнч(Параметры.Основание) = Тип("ДокументСсылка.ОбращениеВСтационар") 
		И Не ЗначениеЗаполнено(Объект.Ссылка)
	Тогда
		ЗаполнитьТаблицыДаннымиБазы();
	КонецЕсли;
	
	#Область ЭлектронныеПодписи
	ИспользуютсяЭП = ЭЦП_УМЦ_Сервер.ИспользоватьЭлектронныеПодписиЭМК();
	
	Если ИспользуютсяЭП И Не Объект.Ссылка.Пустая() Тогда
		Если Объект.ПодписанЭП Тогда
			ОбновитьСписокПодписей();
		Иначе
			доп_СертификатыЭЦП.ЗаполнитьСводкуПодписей(Объект.Ссылка, СводкаHTML, ЭлектронныеПодписи);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьДоступностьВидимостьПоЭП();
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	УстановитьТипыОтборыЭлементовКлассификаторовМинздрава();
	ЗаголовокДвиженияПоОтделениям = Элементы.СтраницаДвиженияПациентаПоОтделениям.Заголовок;
	ЗаголовокХирургическихОпераций = Элементы.СтраницаХирургическиеОперации.Заголовок;
	ОбновитьЗаголовкиСтраницТаблиц();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменилисьПодписи"
		И Параметр = Объект.Ссылка
	Тогда
		ЭтотОбъект.Прочитать();
		ОбновитьДанныеПослеПодписания();
	ИначеЕсли ИмяСобытия = "ОбновитьСписокПодписей"
		И Параметр = Объект.Ссылка
	Тогда
		ОбновитьСписокПодписей();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискКлиентов(Команда)
	
	ФормаКлиента = ПолучитьФорму("ОбщаяФорма.ФормаПоискаКлиентаУпр", , Элементы.Клиент);
	ФормаКлиента.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОсновныеДанные(Команда)
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ДанныДляЗаполнения = ПолучитьДанныеДляЗаполненияПоКлиенту(Объект.Клиент);
		ЗаполнитьЗначенияСвойств(Объект, ДанныДляЗаполнения);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьТаблицы(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.МедицинскаяКарта) Тогда
		ПоказатьПредупреждение(, "Для заполнения необходимо указать медицинскую карту");
		Возврат;
	КонецЕсли;
	
	Если Объект.ДвиженияПациентаПоОтделениям.Количество() > 0 
		Или Объект.ХирургическиеОперации.Количество() > 0 
	Тогда
		Ответ = Ждать Вопрос("Списки движений по отделениям и операций будут очищены и перезаполнены. Продолжить?", РежимДиалогаВопрос.ОКОтмена,30,КодВозвратаДиалога.ОК);
		Если Ответ = КодВозвратаДиалога.ОК Тогда
			ЗаполнитьТаблицыДаннымиБазы();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПродолжение(Результат, Контекст) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Истина;
		ЗаполнитьТаблицыДаннымиБазы();
		ОбновитьЗаголовкиСтраницТаблиц();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьДвиженияПациентаПоОтделениям(Команда)
	
	Если Ждать ВопросПродолжитьПерезаполнениеСписка(Объект.ДвиженияПациентаПоОтделениям) Тогда
		ПерезаполнитьХирургическиеОперации();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьХирургическиеОперации(Команда)
	
	Если Ждать ВопросПродолжитьПерезаполнениеСписка(Объект.ХирургическиеОперации) Тогда
		ПерезаполнитьХирургическиеОперации();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	ПеречитатьОсновныеДанные(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияПациентаПоОтделениямПриИзменении(Элемент)
	
	ОбновитьЗаголовкиСтраницТаблиц();
	
КонецПроцедуры

&НаКлиенте
Процедура ХирургическиеОперацииПриИзменении(Элемент)
	
	ОбновитьЗаголовкиСтраницТаблиц();
	
КонецПроцедуры

&НаКлиенте
Процедура МедицинскаяКартаПриИзменении(Элемент)
	
	Объект.ДокументОснование = ПолучитьОбращениеПоМедкарте(Объект.МедицинскаяКарта);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьЭлементыФормыПриСоздании()
	
	// Установка отбора вида медкарт по типу Стационарная.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыМедицинскихКарт.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыМедицинскихКарт КАК ВидыМедицинскихКарт
	|ГДЕ
	|	ВидыМедицинскихКарт.ТипКарты = ЗНАЧЕНИЕ(Перечисление.ТипыМедицинскихКарт.Стационар)";
	ПараметрыВыбораЗначения = Новый Массив;
	ПараметрыВыбораЗначения.Добавить(Новый ПараметрВыбора("Отбор.ВидКарты", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка")));
	Элементы.МедицинскаяКарта.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЗначения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеДляЗаполненияПоКлиенту(Клиент)
	
	ДанныеДляЗаполнения = ПолучитьДанныеКлиента(Клиент);
	Если ЗначениеЗаполнено(ДанныеДляЗаполнения.МедицинскаяКарта) Тогда
		ДанныеДляЗаполнения.Вставить("ДокументОснование", ПолучитьОбращениеПоМедкарте(ДанныеДляЗаполнения.МедицинскаяКарта));
	КонецЕсли;
	
	Возврат ДанныеДляЗаполнения;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОбращениеПоМедкарте(МедицинскаяКарта)
	
	ОписаниеПребывания = Стационар.ПолучитьОписаниеПребыванияПациентаВСтационареПоМедкарте(МедицинскаяКарта);
	Возврат ОписаниеПребывания.Обращение;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеКлиента(Клиент)
	
	Возврат Документы.Форма066.ПолучитьДанныеКлиента(Клиент);
	
КонецФункции

&НаКлиенте
Процедура УстановитьТипыОтборыЭлементовКлассификаторовМинздрава()
	
	УстановитьОграничениеТипаПоКлассификатору(Элементы.ХирургическиеОперацииАнестезия);
	УстановитьОграничениеТипаПоКлассификатору(Элементы.ХирургическиеОперацииВидОплаты);
	УстановитьОграничениеТипаПоКлассификатору(Элементы.ДвиженияПациентаПоОтделениямВидОплаты);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничениеТипаПоКлассификатору(Элемент)
	
	мТипКлассификатора = Новый Массив();
	мТипКлассификатора.Добавить(Тип("СправочникСсылка.КлассификаторыМинЗдрава"));
	Элемент.ОграничениеТипа = Новый ОписаниеТипов(мТипКлассификатора);
	Элемент.РедактированиеТекста = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовкиСтраницТаблиц()
	
	Элементы.СтраницаДвиженияПациентаПоОтделениям.Заголовок = СтрШаблон("%1 (%2)", ЗаголовокДвиженияПоОтделениям, Объект.ДвиженияПациентаПоОтделениям.Количество());
	Элементы.СтраницаХирургическиеОперации.Заголовок = СтрШаблон("%1 (%2)", ЗаголовокХирургическихОпераций, Объект.ХирургическиеОперации.Количество());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьВидОплаты()
	
	Видимость = Ложь;
	
	Если Объект.Дата < Документы.Форма066.Дата530н() Тогда
		Видимость = Истина;
	КонецЕсли;
	
	Если Не Видимость Тогда
		Для Каждого Эл Из Объект.ХирургическиеОперации Цикл
			Если ЗначениеЗаполнено(Эл.ВидОплаты) Тогда
				Видимость = Истина;
			КонецЕсли;
		КонецЦикла;
		Для Каждого Эл Из Объект.ДвиженияПациентаПоОтделениям Цикл
			Если ЗначениеЗаполнено(Эл.ВидОплаты)
				Или ЗначениеЗаполнено(Эл.ПрерванныйСлучай)
				Или ЗначениеЗаполнено(Эл.МедицинскийСтандарт)
			Тогда
				Видимость = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
	Элементы.ХирургическиеОперацииВидОплаты.Видимость = Видимость;
	Элементы.ДвиженияПациентаПоОтделениямВидОплаты.Видимость = Видимость;
	Элементы.ДвиженияПациентаПоОтделениямМедицинскийСтандарт.Видимость = Видимость;
	Элементы.ДвиженияПациентаПоОтделениямПрерванныйСлучай.Видимость = Видимость;
	
КонецПроцедуры

&НаКлиенте
Асинх Функция ВопросПродолжитьПерезаполнениеСписка(Список)
	
	Если Список.Количество() <> 0 Тогда
		Ответ = Ждать Вопрос("Текущий список будет очищен и перезаполнен. Продолжить?", РежимДиалогаВопрос.ОКОтмена,30,КодВозвратаДиалога.ОК);
		Возврат Ответ = КодВозвратаДиалога.ОК;
	КонецЕсли;
	
	Возврат Истина;		
	
КонецФункции
 
&НаСервере
Процедура ПерезаполнитьДвиженияПациентаПоОтделениям()
	
	ДвиженияПациентаПоОтделениям = Стационар.ПолучитьДанныеДвиженияПациентаПоОтделениям(Объект.МедицинскаяКарта);
	
	Объект.ДвиженияПациентаПоОтделениям.Очистить();
	Для Каждого СтрокаЗаполнения Из ДвиженияПациентаПоОтделениям Цикл
		ЗаполнитьЗначенияСвойств(Объект.ДвиженияПациентаПоОтделениям.Добавить(), СтрокаЗаполнения);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьХирургическиеОперации()
	
	ХирургическиеОперации = Стационар.ПолучитьДанныеХирургическихОпераций(Объект.МедицинскаяКарта);
	
	Объект.ХирургическиеОперации.Очистить();
	Для Каждого СтрокаЗаполнения Из ХирургическиеОперации Цикл
		НоваяСтрока = Объект.ХирургическиеОперации.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗаполнения);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыДаннымиБазы()
	
	ПерезаполнитьДвиженияПациентаПоОтделениям();
	ПерезаполнитьХирургическиеОперации();
	
КонецПроцедуры 

#КонецОбласти

#Область ЭлектронныеПодписи

#Область ЭлектронныеПодписиКоманды

&НаКлиенте
Процедура ПодписатьВсе(Команда)
	
	ЭЦП_УМЦ_Клиент.ПерейтиКПодписаниюЭМД(ЭтотОбъект, Ложь, Ложь, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКПодписаниюЭМД(Команда)
	
	ЭЦП_УМЦ_Клиент.ПерейтиКПодписаниюЭМД(ЭтотОбъект, Истина, Ложь, Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписиСлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокПодписей()
	
	доп_СертификатыЭЦП.ЗаполнитьСписокПодписей(Объект.Ссылка, УникальныйИдентификатор, Элементы.ГруппаЭП, ЭлектронныеПодписи, , СводкаHTML);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПослеПодписания()
	
	ОбновитьСписокПодписей();
	УстановитьДоступностьВидимостьПоЭП();
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписиУправлениеДоступностьюПолей

&НаСервере
Процедура УстановитьДоступностьВидимостьПоЭП()
	
	Элементы.ГруппаЭП.Видимость = ИспользуютсяЭП;
	
	//ЭтоСупервайзер = ЭЦП_УМЦ_Сервер.ЭтоСупервайзер();
	ОтсутствуютПраваНаИзменение = Не ПравоДоступа("Изменение", Объект.Ссылка.Метаданные());
	
	//ИзмененияЗапрещены = ОтсутствуютПраваНаИзменение Или (ИспользуютсяЭП И Не ЭтоСупервайзер И Объект.ПодписанЭП);
	ИзмененияЗапрещены = ОтсутствуютПраваНаИзменение Или (ИспользуютсяЭП И Объект.ПодписанЭП);
	
	РаботаСФормамиКлиентСервер.УстановитьДоступностьЭлементаФормы(Элементы, "Дата",									Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьДоступностьЭлементаФормы(Элементы, "СтраницаОсновная",						Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьДоступностьЭлементаФормы(Элементы, "СтраницаПатологоанатомическийДиагноз",	Не ИзмененияЗапрещены);
	
	РаботаСФормамиКлиентСервер.УстановитьПолеЭлементаФормы(Элементы, "ПоискКлиентов",			 "Доступность", Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьПолеЭлементаФормы(Элементы, "ПеречитатьОсновныеДанные", "Доступность", Не ИзмененияЗапрещены);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
