
Функция ПолучитьНастройки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.омг_НастройкиИнтеграцииСN8N КАК омг_НастройкиИнтеграцииСN8N";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураНастроек = Новый Структура;
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СтруктураНастроек.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СтруктураНастроек;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, Выборка);
	
	Возврат СтруктураНастроек;
	
КонецФункции
