
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаписьРегистра = РегистрыСведений.омг_НастройкиИнтеграцииСN8N.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Прочитать();
	ЗаполнитьЗначенияСвойств(Запись, ЗаписьРегистра);
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеПароля = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ИнтеграцияСN8N", "Пароль");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не ДанныеПароля = Неопределено Тогда
		Пароль = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.омг_ОтправкаРасписанияN8N);
	РегламентноеЗаданиеИспользуется = РеглЗадание.Использование;
	АдресРасписания = ПоместитьВоВременноеХранилище(РеглЗадание.Расписание, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.омг_ОтправкаРасписанияN8N);
	РеглЗадание.Расписание = ПолучитьИзВременногоХранилища(АдресРасписания);
	РеглЗадание.Использование = РегламентноеЗаданиеИспользуется;
	РеглЗадание.Записать();
	
	ЗаписьРегистра = РегистрыСведений.омг_НастройкиИнтеграцииСN8N.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьРегистра, Запись);
	ЗаписьРегистра.Записать();
	
	Если ПарольИзменен Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("омг_ИнтеграцияСN8N", Новый ХранилищеЗначения(Пароль), "Пароль");
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	ПарольИзменен = Ложь;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ЗаписатьРасписание(Расписание, ДопПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресРасписания = ПоместитьВоВременноеХранилище(Расписание);
	
КонецПроцедуры

&НаКлиенте
Процедура Расписание(Команда)
	
	Расписание = ПолучитьИзВременногоХранилища(АдресРасписания);
	
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	ДиалогРасписания.Показать(Новый ОписаниеОповещения("Обработчик_ЗаписатьРасписание", ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьХешБазы(Команда)
	ХешБазы = ПолучитьХешБазыНаСервере();
	Элементы.ХешБазы.Видимость = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьХешБазыНаСервере()
	Возврат омг_ДополнительныеАлгоритмы.ПолучитьТекущийХэшБазы();
КонецФункции
