
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураЗаписи = Новый Структура("ПустоеИзмерение", 0);
	МассивСтруктураЗаписи = Новый Массив;
	МассивСтруктураЗаписи.Добавить(СтруктураЗаписи);
	КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.омг_НастройкиПодключенияБазыЗнаний", МассивСтруктураЗаписи);
	
	Параметрыформы = Новый Структура("Ключ", КлючЗаписи);                            
	Попытка
		ОткрытьФорму("РегистрСведений.омг_НастройкиПодключенияБазыЗнаний.Форма.ФормаЗаписи", Параметрыформы);
	Исключение
		ОткрытьФорму("РегистрСведений.омг_НастройкиПодключенияБазыЗнаний.Форма.ФормаЗаписи");
	КонецПопытки;
	

КонецПроцедуры
