
Функция ПолучитьМедКартуСтационара(Клиент, ТолькоОткрытые = Истина) Экспорт
	
	МедКартыСтационара = ПолучитьМедКартыСтационара(Клиент, ТолькоОткрытые);
	
	Если МедКартыСтационара.Количество() > 0 Тогда 
		Возврат МедКартыСтационара[0];
	Иначе 
		Возврат Справочники.МедицинскиеКарты.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Возвращает массив медкарт стационара клиента.
//
// Параметры:
//  Клиент	 - СправочникСсылка.Клиенты - Клиент.
// 
// Возвращаемое значение:
//   - Массив.
//
Функция ПолучитьМедКартыСтационара(Клиент, ТолькоОткрытые) Экспорт
	// Изменения Макеев 11-02-2026 (
	
	ОсновнаяМедицинскаяКарта = Клиент.ОсновнаяМедицинскаяКарта;

	ПрочиеНастройки = омг_МедицинскаяДеятельность.ПолучитьПрочиеНастройкиСистемы();
	ТипКарты = Перечисления.ТипыМедицинскихКарт.Стационар;
	Если ПрочиеНастройки.Свойство("ТипКартыСтационара") Тогда
		ТипКарты = ПрочиеНастройки.ТипКартыСтационара;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МедицинскиеКарты.Ссылка КАК МедКарта
	                      |ИЗ
	                      |	РегистрСведений.омг_ТекущиеМедицинскиеКарты.СрезПоследних КАК омг_ТекущиеМедицинскиеКартыСрезПоследних
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МедицинскиеКарты КАК МедицинскиеКарты
	                      |		ПО омг_ТекущиеМедицинскиеКартыСрезПоследних.МедицискаяКарта = МедицинскиеКарты.Ссылка
	                      |ГДЕ
	                      |	МедицинскиеКарты.Клиент = &Клиент
	                      |	И МедицинскиеКарты.ВидКарты.ТипКарты = &ТипКарты
	                      |	И (&ТолькоОткрытые = ЛОЖЬ
	                      |			ИЛИ МедицинскиеКарты.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	                      |	И омг_ТекущиеМедицинскиеКартыСрезПоследних.Активна
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	МедицинскиеКарты.Ссылка <> &МедКарта,
	                      |	МедицинскиеКарты.ДатаЗакрытия <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0),
	                      |	МедицинскиеКарты.ДатаРегистрации УБЫВ");
	Запрос.УстановитьПараметр("Клиент",Клиент);
	Запрос.УстановитьПараметр("МедКарта",ОсновнаяМедицинскаяКарта);
	Запрос.УстановитьПараметр("ТолькоОткрытые",ТолькоОткрытые);
	Запрос.УстановитьПараметр("ТипКарты",ТипКарты);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Медкарта");
	
КонецФункции

Функция ЭтоМедКартаСтационара(МедицинскаяКарта) Экспорт
	
	Возврат ЗначениеЗаполнено(МедицинскаяКарта)
			// Изменено Макеевв (
			И (МедицинскаяКарта.ВидКарты.ТипКарты = Перечисления.ТипыМедицинскихКарт.Стационар
			Или МедицинскаяКарта.ВидКарты.ТипКарты = Перечисления.ТипыМедицинскихКарт.омг_СтационарРК);
			// )
		
КонецФункции

Процедура ПередРассчетомДвиженийВыполненияПланаЛечения(ВыполнениеПлана, Регистратор, МедицинскаяКарта) Экспорт
	
	Если Не ЭтоМедКартаСтационара(МедицинскаяКарта) Тогда
		Возврат;
	КонецЕсли;
	
	// Допустимые исполнители такой номенклатуры выполнения плана
	ДопустимыеИсполнители = Новый Массив;
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.ДействияЗаСутки") Тогда
		ДопустимыеИсполнители.Добавить(Перечисления.ИсполнителиВСтационаре.ВыполняетсяМедсестрой);
		// Добавлено Макеев (
		ДопустимыеИсполнители.Добавить(Перечисления.ИсполнителиВСтационаре.ВыполняетсяВрачомОтображается);
		// )
	Иначе
		ДопустимыеИсполнители.Добавить(Перечисления.ИсполнителиВСтационаре.ВыполняетсяВрачом);
		ДопустимыеИсполнители.Добавить(Перечисления.ИсполнителиВСтационаре.ВыполняетсяВрачомОтображается);
		ДопустимыеИсполнители.Добавить(Перечисления.ИсполнителиВСтационаре.ПустаяСсылка());
	КонецЕсли;
	
	// Какая номенклатура документа отмечается им как выполнение плана лечения?
	НоменклатураВыполнения = ВыполнениеПлана.ВыгрузитьКолонку("Номенклатура");
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НоменклатураВыполнения", НоменклатураВыполнения);
	Запрос.УстановитьПараметр("ДопустимыеИсполнители", ДопустимыеИсполнители);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&НоменклатураВыполнения)
	|	И Номенклатура.ИсполнительВСтационаре В(&ДопустимыеИсполнители)"
	;
	НоменклатураДопустимая = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	// Удаление лишних строк из таблицы выполнения плана
	мОбрИнд = ВыполнениеПлана.Количество()-1;
	Для Сч = 0 По мОбрИнд Цикл
		
		СтрокаТЗ = ВыполнениеПлана[мОбрИнд-Сч];
		Если НоменклатураДопустимая.Найти(СтрокаТЗ.Номенклатура) = Неопределено Тогда
			ВыполнениеПлана.Удалить(мОбрИнд-Сч);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает значение Шаблона осмотра для переданной роли и специализации
//
// Параметры:
//  РольШаблона - ПеречислениеСсылка.РольШаблоновСтационара - Роль шаблона
//	Специализация - СправочникСсылка.КатегорииВыработки - Специализация, для которой необходимо получить шаблон 
//
// Возвращаемое значение:
//  СправочникСсылка.ШаблоныHTML
//
Функция ПолучитьШаблонОсмотраМедицинскогоДокумента(РольШаблона = Неопределено, Специализация = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если РольШаблона = Неопределено Тогда 
		РольШаблона = Перечисления.РольШаблоновСтационара.ДневниковаяЗапись;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныМедицинскихДокументов.ШаблонОсмотра КАК ШаблонОсмотра,
		|	ВЫБОР
		|		КОГДА ШаблоныМедицинскихДокументов.Специализация = &Специализация
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Приоритет
		|ИЗ
		|	РегистрСведений.ШаблоныМедицинскихДокументовСтационара КАК ШаблоныМедицинскихДокументов
		|ГДЕ
		|	ШаблоныМедицинскихДокументов.РольШаблона = &РольШаблона
		|	И (ШаблоныМедицинскихДокументов.Специализация = &Специализация
		|			ИЛИ ШаблоныМедицинскихДокументов.Специализация = ЗНАЧЕНИЕ(Справочник.КатегорииВыработки.ПустаяСсылка))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	Запрос.УстановитьПараметр("РольШаблона", РольШаблона);
	Запрос.УстановитьПараметр("Специализация", Специализация);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ШаблонОсмотра;
	Иначе
		Возврат Справочники.ШаблоныHTML.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Койки, в настоящее время привязанные к указанной Палате.
//
// Параметры:
//  Палата	 - СправочникСсылка.Палаты	 - палата.
// 
// Возвращаемое значение:
//  Массив - из СправочникСсылка.КойкоМеста.
//
Функция КойкиПалаты(Палата) Экспорт
	
	Койки = Новый Массив;
	
	Выб  = Справочники.КойкоМеста.Выбрать(, Палата);
	Пока Выб.Следующий() Цикл
		Если Не Выб.ПометкаУдаления Тогда
			Койки.Добавить(Выб.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Койки;
	
КонецФункции

Процедура ПроверитьВозможностьИзмененияСостоянияКойкоМеста(ДокументОбъект, ТаблицаУслуг = Неопределено, Отказ) Экспорт
	
	Перем ТаблицаСостоянияКойкоМест;
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.БронированиеКойкоМеста"));
	МассивТипов.Добавить(Тип("ДокументСсылка.УстановкаУсловийПребывания"));	
	
	СтруктураДанных = Новый Структура("Клиент,КойкоМесто,ДатаНачала,ДатаОкончания,Ссылка,Дата");

	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.БронированиеКойкоМеста") Тогда 
		
		ЗаполнитьЗначенияСвойств(СтруктураДанных,ДокументОбъект);
		
		ПолучитьЗанятостьКойкоМест(СтруктураДанных,ТаблицаСостоянияКойкоМест);
		ОбработатьДанныеПоСостояниюКойкоМест(ТаблицаСостоянияКойкоМест,ДокументОбъект,Отказ);
		
		Если Не Отказ Тогда 
			ТекстСообщения = ПроверитьПациентов(СтруктураДанных,ТаблицаСостоянияКойкоМест,Отказ);
			Если ТекстСообщения <> "" Тогда
				Сообщить(ТекстСообщения);
			КонецЕсли;
			// Проводим движение
			ВыполнитьДвиженияПоРегиструСостояниеКойкоМеста(ДокументОбъект,Справочники.ВидыСостоянийКойкоМест.Бронь,Отказ);
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УстановкаУсловийПребывания") Тогда	
		Если ДокументОбъект.ВидОперации = Перечисления.ВидыДвиженияВСтационаре.Поступление Тогда 
			// Проверим свободно ли койко-место, если да, то проведем движения по регистрам КлиентыСтационара и СостоянияКойкоМест.

			ЗаполнитьЗначенияСвойств(СтруктураДанных,ДокументОбъект);
			ПолучитьЗанятостьКойкоМест(СтруктураДанных,ТаблицаСостоянияКойкоМест);
			ОбработатьДанныеПоСостояниюКойкоМест(ТаблицаСостоянияКойкоМест,ДокументОбъект,Отказ);
			
			ТекущийДокументПоступления = ПолучитьДокументПоступленияПациентаСтационара(ДокументОбъект.Клиент, ДокументОбъект.Дата);
			Если ЗначениеЗаполнено(ТекущийДокументПоступления) Тогда
				
				ТекстСообщения	= "Пациент уже числится в стационаре по состоянию на " + Формат(ДокументОбъект.Дата, "ДФ=dd.MM.yyyy") + ".
				|Документ поступления пациента: " + ТекущийДокументПоступления + "
				|Проведение документа с видом операции " + Строка(ДокументОбъект.ВидОперации) + " невозможно!";
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка);
				
				Отказ = Истина;
			КонецЕсли;

			Если Не Отказ Тогда 
				
				ВыполнитьДвиженияПоРегиструКлиентыСтационара(ДокументОбъект, ДокументОбъект.Ссылка, Отказ);
				ВыполнитьДвиженияПоРегиструСостояниеКойкоМеста(ДокументОбъект,Справочники.ВидыСостоянийКойкоМест.ЗанятоПациентом,Отказ);
				ДвиженияПоРегиструУсловияПребывания(ДокументОбъект,ТаблицаУслуг,Отказ);				
			КонецЕсли;
				
		ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыДвиженияВСтационаре.ИзменениеУсловий Тогда 

			ЗаполнитьЗначенияСвойств(СтруктураДанных,ДокументОбъект);
			ПолучитьЗанятостьКойкоМест(СтруктураДанных,ТаблицаСостоянияКойкоМест);
			ОбработатьДанныеПоСостояниюКойкоМест(ТаблицаСостоянияКойкоМест,ДокументОбъект,Отказ);
			
			Если Не Отказ Тогда 
				ТекущийДокументПоступления = ПолучитьДокументПоступленияПациентаСтационара(ДокументОбъект.Клиент, ДокументОбъект.Дата);
				Если Не ЗначениеЗаполнено(ТекущийДокументПоступления) Тогда
					
					ТекстСообщения	= "Пациент не числится в стационаре по состоянию на " + Формат(ДокументОбъект.Дата, "ДФ=dd.MM.yyyy") + ".
									  |Проведение документа с видом операции " + Строка(ДокументОбъект.ВидОперации) + " невозможно!";
								
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка);
					Отказ = Истина;
				КонецЕсли;
				
				Если Не Отказ Тогда 
					ВыполнитьДвиженияПоРегиструКлиентыСтационара(ДокументОбъект, ТекущийДокументПоступления, Отказ);
					ВыполнитьДвиженияПоРегиструСостояниеКойкоМеста(ДокументОбъект,Справочники.ВидыСостоянийКойкоМест.ЗанятоПациентом,Отказ);
				КонецЕсли;
				
				ДвиженияПоРегиструУсловияПребывания(ДокументОбъект,ТаблицаУслуг,Отказ);
			КонецЕсли;
			
		ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыДвиженияВСтационаре.Выписка Тогда
			
			ТекущийДокументПоступления = ПолучитьДокументПоступленияПациентаСтационара(ДокументОбъект.Клиент, ДокументОбъект.ДатаНачала);
			Если Не ЗначениеЗаполнено(ТекущийДокументПоступления) Тогда
				
				ТекстСообщения	= "Пациент не числится в стационаре по состоянию на " + Формат(ДокументОбъект.Дата, "ДФ=dd.MM.yyyy") + ".
								  |Проведение документа с видом операции " + Строка(ДокументОбъект.ВидОперации) + " невозможно!";
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка);
				Отказ = Истина;
			КонецЕсли;
			
			Если Не Отказ Тогда
				// Проводим движение
				ВыполнитьДвиженияПоРегиструКлиентыСтационара(ДокументОбъект, ТекущийДокументПоступления, Отказ, Истина);
				ВыполнитьДвиженияПоРегиструСостояниеКойкоМеста(ДокументОбъект,Справочники.ВидыСостоянийКойкоМест.Свободно,Отказ);
			КонецЕсли;
			
		ИначеЕсли ДокументОбъект.ВидОперации = Перечисления.ВидыДвиженияВСтационаре.ПереводМеждуПодразделениями Тогда
			
			ЗаполнитьЗначенияСвойств(СтруктураДанных,ДокументОбъект);
			ПолучитьЗанятостьКойкоМест(СтруктураДанных,ТаблицаСостоянияКойкоМест);
			ОбработатьДанныеПоСостояниюКойкоМест(ТаблицаСостоянияКойкоМест,ДокументОбъект,Отказ);
			
			Если Не Отказ Тогда
				ТекущийДокументПоступления = ПолучитьДокументПоступленияПациентаСтационара(ДокументОбъект.Клиент, ДокументОбъект.Дата);
				Если Не ЗначениеЗаполнено(ТекущийДокументПоступления) Тогда
					
					ТекстСообщения	= "Пациент не числится в стационаре по состоянию на " + Формат(ДокументОбъект.Дата, "ДФ=dd.MM.yyyy") + ".
									  |Проведение документа с видом операции " + Строка(ДокументОбъект.ВидОперации) + " невозможно!";
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка);
					Отказ = Истина;
				КонецЕсли;
				
				Если Не Отказ И ПолучитьПредыдущееПодразделениеКлиента(ДокументОбъект.ДатаНачала, ДокументОбъект.Клиент) = ДокументОбъект.Подразделение Тогда
					
					ТекстСообщения	= "Пациент уже числится в данном отделении!
									  |Проведение документа с видом операции " + Строка(ДокументОбъект.ВидОперации) + " невозможно!";
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ДокументОбъект.Ссылка);
					Отказ = Истина;
					
				КонецЕсли;
				
				Если Не Отказ Тогда
					ВыполнитьДвиженияПоРегиструКлиентыСтационара(ДокументОбъект, ТекущийДокументПоступления, Отказ);
					ВыполнитьДвиженияПоРегиструСостояниеКойкоМеста(ДокументОбъект,Справочники.ВидыСостоянийКойкоМест.ЗанятоПациентом,Отказ);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает последнее подразделение, в котором находился клиент
//
// Параметры:
//  Период	 - Дата						 - дата, на который нужно найти подразделение.
//  Клиент	 - СправочникСсылка.Клиенты	 - Клиент.
// 
// Возвращаемое значение:
//  СправочникСсыкла.КойкоМесто - Последняя занятая клиентом койка.
//
Функция ПолучитьПредыдущееПодразделениеКлиента(Дата, Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлиентыСтационараСрезПоследних.Подразделение КАК Подразделение
	               |ИЗ
	               |	РегистрСведений.КлиентыСтационара.СрезПоследних(&Период, Клиент = &Клиент) КАК КлиентыСтационараСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Подразделение;	
	Иначе
		Возврат Справочники.Подразделения.ПустаяСсылка();	
	КонецЕсли;
	
КонецФункции

Процедура ОбработатьДанныеПоСостояниюКойкоМест(ТаблицаСостоянияКойкоМест, ДокументОбъект, Отказ)
	
	Отказ = Ложь;
	Клиент = Строка(ДокументОбъект.Клиент);	
	Если ТаблицаСостоянияКойкоМест <> Неопределено И ТаблицаСостоянияКойкоМест.Количество() > 0  Тогда 
		Для Каждого стрТБ Из ТаблицаСостоянияКойкоМест Цикл
			
			ТекстОшибки = "";
			
			Если стрТБ.ПричинаСостоянияКойкоМеста = "Недоступность" Тогда
				ТекстОшибки = "Койка не существует, или недоступна в какой-то момент времени периода.";	
			Иначе
				Если Строка(стрТБ.Документ) = "" Тогда 
					БлокирующийДокумент =  "";
				Иначе 
					БлокирующийДокумент = " документом " + Строка(стрТБ.Документ);
				КонецЕсли;
				
				ТекстДатаКон = ?(ЗначениеЗаполнено(стрТБ.ДатаОкончания), " по " + Формат(стрТБ.ДатаОкончания,"ДФ='dd.MM.yyyy HH:mm'"), " бессрочно");
				ТекстКонцовка = " с " + Формат(стрТБ.ДатаНачала,"ДФ='dd.MM.yyyy HH:mm'") + ТекстДатаКон + БлокирующийДокумент + ?(ЗначениеЗаполнено(стрТБ.Клиент)," пациентом " + стрТБ.Клиент,"");
				
				Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.БронированиеКойкоМеста") Тогда
					
					ТекстОшибки = "Для койко-места " + стрТБ.КойкоМестоТекст + " бронирование невозможно, так как оно уже занято" + ТекстКонцовка;
					
				ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УстановкаУсловийПребывания") Тогда
					
					ТекстОшибки = "Пациента " + Клиент + " невозможно разместить на койко-месте " + стрТБ.КойкоМестоТекст + ", так как оно уже занято" + ТекстКонцовка;
				КонецЕсли;
			КонецЕсли;
			ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки,Отказ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьДвиженияПоРегиструСостояниеКойкоМеста(ДокументОбъект,СостояниеКойкоМеста,Отказ)
	
	НаборДвижений = ДокументОбъект.Движения.СостояниеКойкоМеста;
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	
	Койка = ПолучитьОсвобождаемоеКойкоМесто(ДокументОбъект.Ссылка, ДокументОбъект.Клиент, ДокументОбъект.ДатаНачала);
	
	// Заполним таблицу движений.
	НоваяЗапись = ТаблицаДвижений.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, ДокументОбъект);
	НоваяЗапись.Состояние 			= СостояниеКойкоМеста;
	НоваяЗапись.КойкоМесто 			= ?(СостояниеКойкоМеста = Справочники.ВидыСостоянийКойкоМест.Свободно, Койка, НоваяЗапись.КойкоМесто);
	НоваяЗапись.ДатаОкончания 		= ?(НоваяЗапись.ДатаОкончания = Дата(1,1,1), Дата(3999, 12, 31, 23, 59, 59), НоваяЗапись.ДатаОкончания);
	
	// Для изменения условий создаем выписку из предыдущей палаты
	Если СостояниеКойкоМеста <> Справочники.ВидыСостоянийКойкоМест.Бронь
		И (ДокументОбъект.ВидОперации = Перечисления.ВидыДвиженияВСтационаре.ИзменениеУсловий
			Или ДокументОбъект.ВидОперации = Перечисления.ВидыДвиженияВСтационаре.ПереводМеждуПодразделениями)
		И Койка <> НоваяЗапись.КойкоМесто 
	Тогда
		ЗаписьВыписка = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(ЗаписьВыписка, ДокументОбъект);
		ЗаписьВыписка.КойкоМесто 		= Койка;
		ЗаписьВыписка.Состояние	 		= Справочники.ВидыСостоянийКойкоМест.Свободно;
		ЗаписьВыписка.ДатаОкончания 	= ?(ЗаписьВыписка.ДатаОкончания = Дата(1,1,1), Дата(3999, 12, 31, 23, 59, 59), ЗаписьВыписка.ДатаОкончания);
	КонецЕсли;
	
	НаборДвижений.мПериод           = ДокументОбъект.ДатаНачала;
	НаборДвижений.мТаблицаДвижений  = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		НаборДвижений.ВыполнитьДвижения();
	КонецЕсли;
	
КонецПроцедуры

// Возвращает предыдущую занятую клиентом койку
//
// Параметры:
//	ДокументСсылка.УстановкаУсловийПребывания	- Документ, по которому клиент освобождает койку
//  Клиент	 									- СправочникСсылка.Клиенты	 - Клиент
//  Период	 									- Дата	 - Период, на который нужно найти койку
// 
// Возвращаемое значение:
// СправочникСсыкла.КойкоМесто  - Последняя занятая клиентом койка
//
Функция ПолучитьОсвобождаемоеКойкоМесто(Документ, Клиент, Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостояниеКойкоМестаСрезПоследних.КойкоМесто КАК КойкоМесто
	               |ИЗ
	               |	РегистрСведений.СостояниеКойкоМеста.СрезПоследних(
	               |			&Период,
	               |			Клиент = &Клиент
	               |				И Регистратор <> &Документ
	               |				И Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийКойкоМест.Свободно)
	               |				И Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийКойкоМест.Бронь)) КАК СостояниеКойкоМестаСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СостояниеКойкоМестаСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КойкоМесто;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции	

Процедура ВыполнитьДвиженияПоРегиструКлиентыСтационара(ДокументОбъект, ДокументПоступления, Отказ, Выписан = Ложь)
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УстановкаУсловийПребывания") Тогда 
		
		НаборДвижений = ДокументОбъект.Движения.КлиентыСтационара;
		ТаблицаДвижений = НаборДвижений.Выгрузить();
		// Заполним таблицу движений.
		СтрокаДвижения = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДвижения,ДокументОбъект);
		СтрокаДвижения.ДокументПоступления = ДокументПоступления;
		СтрокаДвижения.Выписан = Выписан;
		
		НаборДвижений.мПериод           = ДокументОбъект.Дата;
		НаборДвижений.мТаблицаДвижений  = ТаблицаДвижений;
		Если Не Отказ Тогда
			НаборДвижений.ВыполнитьДвижения();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УпорядочитьТаблицуПоПриоритетуСостояний(ТаблицаСостоянияКойкоМест)
	
		
КонецПроцедуры

Процедура ПолучитьЗанятостьКойкоМест(СтруктураДанных,ТаблицаСостоянияКойкоМест)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СостояниеКойкоМеста.Клиент КАК Клиент,
	                      |	СостояниеКойкоМеста.КойкоМесто КАК КойкоМесто,
	                      |	СостояниеКойкоМеста.ДатаНачала КАК ДатаНачала,
	                      |	СостояниеКойкоМеста.ДатаОкончания КАК ДатаОкончания,
	                      |	СостояниеКойкоМеста.Регистратор КАК Документ,
	                      |	ВЫБОР
	                      |		КОГДА СостояниеКойкоМеста.Регистратор ССЫЛКА Документ.БронированиеКойкоМеста
	                      |			ТОГДА ""Бронирование""
	                      |		ИНАЧЕ ""ИзменениеУсловий""
	                      |	КОНЕЦ КАК ПричинаСостоянияКойкоМеста,
	                      |	СостояниеКойкоМеста.КойкоМесто.Представление КАК КойкоМестоТекст
	                      |ПОМЕСТИТЬ ЗанятостьКойки
	                      |ИЗ
	                      |	РегистрСведений.СостояниеКойкоМеста.СрезПоследних(&Дата) КАК СостояниеКойкоМеста
	                      |ГДЕ
	                      |	СостояниеКойкоМеста.Регистратор <> &ДокументСсылка
	                      |	И СостояниеКойкоМеста.Клиент <> &Клиент
	                      |	И СостояниеКойкоМеста.КойкоМесто = &КойкоМесто
	                      |	И (&ДатаНачала МЕЖДУ СостояниеКойкоМеста.ДатаНачала И ВЫБОР
	                      |				КОГДА СостояниеКойкоМеста.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	                      |					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	                      |				ИНАЧЕ СостояниеКойкоМеста.ДатаОкончания
	                      |			КОНЕЦ
	                      |			ИЛИ &ДатаОкончания МЕЖДУ СостояниеКойкоМеста.ДатаНачала И ВЫБОР
	                      |				КОГДА СостояниеКойкоМеста.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	                      |					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	                      |				ИНАЧЕ СостояниеКойкоМеста.ДатаОкончания
	                      |			КОНЕЦ
	                      |			ИЛИ &ДатаНачала <= СостояниеКойкоМеста.ДатаНачала
	                      |				И &ДатаОкончания >= ВЫБОР
	                      |					КОГДА СостояниеКойкоМеста.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	                      |						ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	                      |					ИНАЧЕ СостояниеКойкоМеста.ДатаОкончания
	                      |				КОНЕЦ)
	                      |	И СостояниеКойкоМеста.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийКойкоМест.Свободно)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЗанятостьКойки.Документ КАК Документ,
	                      |	МИНИМУМ(СостояниеКойкоМеста.ДатаОкончания) КАК АктуальнаяДатаОкончания
	                      |ПОМЕСТИТЬ АктуальныеДатыОкончания
	                      |ИЗ
	                      |	ЗанятостьКойки КАК ЗанятостьКойки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеКойкоМеста КАК СостояниеКойкоМеста
	                      |		ПО ЗанятостьКойки.Клиент = СостояниеКойкоМеста.Клиент
	                      |			И ЗанятостьКойки.КойкоМесто = СостояниеКойкоМеста.КойкоМесто
	                      |			И ЗанятостьКойки.ДатаНачала <= СостояниеКойкоМеста.ДатаНачала
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ЗанятостьКойки.Документ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЗанятостьКойки.Клиент КАК Клиент,
	                      |	ЗанятостьКойки.КойкоМесто КАК КойкоМесто,
	                      |	ЗанятостьКойки.ДатаНачала КАК ДатаНачала,
	                      |	АктуальныеДатыОкончания.АктуальнаяДатаОкончания КАК ДатаОкончания,
	                      |	ЗанятостьКойки.Документ КАК Документ,
	                      |	ЗанятостьКойки.ПричинаСостоянияКойкоМеста КАК ПричинаСостоянияКойкоМеста,
	                      |	ЗанятостьКойки.КойкоМестоТекст КАК КойкоМестоТекст
	                      |ИЗ
	                      |	ЗанятостьКойки КАК ЗанятостьКойки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ АктуальныеДатыОкончания КАК АктуальныеДатыОкончания
	                      |		ПО ЗанятостьКойки.Документ = АктуальныеДатыОкончания.Документ
	                      |ГДЕ
	                      |	ЕСТЬNULL(АктуальныеДатыОкончания.АктуальнаяДатаОкончания, ВЫБОР
	                      |				КОГДА ЗанятостьКойки.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	                      |					ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	                      |				ИНАЧЕ ЗанятостьКойки.ДатаОкончания
	                      |			КОНЕЦ) >= &ДатаНачала");
						  
	Запрос.УстановитьПараметр("ДокументСсылка",СтруктураДанных.Ссылка);
	Запрос.УстановитьПараметр("Клиент"		  ,СтруктураДанных.Клиент);
	Запрос.УстановитьПараметр("КойкоМесто"	  ,СтруктураДанных.КойкоМесто);
	Запрос.УстановитьПараметр("ДатаНачала"	  ,СтруктураДанных.ДатаНачала);
	// Добавлено Макеев (
	Запрос.УстановитьПараметр("Дата"	  ,СтруктураДанных.Дата);
	// )
	Запрос.УстановитьПараметр("ДатаОкончания" ,?(СтруктураДанных.ДатаОкончания = Дата(1,1,1), Дата(3999, 12, 31, 23, 59, 59), СтруктураДанных.ДатаОкончания));
	
	ТаблицаСостоянияКойкоМест = Запрос.Выполнить().Выгрузить();
	
	ПроверитьДоступностьКойкоМеста(ТаблицаСостоянияКойкоМест, СтруктураДанных);
   
	УпорядочитьТаблицуПоПриоритетуСостояний(ТаблицаСостоянияКойкоМест);
	
КонецПроцедуры

Процедура ПроверитьДоступностьКойкоМеста(ТаблицаСостоянияКойкоМест, СтруктураДанных)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДвижениеКоечногоФондаСрезПоследних.Койка КАК Койка,
	               |	ДвижениеКоечногоФондаСрезПоследних.Статус КАК Статус,
	               |	""СостояниеНаНачало"" КАК ПричинаЗаписи,
	               |	ДвижениеКоечногоФондаСрезПоследних.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ДвижениеКоечногоФонда.СрезПоследних(&ДатаНачала, Койка = &Койка) КАК ДвижениеКоечногоФондаСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	ДвижениеКоечногоФонда.Койка,
	               |	ДвижениеКоечногоФонда.Статус,
	               |	""Недоступность"" КАК ПричинаЗаписи,
	               |	ДвижениеКоечногоФонда.Период
	               |ИЗ
	               |	РегистрСведений.ДвижениеКоечногоФонда КАК ДвижениеКоечногоФонда
	               |ГДЕ
	               |	ДвижениеКоечногоФонда.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ДвижениеКоечногоФонда.Статус <> ЗНАЧЕНИЕ(Перечисление.СостоянияКоек.ПустаяСсылка)
				   |	И ДвижениеКоечногоФонда.Койка = &Койка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	
	Запрос.УстановитьПараметр("Койка",СтруктураДанных.КойкоМесто);
	Запрос.УстановитьПараметр("ДатаНачала",СтруктураДанных.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",?(СтруктураДанных.ДатаОкончания = Дата(1,1,1), Дата(3999, 12, 31, 23, 59, 59), СтруктураДанных.ДатаОкончания));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() 
		И Выборка.Количество() = 1 
		И Выборка.Статус = Перечисления.СостоянияКоек.ПустаяСсылка() 
	Тогда
		// Одна запись на начало периода о том, что койка свободна
		Возврат;	
	Иначе
		// Койки не существует на начало периода, или она становится недоступной на протяжении периода, 
		//или койку переместили в другую палату в будущем
		Строка = ТаблицаСостоянияКойкоМест.Добавить();
		Строка.КойкоМесто = СтруктураДанных.КойкоМесто;
		Строка.ПричинаСостоянияКойкоМеста = "Недоступность";
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьПациентов(СтруктураДанных,ТаблицаСостоянияКойкоМест,Отказ)
	
	Если Не Отказ Тогда 
	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	КлиентыСтационараСрезПоследних.Клиент,
		                      |	КлиентыСтационараСрезПоследних.КойкоМесто,
		                      |	КлиентыСтационараСрезПоследних.ДатаНачала,
		                      |	КлиентыСтационараСрезПоследних.ДатаОкончания
		                      |ПОМЕСТИТЬ КлиентыСтационараСрезПоследнихНеВыписанные
		                      |ИЗ
		                      |	РегистрСведений.КлиентыСтационара.СрезПоследних(&ДатаПроведения, ) КАК КлиентыСтационараСрезПоследних
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	КлиентыСтационараСрезПоследнихНеВыписанные.Клиент.Представление КАК Клиент
		                      |ИЗ
		                      |	КлиентыСтационараСрезПоследнихНеВыписанные КАК КлиентыСтационараСрезПоследнихНеВыписанные
		                      |ГДЕ
		                      |	КлиентыСтационараСрезПоследнихНеВыписанные.КойкоМесто <> ЗНАЧЕНИЕ(Справочник.КойкоМеста.ПустаяСсылка)
		                      |	И КлиентыСтационараСрезПоследнихНеВыписанные.Клиент <> &Клиент
		                      |	И КлиентыСтационараСрезПоследнихНеВыписанные.КойкоМесто = &КойкоМесто");
							  
		Запрос.УстановитьПараметр("ДокументСсылка",СтруктураДанных.Ссылка);
		Запрос.УстановитьПараметр("ДатаПроведения",СтруктураДанных.Дата);
		Запрос.УстановитьПараметр("Клиент"		  ,СтруктураДанных.Клиент);
		Запрос.УстановитьПараметр("КойкоМесто"	  ,СтруктураДанных.КойкоМесто);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Текст = "Пациенты ";
		Пока Выборка.Следующий() Цикл 
			Текст = Текст + Выборка.Клиент + ", ";
		КонецЦикла;
		
		
		Если Текст <> "Пациенты " Тогда 
			Текст = СтрЗаменить(Текст + "**",", **","") + " не являются выписанными!";
			Возврат Текст;
		Иначе 
			Возврат "";
		КонецЕсли; 
		
	КонецЕсли;
	
КонецФункции

Функция ПолучитьДокументПоступленияПациентаСтационара(Клиент, Дата) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КлиентыСтационараСрезПоследних.Клиент КАК Клиент,
	                      |	КлиентыСтационараСрезПоследних.ДокументПоступления КАК ДокументПоступления,
	                      |	КлиентыСтационараСрезПоследних.КойкоМесто КАК КойкоМесто,
	                      |	КлиентыСтационараСрезПоследних.ДатаНачала КАК ДатаНачала,
	                      |	КлиентыСтационараСрезПоследних.ДатаОкончания КАК ДатаОкончания,
	                      |	КлиентыСтационараСрезПоследних.Выписан КАК Выписан
	                      |ИЗ
	                      |	РегистрСведений.КлиентыСтационара.СрезПоследних(&Дата, Клиент = &Клиент) КАК КлиентыСтационараСрезПоследних
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаНачала УБЫВ");
						  
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Или Выборка.Выписан	Тогда
		Возврат Документы.УстановкаУсловийПребывания.ПустаяСсылка();
	Иначе
		Возврат Выборка.ДокументПоступления;
	КонецЕсли;
	
КонецФункции

Процедура ДвиженияПоРегиструУсловияПребывания(ДокументОбъект,ТаблицаПоУслугам, Отказ)
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УстановкаУсловийПребывания") И  ТаблицаПоУслугам.Количество() > 0 Тогда 
		
		НаборДвижений = ДокументОбъект.Движения.УсловияПребывания;
		ТаблицаДвижений = НаборДвижений.Выгрузить();
		// Заполним таблицу движений.
		Для Каждого стрТЗ Из ТаблицаПоУслугам Цикл 
			ЗаполнитьЗначенияСвойств(ТаблицаДвижений.Добавить(),стрТЗ);
		КонецЦикла;	
		НаборДвижений.мПериод           = ДокументОбъект.Дата;
		НаборДвижений.мТаблицаДвижений  = ТаблицаДвижений;
		Если Не Отказ Тогда
			НаборДвижений.ВыполнитьДвижения();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрам
	
Функция ПолучитьТекстЗапросаТекущиеКлиентыСтационара(НуженОтборПоФилиалу = Ложь, ДополнительныеПоляЗапроса = Неопределено, ДополнительныеУсловия = Неопределено) Экспорт
	
	// Изменения Макеев 02-12-2025 (
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КлиентыСтационара.Клиент КАК Клиент,
	|	КлиентыСтационара.ДокументПоступления КАК ДокументПоступления,
	|	МАКСИМУМ(КлиентыСтационара.ДатаНачала) КАК ДатаНачала
	|ПОМЕСТИТЬ ПоследниеСостоянияКлиентовСтационара
	|ИЗ
	|	РегистрСведений.КлиентыСтационара КАК КлиентыСтационара
	|ГДЕ
	|	КлиентыСтационара.ДатаНачала <= КОНЕЦПЕРИОДА(&Дата, День)
	|
	|СГРУППИРОВАТЬ ПО
	|	КлиентыСтационара.Клиент,
	|	КлиентыСтационара.ДокументПоступления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Клиент,
	|	ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлиентыСтационара.Клиент,
	|	КлиентыСтационара.ДокументПоступления,
	|	КлиентыСтационара.КойкоМесто,
	|	КлиентыСтационара.ДатаНачала,
	|	КлиентыСтационара.ДатаОкончания,
	|	КлиентыСтационара.Выписан,
	|	ВЫБОР
	|		КОГДА КлиентыСтационара.ДокументПоступления.ДокументОбращения = ЗНАЧЕНИЕ(Документ.ОбращениеВСтационар.ПустаяСсылка)
	|				ИЛИ КлиентыСтационара.ДокументПоступления.ДокументОбращения.ДатаВремяПоступления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ТОГДА КлиентыСтационара.ДокументПоступления.Дата
	|		ИНАЧЕ КлиентыСтационара.ДокументПоступления.ДокументОбращения.ДатаВремяПоступления
	|	КОНЕЦ КАК ДатаПоступления,
	|	КлиентыСтационара.Период КАК ДатаПоследнегоИзменения,
	|	КлиентыСтационара.КойкоМесто.Владелец.Подразделение КАК омг_Отделение,
	|	КлиентыСтационара.КойкоМесто.Владелец КАК Палата,
	|	КлиентыСтационара.ДокументПоступления.ДокументОбращения КАК ДокументОбращения,
	|	КлиентыСтационара.Регистратор
	|	//%ДополнительныеПоля%
	|ИЗ
	|	РегистрСведений.КлиентыСтационара КАК КлиентыСтационара
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоследниеСостоянияКлиентовСтационара КАК ПоследниеСостоянияКлиентовСтационара
	|		ПО КлиентыСтационара.Клиент = ПоследниеСостоянияКлиентовСтационара.Клиент
	|			И КлиентыСтационара.ДокументПоступления = ПоследниеСостоянияКлиентовСтационара.ДокументПоступления
	|			И КлиентыСтационара.ДатаНачала = ПоследниеСостоянияКлиентовСтационара.ДатаНачала
	|ГДЕ
	|	НЕ КлиентыСтационара.Выписан
	|	//%ДополнительныеУсловия%
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПоступления
	|";
	
	Если НуженОтборПоФилиалу И ДополнительныеУсловия = Неопределено Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ДополнительныеУсловия%", "И Регистратор.Филиал = &Филиал");
	КонецЕсли;
	
	Если Не ДополнительныеУсловия = Неопределено Тогда
		СтрокаУсловий = "";
		Для Каждого Условие Из ДополнительныеУсловия Цикл
			СтрокаУсловий = СтрокаУсловий + " И " + Условие.Текст + " ";
		КонецЦикла;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ДополнительныеУсловия%", СтрокаУсловий);
	КонецЕсли;
	
	Если ТипЗнч(ДополнительныеПоляЗапроса) = Тип("СписокЗначений") Тогда
		ТекстДопПолей = "";
		Для Каждого ЭлементСписка Из ДополнительныеПоляЗапроса Цикл
			
			ТекстДопПоля = "," + Символы.ПС + "КлиентыСтационара." + ЭлементСписка.Представление + " КАК " + ЭлементСписка.Значение;
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ТекстДопПолей, ТекстДопПоля, Символы.ПС);
			
		КонецЦикла;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//%ДополнительныеПоля%", ТекстДопПолей);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Только для возврата на сторону сервера
//
Функция ПолучитьКлиентовСтационара(Дата, Филиал = Неопределено, ДополнительныеПоляЗапроса = Неопределено, ДополнительныеУсловия = Неопределено) Экспорт
	
	// Изменено Макеев 02-12-2025
	Запрос = Новый Запрос(ПолучитьТекстЗапросаТекущиеКлиентыСтационара(ЗначениеЗаполнено(Филиал), ДополнительныеПоляЗапроса, ДополнительныеУсловия));
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Если Не ДополнительныеУсловия = Неопределено Тогда
		Для Каждого Условие Из ДополнительныеУсловия Цикл
			Для Каждого Параметр Из Условие.Параметры Цикл
				Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
	
Функция ПолучитьМедкартуИлиСсылкуПервичногоПриемаСтационара(Клиент, Дата, ВернутьПрием = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлиентыСтационараСрезПоследних.Клиент КАК Клиент,
		|	КлиентыСтационараСрезПоследних.ДокументПоступления.ДокументОбращения.МедицинскаяКарта КАК МедицинскаяКартаСтационара,
		|	КлиентыСтационараСрезПоследних.ДокументПоступления.ДокументОбращения.ДокументОснование КАК ПервичныйПрием
		|ПОМЕСТИТЬ СрезСтационара
		|ИЗ
		|	РегистрСведений.КлиентыСтационара.СрезПоследних(&Дата, Клиент = &Клиент) КАК КлиентыСтационараСрезПоследних
		|ГДЕ
		|	КлиентыСтационараСрезПоследних.ДокументПоступления.ДокументОбращения <> ЗНАЧЕНИЕ(Документ.ОбращениеВСтационар.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Прием.Ссылка КАК Ссылка,
		|	Прием.Дата КАК Дата,
		|	Прием.МедицинскаяКарта КАК МедицинскаяКарта
		|ПОМЕСТИТЬ ПриемыКлиента
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	Прием.ЭтоПервичный
		|	И Прием.Клиент = &Клиент
		|	И Прием.МедицинскаяКарта.ВидКарты.ТипКарты = ЗНАЧЕНИЕ(Перечисление.ТипыМедицинскихКарт.Стационар)
		|	И Прием.Дата >= ДОБАВИТЬКДАТЕ(&Дата, День, -7)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПриемыКлиента.Ссылка КАК Ссылка,
		|	МИНИМУМ(ПриемыКлиента.Дата) КАК Дата,
		|	ПриемыКлиента.МедицинскаяКарта КАК МедицинскаяКарта
		|ПОМЕСТИТЬ МедкартаПервогоПриема
		|ИЗ
		|	ПриемыКлиента КАК ПриемыКлиента
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриемыКлиента.Ссылка,
		|	ПриемыКлиента.МедицинскаяКарта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Выбор Когда СрезСтационара.ПервичныйПрием = Значение(Документ.Прием.ПустаяСсылка) Тогда 3 Иначе 1 Конец КАК Приоритет,
		|	СрезСтационара.МедицинскаяКартаСтационара КАК МедицинскаяКартаСтационара,
		|	СрезСтационара.ПервичныйПрием КАК Прием
		|ИЗ
		|	СрезСтационара КАК СрезСтационара
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Выбор Когда Прием.Ссылка = Значение(Документ.Прием.ПустаяСсылка) Тогда 4 Иначе 2 Конец,
		|	Прием.МедицинскаяКарта,
		|	Прием.Ссылка
		|ИЗ
		|	МедкартаПервогоПриема КАК Прием
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	5,
		|	МедицинскиеКарты.Ссылка,
		|	NULL
		|ИЗ
		|	Справочник.МедицинскиеКарты КАК МедицинскиеКарты
		|ГДЕ
		|	МедицинскиеКарты.Клиент = &Клиент
		|	И МедицинскиеКарты.ВидКарты.ТипКарты = ЗНАЧЕНИЕ(Перечисление.ТипыМедицинскихКарт.Стационар)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ВернутьПрием = Неопределено Тогда
			Возврат Новый Структура("ПервичныйПрием, МедицинскаяКарта", ВыборкаДетальныеЗаписи.Прием, ВыборкаДетальныеЗаписи.МедицинскаяКартаСтационара);  
		Иначе	
			Возврат ?(ВернутьПрием, ВыборкаДетальныеЗаписи.Прием, ВыборкаДетальныеЗаписи.МедицинскаяКартаСтационара);
		КонецЕсли;
	Иначе
		Если ВернутьПрием = Неопределено Тогда
			Возврат Новый Структура("ПервичныйПрием, МедицинскаяКарта");  
		Иначе	
			Возврат ?(ВернутьПрием, Документы.Прием.ПустаяСсылка(), Справочники.МедицинскиеКарты.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;
			
КонецФункции

Функция ПолучитьОписаниеПребыванияПациентаВСтационареПоМедкарте(МедицинскаяКарта) Экспорт
	
	Результат = Новый Структура("МедицинскаяКарта, Обращение, ПервичныйПрием, ДокументПоступления, 
								|ДатаПоступления, ДатаВыписки, ПалатаПоступления, КойкоМестоПоступления",
								МедицинскаяКарта);
	
	// Получаем документ обращения в стационар по медкарте
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МедицинскаяКарта", МедицинскаяКарта);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбращениеВСтационар.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОбращениеВСтационар КАК ОбращениеВСтационар
	|ГДЕ
	|	ОбращениеВСтационар.МедицинскаяКарта = &МедицинскаяКарта
	|	И НЕ ОбращениеВСтационар.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбращениеВСтационар.Дата УБЫВ"
	;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Результат.Обращение = Выборка.Ссылка;
		
		// Получаем дату поступления и дату выписки
		ДанныеПребывания = ДанныеПребыванияПоОбращению(Результат.Обращение);
		
		ЗаполнитьЗначенияСвойств(Результат, ДанныеПребывания);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОбращениеПоМедкарте(МедицинскаяКарта, ДокументыИсключения = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(МедицинскаяКарта) Тогда
		Возврат Документы.ОбращениеВСтационар.ПустаяСсылка(); 	
	КонецЕсли;
	
	// Получаем документ обращения в стационар по медкарте
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МедицинскаяКарта", МедицинскаяКарта);
	Запрос.УстановитьПараметр("ДокументыИсключения", ДокументыИсключения);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбращениеВСтационар.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ОбращениеВСтационар КАК ОбращениеВСтационар
	|ГДЕ
	|	ОбращениеВСтационар.МедицинскаяКарта = &МедицинскаяКарта
	|	И (&ДокументыИсключения = НЕОПРЕДЕЛЕНО ИЛИ ОбращениеВСтационар.Ссылка НЕ В (&ДокументыИсключения))
	|	И НЕ ОбращениеВСтационар.ПометкаУдаления
	|	И НЕ ОбращениеВСтационар.ОтказВГоспитализации
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбращениеВСтационар.Дата УБЫВ"
	;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Документы.ОбращениеВСтационар.ПустаяСсылка()
	КонецЕсли;
	
КонецФункции

Функция ДанныеПребыванияПоОбращению(ОбращениеВСтационар)
	
	ДанныеПребывания = Новый Структура("ДатаПоступления, ДатаВыписки, ДокументПоступления, ПалатаПоступления, КойкоМестоПоступления");
	
	// Запрос получения даты поступления.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбращениеВСтационар", ОбращениеВСтационар);
	Запрос.УстановитьПараметр("ВидДвижения", Перечисления.ВидыДвиженияВСтационаре.Поступление);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлиентыСтационара.ДокументПоступления КАК ДокументПоступления,
	|	КлиентыСтационара.ДатаНачала КАК ДатаПоступления,
	|	КлиентыСтационара.ДокументПоступления.Палата КАК ПалатаПоступления,
	|	КлиентыСтационара.ДокументПоступления.КойкоМесто КАК КойкоМестоПоступления
	|ИЗ
	|	РегистрСведений.КлиентыСтационара КАК КлиентыСтационара
	|ГДЕ
	|	КлиентыСтационара.ДокументПоступления.ДокументОбращения = &ОбращениеВСтационар
	|	И КлиентыСтационара.ДокументПоступления.ВидОперации = &ВидДвижения"
	;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеПребывания, Выборка);
		
		// Получение даты выписки по этому документу поступления
		Запрос.УстановитьПараметр("ДокументПоступления", Выборка.ДокументПоступления);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлиентыСтационара.ДатаНачала КАК ДатаВыписки
		|ИЗ
		|	РегистрСведений.КлиентыСтационара КАК КлиентыСтационара
		|ГДЕ
		|	КлиентыСтационара.ДокументПоступления = &ДокументПоступления
		|	И КлиентыСтационара.Выписан"
		;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДанныеПребывания.ДатаВыписки = Выборка.ДатаВыписки;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДанныеПребывания;
	
КонецФункции

// Должность и специализация врача по классификаторам МЗ.
//
// Параметры:
//  Врач - СправочникСсылка.Сотрудники - врач.
// 
// Возвращаемое значение:
//  Структура.
//
Функция ДолжностьСпециализацияВрача(Врач) Экспорт
	
	Возврат МедицинскаяДеятельность.ДолжностьСпециализацияВрача(Врач);
	
КонецФункции

Функция ДатаВступленияПриказа530н() Экспорт
	
	Возврат Дата(2023, 3, 1);
	
КонецФункции

// См. МедицинскаяДеятельность.СтандатноеОписаниеДиагнозовСВидамиНозологий
Функция СтандатноеОписаниеДиагнозовМД_003(ДокументОбъект, ДляHTMLВерсии = Ложь, ДопОписаниеЗаболевания = "") Экспорт
	
	Возврат МедицинскаяДеятельность.СтандатноеОписаниеДиагнозовСВидамиНозологий(ДокументОбъект, ДляHTMLВерсии, ДопОписаниеЗаболевания);
	
КонецФункции

Функция ФорматВидаНозологииВОписанииДиагнозаМД_003(ВидНозологии, Представление, Количество = 10)
	
	Возврат Новый Структура("ВидНозологии, Представление, Количество", ВидНозологии, Представление, Количество);
	
КонецФункции

Функция ТекстОписанияНозологийДляМД_003(Диагнозы, ФорматыНозологий, ДиагнозыПоКлассификациям, ВыводитьЗаголовкиВидов = Истина, ДляHTMLВерсии = Ложь)
	
	ТекстОписанияНозологий = "";
	
	ШаблонТекстаДиагноза = "%1. Код_по_МКБ_[%2]. %3"; // Вид нозологии: Дзагноз. Код по МКБ: Код. Детали.
	ШаблонТекстаДиагноза = СтрЗаменить(ШаблонТекстаДиагноза,"_",Символы.НПП);
	
	Если ДляHTMLВерсии Тогда
		ШаблонТекстаВидаНозологии = "<u>%1</u>: %2";
	Иначе
		ШаблонТекстаВидаНозологии = "%1: %2";
	КонецЕсли;
	
	Отбор = Новый Структура("ВидНозологии");
	Для Каждого ВидФормат Из ФорматыНозологий Цикл
		
		Отбор.ВидНозологии = ВидФормат.ВидНозологии;
		СтрокиДиагнозов = Диагнозы.НайтиСтроки(Отбор);
		ТекстВидаНозологии = "";
		мТекстыДиагнозовПоКлассификации = Новый Массив;
		мТекстыКодовДиагнозовПоКлассификации = Новый Массив;
		
		СчЛимит = 1;
		МассивДиагнозов = Новый Массив;
		Для Каждого СтрокаДиагноза Из СтрокиДиагнозов Цикл
			
			Если СчЛимит > ВидФормат.Количество Тогда
				Прервать;
			КонецЕсли;
			
			МассивДиагнозов.Добавить(СтрокаДиагноза.Диагноз);
			
			НаименованиеДиагноза = ?(ПустаяСтрока(СтрокаДиагноза.Диагноз.НаименованиеПолное), СтрокаДиагноза.Диагноз.Наименование, СтрокаДиагноза.Диагноз.НаименованиеПолное);
			ТекстДиагноза = СтрШаблон(ШаблонТекстаДиагноза, НаименованиеДиагноза, СтрокаДиагноза.Диагноз.КодДиагноза, СтрокаДиагноза.Детализация);
			
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ТекстВидаНозологии, ТекстДиагноза, Символы.ПС);
			
			мТекстыДиагнозовПоКлассификации.Добавить(НаименованиеДиагноза);
			мТекстыКодовДиагнозовПоКлассификации.Добавить(СтрокаДиагноза.Диагноз.КодДиагноза);
			
			СчЛимит = СчЛимит + 1;
		КонецЦикла;
		
		Если Не ПустаяСтрока(ТекстВидаНозологии)
			И ВыводитьЗаголовкиВидов
		Тогда
			ТекстВидаНозологии = СтрШаблон(ШаблонТекстаВидаНозологии, ВидФормат.Представление, ТекстВидаНозологии);
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ТекстОписанияНозологий, ТекстВидаНозологии, Символы.ПС, Истина);
		
		Если МассивДиагнозов.Количество() > 0 Тогда
			ТекстДиагнозов = СтрСоединить(мТекстыДиагнозовПоКлассификации, Символы.ПС);
			ТекстКодов = СтрСоединить(мТекстыКодовДиагнозовПоКлассификации, ", ");
			СтруктураДиагнозовПоКлассификации = Новый Структура("МассивДиагнозов, ТекстДиагнозов, ТекстКодов", МассивДиагнозов, ТекстДиагнозов, ТекстКодов);
			ДиагнозыПоКлассификациям.Вставить(ВидФормат.ВидНозологии, СтруктураДиагнозовПоКлассификации);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекстОписанияНозологий;
	
КонецФункции

Функция ДатаВремяВФормате003У(Дата) Экспорт
	
	Результат = Формат(Дата,"Л=ru_RU; ДЛФ=DD") + " " + Формат(Дата, "ДФ='""время:"" HH ""час."" mm ""мин.""'");
	
	Возврат Результат;
	
КонецФункции

// См. МедицинскаяДеятельностьПереопределяемый.РольДоступнаТекущемуПользователю()
Функция РольДоступнаТекущемуПользователю(Медкарта, Роль) Экспорт
	
	Сотрудник = Неопределено;
	Если Роль = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(18, "РолиПриПодписиМедДокументов") Тогда
		Сотрудник = ОбращениеПоМедкарте(Медкарта).ЛечащийВрач;
	ИначеЕсли Роль = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(5, "РолиПриПодписиМедДокументов") Тогда
		Сотрудник = ОбращениеПоМедкарте(Медкарта).Подразделение.Руководитель;
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(Сотрудник) И ПараметрыСеанса.ТекущийПользователь.Сотрудник = Сотрудник;
	
КонецФункции

Процедура ДополнитьЗначенияПараметровПоМедкарте(МедКарта, ЗначенияПараметровМедкарты, ЗначенияВычисляемыхПараметровМедкарты, ТекстыДиагнозовРаздельно = Ложь) Экспорт
	
	Клиент = Медкарта.Клиент;
	
	ПечатьКарты530н_ДополнитьПараметрыПоКлиенту(Клиент, МедКарта, ЗначенияПараметровМедкарты);
	
	// Заполнение по документам
	ПечатьКарты530н_ДополнитьПараметрыПоОбращению(Медкарта, ЗначенияПараметровМедкарты);
	ПечатьКарты530н_ДополнитьПараметрыПоПребыванию(Медкарта, ЗначенияПараметровМедкарты, ТекстыДиагнозовРаздельно);
	
	// Форматирование ссылок на диагнозы
	ШаблонДИагноз = "%1  Код по МКБ [%2]";
	СтруктурыЗначений = ОбщегоНазначенияКлиентСервер.НовыйМассив(ЗначенияПараметровМедкарты, ЗначенияВычисляемыхПараметровМедкарты);
	Для Каждого СтруктураЗначений Из СтруктурыЗначений Цикл
		Для Каждого СтруктураПараметра Из СтруктураЗначений Цикл
			Если ТипЗнч(СтруктураПараметра.Значение) = Тип("СправочникСсылка.Диагнозы") Тогда
				
				ПредставлениеДиагноза = СтрШаблон(ШаблонДИагноз, СокрЛП(СтруктураПараметра.Значение.НаименованиеПолное), СокрЛП(СтруктураПараметра.Значение.КодДиагноза));
				ЗначенияВычисляемыхПараметровМедкарты.Вставить(СтруктураПараметра.Ключ, ПредставлениеДиагноза);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	МедицинскаяДеятельность.ДополнитьВручнуюЗаполненнымиПараметрами(МедКарта, ЗначенияПараметровМедкарты, ЗначенияВычисляемыхПараметровМедкарты);
	
	Для Каждого ЗначениеПараметра Из ПолучитьЗначенияПустыхПараметровПоУмолчанию530н() Цикл
		ЗаполнитьПустоеЗначениеПараметраПоУмолчанию(ЗначенияПараметровМедкарты, ЗначенияВычисляемыхПараметровМедкарты, ЗначениеПараметра.ИмяПараметра, ЗначениеПараметра.Значение);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗначенияПустыхПараметровПоУмолчанию530н() Экспорт
	
	ЗначенияПараметров = Новый Массив;
	ЗначенияПараметров.Добавить(Новый Структура("ИмяПараметра, Значение", "СемейноеПоложение", "неизвестно"));
	ЗначенияПараметров.Добавить(Новый Структура("ИмяПараметра, Значение", "Образование", "неизвестно"));
	ЗначенияПараметров.Добавить(Новый Структура("ИмяПараметра, Значение", "АлергическиеРекакции", "нет сведений"));
	ЗначенияПараметров.Добавить(Новый Структура("ИмяПараметра, Значение", "НаличиеТрансфузийВАнамнезе", "нет сведений"));
	
	Возврат ЗначенияПараметров;
	
КонецФункции

Процедура ЗаполнитьПустоеЗначениеПараметраПоУмолчанию(ЗначенияПараметровМедкарты, ЗначенияВычисляемыхПараметровМедкарты, ИмяПараметра, Значение)
	
	Если (ЗначенияПараметровМедкарты.Свойство(ИмяПараметра)
				И ЗначениеЗаполнено(ЗначенияПараметровМедкарты[ИмяПараметра]))
			Или (ЗначенияВычисляемыхПараметровМедкарты.Свойство(ИмяПараметра)
				И ЗначениеЗаполнено(ЗначенияВычисляемыхПараметровМедкарты[ИмяПараметра]))
	Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначенияВычисляемыхПараметровМедкарты.Свойство(ИмяПараметра) Тогда
		ЗначенияВычисляемыхПараметровМедкарты.Вставить(ИмяПараметра, Значение);
	Иначе
		ЗначенияПараметровМедкарты.Вставить(ИмяПараметра, Значение);
	КонецЕсли;
	
КонецПроцедуры

Функция ФактУпотребленияАлкоголяИИныхПсихоактивныхВеществ(Обращение) Экспорт
	
	ФактУпотребления = "";
	Если Обращение.АлкогольноеОпьянение И Обращение.НаркотическоеОпьянение Тогда
		ФактУпотребления = "Употребление алкоголя и иных психоактивных веществ";
	ИначеЕсли Обращение.АлкогольноеОпьянение Тогда
		ФактУпотребления = "Употребление алкоголя";
	ИначеЕсли Обращение.НаркотическоеОпьянение Тогда
		ФактУпотребления = "Употребление иных психоактивных веществ";
	Иначе
		ФактУпотребления = "Нет признаков состояния опьянения";
	КонецЕсли;
	Если ЗначениеЗаполнено(Обращение.ОпьянениеДатаВремяВзятияПробы) Тогда
		ФактУпотребления = ФактУпотребления + ". " + "Проба от: " + Формат(Обращение.ОпьянениеДатаВремяВзятияПробы, "ДФ='dd.MM.yyyy HH:mm'");
	КонецЕсли;
	Если ЗначениеЗаполнено(Обращение.ОпьянениеРезультатВзятияПробы) Тогда
		ФактУпотребления = ФактУпотребления + ". " + "Результат пробы: " + Обращение.ОпьянениеРезультатВзятияПробы;
	КонецЕсли;
	
	Возврат ФактУпотребления;
	
КонецФункции

Функция ПолучитьПалатыКлиентаПоМедкарте(Медкарта, ВернутьПервое = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Палаты.Префикс КАК НомерПалаты
		|ИЗ
		|	РегистрСведений.КлиентыСтационара КАК КлиентыСтационара
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КойкоМеста КАК КойкоМеста
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Палаты КАК Палаты
		|			ПО (Палаты.Ссылка = КойкоМеста.Владелец)
		|		ПО КлиентыСтационара.КойкоМесто = КойкоМеста.Ссылка
		|			И (КлиентыСтационара.ДокументПоступления.ДокументОбращения = &ДокументОбращения)
		|			И (НЕ КлиентыСтационара.Выписан)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КлиентыСтационара.Период";
	
	Запрос.УстановитьПараметр("ДокументОбращения", Стационар.ОбращениеПоМедкарте(Медкарта));
	МассивПалат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерПалаты");
	
	Если ВернутьПервое Тогда
		Если МассивПалат.Количество() = 0 Тогда
			Возврат "";
		КонецЕсли;
		Возврат МассивПалат[0];
	КонецЕсли;
	
	Возврат МассивПалат;
	
КонецФункции

Функция ЭтоВечернееВремяВыполненияМанипуляции(Дата) Экспорт

	// При изменении поменять еще в 2х местах (там вызывается с клиента) 
	// ОбщаяФорма.ТемпературныйЛистВводПоказателей и Документ.ДействияЗаСутки.ФормаДокумента
	
	// Позже 14:00 - вечер.
	Возврат (Дата - НачалоДня(Дата)) >= ГраницаВечера();
	
КонецФункции

// Граница начала вечерней половины дня в стационаре с точки зрения отнесения манипуляций на "Утро" или "Вечер".
//
// Параметры:
//  КакЧисло - Булево	 - вернуть нужно тип Число (Истина) или Дата (Ложь).
// 
// Возвращаемое значение:
//  Число, Дата - время.
//
Функция ГраницаВечера(КакЧисло = Истина) Экспорт
	
	ВремяСекунды = 14*60*60;
	
	Если КакЧисло Тогда
		Возврат ВремяСекунды;
	Иначе
		Возврат Дата(1,1,1) + ВремяСекунды;
	КонецЕсли;
	
КонецФункции

// Обработка заполнения приема из обращения в стационар в форме структуры.
//
// Параметры:
//  ЭтотОбъект	 - ДокументОбъект.Прием - новый прием.
//  Обращение	 - ДокументСсылка.ОбращениеВСтационар - обращение, выступающее основанием.
//
Процедура ОбработкаЗаполнения_ОбращениеВСтационарСтруктура_Прием(ЭтотОбъект, Обращение) Экспорт
	
	Сотрудник = ОтраслевыеДополнения.СотрудникПользователяПоФилиалу(Пользователи.ТекущийПользователь(), Обращение.Филиал);
	СпециализацияВрача = Сотрудник.Специализация;
	// Поиск шаблона в настройках основных шаблонов стационара
	ШаблонПриема = Стационар.ПолучитьШаблонОсмотраМедицинскогоДокумента(Перечисления.РольШаблоновСтационара.ПервичныйОсмотрВрачомПриемногоОтделения, СпециализацияВрача);
	
	// Если шаблона нет, то ищем подходящий по Виду медицинской документации.
	Если Не ЗначениеЗаполнено(ШаблонПриема) Тогда
		ВидМД = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(381, "ВидыМедицинскихДокументов"); // Первичный осмотр приемного отделения.
		Если ЗначениеЗаполнено(ВидМД) Тогда
			Шаблоны = МедицинскаяДеятельность.ШаблоныПоВидуДокументации(ВидМД, СпециализацияВрача);
			Если Шаблоны.Количество() = 0
				И ЗначениеЗаполнено(СпециализацияВрача)
			Тогда
				Шаблоны = МедицинскаяДеятельность.ШаблоныПоВидуДокументации(ВидМД, Неопределено);
			КонецЕсли;
			
			Если Шаблоны.Количество() <> 0 Тогда
				ШаблонПриема = Шаблоны[0];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ШаблонПриема) Тогда
		СтрокаШаблон = ЭтотОбъект.ШаблоныПриема.Добавить();
		СтрокаШаблон.ШаблонПриема = ШаблонПриема;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДвиженияПациентаПоОтделениям(МедКарта) Экспорт
	
	ДокументыУстановкиПребывания = ПолучитьДокументыУстановкиПребыванияПоМедКарте(МедКарта);
	
	ВидыМД = Новый Массив;
	ВидыМД.Добавить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(108, "ВидыМедицинскихДокументов"));
	ВидыМД.Добавить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(341, "ВидыМедицинскихДокументов"));
	ВидыМД.Добавить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(381, "ВидыМедицинскихДокументов"));
	
	ДокументыПриемов = МедицинскаяДеятельность.ДокументыПоВидуДокументации(МедКарта, ВидыМД);
	Приемы = ДокументыПриемов.ВыгрузитьКолонку("Документ");
	мНазначения = Новый Массив;
	мНазначения.Добавить(Перечисления.КодировкаПолейЭМД.ЛечащийВрач);
	ЗначенияПараметровСНазначениями = ЗначенияПараметровСНазначениями(МедКарта, мНазначения, Приемы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Диагнозы.Ссылка.Дата КАК Дата,
		|	Диагнозы.Ссылка КАК Документ,
		|	Диагнозы.Диагноз КАК Диагноз,
		|	Диагнозы.Классификация3 КАК ВидНозологии
		|ИЗ
		|	Документ.Прием.Диагнозы КАК Диагнозы
		|ГДЕ
		|	Диагнозы.Ссылка В(&Приемы)
		|	И Диагнозы.Классификация3 = ЗНАЧЕНИЕ(Перечисление.КлассификацииДиагнозов.ОсновноеЗаболевание)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Диагнозы.Ссылка.Дата УБЫВ,
		|	Диагнозы.Ссылка УБЫВ";
	
	Запрос.УстановитьПараметр("Приемы", Приемы);
	
	Диагнозы = Запрос.Выполнить().Выгрузить();
	
	Счетчик = 0;
	Количество = ДокументыУстановкиПребывания.Количество(); 
	
	ДанныеДвиженияПациентаПоОтделениям = ПолучитьТаблицуДвиженияПациентаПоОтделениям();
	
	Пока Счетчик < Количество Цикл 
		Эл = ДокументыУстановкиПребывания[Счетчик];
		Если Эл.ВидОперации = Перечисления.ВидыДвиженияВСтационаре.Выписка 
			Или Эл.ВидОперации = Перечисления.ВидыДвиженияВСтационаре.ИзменениеУсловий 
		Тогда
			Счетчик = Счетчик + 1;
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ДанныеДвиженияПациентаПоОтделениям.Добавить();
		НоваяСтрока.Отделение = Эл.Подразделение;
		НоваяСтрока.ДатаПоступления = Эл.ДатаНачала;
		НоваяСтрока.ПрофильКоек = Эл.ПрофильКойки;
		// Получаем дату из следующей строки в данной таблице
		НоваяСтрока.ДатаВыписки = ПолучитьДатуВыписки(ДокументыУстановкиПребывания, Счетчик);
		// Получаем последний диагноз на дату выписки, перевода
		НоваяСтрока.Диагноз = ПолучитьДиагноз(Диагнозы, НоваяСтрока.ДатаВыписки);
		// Врач из обращения
		НоваяСтрока.Врач = Эл.ЛечащийВрач;
		// Если переназначали врача в приеме
		ЛечащийВрач = НайтиЗначениеВКешеПоНазначению(ЗначенияПараметровСНазначениями, Перечисления.КодировкаПолейЭМД.ЛечащийВрач);
		Если ЗначениеЗаполнено(ЛечащийВрач) Тогда
			НоваяСтрока.Врач = ЛечащийВрач;
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Возврат ДанныеДвиженияПациентаПоОтделениям;
	
КонецФункции

Функция ПолучитьТаблицуДвиженияПациентаПоОтделениям()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Отделение");
	Таблица.Колонки.Добавить("ДатаПоступления");
	Таблица.Колонки.Добавить("ПрофильКоек");
	Таблица.Колонки.Добавить("ДатаВыписки");
	Таблица.Колонки.Добавить("Диагноз");
	Таблица.Колонки.Добавить("Врач");
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьДокументыУстановкиПребыванияПоМедКарте(МедКарта)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ОбращениеВСтационар.Ссылка КАК Ссылка,
		|	ОбращениеВСтационар.Клиент КАК Клиент,
		|	ОбращениеВСтационар.ЛечащийВрач КАК ЛечащийВрач
		|ПОМЕСТИТЬ ОбращениеВСтационар
		|ИЗ
		|	Документ.ОбращениеВСтационар КАК ОбращениеВСтационар
		|ГДЕ
		|	ОбращениеВСтационар.МедицинскаяКарта = &МедицинскаяКарта
		|	И ОбращениеВСтационар.ПометкаУдаления = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстановкаУсловийПребывания.Ссылка КАК Ссылка,
		|	ОбращениеВСтационар.Клиент КАК Клиент,
		|	ОбращениеВСтационар.ЛечащийВрач КАК ЛечащийВрач
		|ПОМЕСТИТЬ УстановкаПоступление
		|ИЗ
		|	Документ.УстановкаУсловийПребывания КАК УстановкаУсловийПребывания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ОбращениеВСтационар КАК ОбращениеВСтационар
		|		ПО УстановкаУсловийПребывания.ДокументОбращения = ОбращениеВСтационар.Ссылка
		|			И УстановкаУсловийПребывания.Клиент = ОбращениеВСтационар.Клиент
		|			И (УстановкаУсловийПребывания.Проведен = ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КлиентыСтационара.ДатаНачала КАК ДатаНачала,
		|	КлиентыСтационара.ДатаОкончания КАК ДатаОкончания,
		|	КлиентыСтационара.Выписан КАК Выписан,
		|	КлиентыСтационара.Регистратор КАК Регистратор,
		|	КлиентыСтационара.Подразделение КАК Подразделение,
		|	КлиентыСтационара.Регистратор.ВидОперации КАК ВидОперации,
		|	КлиентыСтационара.Регистратор.КойкоМесто.Владелец.Профиль КАК ПрофильКойки,
		|	УстановкаПоступление.ЛечащийВрач КАК ЛечащийВрач
		|ИЗ
		|	РегистрСведений.КлиентыСтационара КАК КлиентыСтационара
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УстановкаПоступление КАК УстановкаПоступление
		|		ПО КлиентыСтационара.Клиент = УстановкаПоступление.Клиент
		|			И КлиентыСтационара.ДокументПоступления = УстановкаПоступление.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНачала";
	
	Запрос.УстановитьПараметр("МедицинскаяКарта", МедКарта);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьДиагноз(Диагнозы, ДатаВыписки) 
	
	ПоследнийДиагноз = Справочники.Диагнозы.ПустаяСсылка();
	
	Для Каждого Эл Из Диагнозы Цикл
		Если Не ЗначениеЗаполнено(ПоследнийДиагноз) Тогда
			ПоследнийДиагноз = Эл.Диагноз; 
		КонецЕсли;
		
		Если ДатаВыписки >= Эл.Дата И ЗначениеЗаполнено(Эл.Диагноз) Тогда
			Возврат Эл.Диагноз;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПоследнийДиагноз;
	
КонецФункции

Функция ПолучитьДатуВыписки(Таблица, Знач Счетчик)
	
	Счетчик = Счетчик + 1;
	Пока Счетчик < Таблица.Количество() Цикл
		Эл = Таблица[Счетчик];
		Если Эл.ВидОперации <> Перечисления.ВидыДвиженияВСтационаре.ИзменениеУсловий Тогда
			Возврат Эл.ДатаНачала;
		КонецЕсли;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Возврат Дата(1,1,1,0,0,0);
	
КонецФункции

Функция ПолучитьДанныеХирургическихОпераций(МедКарта) Экспорт
	
	ДанныеХирургическихОпераций = ПодготовитьТаблицаДанныхХирургическихОпераций();
	
	ВидМД = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(108, "ВидыМедицинскихДокументов"); // Протокол оперативного вмешательства (операции).
	СоответсвиеДанныхКодировки = СоответсвиеДанныхКодировкиХирургическихОпераций();
	
	Выборка = ПолучитьВыборкуЗначенийПараметровПоВидуИЗначПараметров(МедКарта, ВидМД, СоответсвиеДанныхКодировки);
	
	Если Выборка = Неопределено Тогда
		Возврат ДанныеХирургическихОпераций; 
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		ДетальныеЗаписи = Выборка.Выбрать();
		НоваяСтрока = ДанныеХирургическихОпераций.Добавить();
		Пока ДетальныеЗаписи.Следующий() Цикл
			ИмяКолонки = СоответсвиеДанныхКодировки.Получить(ДетальныеЗаписи.Назначение);
			Если ИмяКолонки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если ИмяКолонки = "Анестезия" И ЗначениеЗаполнено(НоваяСтрока[ИмяКолонки]) Тогда
				НоваяСтрока["Анестезия2"] = ДетальныеЗаписи.Значение;
				Продолжить;
			КонецЕсли;
			НоваяСтрока[ИмяКолонки] = ДетальныеЗаписи.Значение;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого Эл Из ДанныеХирургическихОпераций Цикл
		
		Эл.ДатаОперации = СформироватьДатуХирургическойОперации(Эл.ДатаНачалаОперации, Эл.ЧасНачалаОперации, Эл.МинутыНачалаОперации); 
		
		Если ЗначениеЗаполнено(Эл.Хирург) Тогда
			Эл.Отделение = Эл.Хирург.Подразделение;
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат ДанныеХирургическихОпераций;
	
КонецФункции

Функция ПолучитьВыборкуЗначенийПараметровПоВидуИЗначПараметров(МедКарта, ВидМД, СоответсвиеДанныхКодировки) Экспорт
	
	ДокументыПоВиду = МедицинскаяДеятельность.ДокументыПоВидуДокументации(МедКарта, ВидМД);
	
	Если ДокументыПоВиду.Количество() = 0 Тогда
		Возврат Неопределено
	КонецЕсли;
	
	Приемы = ДокументыПоВиду.ВыгрузитьКолонку("Документ");
	
	мНазначения = Новый Массив;
	Для Каждого Эл Из СоответсвиеДанныхКодировки Цикл
		мНазначения.Добавить(Эл.Ключ);
	КонецЦикла;
	
	ЗначенияПараметров = ЗначенияПараметровСНазначениями(МедКарта, мНазначения, Приемы);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыОВ.Документ КАК Документ,
		|	ДокументыОВ.ИндексШаблона КАК ИндексШаблона,
		|	ДокументыОВ.Дата КАК Дата
		|ПОМЕСТИТЬ ДокументыОВ
		|ИЗ
		|	&ДокументыОперативныхВмешательств КАК ДокументыОВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПараметров.Документ КАК Документ,
		|	ЗначенияПараметров.ИндексШаблона КАК ИндексШаблона,
		|	ЗначенияПараметров.Дата КАК Дата,
		|	ЗначенияПараметров.Назначение КАК Назначение,
		|	ЗначенияПараметров.Значение КАК Значение
		|ПОМЕСТИТЬ ЗначенияПараметров
		|ИЗ
		|	&ЗначенияПараметровСНазначениями КАК ЗначенияПараметров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПараметров.Документ КАК Документ,
		|	ЗначенияПараметров.ИндексШаблона КАК ИндексШаблона,
		|	ЗначенияПараметров.Дата КАК Дата,
		|	ЗначенияПараметров.Назначение КАК Назначение,
		|	ЗначенияПараметров.Значение КАК Значение
		|ИЗ
		|	ЗначенияПараметров КАК ЗначенияПараметров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыОВ КАК ДокументыОВ
		|		ПО ЗначенияПараметров.Документ = ДокументыОВ.Документ
		|			И ЗначенияПараметров.ИндексШаблона = ДокументыОВ.ИндексШаблона
		|			И ЗначенияПараметров.Дата = ДокументыОВ.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|ИТОГИ ПО
		|	Документ,
		|	ИндексШаблона";
	
	Запрос.УстановитьПараметр("ДокументыОперативныхВмешательств", ДокументыПоВиду);
	Запрос.УстановитьПараметр("ЗначенияПараметровСНазначениями", ЗначенияПараметров);
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
КонецФункции

Функция ПодготовитьТаблицаДанныхХирургическихОпераций()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ДатаНачалаОперации");
	Таблица.Колонки.Добавить("ЧасНачалаОперации");
	Таблица.Колонки.Добавить("МинутыНачалаОперации");
	Таблица.Колонки.Добавить("ДатаОперации");
	Таблица.Колонки.Добавить("Хирург");
	Таблица.Колонки.Добавить("Операция");
	Таблица.Колонки.Добавить("Осложнение");
	Таблица.Колонки.Добавить("ОсложнениеУточнение");
	Таблица.Колонки.Добавить("ИспользованиеЭнд");
	Таблица.Колонки.Добавить("ИспользованиеЛазер");
	Таблица.Колонки.Добавить("ИспользованиеКриог");
	Таблица.Колонки.Добавить("ИспользованиеРентген");
	Таблица.Колонки.Добавить("Анестезия");
	Таблица.Колонки.Добавить("Анестезия2");
	Таблица.Колонки.Добавить("Отделение");
	Возврат Таблица;
	
КонецФункции

Функция СоответсвиеДанныхКодировкиХирургическихОпераций()
	
	 Соответствие = Новый Соответствие;
	 Соответствие.Вставить(Перечисления.КодировкаПолейЭМД.Операция_ДатаНачала, "ДатаНачалаОперации");
	 Соответствие.Вставить(Перечисления.КодировкаПолейЭМД.Операция_ЧасНачала, "ЧасНачалаОперации");
	 Соответствие.Вставить(Перечисления.КодировкаПолейЭМД.Операция_МинутаНачала, "МинутыНачалаОперации");
	 Соответствие.Вставить(Перечисления.КодировкаПолейЭМД.ОперирующийВрач, "Хирург");
	 Соответствие.Вставить(Перечисления.КодировкаПолейЭМД.ОсложнениеУточнение, "ОсложнениеУточнение");
	 Соответствие.Вставить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(833, "КлассификаторыМинЗдрава",  Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов), "Операция");
	 Соответствие.Вставить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(9054, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов), "Осложнение");
	 Соответствие.Вставить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(829, "КлассификаторыМинЗдрава",  Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов), "Анестезия");
	 // Оборудование
	 Соответствие.Вставить(Перечисления.КодировкаПолейЭМД.ИспользованниеМедИзделий_Эндоскопическое,	 "ИспользованиеЭнд");
	 Соответствие.Вставить(Перечисления.КодировкаПолейЭМД.ИспользованниеМедИзделий_Лазерное,		 "ИспользованиеЛазер");
	 Соответствие.Вставить(Перечисления.КодировкаПолейЭМД.ИспользованниеМедИзделий_Криогенное,		 "ИспользованиеКриог");
	 Соответствие.Вставить(Перечисления.КодировкаПолейЭМД.ИспользованниеМедИзделий_Рентгеновское,	 "ИспользованиеРентген");
	 
	 Возврат Соответствие;
	
КонецФункции

Функция СформироватьДатуХирургическойОперации(Знач Дата, Час, Минуты) 
	
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Минуты) Тогда
		Дата = Дата + Число(Минуты) * 60; 
	КонецЕсли;
	
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Час) Тогда
		Дата = Дата + Число(Час) * 60 * 60; 
	КонецЕсли;
	
	Возврат Дата;
	
КонецФункции

#Область ПечатьМедкарты003у530н

Функция ПечатьКарты530н(МедКарта, ЗначенияПараметровМедкарты, ЗначенияВычисляемыхПараметровМедкарты, ИмяМакета, ДляРедактирования) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Макет = Справочники.ВидыМедицинскихКарт.ПолучитьМакет(?(ИмяМакета = Неопределено, Медкарта.ВидКарты.Макет, ИмяМакета));
	Если ДляРедактирования Тогда
		ОбщегоНазначенияБИТКлиентСервер.ДобавитьРасшифровки(Макет);
	КонецЕсли;
	
	ПечатьКарты530н_ЗаполнитьОперативныеВмешательства(МедКарта, Макет);
	
	ДополнитьЗначенияПараметровПоМедкарте(МедКарта, ЗначенияПараметровМедкарты, ЗначенияВычисляемыхПараметровМедкарты, Истина);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Титульный1");
	МедицинскаяДеятельность.ЗаполнитьОбластьМедкартыПараметрами(ОбластьМакета, ЗначенияПараметровМедкарты, ЗначенияВычисляемыхПараметровМедкарты);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("СведенияОПациенте");
	МедицинскаяДеятельность.ЗаполнитьОбластьМедкартыПараметрами(ОбластьМакета, ЗначенияПараметровМедкарты, ЗначенияВычисляемыхПараметровМедкарты);
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ТабДокумент.Вывести(ОбластьМакета);
	
	Возврат ТабДокумент;
	
КонецФункции

Процедура ПечатьКарты530н_ЗаполнитьОперативныеВмешательства(МедКарта, Макет)
	
	ВидМД = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(108, "ВидыМедицинскихДокументов"); // Протокол оперативного вмешательства (операции).
	
	ДокументыОперативныхВмешательств = МедицинскаяДеятельность.ДокументыПоВидуДокументации(МедКарта, ВидМД);
	
	Если ДокументыОперативныхВмешательств.Количество() = 0 Тогда
		Макет.УдалитьОбласть(Макет.Область("ОперативныеВмешательства"), ТипСмещенияТабличногоДокумента.ПоВертикали);
		Возврат;
	КонецЕсли;
	
	НазначениеВмешательства	= ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(833, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов);
	НазначениеАнестезии		= ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(829, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов);
	НазначениеКровопотери	= ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(6063, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов);
	
	мНазначения = Новый Массив;
	мНазначения.Добавить(НазначениеВмешательства);
	мНазначения.Добавить(НазначениеАнестезии);
	мНазначения.Добавить(НазначениеКровопотери);
	
	ЗначенияПараметровСНазначениями = ЗначенияПараметровСНазначениями(Медкарта, мНазначения);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыОВ.Документ КАК Документ,
		|	ДокументыОВ.ИндексШаблона КАК ИндексШаблона,
		|	ДокументыОВ.Дата КАК Дата
		|ПОМЕСТИТЬ ДокументыОВ
		|ИЗ
		|	&ДокументыОперативныхВмешательств КАК ДокументыОВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПараметров.Документ КАК Документ,
		|	ЗначенияПараметров.ИндексШаблона КАК ИндексШаблона,
		|	ЗначенияПараметров.Дата КАК Дата,
		|	ЗначенияПараметров.Назначение КАК Назначение,
		|	ЗначенияПараметров.Значение КАК Значение
		|ПОМЕСТИТЬ ЗначенияПараметров
		|ИЗ
		|	&ЗначенияПараметровСНазначениями КАК ЗначенияПараметров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПараметров.Документ КАК Документ,
		|	ЗначенияПараметров.ИндексШаблона КАК ИндексШаблона,
		|	ЗначенияПараметров.Дата КАК Дата,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЗначенияПараметров.Назначение = &НазначениеВмешательства
		|				ТОГДА ЗначенияПараметров.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК Вмешательство,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЗначенияПараметров.Назначение = &НазначениеАнестезии
		|				ТОГДА ЗначенияПараметров.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК Анестезия,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЗначенияПараметров.Назначение = &НазначениеКровопотери
		|				ТОГДА ЗначенияПараметров.Значение
		|			ИНАЧЕ NULL
		|		КОНЕЦ) КАК Кровопотеря
		|ИЗ
		|	ЗначенияПараметров КАК ЗначенияПараметров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыОВ КАК ДокументыОВ
		|		ПО ЗначенияПараметров.Документ = ДокументыОВ.Документ
		|			И ЗначенияПараметров.ИндексШаблона = ДокументыОВ.ИндексШаблона
		|			И ЗначенияПараметров.Дата = ДокументыОВ.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗначенияПараметров.Документ,
		|	ЗначенияПараметров.ИндексШаблона,
		|	ЗначенияПараметров.Дата
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата";
	
	Запрос.УстановитьПараметр("ДокументыОперативныхВмешательств",	ДокументыОперативныхВмешательств);
	Запрос.УстановитьПараметр("ЗначенияПараметровСНазначениями",	ЗначенияПараметровСНазначениями);
	Запрос.УстановитьПараметр("НазначениеАнестезии",				НазначениеАнестезии);
	Запрос.УстановитьПараметр("НазначениеВмешательства",			НазначениеВмешательства);
	Запрос.УстановитьПараметр("НазначениеКровопотери",				НазначениеКровопотери);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТабдокОперативногоВмешательства = Макет.ПолучитьОбласть("ОперативныеВмешательства");
		
		НаименованиеОперации = Строка(Выборка.Вмешательство)
							 + ?(ТипЗнч(Выборка.Вмешательство) = Тип("СправочникСсылка.НоменклатураМедицинскихУслуг"), " " + Выборка.Вмешательство.Код, "");
		
		ТабдокОперативногоВмешательства.Параметры.ДатаОперации			= Формат(Выборка.Дата, "ДФ=dd.MM.yyyy");
		ТабдокОперативногоВмешательства.Параметры.НаименованиеОперации	= НаименованиеОперации;
		ТабдокОперативногоВмешательства.Параметры.ВидАнестезии			= Выборка.Анестезия;
		ТабдокОперативногоВмешательства.Параметры.Кровопотеря			= Выборка.Кровопотеря;
		
		ОбластьОперативногоВмешательства = ТабдокОперативногоВмешательства.Области.ОперативныеВмешательства;
		ОбластьОперативногоВмешательства.Имя = "";
		
		Макет.ВставитьОбласть(ОбластьОперативногоВмешательства, Макет.Область("ОперативныеВмешательства"), ТипСмещенияТабличногоДокумента.ПоВертикали, Истина);
	КонецЦикла;
	
	Макет.УдалитьОбласть(Макет.Область("ОперативныеВмешательства"), ТипСмещенияТабличногоДокумента.ПоВертикали);
	
КонецПроцедуры

Процедура ПечатьКарты530н_ДополнитьПараметрыПоКлиенту(Клиент, МедКарта, ЗначенияПараметровМедкарты) Экспорт
	
	// Пол
	ПолВарианты = Новый Соответствие;
	ПолВарианты.Вставить(Перечисления.ПолФизическихЛиц.Мужской, "мужской - 1");
	ПолВарианты.Вставить(Перечисления.ПолФизическихЛиц.Женский, "женский - 2");
	ЗначенияПараметровМедкарты.Пол = ПолВарианты.Получить(Клиент.Пол);
	
	// Гражданство
	Гражданство = Клиент.Гражданство;
	Если Не ЗначениеЗаполнено(Гражданство) Тогда
		Гражданство = Справочники.СтраныМира.Россия;
	КонецЕсли;
	НаименованиеСтраны = ?(ЗначениеЗаполнено(Гражданство.НаименованиеПолное), Гражданство.НаименованиеПолное, Гражданство.Наименование);
	ЗначенияПараметровМедкарты.Вставить("Гражданство", НаименованиеСтраны);
	
	// Паспортные данные
	ДанныеПаспорта = РегистрыСведений.ПаспортныеДанные.ПолучитьПоследнее(МедКарта.ДатаЗакрытия, Новый Структура("ФизЛицо",Клиент));
	ЗначенияПараметровМедкарты.Вставить("ВидДУЛ",	 ДанныеПаспорта.ДокументВид);
	ЗначенияПараметровМедкарты.Вставить("СерияДУЛ",	 ДанныеПаспорта.ДокументСерия);
	ЗначенияПараметровМедкарты.Вставить("НомерДУЛ",	 ДанныеПаспорта.ДокументНомер);
	
	// Адреса
	СтруктураАдреса = МедицинскаяДеятельность.ПолучитьАдресКлиентаДляМедкарты(Клиент, Ложь);
	СтруктураАдреса.Удалить("Представление");
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ЗначенияПараметровМедкарты, СтруктураАдреса, Ложь);
	
	СтруктураАдреса = МедицинскаяДеятельность.ПолучитьАдресКлиентаДляМедкарты(Клиент, Ложь, Справочники.ВидыКонтактнойИнформации.АдресФактический);
	Если ЗначениеЗаполнено(СтруктураАдреса.Представление) Тогда
		Для Каждого кзАдрес Из СтруктураАдреса Цикл
			Если кзАдрес.Ключ <> "Представление" Тогда
				ЗначенияПараметровМедкарты.Вставить(кзАдрес.Ключ + "Пребывание", кзАдрес.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// Электронная почта
	ЗначенияПараметровМедкарты.Вставить("ЭлПочта", КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Клиент, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
	
	// Полис
	ЗначенияПараметровМедкарты.Вставить("ПолисОМС",			 ЗначенияПараметровМедкарты.НомерСерияПолиса);
	ЗначенияПараметровМедкарты.Вставить("ДанныеОСтраховой",  ЗначенияПараметровМедкарты.СтраховаяОрганизация);
	ЗначенияПараметровМедкарты.Вставить("ДатаВыдачиОМС",	 Формат(ЗначенияПараметровМедкарты.СрокДействияНачало, "ДФ=dd.MM.yyyy"));
	
	// Место работы, Профессия/Должность
	МестоРаботы = Строка(Клиент.умцМестоРаботы);
	Если ТипЗнч(Клиент.умцМестоРаботы) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(Клиент.умцМестоРаботы.НаименованиеПолное) Тогда
		МестоРаботы = Клиент.умцМестоРаботы.НаименованиеПолное;
	КонецЕсли;
	ЗначенияПараметровМедкарты.Вставить("МестоРаботы", МестоРаботы);
	ЗначенияПараметровМедкарты.Вставить("Должность", Клиент.Профессия);
	
КонецПроцедуры

Процедура ПечатьКарты530н_ДополнитьПараметрыПоОбращению(Медкарта, ЗначенияПараметровМедкарты) Экспорт
	
	ФорматДатаВремя003у = "";
	
	Обращение = ОбращениеПоМедкарте(Медкарта);
	
	Если Не ЗначениеЗаполнено(Обращение) Тогда
		Возврат;
	КонецЕсли;
	
	// Вид стационара.
	ВидСтационара = Обращение.Подразделение.ВидСтационара;
	ВидСтационараВарианты = Новый Соответствие;
	ВидСтационараВарианты.Вставить(Перечисления.ВидыСтационара.Круглосуточный,	 "стационар - 1");
	ВидСтационараВарианты.Вставить(Перечисления.ВидыСтационара.Дневной,			 "дневной стационар - 2");
	ЗначенияПараметровМедкарты.Вставить("ВидСтационара", ВидСтационараВарианты.Получить(ВидСтационара));
	
	// Дата поступления
	Если ЗначениеЗаполнено(Обращение.ДатаВремяПоступления) Тогда
		ЗначенияПараметровМедкарты.Вставить("ДатаВремяПоступления", ДатаВремяВФормате003У(Обращение.ДатаВремяПоступления));
		ЗначенияПараметровМедкарты.Вставить("ДатаПоступления", Обращение.ДатаВремяПоступления);
	КонецЕсли;
	// Прошло часов с травмы к моменту поступления.
	ЗначенияПараметровМедкарты.Вставить("ЧерезЧасовПослеНачалаЗаболевания", Формат(Обращение.ЧерезЧасовПослеНачалаЗаболевания, "ЧН= - "));
	// Кем доставлен (канал)
	ЗначенияПараметровМедкарты.Вставить("КаналГоспитализации", Обращение.КаналГоспитализации);
	// Направившее учреждение
	ЗначенияПараметровМедкарты.Вставить("НаправившееУчреждение",		 Обращение.НаправившееУчреждение);
	ЗначенияПараметровМедкарты.Вставить("НомерНаправления",				 Обращение.НомерНаправления);
	ЗначенияПараметровМедкарты.Вставить("ДатаВыдачиНаправления",		 Формат(Обращение.ДатаВыдачиНаправления,"ДЛФ=DD"));
	ЗначенияПараметровМедкарты.Вставить("ДиагнозНаправившегоУчреждения", Обращение.ДиагнозНаправления);
	
	// Форма: экстренно / планово
	ЗначенияПараметровМедкарты.Вставить("ФормаОказанияМедПомощи", ?(Обращение.ДоставленПоЭкстреннымПоказателям, "экстренная - 2", "плановая - 1"));
	
	// Отделение
	Отделение = Обращение.Подразделение;
	ОтделениеНаименование = Отделение.НаименованиеПолное;
	Если ПустаяСтрока(ОтделениеНаименование) Тогда
		ОтделениеНаименование = ?(ЗначениеЗаполнено(Отделение.ПодразделениеМинздрава), Строка(Отделение.ПодразделениеМинздрава), Отделение.Наименование);
	КонецЕсли;
	ЗначенияПараметровМедкарты.Вставить("Отделение", ОтделениеНаименование);
	
	// Значение затирается далее, если менялось после обращения в ходе пребывания
	Если ЗначениеЗаполнено(Обращение.ЛечащийВрач) Тогда
		ЗначенияПараметровМедкарты.Вставить("ФИОДолжностьСпециальностьВрача", ПредставлениеВрачаВМедкартеСДолжностьюСпециальностью(Обращение.ЛечащийВрач));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отделение.Руководитель) Тогда
		ЗначенияПараметровМедкарты.Вставить("ФИОЗаведующегоОтделением", ОбщегоНазначения.ФИОФизЛица(Отделение.Руководитель));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПечатьКарты530н_ДополнитьПараметрыПопребыванию(Медкарта, ЗначенияПараметровМедкарты, ТекстыДиагнозовРаздельно) Экспорт
	
	ЗначенияПараметровСНазначениями = ЗначенияПараметровСНазначениями(Медкарта);

	ДанныеПребывания = ПолучитьОписаниеПребыванияПациентаВСтационареПоМедкарте(Медкарта);
	
	// Палата поступления	
	ПалатаПоступления = ДанныеПребывания.ПалатаПоступления;
	Если ЗначениеЗаполнено(ПалатаПоступления) Тогда
		ЗначенияПараметровМедкарты.Вставить("Палата", ПалатаПоступления.Префикс);
		ЗначенияПараметровМедкарты.Вставить("ПрофильКоек", Строка(ПалатаПоступления.Профиль));
	КонецЕсли;

	// Дата выписки
	ДатаВыписки = НайтиЗначениеВКешеПоНазначению(ЗначенияПараметровСНазначениями, ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(12496, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов));
		
	Если ЗначениеЗаполнено(ДатаВыписки) Тогда
		ЗначенияПараметровМедкарты.Вставить("ДатаВремяВыписки", ДатаВремяВФормате003У(ДатаВыписки));
		
		КолДней = (ДатаВыписки - ЗначенияПараметровМедкарты.ДатаПоступления)/86400;
		Если КолДней <> Цел(КолДней) Тогда
			КолДней = Цел(КолДней) + 1;
		КонецЕсли;
		ЗначенияПараметровМедкарты.Вставить("ДнейВМедОрганизации", КолДней);
	КонецЕсли;
	
	// Заполнение по первичному осмотру
	ВидМД = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(381, "ВидыМедицинскихДокументов"); // Первичный осмотр приемного отделения.
	Если ЗначениеЗаполнено(ВидМД) Тогда
		ДокументыКарты = МедицинскаяДеятельность.ДокументыПоВидуДокументации(Медкарта, ВидМД);
	
		Если ДокументыКарты.Количество() <> 0 Тогда
			
			ДанныеДокумента = ДокументыКарты[ДокументыКарты.Количество() - 1]; // Хронологически последний.
			
			ДокументСсылка = ДанныеДокумента.Документ;
			
			ДопОписаниеЗаболеванияИзПараметраПриема = НайтиЗначениеВКешеПоНазначению(ЗначенияПараметровСНазначениями,
																					 ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(8045, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов),
																					 ДокументСсылка);
			СтандатноеОписаниеДиагнозов = СтандатноеОписаниеДиагнозовМД_003(ДокументСсылка,,ДопОписаниеЗаболеванияИзПараметраПриема);
			
			ЗначенияПараметровМедкарты.Вставить("ДатаВремяПредварительногоДиагноза", ДатаВремяВФормате003У(ДанныеДокумента.Дата));
			ЗначенияПараметровМедкарты.Вставить("ДиагнозПриПоступленииПолныйТекст", СтандатноеОписаниеДиагнозов.ОписаниеДиагнозов);
			
			Если ТекстыДиагнозовРаздельно Тогда
				Для Каждого ДиагнозыПоКлассификации Из СтандатноеОписаниеДиагнозов.ДиагнозыПоКлассификациям Цикл
					ИндексЗначенияПеречисления = Перечисления.КлассификацииДиагнозов.Индекс(ДиагнозыПоКлассификации.Ключ);
					МетаданныеПеречисления = Метаданные.Перечисления.КлассификацииДиагнозов.ЗначенияПеречисления[ИндексЗначенияПеречисления];
					ИмяПараметраДиагноза = СтрШаблон("%1ПриПоступлении", МетаданныеПеречисления.Имя);
					ИмяПараметраКода = СтрШаблон("Код%1ПриПоступлении", МетаданныеПеречисления.Имя);
					ЗначенияПараметровМедкарты.Вставить(ИмяПараметраДиагноза, ДиагнозыПоКлассификации.Значение.ТекстДиагнозов);
					ЗначенияПараметровМедкарты.Вставить(ИмяПараметраКода, ДиагнозыПоКлассификации.Значение.ТекстКодов);
				КонецЦикла;
				ЗначенияПараметровМедкарты.Вставить("ДополнительныеСведенияОЗаболеванииПриПоступлении", СтандатноеОписаниеДиагнозов.ДополнительныеСведения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Инфекции в анамнезе
	ЗначенияПараметровМедкарты.Вставить("ИнфекционныеОтметкиАнамнезаВСтационаре",
		НайтиЗначениеВКешеПоНазначению(ЗначенияПараметровСНазначениями, Перечисления.КодировкаПолейЭМД.ИнфекционныеОтметкиАнамнезаВСтационаре));
	// Инфекции в анамнезе. Если не заполнено, то значение по умолчанию с прочерками.
	Если Не ЗначениеЗаполнено(ЗначенияПараметровМедкарты.ИнфекционныеОтметкиАнамнезаВСтационаре) Тогда
		ЗначенияПараметровМедкарты.ИнфекционныеОтметкиАнамнезаВСтационаре = Обработки.ИнтерфейсВводаПолейЭМД.ИнфекционныеОтметкиАнамнезаВСтационаре_ЗначениеПоУмолчанию(Медкарта);
	КонецЕсли;
	
	// Педикулез, чесотка.
	ЗначенияПараметровМедкарты.Вставить("ОстмотрНаПедикулезЧесотку", "нет");
	ЗначенияПараметровМедкарты.Вставить("РезультатОсмотраНаПедикулезЧесотку", "нет");
	
	// Аллергии в анамнезе
	ЗначенияПараметровМедкарты.Вставить("АлергическиеРекакции",
		НайтиЗначениеВКешеПоНазначению(ЗначенияПараметровСНазначениями, ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(12117, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов)));
	
	// Трансфузии в анамнезе
	ЗначенияПараметровМедкарты.Вставить("НаличиеТрансфузийВАнамнезе",
		НайтиЗначениеВКешеПоНазначению(ЗначенияПараметровСНазначениями, ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(1004, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов)));

	// Группа крови и др.
	ЗначенияПараметровМедкарты.Вставить("ГруппаКрови",
		НайтиЗначениеВКешеПоНазначению(ЗначенияПараметровСНазначениями, ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(11052, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов)));
		
	ЗначенияПараметровМедкарты.Вставить("Резус",
		НайтиЗначениеВКешеПоНазначению(ЗначенияПараметровСНазначениями, ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(12237, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов)));
		
	ЗначенияПараметровМедкарты.Вставить("АнтигенК1",
		НайтиЗначениеВКешеПоНазначению(ЗначенияПараметровСНазначениями, ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(12240, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов)));
	
	// Клинический диагноз
	ДатаИДокументКлиническогоДиагноза = ДанныеДокументаКлиническогоДиагнозаМедкарты(Медкарта);
	Если ЗначениеЗаполнено(ДатаИДокументКлиническогоДиагноза.ДатаКлиническогоДиагноза) Тогда
		ЗначенияПараметровМедкарты.Вставить("ДатаВремяУстановленияКлиническогоДиагноза", ДатаВремяВФормате003У(ДатаИДокументКлиническогоДиагноза.ДатаКлиническогоДиагноза));
	КонецЕсли;
	Если ЗначениеЗаполнено(ДатаИДокументКлиническогоДиагноза.Документ) Тогда
		
		ДопОписаниеЗаболеванияИзПараметраПриема = НайтиЗначениеВКешеПоНазначению(ЗначенияПараметровСНазначениями,
																				 ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(8045, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов),
																				 ДатаИДокументКлиническогоДиагноза.Документ);
		СтандатноеОписаниеДиагнозов = СтандатноеОписаниеДиагнозовМД_003(ДатаИДокументКлиническогоДиагноза.Документ,, ДопОписаниеЗаболеванияИзПараметраПриема);
		ЗначенияПараметровМедкарты.Вставить("ДиагнозКлиническийПолныйТекст", СтандатноеОписаниеДиагнозов.ОписаниеДиагнозов);
		
		Если ТекстыДиагнозовРаздельно Тогда
			Для Каждого ДиагнозыПоКлассификации Из СтандатноеОписаниеДиагнозов.ДиагнозыПоКлассификациям Цикл
				ИндексЗначенияПеречисления = Перечисления.КлассификацииДиагнозов.Индекс(ДиагнозыПоКлассификации.Ключ);
				МетаданныеПеречисления = Метаданные.Перечисления.КлассификацииДиагнозов.ЗначенияПеречисления[ИндексЗначенияПеречисления];
				ИмяПараметраДиагноза = СтрШаблон("%1Заключение", МетаданныеПеречисления.Имя);
				ИмяПараметраКода = СтрШаблон("Код%1Заключение", МетаданныеПеречисления.Имя);
				ЗначенияПараметровМедкарты.Вставить(ИмяПараметраДиагноза, ДиагнозыПоКлассификации.Значение.ТекстДиагнозов);
				ЗначенияПараметровМедкарты.Вставить(ИмяПараметраКода, ДиагнозыПоКлассификации.Значение.ТекстКодов);
			КонецЦикла;
			ЗначенияПараметровМедкарты.Вставить("ДополнительныеСведенияОЗаболеванииЗаключение", СтандатноеОписаниеДиагнозов.ДополнительныеСведения);
		КонецЕсли;
	КонецЕсли;
	
	// Проведенные операции.
	
	// Исход госпитализации
	ЗначенияПараметровМедкарты.Вставить("ИсходГоспитализации",
		НайтиЗначениеВКешеПоНазначению(ЗначенияПараметровСНазначениями, ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(12157, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов)));

	// Иная организация, куда был переведен
	
	// Результат госпитализации
	ЗначенияПараметровМедкарты.Вставить("РезультатГоспитализации",
		НайтиЗначениеВКешеПоНазначению(ЗначенияПараметровСНазначениями, ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(818, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов)));
	
	// Умер, умерла
	// нет.	
	
	// Листки нетрудоспособности
	ДанныеЛистков = Документы.ЛистокНетрудоспособности.ДанныеЛистковМедкарты(Медкарта);
	Для Каждого КлючЗначение Из ДанныеЛистков Цикл
		Если ЗначениеЗаполнено(КлючЗначение.Значение) Тогда
			ЗначенияПараметровМедкарты.Вставить(КлючЗначение.Ключ, Формат(КлючЗначение.Значение, "ДФ=dd.MM.yyyy"));
		КонецЕсли;
	КонецЦикла;

	// МСЭ
	
	// Законный представитель для информирования
	// нет.
	
	// Лечащий врач (затирает ранее вычисленное значение по обращению).
	ЛечащийВрач = НайтиЗначениеВКешеПоНазначению(ЗначенияПараметровСНазначениями, Перечисления.КодировкаПолейЭМД.ЛечащийВрач);
	Если ЗначениеЗаполнено(ЛечащийВрач) Тогда
		ЗначенияПараметровМедкарты.Вставить("ФИОДолжностьСпециальностьВрача", ПредставлениеВрачаВМедкартеСДолжностьюСпециальностью(ЛечащийВрач));
	КонецЕсли;

КонецПроцедуры

Функция ЗначенияПараметровСНазначениями(Медкарта, Назначения = Неопределено, Приемы=Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МедицинскаяКарта", МедКарта);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПараметрыHTML.Ссылка КАК Параметр,
		|	ПараметрыHTML.Назначение КАК Назначение
		|ПОМЕСТИТЬ Параметры
		|ИЗ
		|	ПланВидовХарактеристик.ПараметрыHTML КАК ПараметрыHTML
		|ГДЕ
		|	ПараметрыHTML.Назначение <> НЕОПРЕДЕЛЕНО
		|	И (&ПоВсемНазначениям
		|			ИЛИ ПараметрыHTML.Назначение В (&Назначения))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Прием.Ссылка КАК Ссылка,
		|	Прием.Дата КАК Дата
		|ПОМЕСТИТЬ ДокументыКарты
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	Прием.МедицинскаяКарта = &МедицинскаяКарта
		|	И НЕ Прием.ПометкаУдаления
		|	И (&ПоВсемПриемам
		|			ИЛИ Прием.Ссылка В (&Приемы))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗначенияПараметровHTML.Параметр КАК Параметр,
		|	Параметры.Назначение КАК Назначение,
		|	ЗначенияПараметровHTML.Значение КАК Значение,
		|	ЗначенияПараметровHTML.Документ КАК Документ,
		|	ЗначенияПараметровHTML.ИндексШаблона КАК ИндексШаблона,
		|	ДокументыКарты.Дата КАК Дата
		|ИЗ
		|	ДокументыКарты КАК ДокументыКарты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПараметровHTML КАК ЗначенияПараметровHTML
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Параметры КАК Параметры
		|			ПО ЗначенияПараметровHTML.Параметр = Параметры.Параметр
		|		ПО ДокументыКарты.Ссылка = ЗначенияПараметровHTML.Документ
		|ГДЕ
		|	ЗначенияПараметровHTML.Значение <> """"
		|	И ЗначенияПараметровHTML.Значение <> НЕОПРЕДЕЛЕНО
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	Документ,
		|	ИндексШаблона";
	
	ПоВсемНазначениям = Назначения = Неопределено;
	
	Если ПоВсемНазначениям Тогда
		Назначения = Новый Массив;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПоВсемНазначениям", ПоВсемНазначениям);
	Запрос.УстановитьПараметр("Назначения", Назначения);
	
	ПоВсемПриемам = Приемы = Неопределено;
	
	Если ПоВсемПриемам Тогда
		Приемы = Новый Массив;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПоВсемПриемам", ПоВсемПриемам);
	Запрос.УстановитьПараметр("Приемы", Приемы);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция НайтиЗначениеВКешеПоНазначению(ЗначенияПараметровСНазначениями, Назначение, ДокументыОтбор = Неопределено, Последнее = Истина)
	
	Значение = "";
	
	СтрокиПоНазначению = ЗначенияПараметровСНазначениями.НайтиСтроки(Новый Структура("Назначение", Назначение));
	
	// Если задан отбор по документам, то фильтруются лишние строки.
	Если ДокументыОтбор <> Неопределено Тогда
		Если ТипЗнч(ДокументыОтбор) = Тип("ТаблицаЗначений") Тогда
			ПоискДокумента = Новый Структура("Документ, ИндексШаблона");
			мОбрИнд = СтрокиПоНазначению.Количество()-1;
			Для Сч = 0 По мОбрИнд Цикл
				
				СтрокаТЗ = СтрокиПоНазначению[мОбрИнд-Сч];
				
				ЗаполнитьЗначенияСвойств(ПоискДокумента, СтрокаТЗ);
				Если ДокументыОтбор.НайтиСтроки(ПоискДокумента).Количество() = 0 Тогда
					СтрокиПоНазначению.Удалить(мОбрИнд-Сч);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ДокументыОтбор)) Тогда
			мОбрИнд = СтрокиПоНазначению.Количество()-1;
			Для Сч = 0 По мОбрИнд Цикл
				СтрокаТЗ = СтрокиПоНазначению[мОбрИнд-Сч];
				Если СтрокаТЗ.Документ <> ДокументыОтбор Тогда
					СтрокиПоНазначению.Удалить(мОбрИнд-Сч);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокиПоНазначению.Количество() <> 0 Тогда
		
		Если Последнее Тогда
			Значение = СтрокиПоНазначению[0].Значение;
		Иначе
			Для Каждого СтрокаПоНазначению Из СтрокиПоНазначению Цикл
				ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Значение, СтрокаПоНазначению.Значение, Символы.ПС);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Функция - Данные документа клинического диагноза медкарты
//
// Параметры:
//  Медкарта - СправочникСсылка.МедицинскиеКарты - медкарта.
// 
// Возвращаемое значение:
//  Структура - с ключами: Документ - ДокументСсылка.Приемы; ДатаКлиническогоДиагноза - дата.
//
Функция ДанныеДокументаКлиническогоДиагнозаМедкарты(Медкарта) Экспорт
	
	Результат = Новый Структура("Документ, ДатаКлиническогоДиагноза");
	
	// Осмотр лечащим врачом, врачом-специалистом, заведующим отделением, 
	// лечащим врачом совместно с врачом-специалистом, лечащим врачом совместно с заведующим отделением.
	ВидМД = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(341, "ВидыМедицинскихДокументов");
	ДокументыКарты = МедицинскаяДеятельность.ДокументыПоВидуДокументации(Медкарта, ВидМД);
	ДокументыКарты.Свернуть("Документ, Дата");
	
	// Ищем в конечном счете последний документ с диагнозами в табличной части
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументыКарты", ДокументыКарты);
	Запрос.УстановитьПараметр("ВидНозологииОсновноеЗаболевание", Перечисления.КлассификацииДиагнозов.ОсновноеЗаболевание);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДокументыКарты.Документ КАК Документ,
	|	ДокументыКарты.Дата КАК Дата
	|ПОМЕСТИТЬ ДокументыКарты
	|ИЗ
	|	&ДокументыКарты КАК ДокументыКарты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыКарты.Документ КАК Документ,
	|	ДокументыКарты.Дата КАК Дата,
	|	Диагнозы.Диагноз КАК Диагноз,
	|	Диагнозы.Классификация3 КАК ВидНозологии
	|ИЗ
	|	ДокументыКарты КАК ДокументыКарты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Прием.Диагнозы КАК Диагнозы
	|		ПО ДокументыКарты.Документ = Диагнозы.Ссылка
	|			И Диагнозы.Классификация3 = &ВидНозологииОсновноеЗаболевание
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументыКарты.Дата,
	|	ДокументыКарты.Документ"
	;
	
	ДокументыИДиагнозы = Запрос.Выполнить().Выгрузить();
	
	Если ДокументыИДиагнозы.Количество() <> 0 Тогда
	
	СтрокаПоследнийДиагноз = ДокументыИДиагнозы[ДокументыИДиагнозы.Количество() - 1];
	Результат.Документ = СтрокаПоследнийДиагноз.Документ;
	
	// Ищем, когда этот основной диагноз был выявлен впервые.
	Отбор = Новый Структура("Диагноз", СтрокаПоследнийДиагноз.Диагноз);
	СтрокиДиагноза = ДокументыИДиагнозы.НайтиСтроки(Отбор);
	Если СтрокиДиагноза.Количество() <> 0 Тогда
		Результат.ДатаКлиническогоДиагноза = СтрокиДиагноза[0].Дата;
	КонецЕсли;
	
	//ДокументыСДиагнозами = ДокументыИДиагнозы.Скопировать(, "Документ, Дата");
	//ДокументыСДиагнозами.Свернуть("Документ, Дата");
	//ДокументыСДиагнозами.Колонки.Добавить("ХешДиагнозов", Новый ОписаниеТипов("Строка"));
	//// Этап 1, вычисление "хеша" диагнозов каждого документа.
	//Для Каждого ДокументСДиагнозом Из ДокументыСДиагнозами Цикл
	//	
	//	Хеш = ""; // Упрощенно.
	//	
	//	Отбор.Документ = ДокументСДиагнозом.Документ;
	//	СтрокиДиагнозы = ДокументыИДиагнозы.НайтиСтроки(Отбор);
	//	Для Каждого СтрокаДиагноза Из СтрокиДиагнозы Цикл
	//		
	//		ДокументСДиагнозом.ХешДиагнозов = ДокументСДиагнозом.ХешДиагнозов
	//										+ Строка(СтрокаДиагноза.Диагноз.УникальныйИдентификатор())
	//										+ Строка(СтрокаДиагноза.ВидНозологии);
	//		
	//	КонецЦикла;
	//КонецЦикла;
	//
	//// Этап 2. Определение, какой самый ранний документ имел этот же "хеш" диагнозов
	//ПоследнийХеш = ДокументыСДиагнозами[ДокументыСДиагнозами.Количество()-1].ХешДиагнозов;
	//Для Каждого ДокументСДиагнозом Из ДокументыСДиагнозами Цикл
	//	Если ДокументСДиагнозом.ХешДиагнозов = ПоследнийХеш Тогда
	//		// Отсортированы по возрастанию даты
	//		Результат.Документ = ДокументСДиагнозом.Документ;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//КлиническийДиагноз = Неопределено;
	//Отбор.Документ = ДокументыСДиагнозами[ДокументыСДиагнозами.Количество() - 1].Документ;
	//СтрокиДиагнозы = ДокументыИДиагнозы.НайтиСтроки(Отбор);
	
	КонецЕсли;
	
	Возврат Результат; // По умолчанию.
	
КонецФункции

Функция ПредставлениеВрачаВМедкартеСДолжностьюСпециальностью(Сотрудник)
	
	мДанныеВрача = Новый Массив;
	мДанныеВрача.Добавить(ОбщегоНазначения.ФИОФизЛица(Сотрудник));
	
	ДолжностьСпециализация = ДолжностьСпециализацияВрача(Сотрудник);
	Если ЗначениеЗаполнено(ДолжностьСпециализация.ДолжностьПредставление) Тогда
		мДанныеВрача.Добавить(ДолжностьСпециализация.ДолжностьПредставление);
	КонецЕсли;
	Если ЗначениеЗаполнено(ДолжностьСпециализация.СпециализацияПредставление) Тогда
		мДанныеВрача.Добавить(ДолжностьСпециализация.СпециализацияПредставление);
	КонецЕсли;
	
	Представление = СтрСоединить(мДанныеВрача, ", ");
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти

#Область ЭМК

Функция СформироватьТемпературныйЛистДляЭМК(Клиент, МедицинскаяКарта, ДатаНачала, ДатаОкончания) Экспорт
	
	ДатаНачалаОтчета = ДатаНачала;
	
	ОписаниеПребывания = Стационар.ПолучитьОписаниеПребыванияПациентаВСтационареПоМедкарте(МедицинскаяКарта);
	Если ЗначениеЗаполнено(ОписаниеПребывания.ДатаПоступления) Тогда
		ДатаНачалаОтчета = Макс(НачалоДня(ОписаниеПребывания.ДатаПоступления), ДатаНачала);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаНачалаОтчета) Тогда
		Сообщение	= НСтр("ru='Не удалось сформировать температурный лист:'") + Символы.Таб
					+ НСтр("ru='Дата отчета не задана и не может быть определена автоматически'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеПребывания.ДатаВыписки) Тогда
		ДатаОкончанияОтчета = НачалоДня(ОписаниеПребывания.ДатаВыписки);
	Иначе
		ДатаОкончанияОтчета = Дата(3999, 12, 31);
	КонецЕсли;
	
	ТабДок = Отчеты.ТемпературныйЛист.Создать().СформироватьОтчет(, Клиент, МедицинскаяКарта, ДатаНачалаОтчета, ДатаОкончанияОтчета);
	
	Возврат ТабДок;
	
КонецФункции

Функция СформироватьЛистНазначенийДляЭМК(Клиент, МедицинскаяКарта, ДатаНачала, ДатаОкончания) Экспорт
	
	ЛистНазначенияОтчет = Отчеты.ЛистНазначений.Создать();
	ЛистНазначенияОтчет.Клиент = Клиент;
	ЛистНазначенияОтчет.МедицинскаяКарта = МедицинскаяКарта;
	
	Возврат ЛистНазначенияОтчет.СформироватьЛистВыполненияНазначений();
	
КонецФункции

Функция ПолучитьТекстHTMLТабличногоДокумента(ТабДок, СтандартныйHTMLПустогоДокумента = Ложь)
	
	ИтоговыйТекстHTML = "";
	
	Если ТипЗнч(ТабДок) = Тип("ТабличныйДокумент")
		И ТабДок.ВысотаТаблицы <> 0
	Тогда
		ИмяВременногоКаталога = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(
			ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогВременныхФайлов()) + "medcard_tmp");
		ФайлКаталог = Новый Файл(ИмяВременногоКаталога);
		Если ФайлКаталог.Существует() Тогда 
			УдалитьФайлы(ИмяВременногоКаталога);
		КонецЕсли;
		СоздатьКаталог(ИмяВременногоКаталога);
		
		ИмяВременногоФайла = ИмяВременногоКаталога + "medcard.html"; 
		ТабДок.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.HTML5);
		
		ТекстовыйФайл = Новый ТекстовыйДокумент;
		ТекстовыйФайл.Прочитать(ИмяВременногоФайла);
		ТекстHТМЛ = ТекстовыйФайл.ПолучитьТекст();
		
		// Обработка изображений не осуществляется.
		
		ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM(ТекстHТМЛ);
		ТекстHТМЛ = РаботаСDOMКлиентСервер.ПолучитьТекстHTMLДокументаDOM(ДокументHTML);
		
		// Удаление временных файлов
		УдалитьФайлы(ИмяВременногоКаталога);
	Иначе 
		ТекстHТМЛ = "";
	КонецЕсли;
	
	Если ПустаяСтрока(ТекстHТМЛ) И СтандартныйHTMLПустогоДокумента Тогда 
		ТекстHТМЛ = РаботаСHTMLКлиентСервер.ПолучитьТекстHTMLПустогоДокумента();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстHТМЛ) Тогда
		ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM(ТекстHТМЛ);
		ИтоговыйТекстHTML = РаботаСDOMКлиентСервер.ПолучитьТекстHTMLДокументаDOM(ДокументHTML);
		ИтоговыйТекстHTML = РаботаСHTMLКлиентСервер.ПеренестиСтилиИзHeadВТелоДокументаСЗаменойИменКлассов(ИтоговыйТекстHTML);
		ИтоговыйТекстHTML = РаботаСHTMLКлиентСервер.УдалитьСтильЭлемента(ИтоговыйТекстHTML);
	КонецЕсли;
	
	Возврат ИтоговыйТекстHTML;
	
КонецФункции

Функция СформироватьЖурналТрансфузийДляЭМК(Клиент, МедицинскаяКарта) Экспорт
	
	ТабДок = Отчеты.ЖурналТрансфузий.Создать().СформироватьОтчет(, Клиент, МедицинскаяКарта);
	
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти