#Область ПрограммныйИнтерфейс

// Обновляет идентификаторы метаданных расширений при обновлении
Процедура ОбновитьИдентификаторыМетаданныхРасширений() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Если Не Справочники.ИдентификаторыОбъектовРасширений.ИдентификаторыОбъектовТекущейВерсииРасширенийЗаполнены() Тогда
		Если Не ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
			ВариантыОтчетов.ОперативноеОбновлениеОбщихДанных("ОбщиеДанныеРасширений", Неопределено);
			Справочники.ИдентификаторыОбъектовРасширений.ОбновитьДанныеСправочника();
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Идентификаторы объектов у текущей версии расширений не заполнены");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Получает реквизит/атрибут/свойство по имени на сервере.
// Используется для получения через точку значений ссылочных типов.
// Не применяет произвольный запрос к таблице как ОбщегоНазначения.ЗначениеРеквизитаОбъекта().
//
// Параметры:
//  Ссылка		 - ЛюбаяСсылка, Произвольный - Ссылка или значение, имеющее атрибуты (свойства).
//  ИмяРеквизита - Строка - Имя реквизита или цепочка имен, например "Сотрудник.Код" - вернет код реквизита "Сотрудник" переданной ссылки.
// 
// Возвращаемое значение:
//   Произвольный, Неопределено.
//
Функция ПолучитьРеквизит(Ссылка, ИмяРеквизита) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		ЗаполненоЗначение = ЗначениеЗаполнено(Ссылка);
	Исключение
		ЗаполненоЗначение = Истина;
	КонецПопытки;
	
	Если ЗаполненоЗначение Тогда
		
		Если СтрНайти(ИмяРеквизита, ".") = 0 Тогда
			Возврат Ссылка[ИмяРеквизита];
		Иначе
			ЧастиРеквизита = СтрРазделить(ИмяРеквизита, ".");
			ЗначениеРеквизита = Ссылка[ЧастиРеквизита[0]];
			ЧастиРеквизита.Удалить(0);
			
			Возврат ПолучитьРеквизит(ЗначениеРеквизита, СтрСоединить(ЧастиРеквизита, "."));
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции	

// Возвращает Истина, если передана ссылка на документ или имя метаданных документа.
//
// Параметры:
//  Документ	 - Строка, ДокументСсылка - проверяемое значение.
// 
// Возвращаемое значение:
//   Булево.
//
Функция ЭтоДокумент(Документ) Экспорт
	
	Если ТипЗнч(Документ) = Тип("Строка") Тогда
		Если Метаданные.Документы.Найти(Документ) <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;	
	ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(Документ)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает Истина, если передана ссылка на справочник или имя метаданных справочника.
//
// Параметры:
//  Справочник	 - Строка, СправочникСсылка - проверяемое значение.
// 
// Возвращаемое значение:
//   Булево.
//
Функция ЭтоСправочник(Справочник) Экспорт
	
	Если ТипЗнч(Справочник) = Тип("Строка") Тогда
		Если Метаданные.Справочники.Найти(Справочник) <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;	
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Справочник)) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Пустая ссылка по имени документа.
//
// Параметры:
//  Имя	 - Строка - Имя документа.
// 
// Возвращаемое значение:
//   ДокументСсылка. 
//
Функция ПустаяСсылкаПоТипуДокумента(Имя) Экспорт
	Возврат Документы[Имя].ПустаяСсылка();
КонецФункции

// Пустая ссылка по имени справочника.
//
// Параметры:
//  Имя	 - Строка - Имя справочника.
// 
// Возвращаемое значение:
//   СправочникСсылка. 
//
Функция ПустаяСсылкаПоТипуСправочника(Имя) Экспорт
	Возврат Справочники[Имя].ПустаяСсылка();
КонецФункции

// Вызывает на сервере функцию РольДоступна() платформы.
//
// Параметры:
//  ИмяРоли	 - Строка - Имя роли.
// 
// Возвращаемое значение:
//   Булево.
//
Функция РольДоступнаСервер(ИмяРоли) Экспорт 
	Возврат РольДоступна(ИмяРоли);
КонецФункции	

// Номер релиза конфигурации.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ПолучитьНомерВерсииКонфигурации() Экспорт 
	Возврат Константы.НомерВерсииКонфигурации.Получить();
КонецФункции

// Возвращает ссылку на общий модуль по имени.
//	Отличается от функции из БСП наличием параметра ИсключениеЕслиНеНайден для работы с отсутствующими модулями.
//
// Параметры:
//  Имя          - Строка - имя общего модуля, например:
//                 "ОбщегоНазначения",
//                 "ОбщегоНазначенияКлиент".
//	ИсключениеЕслиНеНайден - Булево - вызывать исключение, если модуля в конфигурации нет (добавлен ОЛИМП для возможности не вызывать исключение).
//
// Возвращаемое значение:
//  ОбщийМодуль - общий модуль.
//
Функция ОбщийМодуль(Имя, ИсключениеЕслиНеНайден = Ложь) Экспорт
	
	Если ИсключениеЕслиНеНайден Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль(Имя);
	Иначе
		Попытка
			Модуль = ОбщегоНазначения.ОбщийМодуль(Имя);
		Исключение
			Модуль = Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции

// Возвращает полное имя ссылочного типа, например, "Документ.Прием".
//	Для не ссылочных типов возвращает пустую строку.
//
// Параметры:
//  Ссылка	 - Произвольный	 - ссылка или иное значение.
// 
// Возвращаемое значение:
//  Строка - Полное имя метаданных ссылки.
//
Функция ИмяСсылочногоТипа(Ссылка) Экспорт
	
	Попытка 
		ОбъектМД = Метаданные.НайтиПоТипу(ТипЗнч(Ссылка));
			
		// Проверку выполняем только для ссылочных типов.
		Если ОбъектМД <> Неопределено
			И ОбщегоНазначения.ЭтоОбъектСсылочногоТипа(ОбъектМД) Тогда
			
			Возврат ОбъектМД.ПолноеИмя();
			
		КонецЕсли;
	Исключение КонецПопытки;
	
	Возврат "";
	
КонецФункции

Функция ПредставленияМассиваСсылок(МассивСсылок) Экспорт
	
	Результат = Новый СписокЗначений;
	
	Если МассивСсылок.Количество() <> 0 Тогда
		
		ИмяТипа = МассивСсылок[0].Метаданные().ПолноеИмя();
		
		ТекстЗапроса = СтрШаблон("ВЫБРАТЬ Ссылка, Представление ИЗ %1 ГДЕ Ссылка В (&Ссылки)", ИмяТипа);
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылки", МассивСсылок);
		Выборка = Запрос.Выполнить().Выбрать();
		Отбор = Новый Структура("Ссылка");
		Для Каждого Ссылка Из МассивСсылок Цикл
			Отбор.Ссылка = Ссылка;
			Выборка.Сбросить();
			Если Выборка.НайтиСледующий(Отбор) Тогда
				Результат.Добавить(Ссылка, Выборка.Представление);
			Иначе
				Результат.Добавить(Ссылка, Строка(Ссылка)); // Битая ссылка.
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область СистемнаяИнформация

// Получает имя клиентского приложения из текущего сеанса пользователя.
// 
// Возвращаемое значение:
//  Строка - имя клиентского приложения.
//
Функция ИмяКлиентскогоПриложения() Экспорт
	
	Возврат ПолучитьТекущийСеансИнформационнойБазы().ИмяПриложения;
	
КонецФункции

// Возвращает Истина, если клиентское приложение - это Толстый клиент.
// 
// Возвращаемое значение:
//  Булево - Истина, если это толстый клиент.
//
Функция ЭтоТолстыйКлиент() Экспорт 
	
	Возврат ИмяКлиентскогоПриложения() = "1CV8";
	
КонецФункции

#КонецОбласти

// Процедура сворачивает таблицу значений по всем колонкам.
//
// Параметры:
//  Таблица				 - ТаблицаЗначений - сворачиваемая таблица.
//  СуммируемыеКолонки	 - Строка - перечень суммируемых колонок таблицы, например "Сумма, Количество".
//
Процедура СвернутьТаблицуЗначений(Таблица, СуммируемыеКолонки = "", СтрокаИзмерений = Неопределено)  экспорт
	
	КолонкиСуммы = СтрРазделить(СтрЗаменить(СуммируемыеКолонки," ",""), ",", Ложь);
	
	Если ТипЗнч(СтрокаИзмерений) <> Тип("Строка") Тогда
		ИзмеренияСтрокой = "";
		Для Каждого Колонка Из Таблица.Колонки Цикл
			Если КолонкиСуммы.Найти(Колонка.Имя) = Неопределено Тогда
				ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(ИзмеренияСтрокой, Колонка.Имя);
			КонецЕсли;
		КонецЦикла;
	Иначе
		КолонкиИзмерений = СтрРазделить(СтрЗаменить(СтрокаИзмерений," ",""), ",", Ложь);
		Для Каждого КолонкаСуммы Из КолонкиСуммы Цикл
			Инд = КолонкиИзмерений.Найти(КолонкаСуммы);
			Если Инд <> Неопределено Тогда
				КолонкиИзмерений.Удалить(Инд);
			КонецЕсли;
		КонецЦикла;
		ИзмеренияСтрокой = СтрСоединить(КолонкиИзмерений, ",");
	КонецЕсли;
	
	Таблица.Свернуть(ИзмеренияСтрокой, СуммируемыеКолонки);
	
КонецПроцедуры

// Помещает таблицу значений во временную таблицу запроса. 
// Не сохраняет текст запроса.
//
// Параметры:
//  ТаблицаЗначений - ТаблицаЗначений - помещаемая таблица значений
//  ИмяВременнойТаблицы - Строка - имя временной таблицы
//  Запрос          - Запрос - запрос, в котором будет помещена временная таблица
//  СписокПолей     - Строка - Список колонок для помещения во временную таблицу, По умолчанию "".
//
Процедура ПоместитьТаблицуЗначенийВоВременнуюТаблицу(ТаблицаЗначений, ИмяВременнойТаблицы, Запрос, СписокПолей = "") Экспорт
	
	Если Запрос.МенеджерВременныхТаблиц = Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Иначе
		УничтожитьВременнуюТаблицуЗапроса(Запрос, ИмяВременнойТаблицы);
	КонецЕсли;		
	
	Если ПустаяСтрока(СписокПолей) Тогда
		
		Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
			СписокПолей = СписокПолей + ?(ПустаяСтрока(СписокПолей),"",", ") + Колонка.Имя;
		КонецЦикла;
		ТекстГруппировка = "";
		Запрос.Текст = "ВЫБРАТЬ "+СписокПолей+" ПОМЕСТИТЬ "+ИмяВременнойТаблицы+" ИЗ &Таб КАК Таблица"+ТекстГруппировка;
		
	Иначе
		УникальныйСуффикс = "_УникальныйСуффикс";
		ТекстГруппировка = Символы.ПС + "СГРУППИРОВАТЬ ПО " + СписокПолей;
		
		Запрос.Текст = 	"ВЫБРАТЬ "+СписокПолей+" 
						|ПОМЕСТИТЬ " + ИмяВременнойТаблицы + УникальныйСуффикс + " 
						|ИЗ &Таб КАК Таблица
						|;
						|
						|ВЫБРАТЬ "+СписокПолей+" 
						|ПОМЕСТИТЬ " + ИмяВременнойТаблицы + " 
						|ИЗ " + ИмяВременнойТаблицы + УникальныйСуффикс + "
						|" + ТекстГруппировка + "
						|;
						|
						|УНИЧТОЖИТЬ "  + ИмяВременнойТаблицы + УникальныйСуффикс;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Таб",ТаблицаЗначений);
	Запрос.Выполнить();
	
КонецПроцедуры

// Удаляет временную таблицу запроса, если она в нём есть.
//
// Параметры:
//  Запрос          - Запрос - запрос, в котором будет удалена временная таблица
//  ИмяВременнойТаблицы - Строка - имя временной таблицы.
//
Процедура УничтожитьВременнуюТаблицуЗапроса(Запрос, ИмяВременнойТаблицы) Экспорт
	
	Если Запрос.МенеджерВременныхТаблиц.Таблицы.Найти(ИмяВременнойТаблицы) <> Неопределено Тогда
		// Удаление старой, если уже есть в менеджере таблиц
		Запрос.Текст = "УНИЧТОЖИТЬ " + ИмяВременнойТаблицы;
		Запрос.Выполнить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
