// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("ОтказПациентаОтГоспитализации","Отказ пациента от госпитализации");
	СтруктураМакетов.Вставить("ОтказВГоспитализации","Отказ в госпитализации");
	СтруктураМакетов.Вставить("ВыпискаИзМедкарты","Выписка форма №027/у"); 

	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура формирует печатную форму документа
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Функция Печать(СсылкаНаОбъект, ИмяМакета) Экспорт
	
Перем ТабДокумент;
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "ОтказВГоспитализации" Тогда
		ТабДокумент = ПечатьОтказВГоспитализации(СсылкаНаОбъект);
	ИначеЕсли ИмяМакета = "ВыпискаИзМедкарты" Тогда
		ТабДокумент = ПечатьВыпискаИзМедкарты(СсылкаНаОбъект);
	ИначеЕсли ИмяМакета = "ОтказПациентаОтГоспитализации" Тогда
		ТабДокумент = ПечатьОтказПациентаОтГоспитализации(СсылкаНаОбъект);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьОтказВГоспитализации(СсылкаНаОбъект)  Экспорт
	
	Если Ложь Тогда СсылкаНаОбъект = Документы.ОбращениеВСтационар.ПустаяСсылка() КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ОтказВГоспитализации");
	ОбластьДокумент = Макет.ПолучитьОбласть("ОтказВГоспитализации");
	Если СсылкаНаОбъект.ОтказВГоспитализации Тогда 
		
		//Данные организации
		СтруктураРеквизитовОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(СсылкаНаОбъект); 
		Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.НазваниеОрганизации) Тогда
			ОбластьДокумент.Параметры.НазваниеОрганизации = СтруктураРеквизитовОрганизации.НазваниеОрганизации;
		КонецЕсли;

		Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.Адрес) Тогда
			ОбластьДокумент.Параметры.АдресОрганизации = СтруктураРеквизитовОрганизации.Адрес;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.ИНН) И
			 ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.КПП)
		Тогда
			ОбластьДокумент.Параметры.ИННКПП = "ИНН: " + СтруктураРеквизитовОрганизации.ИНН + ", КПП: " + СтруктураРеквизитовОрганизации.КПП; 
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.Телефон) Тогда
			ОбластьДокумент.Параметры.Телефон = СтруктураРеквизитовОрганизации.Телефон;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.Телефон) Тогда
			ОбластьДокумент.Параметры.Телефон = СтруктураРеквизитовОрганизации.Телефон;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.ОГРН) Тогда
			ОбластьДокумент.Параметры.ОГРН = СтруктураРеквизитовОрганизации.ОГРН;
		КонецЕсли;
		
		ЗапросНомер = Новый Запрос("ВЫБРАТЬ
		                           |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОбращениеВСтационар.Ссылка) КАК КоличествоОбращений
		                           |ИЗ
		                           |	Документ.ОбращениеВСтационар КАК ОбращениеВСтационар
		                           |ГДЕ
		                           |	ОбращениеВСтационар.Ссылка <> &Ссылка
		                           |	И ОбращениеВСтационар.ОтказВГоспитализации");
		ЗапросНомер.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
		ВыборкаНомер = ЗапросНомер.Выполнить().Выбрать();
		ВыборкаНомер.Следующий();
		
		ОбластьДокумент.Параметры.Номер = ВыборкаНомер.КоличествоОбращений + 1;
		
		ЗапросКлиент = Новый Запрос;
		ЗапросКлиент.УстановитьПараметр("Клиент",СсылкаНаОбъект.Клиент);
		ЗапросКлиент.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Клиенты.Фамилия,
		|	Клиенты.Имя,
		|	Клиенты.Отчество,
		|	Клиенты.Пол,
		|	Клиенты.ДатаРождения,
		|	Клиенты.СНИЛС КАК СНИЛС,
		|	Клиенты.умцМестоРаботы КАК МестоРаботы1,
		|	Клиенты.умцМестоРаботыДополнительное КАК МестоРаботы2,
		|	Клиенты.умцМестоРаботы.НаименованиеПолное КАК умцМестоРаботы1НаименованиеПолное
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.Ссылка = &Клиент"
		;
		ВыборкаКлиент = ЗапросКлиент.Выполнить().Выбрать();
		ВыборкаКлиент.Следующий();  
		
		ОбластьДокумент.Параметры.Фамилия	 = СокрЛП(ВыборкаКлиент.Фамилия);
		ОбластьДокумент.Параметры.Имя 	  	 = СокрЛП(ВыборкаКлиент.Имя);
		ОбластьДокумент.Параметры.Отчество	 = СокрЛП(ВыборкаКлиент.Отчество); 	
		
		Если ЗначениеЗаполнено(ВыборкаКлиент.ДатаРождения) Тогда 
			ОбластьДокумент.Параметры.ДатаРождения = Формат(ВыборкаКлиент.ДатаРождения,"ДФ=dd.MM.yyyy");
			ОбластьДокумент.Параметры.Возраст = ОбщегоНазначенияКлиентСервер.ПолучитьВозрастСтрокой(ВыборкаКлиент.ДатаРождения);
		КонецЕсли;
		
		ОбластьДокумент.Параметры.Пол = ?(ВыборкаКлиент.Пол=Перечисления.ПолФизическихЛиц.НеУказан,"",ВыборкаКлиент.Пол);
		
		Если ЗначениеЗаполнено(ВыборкаКлиент.СНИЛС) Тогда
			ОбщегоНазначения.ЗаполнитьПараметрПосимвольно(ОбластьДокумент,"СНИЛС", ВыборкаКлиент.СНИЛС);
		КонецЕсли;

		Если ЗначениеЗаполнено(СсылкаНаОбъект.ДатаВремяПоступления) Тогда 
			ОбластьДокумент.Параметры.ДатаВремяПоступления = Формат(СсылкаНаОбъект.ДатаВремяПоступления,"ДФ='dd.MM.yyyy HH:mm'");
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СсылкаНаОбъект.ДатаВремяОтказа) Тогда 
			ОбластьДокумент.Параметры.ДатаВремяОтказа = Формат(СсылкаНаОбъект.ДатаВремяОтказа,"ДФ='dd.MM.yyyy HH:mm'");
		КонецЕсли;
		
		ОбластьДокумент.Параметры.ДиагнозНаправления    	   = СсылкаНаОбъект.ДиагнозНаправления;
		ОбластьДокумент.Параметры.ДиагнозПоступления		   = СсылкаНаОбъект.ДиагнозПоступления;
		ОбластьДокумент.Параметры.ПринятыеМеры  			   = СсылкаНаОбъект.ПринятыеМеры;
		ОбластьДокумент.Параметры.Рекомендации  			   = СсылкаНаОбъект.Рекомендации;
		ОбластьДокумент.Параметры.ПричинаОтказаВГоспитализации = СсылкаНаОбъект.ПричинаОтказаВГоспитализации;
		
		ОбластьДокумент.Параметры.Ответственный = ОбщегоНазначения.ФамилияИнициалыФизЛица(СсылкаНаОбъект.Ответственный.Сотрудник);		
		ТабДокумент.Вывести(ОбластьДокумент);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Отказ в госпитализации не распечатан, потому что документе не отмечен как отказ.'"));
	КонецЕсли;
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабДокумент;
		
КонецФункции

Функция ПечатьВыпискаИзМедкарты(СсылкаНаОбъект) Экспорт
	
	Если Ложь Тогда СсылкаНаОбъект = Документы.ОбращениеВСтационар.ПустаяСсылка() КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ВыпискаИзМедкарты");
	ОбластьЛист1 = Макет.ПолучитьОбласть("Лист1");
	
	//Данные организации
	СтруктураРеквизитовОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(СсылкаНаОбъект); 
	Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.НазваниеОрганизации) Тогда
		ОбластьЛист1.Параметры.ПредставлениеОрганизации = СтруктураРеквизитовОрганизации.НазваниеОрганизации;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.ОКПО) Тогда
		ОбщегоНазначения.ЗаполнитьПараметрПосимвольно(ОбластьЛист1,"ОКПО", СтруктураРеквизитовОрганизации.ОКПО);
	КонецЕсли;
	
	ЗапросКлиент = Новый Запрос;
	ЗапросКлиент.УстановитьПараметр("Клиент",СсылкаНаОбъект.Клиент);
	ЗапросКлиент.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Клиенты.Фамилия,
	|	Клиенты.Имя,
	|	Клиенты.Отчество,
	|	Клиенты.умцМестоРаботы КАК МестоРаботы1,
	|	Клиенты.умцМестоРаботыДополнительное КАК МестоРаботы2,
	|	Клиенты.умцМестоРаботы.НаименованиеПолное КАК умцМестоРаботы1НаименованиеПолное,
	|	Клиенты.ДатаРождения
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.Ссылка = &Клиент"
	;
	ВыборкаКлиент = ЗапросКлиент.Выполнить().Выбрать();
	ВыборкаКлиент.Следующий();  
	
	ОбластьЛист1.Параметры.ФИО_Пациента	 = СокрЛП(ВыборкаКлиент.Фамилия) + " " +СокрЛП(ВыборкаКлиент.Имя) + " " + СокрЛП(ВыборкаКлиент.Отчество); 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = &Тип
	|	И КонтактнаяИнформация.Вид В (&Вид)";
	
	МассивАдр = Новый Массив;
	МассивАдр.Добавить(Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	МассивАдр.Добавить(Справочники.ВидыКонтактнойИнформации.АдресФактический);	
	
	Запрос.УстановитьПараметр("Вид", МассивАдр);
	Запрос.УстановитьПараметр("Объект", СсылкаНаОбъект.Клиент);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьЛист1.Параметры.АдресПациента=ВыборкаДетальныеЗаписи.Представление;
	КонецЦикла;
	
	ОбластьЛист1.Параметры.МестоРаботы_РодЗанятий = ВыборкаКлиент.умцМестоРаботы1НаименованиеПолное;
	
	Если ЗначениеЗаполнено(ВыборкаКлиент.ДатаРождения) Тогда 
		ОбластьЛист1.Параметры.ДатаРождения = Формат(ВыборкаКлиент.ДатаРождения,"ДФ=dd.MM.yyyy");
	КонецЕсли;
		
	Если ЗначениеЗаполнено(СсылкаНаОбъект.ДатаВремяПоступления) Тогда 
		ОбластьЛист1.Параметры.ДатаПоступления = Формат(СсылкаНаОбъект.ДатаВремяПоступления,"ДФ=dd.MM.yyyy");
	КонецЕсли;	

	ТабДокумент.Вывести(ОбластьЛист1);

	ОбластьЛист2 = Макет.ПолучитьОбласть("Лист2");
	
	ОбластьЛист2.Параметры.Дата = Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	ОбластьЛист2.Параметры.Врач = СсылкаНаОбъект.ЛечащийВрач;
	ТабДокумент.Вывести(ОбластьЛист2);	
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ВычислитьПродолжительностьГоспитализации(Объект, ВидСтационара = Неопределено, ДатаВремяВыписки = Неопределено) Экспорт
	
	Если ВидСтационара = Неопределено Тогда 
		ВидСтационара = Перечисления.ВидыСтационара.Круглосуточный;	
	КонецЕсли;
	ПродолжительностьГоспитализации = 0;
	
	Если ДатаВремяВыписки = Неопределено Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КлиентыСтационараСрезПоследних.ДатаНачала КАК ДатаВремяВыписки
		               |ИЗ
		               |	РегистрСведений.КлиентыСтационара.СрезПоследних КАК КлиентыСтационараСрезПоследних
		               |ГДЕ
		               |	КлиентыСтационараСрезПоследних.ДокументПоступления.ДокументОбращения = &ДокументОбращения
		               |	И КлиентыСтационараСрезПоследних.Выписан";
		
		Запрос.УстановитьПараметр("ДокументОбращения", Объект);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			ДатаВремяВыписки = Выборка.ДатаВремяВыписки;
		КонецЕсли;
	КонецЕсли;
	
	ДатаПоступления = ?(ЗначениеЗаполнено(Объект.ДатаВремяГоспитализации), Объект.ДатаВремяГоспитализации, Объект.ДатаВремяПоступления);
	Если ЗначениеЗаполнено(ДатаПоступления)
		И ДатаВремяВыписки <> Неопределено 
		И ДатаПоступления <= ДатаВремяВыписки				
	Тогда
		ПродолжительностьГоспитализации = Окр((НачалоДня(ДатаВремяВыписки) - НачалоДня(ДатаПоступления))/86400);  		 								
		Если ВидСтационара <> Перечисления.ВидыСтационара.Круглосуточный
			Или ПродолжительностьГоспитализации = 0 
		Тогда 
			ПродолжительностьГоспитализации = ПродолжительностьГоспитализации + 1;	
		КонецЕсли;			
	КонецЕсли;	
	
	Возврат Новый Структура("ДатаВремяВыписки, ПродолжительностьГоспитализации", ДатаВремяВыписки, ПродолжительностьГоспитализации);
	
КонецФункции

Функция ПечатьОтказПациентаОтГоспитализации(СсылкаНаОбъект) Экспорт
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ОтказПациентаОтГоспитализации");
	ОбластьДокумент = Макет.ПолучитьОбласть("ОтказПациентаОтГоспитализации");
	
	Если СсылкаНаОбъект.ОтказВГоспитализации Тогда
		
		ОбластьДокумент.Параметры.НаименованиеЛПУПолное = СсылкаНаОбъект.Филиал.НазваниеОрганизации;
		ОбластьДокумент.Параметры.ФИОПациентаДатаРождения = Строка(СсылкаНаОбъект.Клиент) + ", " + Формат(СсылкаНаОбъект.Клиент.ДатаРождения,"ДФ=dd.MM.yyyy");
		ОбластьДокумент.Параметры.НаименованиеЛПУ = СсылкаНаОбъект.Филиал.НазваниеОрганизации;
		ОбластьДокумент.Параметры.ФИОПредставителя = СсылкаНаОбъект.ОтказЗаконныйПредставитель;
		ОбластьДокумент.Параметры.ДатаОтказа = Формат(СсылкаНаОбъект.ДатаВремяОтказа,"ДФ=dd.MM.yyyy");
		ОбластьДокумент.Параметры.ФИОВрача = СсылкаНаОбъект.СотрудникЗафиксировавшийОтказ;
		
	КонецЕсли;
	
	ТабДокумент.Вывести(ОбластьДокумент);
	
	Возврат ТабДокумент;
	
КонецФункции