#Область ОбработчикиСобытий

Процедура омг_ЗаполнитьДанныеПоМедицинскойКарте()
	Запрос = Новый Запрос;
	Запрос.Текст = ""; 
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Прием") Тогда
		// Заполнение шапки
		Филиал = ДанныеЗаполнения.Филиал;
		Клиент = ДанныеЗаполнения.Клиент;
		ЛечащийВрач = ДанныеЗаполнения.Врач;
		// Изменено Макеев (
		Если ДанныеЗаполнения.МедицинскаяКарта.ВидКарты.ТипКарты = Перечисления.ТипыМедицинскихКарт.Стационар
			Или ДанныеЗаполнения.МедицинскаяКарта.ВидКарты.ТипКарты = Перечисления.ТипыМедицинскихКарт.омг_СтационарРК Тогда
		// )
			МедицинскаяКарта = ДанныеЗаполнения.МедицинскаяКарта;
		КонецЕсли;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		
		Если ДанныеЗаполнения.Диагнозы.Количество() > 0 Тогда
			ДиагнозНаправления = ДанныеЗаполнения.Диагнозы[0].Диагноз;
		КонецЕсли; 
		
	// Добавлено Макеев (
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заявка") Тогда
		// Заполнение шапки
		Филиал = ДанныеЗаполнения.Филиал;
		Клиент = ДанныеЗаполнения.Клиент;
		ЛечащийВрач = ДанныеЗаполнения.Сотрудник;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Прием.МедицинскаяКарта КАК МедицинскаяКарта,
		               |	Прием.Ссылка КАК Ссылка,
		               |	Прием.Дата КАК Дата,
		               |	ПриемДиагнозы.Диагноз КАК Диагноз,
		               |	ПриемДиагнозы.НомерСтроки КАК НомерСтроки,
		               |	Прием.Врач.Подразделение КАК Подразделение
		               |ИЗ
		               |	Документ.Прием КАК Прием
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Прием.Диагнозы КАК ПриемДиагнозы
		               |		ПО (ПриемДиагнозы.Ссылка = Прием.Ссылка)
		               |ГДЕ
		               |	Прием.ДокументОснование = &ДокументОснование
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата УБЫВ,
		               |	НомерСтроки УБЫВ";
		Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ВыборкаПриема = РезультатЗапроса.Выбрать();
			ВыборкаПриема.Следующий();
			МедицинскаяКарта = ВыборкаПриема.МедицинскаяКарта;
			ДиагнозНаправления = ВыборкаПриема.Диагноз;
			ДокументОснование = ВыборкаПриема.Ссылка; 
			Подразделение = ВыборкаПриема.Подразделение;
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
		// Заполнение шапки
		Филиал = ДанныеЗаполнения.Филиал;
		Клиент = ДанныеЗаполнения.Клиент;
		ЛечащийВрач = ДанныеЗаполнения.Сотрудник;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Прием.МедицинскаяКарта КАК МедицинскаяКарта,
		               |	Прием.Ссылка КАК Ссылка,
		               |	Прием.Дата КАК Дата,
		               |	ПриемДиагнозы.Диагноз КАК Диагноз,
		               |	ПриемДиагнозы.НомерСтроки КАК НомерСтроки,
		               |	Прием.Врач.Подразделение КАК Подразделение
		               |ИЗ
		               |	Документ.Прием КАК Прием
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Прием.Диагнозы КАК ПриемДиагнозы
		               |		ПО (ПриемДиагнозы.Ссылка = Прием.Ссылка)
		               |ГДЕ
		               |	Прием.ДокументОснование = &ДокументОснование
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата УБЫВ,
		               |	НомерСтроки УБЫВ";
		Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения.ДокументОснование);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			ВыборкаПриема = РезультатЗапроса.Выбрать();
			ВыборкаПриема.Следующий();
			МедицинскаяКарта = ВыборкаПриема.МедицинскаяКарта;
			ДиагнозНаправления = ВыборкаПриема.Диагноз;
			ДокументОснование = ВыборкаПриема.Ссылка;
			Подразделение = ВыборкаПриема.Подразделение;
		КонецЕсли;
	// )
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.БронированиеКойкоМеста") Тогда	
		
		Клиент = ДанныеЗаполнения.Клиент;
		Подразделение = ДанныеЗаполнения.Палата.Подразделение;
		ДатаВремяПоступления = ДанныеЗаполнения.ДатаНачала;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда 
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.ДокументОснование,,"Дата, Номер, ПометкаУдаления, Проведен, Ссылка");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ЗначениеЗаполнено(ОбъектКопирования.ПричинаОтказаВГоспитализации) 
		И ТипЗнч(ОбъектКопирования.ПричинаОтказаВГоспитализации) = Тип("СправочникСсылка.удалитьПричиныОтказаВГоспитализации")
		И ЗначениеЗаполнено(ОбъектКопирования.ПричинаОтказаВГоспитализации.УИДЕГИСЗ)
	Тогда
		ПричинаОтказаВГоспитализации = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(ОбъектКопирования.ПричинаОтказаВГоспитализации.УИДЕГИСЗ, Перечисления.ВидыКлассификаторовМинЗдрава.ПричиныОтказовВГоспитализации)
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверкаУникальностиОбращенияПоМедкарте(Отказ);
	
	Если Не Отказ Тогда
		// Очистка полей госпитализации при отказе в госпитализации и причины отказа при госпитализации.
		Если ОтказВГоспитализации Тогда
			ЛечащийВрач = Неопределено;
			ДатаВремяГоспитализации = Неопределено;
			Подразделение = Неопределено;
		Иначе
			ПричинаОтказаВГоспитализации = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ПометкаУдаления Тогда
		Если ОтказВГоспитализации Тогда
			ПроверяемыеРеквизиты.Добавить("ПричинаОтказаВГоспитализации");
			ПроверяемыеРеквизиты.Добавить("ДатаВремяОтказа");
			ПроверяемыеРеквизиты.Добавить("Клиент");
			
		Иначе
			ПроверяемыеРеквизиты.Добавить("МедицинскаяКарта");
			
			Если ЗначениеЗаполнено(ДатаВремяГоспитализации) Тогда
				ПроверяемыеРеквизиты.Добавить("Подразделение");
			ИначеЕсли ЗначениеЗаполнено(Подразделение) Тогда
				ПроверяемыеРеквизиты.Добавить("ДатаВремяГоспитализации");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаУникальностиОбращенияПоМедкарте(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка, что по этой медкарте еще нет документа обращения в стационар
	Если ЗначениеЗаполнено(МедицинскаяКарта) Тогда
		Обращение = Стационар.ОбращениеПоМедкарте(МедицинскаяКарта, ?(Ссылка.Пустая(), Неопределено, Ссылка));
		Если ЗначениеЗаполнено(Обращение)
			И Обращение <> Ссылка
		Тогда
			Отказ = Истина;
			СообщениеПользователю = СтрШаблон("По данной медкарте уже оформлено обращение: %1", Строка(Обращение));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти