#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);
	Если Не Объект.Ссылка.Пустая() Тогда 
		
		РезультатHTML = "";
		СтрокаПеренос = РаботаСШаблонамиHTMLКлиентСервер.ПолучитьТекстHTMLРазрывСтраницы(Ложь);
		
		Для Каждого СтрокаИсследования Из Объект.Исследования Цикл
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(РезультатHTML, СтрокаИсследования.РезультатИсследования, СтрокаПеренос, Истина);
		КонецЦикла;
		
		Если Не ЗначениеЗаполнено(РезультатHTML) Тогда
			РезультатHTML = Объект.Ссылка.Результат.Получить();
		КонецЕсли;
	КонецЕсли;
	
	СозданныеПриемы.Параметры.УстановитьЗначениеПараметра("ЗаказСоздан", Не Объект.Ссылка.Пустая());
	СозданныеПриемы.Параметры.УстановитьЗначениеПараметра("Заказ", Объект.Ссылка);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьЗаказ(Команда)
	ОтправитьЗаказНаСервере();
КонецПроцедуры

#Область ОбработчикиДинамическиСоздаваемыхКоманд

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИсследованияНоменклатураПриИзменении(Элемент)
	СТД = Элементы.Исследования.ТекущиеДанные;
	СТД.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗаказовЛаборатории.Создан");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтправитьЗаказНаСервере()
	
	Если Объект.Статус = Перечисления.СтатусыОтправкиЗаказовНаИсследовние.Создан Тогда
		Результат = ВзаимодействиеСЛИС.ОтправитьЗаказНаСервере(Объект.Ссылка);
		Если Лев(НРег(Результат),5) = "<soap" Тогда
			Для каждого Стр Из Объект.Исследования Цикл
				Стр.Состояние = Перечисления.СостоянияЗаказовЛаборатории.Отправлен;
			КонецЦикла; 		
			Объект.Статус = Перечисления.СтатусыОтправкиЗаказовНаИсследовние.Отправлен;
			Записать();
		КонецЕсли;
	Иначе
		Сообщить("Данный заказ уже отправлен!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры

#КонецОбласти