
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	Цвет = СправочникОбъект.Цвет.Получить();
	
	РаботаСФормамиСервер.УстановитьОтборСписка("СостояниеЗуба",   Объект.Ссылка, СвязанныеДиагнозы);
	РаботаСФормамиСервер.УстановитьОтборСписка("СостояниеЗуба",   Объект.Ссылка, СвязанныеУслуги);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(Цвет);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СвязанныеДиагнозыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = НЕ РаботаСДиалогамиКлиент.ЗаписатьНовыйОбъектВФорме(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	
	Объект.ЦветHex = ОбщегоНазначенияКлиентСерверПереопределяемый.ЦветВHex(Цвет);
	
КонецПроцедуры

#КонецОбласти


