#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Запись.Оборудование = Неопределено Тогда
		Запись.Оборудование = ПредопределенноеЗначение("Справочник.МедицинскоеОборудование.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОборудованиеОчистка(Элемент, СтандартнаяОбработка)
	Запись.Оборудование = ПредопределенноеЗначение("Справочник.МедицинскоеОборудование.ПустаяСсылка");
КонецПроцедуры

#КонецОбласти