
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ключ") И Не Параметры.Ключ.Пустой() Тогда
		Услуга = Параметры.Ключ.Услуга;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	омг_СвязьУслугИПоказателейИсследований.Услуга КАК Услуга,
		               |	омг_СвязьУслугИПоказателейИсследований.Показатель КАК Показатель
		               |ИЗ
		               |	РегистрСведений.омг_СвязьУслугИПоказателейИсследований КАК омг_СвязьУслугИПоказателейИсследований
		               |ГДЕ
		               |	омг_СвязьУслугИПоказателейИсследований.Услуга = &Услуга";
		Запрос.УстановитьПараметр("Услуга", Услуга);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Показатели.Добавить().Показатель = Выборка.Показатель;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИЗакрытьНаСервере()
	
	НаборЗаписей = РегистрыСведений.омг_СвязьУслугИПоказателейИсследований.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Услуга.Установить(Услуга);
	
	ТЗ_Показатели = Показатели.Выгрузить();
	ТЗ_Показатели.Свернуть("Показатель");
	
	Для Каждого СтрокаПоказателей Из ТЗ_Показатели Цикл
		Если СтрокаПоказателей.Показатель.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		Запись = НаборЗаписей.Добавить();
		Запись.Услуга = Услуга;
		Запись.Показатель = СтрокаПоказателей.Показатель;
	КонецЦикла;
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьИЗакрытьНаСервере();
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьФорму(Команда)
	ЗаписатьИЗакрытьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

