
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ФормаЭлементаНоменклатуры = ПараметрыВыполненияКоманды.Источник;
	Номенклатура = ФормаЭлементаНоменклатуры.Объект.Ссылка;
	
	ИспользуетсяDCMTK = DICOMОбщий.ИспользуетсяСтараяВерсия();
	
	Если ИспользуетсяDCMTK Тогда
		ОткрытьФорму("Справочник.Номенклатура.Форма.НастройкаDicomПолей", Новый Структура("Ключ", Номенклатура));
	Иначе
		Если ЗначениеЗаполнено(ФормаЭлементаНоменклатуры.Объект.ИнструментальноеИсследование) Тогда
			
			Отбор = Новый Структура("Исследование", ФормаЭлементаНоменклатуры.Объект.ИнструментальноеИсследование);
			ОткрытьФорму("РегистрСведений.DICOMОборудованиеПоИнструментИсследованиям.ФормаСписка",Новый Структура("Отбор", Отбор),
							ФормаЭлементаНоменклатуры, Номенклатура,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			ПоказатьПредупреждение(, "Инструментальное исследование не указано для номенклатуры");	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
