
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СегментОбъект = РеквизитФормыВЗначение("Объект");
	ЦветПоУмолчанию = СегментОбъект.Цвет.Получить();
	Если ТипЗнч(ЦветПоУмолчанию) <> Тип("Цвет") И ЗначениеЗаполнено(Объект.ЦветHex) Тогда
		ЦветПоУмолчанию = ОбщегоНазначенияКлиентСерверПереопределяемый.ЦветИзHex(Объект.ЦветHex);
	КонецЕсли;
	Цвет = ЦветПоУмолчанию;
	
	HTML = ПараметрыСеанса.стомКешированныеДанныеЗК.ПриложениеHTML;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(Цвет);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЦветПриИзменении(Элемент)
	
	Объект.ЦветHex = ОбщегоНазначенияКлиентСерверПереопределяемый.ЦветВHex(Цвет);
	ИнициализироватьСегментВПриложении();
	
КонецПроцедуры

&НаКлиенте
Процедура ГрафическиеПараметрыПриИзменении(Элемент)
	
	ИнициализироватьСегментВПриложении();
	
КонецПроцедуры

&НаКлиенте
Процедура HTMLДокументСформирован(Элемент)
	
	ИнициализироватьСегментВПриложении();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИнициализироватьСегментВПриложении()
	
	стомКомпонентыКлиент.ЗагрузитьЗубнуюКартуВПриложении(Элементы.HTML, ПолучитьСтруктуруИнициализации());

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруИнициализации()
	
	СтруктураJSON = Новый Структура("width, height, elements, selectWithCTRL", 500, 500, Новый Массив, Ложь);
	
	// Зуб
	СтруктураЗубJSON = Новый Структура("operation, id, width, height, elements", 
			"+", Строка(Новый УникальныйИдентификатор), 500, 500, Новый Массив);
	СтруктураJSON.elements.Добавить(СтруктураЗубJSON);
	
	// Сегмент
	ПараметрыРасположения = Новый Структура("x, y, sX, sY, r", Объект.TranslateX, Объект.TranslateY, Объект.ScaleX, Объект.ScaleY, Объект.Rotation);
	СтруктураФигура = Новый Структура("silverlight, fill", Объект.Фигура, "#" + НРег(Прав(Объект.ЦветHex, 6)));
	СтруктураСегментJSON = Новый Структура("operation, id, transform, shape, isDecoration", 
		"+", Строка(Новый УникальныйИдентификатор), ПараметрыРасположения, СтруктураФигура, Объект.Декоративный);
	СтруктураЗубJSON.elements.Добавить(СтруктураСегментJSON);
			
	Возврат СтруктураJSON;
	
КонецФункции

#КонецОбласти















