#Область ПрограммныйИнтерфейс

Процедура ДополнитьДаннымиПриема(ДанныеПриемаСтрокой, Прием) Экспорт
	
	#Область Стоматология
	Если Прием.Ссылка.Метаданные().Реквизиты.Найти("СтоматологическийПрием") = Неопределено Или Прием.СтоматологическийПрием Тогда
		ДанныеПриемаСтрокой = ДанныеПриемаСтрокой
							+ ЭЦП_УМЦ_Сервер.ЗначениеСтрокой(Прием.ЗубнаяКарта, "ЗубнаяКарта")
							+ ЭЦП_УМЦ_Сервер.ЗначениеСтрокой(Прием.ВариантЗубнойКарты, "ВариантЗубнойКарты");
							
		Для Каждого СтрокаСостояние Из Прием.стомУстановленныеСостояния Цикл 
			ДанныеПриемаСтрокой = ДанныеПриемаСтрокой + 
				ЭЦП_УМЦ_Сервер.ЗначениеСтрокой(СтрокаСостояние.ЗубВКарте, "ЗубВКарте") +
				ЭЦП_УМЦ_Сервер.ЗначениеСтрокой(СтрокаСостояние.СегментВЗубе, "СегментВЗубе") +
				ЭЦП_УМЦ_Сервер.ЗначениеСтрокой(СтрокаСостояние.СостояниеСегмента, "СостояниеСегмента") +
				ЭЦП_УМЦ_Сервер.ЗначениеСтрокой(СтрокаСостояние.ВидРедактирования, "ВидРедактирования");				
		КонецЦикла;;
		Для Каждого СтрокаВариант Из Прием.стомУстановленныеВарианты Цикл 
			ДанныеПриемаСтрокой = ДанныеПриемаСтрокой + 
				ЭЦП_УМЦ_Сервер.ЗначениеСтрокой(СтрокаВариант.ЗубВКарте, "ЗубВКарте") +
				ЭЦП_УМЦ_Сервер.ЗначениеСтрокой(СтрокаВариант.ВариантЗуба, "ВариантЗуба") +
				ЭЦП_УМЦ_Сервер.ЗначениеСтрокой(СтрокаВариант.Область, "Область") +
				ЭЦП_УМЦ_Сервер.ЗначениеСтрокой(СтрокаВариант.ВидРедактирования, "ВидРедактирования");				
		КонецЦикла;
		Для Каждого СтрокаПараметр Из Прием.стомПараметрыЗубнойФормулы Цикл 
			ДанныеПриемаСтрокой = ДанныеПриемаСтрокой + 
				ЭЦП_УМЦ_Сервер.ЗначениеСтрокой(СтрокаПараметр.ЗубВКарте, "ЗубВКарте") +
				ЭЦП_УМЦ_Сервер.ЗначениеСтрокой(СтрокаПараметр.СегментВЗубе, "СегментВЗубе") +
				ЭЦП_УМЦ_Сервер.ЗначениеСтрокой(СтрокаПараметр.Параметр, "Параметр") +
				ЭЦП_УМЦ_Сервер.ЗначениеСтрокой(СтрокаПараметр.Значение, "Значение");				
		КонецЦикла;
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры

Функция КлючевыеПоляПодписанногоДокумента(Ссылка, ИмяРеквизитаКлиента) Экспорт
	
	КлючевыеРеквизиты = Неопределено;
	
	ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(Ссылка);
	
	Если ИмяТипаДокумента = "Документ.ПрохождениеМедосмотра" Тогда
		КлючевыеРеквизиты = Новый Структура("Реквизиты, ТабличныеЧасти", Новый Массив, Новый Массив);
		
		МетаданныеДокумента = Метаданные.Документы.ПрохождениеМедосмотра;
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Филиал.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ПредседательМедКомиссии.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ДатаЗавершения.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ДиспансернаяГруппа.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ТипМедосмотра.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Рекомендации.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Жалобы.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Исследования.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Заключение.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Осмотр.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.МедицинскаяКарта.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ВидПрохожденияМО.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Номенклатура.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Тестовый.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Профессия.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.МестоРаботы.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ВидПолиса.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ВидМО.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.СведенияОПрививках.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ИнфекционныйАнамнез.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ДополнениеКЗаключению.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ИННРаботодателя.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ПрофильРаботы.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.НомерЛичнойМедКнижки.Имя);
		КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.СтандартныеРеквизиты.Дата.Имя);
		
		ТабличныеЧасти = Новый Массив;
		ТабличныеЧасти.Добавить(МетаданныеДокумента.ТабличныеЧасти.ЗаключенияМедосмотровПоФакторам);
		ТабличныеЧасти.Добавить(МетаданныеДокумента.ТабличныеЧасти.ДействияМедосмотра);
		ТабличныеЧасти.Добавить(МетаданныеДокумента.ТабличныеЧасти.КритичныеПротивопоказания);
		ТабличныеЧасти.Добавить(МетаданныеДокумента.ТабличныеЧасти.ВредныеФакторыПротивопоказаний);
		ТабличныеЧасти.Добавить(МетаданныеДокумента.ТабличныеЧасти.ФакторыИУсловияРаботы);
		ТабличныеЧасти.Добавить(МетаданныеДокумента.ТабличныеЧасти.ИнфекционныеЗаболевания);
		ТабличныеЧасти.Добавить(МетаданныеДокумента.ТабличныеЧасти.ПрофилактическиеПрививки);
		
		Для Каждого МетаданныеТабличнойЧасти Из ТабличныеЧасти Цикл
			СтруктураТЧ = Новый Структура("Имя, Реквизиты", МетаданныеТабличнойЧасти.Имя, Новый Массив);
			Для Каждого РеквизитТЧ Из МетаданныеТабличнойЧасти.Реквизиты Цикл
				СтруктураТЧ.Реквизиты.Добавить(РеквизитТЧ.Имя);
			КонецЦикла;
			КлючевыеРеквизиты.ТабличныеЧасти.Добавить(СтруктураТЧ);
		КонецЦикла;
		
		ИмяРеквизитаКлиента = МетаданныеДокумента.Реквизиты.Клиент.Имя;
	КонецЕсли;
	
	Возврат КлючевыеРеквизиты;
	
КонецФункции

#КонецОбласти
