#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьВозвратПоОплатеПлатежнойКартой(ДокументОбъект) Экспорт
	
	СписокЗаполняемыхРеквизитов =	"Клиент,
									|СуммаДокумента,
									|Основание,
									|СпособРасчетаЧекаККМ,
									|СсылочныйНомер, 
									|омг_ИспользуемыйТерминал,
	                                |омг_НомерТранзакцииТерминала,
									|ЭквайринговыйТерминал,
									|омг_ВидОплаты,
									|НомерКарты";
									
	Если ДокументОбъект.Метаданные().Реквизиты.Найти("Сделка") <> Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СписокЗаполняемыхРеквизитов,"Сделка",",");
	КонецЕсли;								
									
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ДокументОбъект.ДокументОснование, СписокЗаполняемыхРеквизитов);
	ДокументОбъект.Выдать = ДокументОбъект.ДокументОснование.ПринятоОт;
	ДокументОбъект.КредитныеДанные.Загрузить(ДокументОбъект.ДокументОснование.КредитныеДанные.Выгрузить());
	
	ЭТОснования = ОбщегоНазначенияКлиентСервер.СвойствоОбъекта(ДокументОбъект.ДокументОснование, "ЭквайринговыйТерминал", Неопределено);
	Если ЗначениеЗаполнено(ЭТОснования)
		И ИнтеграцияСБП.ЭтоЭквайринговыйТерминалСБП(ЭТОснования)
	Тогда
		ДокументОбъект.ЭквайринговыйТерминал = ЭТОснования; 		
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти  

Функция СобратьДанныеЧеков(ДокументСсылка, НомерСекции, ВерсияФормата, СообщениеОбОшибке) Экспорт
	
	ТипРасчета = 2;		

	ПараметрыПечатиЧека = ПодготовитьПараметрыПечатиЧека(ДокументСсылка);
	
	РеквизитыПечатиЧека = ПараметрыПечатиЧека.РеквизитыПечатиЧека;
	Если РеквизитыПечатиЧека.Количество() = 0 Тогда
		Возврат Новый Структура;
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РеквизитыПечатиЧека[0]);
			
	Реквизиты.Вставить("ТипРасчета",              ТипРасчета);
	Реквизиты.Вставить("НаименованиеВСтрокеЧека", НаименованиеВСтрокеЧека(Реквизиты));
	Реквизиты.Вставить("НомерСекции",             НомерСекции);
	Реквизиты.Вставить("ТипОплаты",               Перечисления.ТипыОплатыККТ.Электронно);
	Реквизиты.Вставить("ДокументОснование",        ДокументСсылка);
	
	Возврат омг_WebKassa.ПараметрыОперацииФискализацииЧека(Реквизиты, ПараметрыПечатиЧека, ВерсияФормата, СообщениеОбОшибке);
	
КонецФункции     

Функция ПодготовитьПараметрыПечатиЧека(ДокументСсылка)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВозвратПоПлатежнойКарте", ДокументСсылка);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", омг_WebKassa.ПолучитьВалютуРегламентированногоУчета());
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаРеквизитыПечатиЧека(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ПараметрыПечатиЧека = Новый Структура;
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПечатиЧека.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПечатиЧека;
КонецФункции

Функция ТекстЗапросаРеквизитыПечатиЧека(НомераТаблиц)
	
	НомераТаблиц.Вставить("РеквизитыПечатиЧека", НомераТаблиц.Количество());
	НомераТаблиц.Вставить("РасшифровкаПлатежа",  НомераТаблиц.Количество());
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ВозвратПоПлатежнойКарте.Ссылка КАК Ссылка,
	|	ВозвратПоПлатежнойКарте.Дата КАК Дата,
	|	ВозвратПоПлатежнойКарте.Номер КАК Номер,
	|	ВозвратПоПлатежнойКарте.Филиал.Организация КАК Организация,
	|	ВозвратПоПлатежнойКарте.ДокументОснование КАК Основание,
	|	"""" КАК ВидОперации,
	|	ВозвратПоПлатежнойКарте.Клиент КАК Контрагент,
	|	ВозвратПоПлатежнойКарте.Выдать КАК Возвращено,
	|	ВозвратПоПлатежнойКарте.СуммаДокумента КАК СуммаДокумента,
	|	"""" КАК ВалютаДокумента,
	|	ВозвратПоПлатежнойКарте.ДокументОснование КАК ДокументРасшифровкиПозиций,
	|	ВозвратПоПлатежнойКарте.ВыдатьИНН КАК ПолучательИИН
	|ИЗ
	|	Документ.ВозвратПоПлатежнойКарте КАК ВозвратПоПлатежнойКарте
	|ГДЕ
	|	ВозвратПоПлатежнойКарте.Ссылка = &ВозвратПоПлатежнойКарте
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	"""" КАК Ссылка,
	|	"""" КАК ДоговорКонтрагента,
	|	"""" КАК СтавкаНДС,
	|	"""" КАК СуммаНДС,
	|	ВозвратПоПлатежнойКарте.СуммаДокумента КАК СуммаПлатежа,
	|	ВозвратПоПлатежнойКарте.СуммаДокумента КАК СуммаВзаиморасчетов
	|ИЗ
	|	Документ.ВозвратПоПлатежнойКарте КАК ВозвратПоПлатежнойКарте
	|ГДЕ
	|	ВозвратПоПлатежнойКарте.Ссылка = &ВозвратПоПлатежнойКарте";
	
	Возврат ТекстЗапроса + омг_WebKassa.ТекстРазделителяЗапросовПакета();
КонецФункции     

Функция НаименованиеВСтрокеЧека(СтруктураШапки)
	
	Если ЗначениеЗаполнено(СтруктураШапки.Возвращено) Тогда
		ШаблонНаименования = НСтр("ru = 'Возврат от: %1%2Основание: %3'");
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименования, СтруктураШапки.Возвращено, " ", СтруктураШапки.Основание);
	Иначе
		ШаблонНаименования = НСтр("ru = 'Основание: %1'");
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименования, СтруктураШапки.Основание);
	КонецЕсли;
	
КонецФункции