#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
   СоздаватьДвижения = Ложь; 
	
	Если омг_ВидОплаты = Перечисления.омг_ВидыОплаты.Предоплата Тогда
		
		Запись = РегистрыСведений.омг_Предоплаты.СоздатьМенеджерЗаписи();
		Запись.Заявка = ДокументОснование.ДокументОснование;
		Запись.РегистраторЗаписи = Ссылка;
		Запись.Прочитать();
		
		Если Не Запись.Выбран() Тогда 
			
			СоздаватьДвижения = Ложь;  
			
		ИначеЕсли Запись.Статус = Перечисления.омг_СтатусыПредоплаты.ПроизведенВозврат или 
			Запись.Статус = Перечисления.омг_СтатусыПредоплаты.ВозвратВОбработке Тогда
			СоздаватьДвижения = Истина; 
		Иначе	
			СоздаватьДвижения = Ложь;
		КонецЕсли;       
		
		ВидОплаты =  Перечисления.ВидыОплаты.Бронь;
		
	Иначе	         
		
		СоздаватьДвижения = Истина; 
		ВидОплаты =  Перечисления.ВидыОплаты.Безналичные;
		
	КонецЕсли;
	
	Если СоздаватьДвижения Тогда
		
		РегистрыНакопления.ДвиженияДенежныхСредств.СформироватьДвиженияПоШапкеДокумента(Новый Структура("Дата, Касса, СуммаДокумента,СтатьяДвиженияДенежныхСредств",Дата,ЭквайринговыйТерминал,СуммаДокумента, СтатьяДвиженияДенежныхСредств),Движения.ДвиженияДенежныхСредств, Ложь, Отказ);
		
		Движение = Движения.ВзаиморасчетыСКлиентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Сумма	= -СуммаДокумента;
		
		Если Метаданные.Документы.Найти("КомплексныйРасчетКлиента") <> Неопределено
			И ЗначениеЗаполнено(ЭтотОбъект.Сделка)
			И ТипЗнч(ЭтотОбъект.Сделка) = Тип("ДокументСсылка.КомплексныйРасчетКлиента")
			И ОбщегоНазначения.ОбщийМодуль("КомплексныеРасчетыКлиентов").РасчетСОбособленнымУчетомВзаиморасчетов(ЭтотОбъект.Сделка)
			Тогда
			Движение.Сделка = ЭтотОбъект.Сделка;
		КонецЕсли;
		
		РаботаСДокументамиСервер.ДобавитьДвижениеПоРегиструОплаты(Движения.Оплаты, Дата, Клиент, ВидОплаты, -СуммаДокумента);
		
		Если Коррекция Тогда	
			РаботаСДокументамиСервер.СторнироватьДвиженияПоРегистрамУПР(ЭтотОбъект, Отказ);	
		КонецЕсли;
		
		Если омг_ВидОплаты = Перечисления.омг_ВидыОплаты.Предоплата Тогда
			Если ЗначениеЗаполнено(ЭтотОбъект.ДокументОснование) и ТипЗнч(ЭтотОбъект.ДокументОснование) = Тип("ДокументСсылка.ОплатаПлатежнойКартой") Тогда
				
				НаборЗаписей = ЭтотОбъект.Движения.омг_ОстаткиПредоплаты;
				НаборЗаписей.Прочитать();
				НаборЗаписей.Очистить();
				
				СуммаПредоплаты = омг_Предоплата.ВернутьСуммуПредоплатыПоДокументу(ЭтотОбъект.ДокументОснование);
				Если СуммаПредоплаты > 0 Тогда
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.Клиент = Клиент;
					НоваяЗапись.Сумма = 0 - СуммаПредоплаты;
					НоваяЗапись.Регистратор = Ссылка; 
					НоваяЗапись.ДокументПоступления = ЭтотОбъект.ДокументОснование;
					НоваяЗапись.Период = Дата;   
					
					//Если ИспользоватьУчетаПоЗаявкам Тогда
					//	НоваяЗапись.Заявка = ЭтотОбъект.ДокументОснование.ДокументОснование; 	
					//Иначе
						ДатаПереходаНаУчетПоЗаявкам = омг_Предоплата.ВернутьДатуПереходаУчетаПоЗаявкам(омг_ДополнительныеАлгоритмы.омг_ВернутьОрганизациюПоФилиалу(ЭтотОбъект.Филиал));
						
						Если ЗначениеЗаполнено(ДатаПереходаНаУчетПоЗаявкам) и Дата >= ДатаПереходаНаУчетПоЗаявкам Тогда
							НоваяЗапись.Заявка = ЭтотОбъект.ДокументОснование.ДокументОснование;
						КонецЕсли;
						
					//КонецЕсли;
					НаборЗаписей.Записать(Истина); 
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	РаботаСДокументамиСервер.ДокументОплатыПроверитьСуммыКредитаККМПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи);	
	РаботаСДокументамиСервер.ПроверитьДанныеКоррекции(ЭтотОбъект, Отказ, РежимЗаписи);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	РаботаСДокументамиСервер.ОчиститьРеквизитыККМДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Метаданные.Документы.Найти("КомплексныйРасчетКлиента") <> Неопределено
		И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КомплексныйРасчетКлиента")
	Тогда
		Клиент = ДанныеЗаполнения.Клиент;
		СуммаДокумента = Макс(0, -РаботаСКлиентамиПереопределяемый.ПолучитьВзаиморасчетыСКлиентом(Клиент, ТекущаяДата(), ДанныеЗаполнения));
		Сделка = ДанныеЗаполнения;
		Филиал = Сделка.Филиал;
		
		НастройкаПечатиЧеков = МенеджерОборудованияВызовСервераПереопределяемый.ПолучитьНастройкуПечатиЧековФилиала(Филиал, Истина);	
		РаботаСДокументамиСервер.ДокументОплатыЗаполнитьРасчетыПоДолгуПоКомплексномуРасчетуСервер(Сделка, НастройкаПечатиЧеков, КредитныеДанные, СуммаДокумента);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ДокументОснование") 
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) 
		И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ОказаниеУслуг") 
	Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		РаботаСДокументамиСервер.ОбработкаЗаполнения(ЭтотОбъект, ДокументОснование);
		
		///////////////////////////////////////////////////
		// ОМГ   
		СтрПоиска = Новый Структура;
		СтрПоиска.Вставить("ВидОплаты",Перечисления.ВидыОплаты.Безналичные);
		СтрокиБезнала = ДокументОснование.Оплата.НайтиСтроки(СтрПоиска);
		Если СтрокиБезнала.Количество() > 0 Тогда			
		ЭтотОбъект.ЭквайринговыйТерминал = СтрокиБезнала[0].ЭквайринговыйТерминал; 
		КонецЕсли;
		// ОМГ  
		///////////////////////////////////////////////////
		
		НастройкаПечатиЧеков = МенеджерОборудованияВызовСервераПереопределяемый.ПолучитьНастройкуПечатиЧековФилиала(Филиал, Истина);	
		РаботаСДокументамиСервер.ДокументОплатыЗаполнитьРасчетыПоДолгуПоОказаниюУслуг(ДокументОснование, НастройкаПечатиЧеков, КредитныеДанные, СуммаДокумента, СпособРасчетаЧекаККМ);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОплатаПлатежнойКартой")Тогда
		ЭтотОбъект.ДокументОснование = ДанныеЗаполнения;
		Документы.ВозвратПоПлатежнойКарте.ЗаполнитьВозвратПоОплатеПлатежнойКартой(ЭтотОбъект);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("Коррекция")
		И ДанныеЗаполнения.Коррекция 
	Тогда		
		РаботаСДокументамиСервер.ЗаполнитьДанныеДокументаКоррекцииПоОснованию(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		РаботаСДокументамиСервер.ЗаполнитьУчастникаИИННДенежнойОперации(Клиент, Выдать, ВыдатьИНН, ВыдатьАдрес);
	КонецЕсли;	
	
	НомерЧекаККМ = "";
	НомерЧекаЭТ = "";
	
КонецПроцедуры

#КонецОбласти
