
//
// ГЛОБАЛЬНЫЙ МОДУЛЬ СИСТЕМЫ ЛИЦЕНЗИРОВАНИЯ 1.6
//

#Область СлужебныеПроцедурыИФункции

// Проверяет значение на Неопределено
//
// Параметры:
//  Значение	- Любой	- Значение, которое необходимо проверить на Неопредлеено.
// Возвращаемое значение:
//  Булево		- Обратный результат сравнения значения с неопределено
Функция доп_сл_ЗначениеОпределено(Знач Значение) Экспорт
	
	Возврат Значение <> Неопределено;
		
КонецФункции

#Область ОБРАБОТЧИКИ_ОЖИДАНИЯ

#Если ТонкийКлиент ИЛИ ВебКлиент ИЛИ ТолстыйКлиентУправляемоеПриложение ИЛИ ТолстыйКлиентОбычноеПриложение Тогда
	
	// Выполняет "Отложенную активацию продукта"
	// "Отложенная активация продукта" настраивается в окне системы лицензирования 1.6
	Процедура доп_сл_Подключаемый_ОтложеннаяАктивация() Экспорт
		
		// Проверка минимальной версии ассистента сервера лицензий
		РезультатПроверки = доп_сл_сервер_ассистент.ПроверитьНеобходимостьОбновленияАссистента();
		
		Если РезультатПроверки.ТребуетсяОбновление Тогда 
			
			доп_сл_общий.ВывестиСообщение(РезультатПроверки.Сообщение);	
			
		КонецЕсли; 
		
		// Получение лицензии для текущего продукта
		Если Не доп_сл_сервер.НетОшибок( доп_сл_сервер.ПолучитьЛицензиюДляТекущегоПродукта() ) Тогда 			
			
			// Обработка ошибки при получении лицензии
			доп_сл_клиент.ОткрытьФормуКлиентаЛицензирования();
		
		КонецЕсли;
		
	КонецПроцедуры
	
	// Обеспечивает функционирование служебных подсистем
	//  
	Процедура доп_сл_Подключаемый_РасширениеВозможностейПлатформы() Экспорт
		
		доп_сл_сервер_ассистент.ВыполнитьПоддержкуРаботыКлиента();
		
	КонецПроцедуры 	
	
#КонецЕсли

#КонецОбласти

#КонецОбласти