
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийВрач = Пользователи.ТекущийПользователь().Сотрудник;
	
	Медсестра = омг_МедицинскаяДеятельность.ПолучитьТекущуюМедсестру(ТекущийВрач);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСеанс(Команда)
	ЗавершитьРаботуСистемы(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОперацию(Команда)
	Если Не Медсестра.Пустая() и не Медсестра = ПредопределенноеЗначение("Справочник.Сотрудники.БезМедсестры") Тогда
		омг_МедицинскаяДеятельность.УстановитьТекущуюМедсестру(ТекущийВрач, Медсестра);
	КонецЕсли; 
	Закрыть(Медсестра);
КонецПроцедуры



&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//Если ЗавершениеРаботы Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//Если Медсестра.Пустая() Тогда
	//	ЗавершитьРаботуСистемы(Ложь);
	//КонецЕсли;
	
КонецПроцедуры

  