
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеФилиалов = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ДополнительныеНастройкиИнтеграцииЛИС", "ДанныеФилиалов");
	
	
	Если ДанныеФилиалов = Неопределено Тогда
		ИсходноеСоответствиеНастроек = Новый Соответствие;
	Иначе
		ИсходноеСоответствиеНастроек = ДанныеФилиалов.Получить();
	КонецЕсли;
	
	СоответствиеФилиалов = Новый Соответствие;
	
	КолонкиТаблицы = ПолучитьРеквизиты("ТаблицаНастроек");
	
	Для Каждого СтрокаТаблицы Из ТаблицаНастроек Цикл
		СтруктураСведений = Новый Структура;
		Для Каждого Колонка ИЗ КолонкиТаблицы Цикл
			Если Колонка.Имя = "ПарольИзменен" Тогда
				Продолжить;
			КонецЕсли;
			СтруктураСведений.Вставить(Колонка.Имя, СтрокаТаблицы[Колонка.Имя]);
		КонецЦикла;
		Если Не СтрокаТаблицы.ПарольИзменен Тогда
			ИсходныеНастройки = ИсходноеСоответствиеНастроек.Получить(СтрокаТаблицы.Филиал);
			Если Не ИсходныеНастройки = Неопределено Тогда
				СтруктураСведений.Пароль = ИсходныеНастройки.Пароль;
			КонецЕсли;
		КонецЕсли;
		СоответствиеФилиалов.Вставить(СтрокаТаблицы.Филиал, СтруктураСведений);
	КонецЦикла;
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("омг_ДополнительныеНастройкиИнтеграцииЛИС", Новый ХранилищеЗначения(СоответствиеФилиалов), "ДанныеФилиалов");
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОКНаСервере();
	Модифицированность = Ложь;
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СоответствиеНастроек = омг_ИнтеграцияСЛИС.ПолучитьДополнительныеНастройкиПоФилиалам(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Филиалы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Филиалы КАК Филиалы";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НастройкиФилиала = СоответствиеНастроек.Получить(Выборка.Ссылка);
		
		НоваяСтрока = ТаблицаНастроек.Добавить();
		Если Не НастройкиФилиала = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НастройкиФилиала);
		КонецЕсли;
		НоваяСтрока.Филиал = Выборка.Ссылка;
		Если ЗначениеЗаполнено(НоваяСтрока.Пароль) Тогда
			НоваяСтрока.Пароль = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПарольПриИзменении(Элемент)
	Элементы.ТаблицаНастроек.ТекущиеДанные.ПарольИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНастроекПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеОтветаНаВопросОЗакрытии(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		ТекстПредупреждения = "Есть изменения по настройкам интеграции с ЛИС.
		|Закрытие формы приведет к потере изменений. Продолжить?";
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		ТекстВопроса = "Есть изменения по настройкам интеграции с ЛИС.
		|Закрытие формы приведет к потере изменений. Продолжить?";
		ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросОЗакрытии", ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
