#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
		Запись.Организация = Справочники.Организации.ЕдинственнаяОрганизация();
		Если Не ЗначениеЗаполнено(Запись.Организация) Тогда
			Запись.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.Пользователь) Тогда
		ТекущийЭлемент = Элементы.УИД;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УИДПриИзменении(Элемент)
	
	Попытка
		УИД = Новый УникальныйИдентификатор(Запись.УИД);
	Исключение
		Запись.УИД = "";
		ПоказатьПредупреждение(, "Неверный формат идентификатора доверенности!
								 |Скопируйте идентификатор из доверенности и вставьте в поле ввода.");
	КонецПопытки;
	
КонецПроцедуры
           	
#КонецОбласти
