#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Результат.ОтображениеСостояния.Видимость = Ложь;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	
	Если Параметры.Свойство("Клиент") Тогда
		Отчет.Клиент = Параметры.Клиент;
		
		Если Параметры.Свойство("МедицинскаяКарта") Тогда
			Отчет.МедицинскаяКарта = Параметры.МедицинскаяКарта;
		Иначе
			Отчет.МедицинскаяКарта = Стационар.ПолучитьМедКартуСтационара(Отчет.Клиент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НапечататьЛистНазначений(Команда)
	
	СформироватьИОткрытьВФормеПечати(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьЛистВыполненияНазначений(Команда)
	
	СформироватьИОткрытьВФормеПечати(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Отчет.МедицинскаяКарта = Стационар.ПолучитьМедКартуСтационара(Отчет.Клиент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьИОткрытьВФормеПечати(ЭтоЛистВыполнения)
	
	Имя		= ?(ЭтоЛистВыполнения, "Лист выполнения врачебных назначений", 
								  "Лист врачебных назначений");
	ТабДок	= ?(ЭтоЛистВыполнения, СформироватьЛистВыполненияНазначенийНаСервере(),
								  СформироватьЛистНазначенийНаСервере());
	
	СтруктураНаПечать = УниверсальныеМеханизмыСервер.НапечататьДокумент(ТабДок, 0, , Имя, Строка(Отчет.Клиент), Отчет.МедицинскаяКарта);
	ПечатьДокументовКлиент.ВывестиНапечататьДокумент(СтруктураНаПечать, Отчет.МедицинскаяКарта);

КонецПроцедуры

&НаСервере
Функция СформироватьЛистНазначенийНаСервере()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Возврат ОтчетОбъект.СформироватьЛистНазначений();
	
КонецФункции

&НаСервере 
Функция СформироватьЛистВыполненияНазначенийНаСервере()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	Возврат ОтчетОбъект.СформироватьЛистВыполненияНазначений();
	
КонецФункции

#КонецОбласти