
// Добавлено Макеев (
&НаСервере
Процедура омг_ВыполнитьИсходноеСобытие(ИмяЭлементаФормы, ИмяСобытия)
	
	Если Параметры.ДополнительныеПараметры.омг_УстановленныеДейстия.Свойство(ИмяЭлементаФормы + "_" + ИмяСобытия)
		И Не Параметры.ДополнительныеПараметры.омг_УстановленныеДейстия[ИмяЭлементаФормы + "_" + ИмяСобытия] = "" Тогда
		Выполнить(Параметры.ДополнительныеПараметры.омг_УстановленныеДейстия[ИмяЭлементаФормы + "_" + ИмяСобытия]);
	КонецЕсли;
	
КонецПроцедуры
	
&НаСервере
Процедура омг_ПриСозданииНаСервере(Отказ)
	
	омг_ВыполнитьИсходноеСобытие("ЭтаФорма", "ПриСозданииНаСервере");
	
	Элементы.ИНН.Заголовок = "БИН";
	
КонецПроцедуры

&НаСервере
Процедура омг_УстановитьДействияФормы()
	
	СтруктураУстановленныхДействий = Новый Структура("ПриСозданииНаСервере", ПолучитьДействие("ПриСозданииНаСервере"));
	
	Параметры.ДополнительныеПараметры.Вставить("омг_УстановленныеДейстия", СтруктураУстановленныхДействий);
	УстановитьДействие("ПриСозданииНаСервере", "омг_ПриСозданииНаСервере");
	
КонецПроцедуры
// )

// Добавлено Макеев (
Если Параметры.Свойство("ДополнительныеПараметры") Тогда
	омг_УстановитьДействияФормы();
КонецЕсли;
// )