
&НаСервереБезКонтекста
Функция ПолучитьДвоичныеДанныеДокументаИсследования(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_РезультатИсследованияMedreview.ФайлРезультата КАК ФайлРезультата
	               |ИЗ
	               |	Документ.омг_РезультатИсследованияMedreview КАК омг_РезультатИсследованияMedreview
	               |ГДЕ
	               |	омг_РезультатИсследованияMedreview.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ДвоичныеДанные = Выборка.ФайлРезультата.Получить();
	
	Возврат ДвоичныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьФайлИсследования(Команда)
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
	
	ДвоичныеДанные = ПолучитьДвоичныеДанныеДокументаИсследования(Объект.Ссылка);
	
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ДокументPDF = Новый ДокументPDF;
	
	ДокументPDF.Прочитать(ИмяВременногоФайла);
	ДокументPDF.Показать("Результат исследования");
	
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаДеталиИсследованияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.СсылкаНаДеталиИсследования);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры
