&НаКлиенте
Перем РаскрытиеСтрокПриВыбореФилиала;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	
	Филиал = УчетнаяПолитика.Филиал;
	Элементы.Филиал.Видимость = ПараметрыСеанса.УчетПоНесколькимФилиалам;
	УстановитьОтборПоФилиалу(Список, Филиал);
		
	КойкиВПалате.Параметры.УстановитьЗначениеПараметра("Палата", Элементы.Список.ТекущаяСтрока);
	КойкиВПалате.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	КойкиССостоянием.Параметры.УстановитьЗначениеПараметра("Палата", Элементы.Список.ТекущаяСтрока);
	КойкиНаХранении.Параметры.УстановитьЗначениеПараметра("Подразделение", Неопределено);
				
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РаскрытиеСтрокПриВыбореФилиала = Ложь;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "СозданиеКоек" Тогда
		ОбновитьСпискиКоек();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьКойку(Команда)
	
	СтруктураПараметров = Новый Структура("Палата", Элементы.Список.ТекущаяСтрока);
	
	ОткрытьФорму("Справочник.КойкоМеста.ФормаОбъекта", СтруктураПараметров,,,,, Новый ОписаниеОповещения("Оповещение_ОбновитьКойки", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиВПалатеПереместить(Команда)
	
	ПереместитьКойки("КойкиВПалате");
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиССостояниемПереместить(Команда)
	
	ПереместитьКойки("КойкиССостоянием", Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиНаХраненииПереместить(Команда)
	
	ПереместитьКойки("КойкиНаХранении",,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюПоПалате(Команда)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.Палаты") Тогда 
				
		ОткрытьФорму("РегистрСведений.ДвижениеКоечногоФонда.ФормаСписка", Новый Структура("Палата", Элементы.Список.ТекущаяСтрока), ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКойку(Команда)
	
	ТекущиеДанные = Элементы.КойкиВПалате.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ОткрытьЗначение(ТекущиеДанные.Койка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено
		И Не РаскрытиеСтрокПриВыбореФилиала 
	Тогда
		ОбновитьСпискиКоек();
		
		СтрокаПалата = ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.Палаты");
		Элементы.ФормаСоздатьКойку.Доступность = СтрокаПалата;
		Элементы.СписокОткрытьИсториюПоПалате.Доступность = СтрокаПалата;
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура КойкиВПалатеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КойкиВПалатеКойка" Тогда
		ОткрытьИсториюКоечногоФонда("Койка", Элементы.КойкиВПалате.ТекущиеДанные.Койка);
	Иначе
		ОткрытьДокументРегистратор(Элементы.КойкиВПалате.ТекущиеДанные.Регистратор);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиССостояниемВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьИсториюКоечногоФонда("Койка", Элементы.КойкиССостоянием.ТекущиеДанные.Койка);	
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиНаХраненииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьИсториюКоечногоФонда("Койка", Элементы.КойкиНаХранении.ТекущиеДанные.Койка);
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиССостояниемПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.Палаты") Тогда
		
		СтруктураПараметров = Новый Структура("Койки", ПараметрыПеретаскивания.Значение);
		СтруктураПараметров.Вставить("УстановкаСостояния", Истина);
		
		ОткрытьФорму("Справочник.КойкоМеста.Форма.ФормаПеремещенияКоек", СтруктураПараметров, ЭтотОбъект,,,,Новый ОписаниеОповещения("Оповещение_ОбновитьКойки",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиВПалатеПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.Палаты") Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыполнитьДвижениеКоечногоФонда(ПараметрыПеретаскивания.Значение, Элементы.Список.ТекущаяСтрока); 
		ОбновитьСпискиКоек();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КойкиНаХраненииПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.Палаты") Тогда
		
		СтандартнаяОбработка = Ложь;
		ВыполнитьДвижениеКоечногоФонда(ПараметрыПеретаскивания.Значение, ПредопределенноеЗначение("Справочник.Палаты.Хранение")); 
		ОбновитьСпискиКоек();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;

	СтруктураПараметров = Новый Структура("Койки", ПараметрыПеретаскивания.Значение);
	СтруктураПараметров.Вставить("ПеремещениеКоек", Истина);
	СтруктураПараметров.Вставить("Палата", Строка);
		
	ОткрытьФорму("Справочник.КойкоМеста.Форма.ФормаПеремещенияКоек", СтруктураПараметров, ЭтотОбъект,,,,Новый ОписаниеОповещения("Оповещение_ОбновитьКойки",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Строка) <> Тип("СправочникСсылка.Палаты") Тогда
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент) 
	
	Если Не Филиал.Пустая() Тогда
		УстановитьОтборПоФилиалу(Список, Филиал);
	Иначе
		Список.Отбор.Элементы.Очистить();
	КонецЕсли;
	ОбновитьСпискиКоек();
	РаскрытьСписок();

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура ОбновитьСпискиКоек()
	
	Палата = ?(ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.Палаты"),Элементы.Список.ТекущаяСтрока, Неопределено);
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Подразделение = ?(ТекущиеДанные.РодительскаяГруппировкаСтроки <> Неопределено, ТекущиеДанные.РодительскаяГруппировкаСтроки.Ключ, ТекущиеДанные.Подразделение);
	КонецЕсли;	
		
	ОбновитьСпискиКоекНаСервере(Палата, Подразделение);
	
КонецПроцедуры                                                        

&НаСервере
Процедура ОбновитьСпискиКоекНаСервере(Палата, Подразделение)
	
	КойкиВПалате.Параметры.УстановитьЗначениеПараметра("Палата", Палата);
	КойкиВПалате.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	КойкиССостоянием.Параметры.УстановитьЗначениеПараметра("Палата", Палата);
	КойкиНаХранении.Параметры.УстановитьЗначениеПараметра("Подразделение", Подразделение);
	Элементы.Список.Обновить();
	
	КойкиВПалате.Параметры.УстановитьЗначениеПараметра("Период", ТекущаяДата());
	
КонецПроцедуры

&НаКлиенте
Процедура Оповещение_ОбновитьКойки(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьСпискиКоек();	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоФилиалу(ДинамическийСписок, Филиал)
	
	ДинамическийСписок.Отбор.Элементы.Очистить();
	ЭлементОтбора = ДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение.Филиал");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Филиал; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюКоечногоФонда(Ключ, Значение)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить(Ключ, Значение);
	
	ОткрытьФорму("РегистрСведений.ДвижениеКоечногоФонда.ФормаСписка", СтруктураПараметров, ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыполнитьДвижениеКоечногоФонда(Койки, Палата = Неопределено, Состояние = Неопределено)
	
	ОшибочныеКойки = РегистрыСведений.ДвижениеКоечногоФонда.ВыполнитьДвижениеКоечногоФонда(Койки,Палата,Состояние);
	
	Если ОшибочныеКойки.Количество() > 0 Тогда
		Отказ = Истина;
		ТекстОшибки = "Перемещено " + Строка(Койки.Количество() - ОшибочныеКойки.Количество()) + " коек.
			|Следующие койки заняты и не могут быть перемещены:";
		
		Для Каждого Койка Из ОшибочныеКойки Цикл
			ТекстОшибки = ТекстОшибки + Символы.ПС + Койка;		
		КонецЦикла;
		
		ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(ТекстОшибки);
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьКойки(ИмяСписка, ПалатаПоУмолчанию = Неопределено, ПеремещениеКоек = Ложь)
	
	Если ТипЗнч(Элементы.Список.ТекущаяСтрока) = Тип("СправочникСсылка.Палаты") Тогда
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Койки", Элементы[ИмяСписка].ВыделенныеСтроки);
		Если ПалатаПоУмолчанию <> Неопределено Тогда
			СтруктураПараметров.Вставить("Палата", ПалатаПоУмолчанию);
		КонецЕсли;
		Если ПеремещениеКоек Тогда
			СтруктураПараметров.Вставить("ПеремещениеКоек", ПеремещениеКоек);	
		КонецЕсли;
		
		ОткрытьФорму("Справочник.КойкоМеста.Форма.ФормаПеремещенияКоек", СтруктураПараметров, ЭтотОбъект,,,,Новый ОписаниеОповещения("Оповещение_ОбновитьКойки",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаскрытьСписок() Экспорт

	Палаты = ПолучитьПалатыФилиала(Филиал);
	
	РаскрытиеСтрокПриВыбореФилиала = Истина;
	Для Каждого Палата Из Палаты Цикл
		Элементы.Список.ТекущаяСтрока = Палата;	
	КонецЦикла;
	РаскрытиеСтрокПриВыбореФилиала = Ложь;
	ОбновитьСпискиКоек();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПалатыФилиала(Филиал)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Палаты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Палаты КАК Палаты
	               |ГДЕ
	               |	Палаты.Подразделение.Филиал = &Филиал";
	
	Запрос.УстановитьПараметр("Филиал", Филиал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивПалат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивПалат.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат МассивПалат;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьДокументРегистратор(Документ)

	Если ТипЗнч(Документ) = Тип("ДокументСсылка.БронированиеКойкоМеста") Тогда
		ОткрытьФорму("Документ.БронированиеКойкоМеста.Форма.ФормаДокумента",Новый Структура("Ключ", Документ), ЭтотОбъект);		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.УстановкаУсловийПребывания") Тогда
		ОткрытьФорму("Документ.УстановкаУсловийПребывания.Форма.ФормаДокумента",Новый Структура("Ключ", Документ), ЭтотОбъект);			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти