Функция КлючПродуктаБИТСЛК(ИмяПродукта = Неопределено)
	Если ИмяПродукта = Неопределено Тогда
		Возврат доп_Защита_Конфигурации.КлючПродухтаБИТСЛК(ИмяПродукта);
	КонецЕсли;
КонецФункции
Процедура дкОбработкаПроведенияДокументовОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Попытка
		ПроверкаЗащитыКонфигурации(Отказ);
	Исключение
		Отказ = Истина;
	КонецПопытки;
КонецПроцедуры
Функция ВалидацияПротекцииОперации(Отказ = Ложь, ИмяМодуля = "") Экспорт
	Валидатор = Новый ГенераторСлучайныхЧисел;
	Ошибка = Не Булево(Валидатор.RandomNumber(1, 100));
	Если ЗначениеЗаполнено(ИмяМодуля) Тогда
		Если ИмяМодуля = "2" И доп_Защита_Конфигурации.ИспользуемаяВерсияСистемыЛицензирования() = "2.0" Тогда
			Если ЭтоУМЦ() Тогда
				ПроверкаЗащитыКонфигурации(Ошибка, Истина, , Ложь);
			Иначе
				Ошибка = Истина;
			КонецЕсли;
		ИначеЕсли МодулиТребующиеПТС().Найти(ИмяМодуля) <> Неопределено Тогда
			Ошибка = Ошибка Или Не МодульПоПТСДоступен(ИмяМодуля);
		Иначе
			ИменаМодулей = ЛицензииСодержащиеМодуль(ИмяМодуля);
			Ошибка = Ошибка Или Не ЕстьЛиЖизньНаМарсе(ИменаМодулей);
		КонецЕсли;
	Иначе
		ПроверкаЗащитыКонфигурации(Ошибка);
	КонецЕсли;
	Отказ = Отказ Или Ошибка;
	Возврат Не Ошибка;
КонецФункции
Функция ЭтоУМЦ()
	Если доп_Защита_Конфигурации.МетаданныеЛицензируемогоПродукта().productId = доп_Защита_Конфигурации.СтруктураМетаданных_УМЦ20().ИдентификаторПродукта Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
Функция ЕстьВДеревнеКолбаса(Отказ = Ложь) Экспорт
	Возврат ВалидацияПротекцииОперации(Отказ);
КонецФункции
Процедура ПроверкаЗащитыКонфигурации(Отказ = Ложь, ПроверятьТолькоОсновнуюЛицензию = Ложь, ВыводитьСообщениеОбОшибке = Истина, ЗаниматьЛицензиюПослеПроверкиКОРП = Истина)
	Перем Результат, РезультатПроверки;
	//Если ЭтоПриложениеБезПроверкиЛицензии() Тогда
	//	Возврат;
	//КонецЕсли;
	//ИспользуемаяВерсияСистемыЛицензирования = доп_Защита_Конфигурации.ИспользуемаяВерсияСистемыЛицензирования();
	//Результат = Ложь;
	//Если ИспользуемаяВерсияСистемыЛицензирования = "1.6" Тогда
	//	Текст = "РезультатПроверки = доп_сл_сервер.ПолучитьЛицензию(КлючПродуктаБИТСЛК());		|Результат = доп_сл_сервер.НетОшибок(РезультатПроверки);";
	//Иначе
	//	Если Не ЗаниматьЛицензиюПослеПроверкиКОРП Тогда
	//		МетаданныеПродукта = доп_Защита_Конфигурации.МетаданныеЛицензируемогоПродукта();
	//		МассивИдентификаторов = Новый Массив;
	//		МассивИдентификаторов.Добавить(МетаданныеПродукта.productId);
	//		Текст = "РезультатПроверки = сл2_Сервер.ПроверитьДоступностьПродуктов(МетаданныеПродукта, МассивИдентификаторов);			|Результат = сл2_Сервер.НетОшибок(РезультатПроверки);			|Если РезультатПроверки.data.productIds.Количество() = 0 Тогда			|	Результат = Ложь;			|КонецЕсли;";
	//	Иначе
	//		Текст = "РезультатПроверки = сл2_Сервер.ПолучитьЛицензиюНаСеанс(доп_Защита_Конфигурации.МетаданныеЛицензируемогоПродукта());			|Результат = сл2_Сервер.НетОшибок(РезультатПроверки);";
	//	КонецЕсли;
	//КонецЕсли;
	//Попытка
	//	Возврат;
	//Исключение
	//КонецПопытки;
	//СистемнаяИнформация = Новый СистемнаяИнформация;
	//Если Результат = Ложь И Константы.ИспользуемаяВерсияСистемыЛицензирования.Получить() = "2.0" И (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86_64 Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86) Тогда
		Отказ = Ложь;
		Результат = Истина;
	//КонецЕсли;
	//Если Не Результат Тогда
	//	Если ИспользуемаяВерсияСистемыЛицензирования = "2.0" И Не ПроверятьТолькоОсновнуюЛицензию Тогда
	//		МетаданныеПродуктов = МетаданныеДополнительныхЛицензируемыхПродуктов();
	//		Для каждого Мтд Из МетаданныеПродуктов Цикл
	//			Текст = "РезультатПроверки = сл2_Сервер.ПолучитьЛицензиюНаСеанс(Мтд);				|Результат = сл2_Сервер.НетОшибок(РезультатПроверки);";
	//			Если Результат Тогда
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЕсли;
	//Отказ = Отказ Или Не Результат;
	//Если Не Результат Тогда
	//	Если ИспользуемаяВерсияСистемыЛицензирования = "1.6" Тогда
	//		ОписаниеОшибкиСЛ = РезультатПроверки.Описание + Символы.ПС + РезультатПроверки.Комментарий + Символы.ПС + "код ошибки: " + РезультатПроверки.Код;
	//	Иначе
	//		ОписаниеОшибкиСЛ = РезультатПроверки.description + Символы.ПС + РезультатПроверки.comment + Символы.ПС + "код ошибки: " + РезультатПроверки.code;
	//	КонецЕсли;
	//	ЗаписьЖурналаРегистрации("Ошибка получения лицензии через ОЛИМП.Сервер лицензирования", УровеньЖурналаРегистрации.Предупреждение, , , ОписаниеОшибкиСЛ);
	//КонецЕсли;
	//Если Не Результат И ВыводитьСообщениеОбОшибке Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(УниверсальныйТекстОшибкиЛицензии());
	//КонецЕсли;
КонецПроцедуры
Функция ЕстьЛиЖизньНаМарсе(ИменаМодулей)
	Возврат Истина;
	Отказ = Истина;
	МодулиСПроверкойЛицензииВФоне = МодулиПроверяемыеПриЛюбомИмениПриложения1С();
	Если МодулиСПроверкойЛицензииВФоне.Найти(ИменаМодулей[0]) = Неопределено Тогда
		Если ЭтоПриложениеБезПроверкиЛицензии() Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Если доп_Защита_Конфигурации.ИспользуемаяВерсияСистемыЛицензирования() = "1.6" Тогда
		Текст = "Результат = доп_сл_сервер.ПолучитьПараметрЛицензии(КлючПродуктаБИТСЛК(), ПараметрыМодуля.ИмяПараметра, ЗначениеПараметра);";
		АтрибутыОсновногоМодуля = ПолучитьАтрибутыПараметраЛицензииМодуля(ИменаМодулей[0]);
		ПредставлениеМодуля = АтрибутыОсновногоМодуля.ПредставлениеМодуля;
		Для каждого ИмяМодуля Из ИменаМодулей Цикл
			ПараметрыМодуля = ПолучитьАтрибутыПараметраЛицензииМодуля(ИмяМодуля);
			ЗначениеПараметра = "";
			Попытка
				Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
					Отказ = ВРег(ЗначениеПараметра) <> ВРег(ПараметрыМодуля.ЗначениеНаличия);
				Иначе
					Отказ = Истина;
				КонецЕсли;
				Если Не Отказ Тогда
					 Прервать;
				КонецЕсли;
			Исключение
				Отказ = Истина;
			КонецПопытки;
		КонецЦикла;
	Иначе
		МетаданныеПродуктов = МетаданныеДополнительныхЛицензируемыхПродуктов();
		МетаданныеПродуктов.Вставить(0, доп_Защита_Конфигурации.МетаданныеЛицензируемогоПродукта());
		Для каждого МетаданныеПродукта Из МетаданныеПродуктов Цикл
			Текст = "ЗначениеПараметра = сл2_Сервер.ПолучитьПараметрЛицензии(МетаданныеПродукта, ПараметрыМодуля.ИдентификаторПараметра);			|Результат = сл2_Сервер.НетОшибок(ЗначениеПараметра);";
			АтрибутыОсновногоМодуля = ПолучитьАтрибутыПараметраЛицензииМодуля(ИменаМодулей[0]);
			ПредставлениеМодуля = АтрибутыОсновногоМодуля.ПредставлениеМодуля;
			Для каждого ИмяМодуля Из ИменаМодулей Цикл
				Если ИмяМодуля = "2" И ЭтоУМЦ() Тогда
					ОтказПриПроверкеЛицензии = Ложь;
					ПроверкаЗащитыКонфигурации(ОтказПриПроверкеЛицензии, Истина, Ложь, Ложь);
					Если Не ОтказПриПроверкеЛицензии Тогда
						Отказ = Ложь;
						Прервать;
					КонецЕсли;
				КонецЕсли;
				ПараметрыМодуля = ПолучитьАтрибутыПараметраЛицензииМодуля(ИмяМодуля);
				ЗначениеПараметра = "";
				Результат = Ложь;
				Попытка
					Если Результат Тогда
						Если ЗначениеЗаполнено(ЗначениеПараметра) И ЗначениеПараметра.data.parameterType = "boolean" Тогда
							Отказ = Не ЗначениеПараметра.data.value;
						Иначе
							Отказ = Истина;
						КонецЕсли;
						Если Не Отказ Тогда
							 Прервать;
						КонецЕсли;
					КонецЕсли;
				Исключение
					Отказ = Истина;
				КонецПопытки;
			КонецЦикла;
			Если Не Отказ Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если Отказ = Истина И Константы.ИспользуемаяВерсияСистемыЛицензирования.Получить() = "2.0" И (СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86_64 Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86) Тогда
		Отказ = Ложь;
	КонецЕсли;
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена лицензия на функционал раздела """ + ПредставлениеМодуля + """!");
	КонецЕсли;
	Возврат Не Отказ;
КонецФункции
Функция МодульПоПТСДоступен(ИмяМодуля)
	ПричинаОшибки = "";
	Если доп_Защита_Конфигурации.ИспользуемаяВерсияСистемыЛицензирования() <> "2.0" Тогда
		ПричинаОшибки = "Требуемая версия системы лицензирования: 2.0";
	КонецЕсли;
	Если ПустаяСтрока(ПричинаОшибки) Тогда
		Если МодулиДополнительноТребующиеКОРПВерсию().Найти(ИмяМодуля) <> Неопределено Тогда
			Ошибка = Ложь;
			ПроверкаЗащитыКонфигурации(Ошибка, Истина, , Ложь);
			Если Ошибка Тогда
				ПричинаОшибки = "Лицензия КОРП-версии программы не найдена";
				ПричинаОшибки = ПричинаОшибки + Символы.ПС + УниверсальныйТекстОшибкиЛицензии();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ПустаяСтрока(ПричинаОшибки) Тогда
		ВидыПТСМодулей = ВидыПТСМодулей();
		Если ВидыПТСМодулей.Свойство(ИмяМодуля) Тогда
			ПодпискаНайдена = Ложь;
			МетаданныеПродуктаФикс = ?(МодулиДополнительноТребующиеКОРПВерсию().Найти(ИмяМодуля) <> Неопределено, доп_Защита_Конфигурации.МетаданныеЛицензируемогоПродукта(доп_Защита_Конфигурации.СтруктураМетаданных_УМЦКОРП()), Неопределено);
			ПричинаОшибки = ИнтерпретацияСостоянияПодписки(ПодпискаНайдена, ВидыПТСМодулей[ИмяМодуля], МетаданныеПродуктаФикс);
			Если ПодпискаНайдена Тогда
				ПричинаОшибки = "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(ПричинаОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Функциональность не доступна по причине:" + Символы.ПС + ПричинаОшибки);
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции
Функция ПолучитьИмяТекущегоПриложения()
	Результат = "";
	УстановитьПривилегированныйРежим(Истина);
	ТекущееСоединение = ПолучитьТекущийСеансИнформационнойБазы();
	Если ТекущееСоединение <> Неопределено Тогда
		Результат = ТекущееСоединение.ИмяПриложения;
	Иначе
		Результат = "hz-application";
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
КонецФункции
Функция ЭтоПриложениеБезПроверкиЛицензии()
	ИмяПриложения = ПолучитьИмяТекущегоПриложения();
	Если ЗначениеЗаполнено(ИмяПриложения) Тогда
		Если ИмяПриложения = "WSConnection" Или ИмяПриложения = "HTTPServiceConnection" Или ИмяПриложения = "WebServerExtension" Или ИмяПриложения = "BackgroundJob" Или ИмяПриложения = "SystemBackgroundJob" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
Функция ПолучитьАтрибутыПараметраЛицензииМодуля(ИмяМодуля) Экспорт
	Результат = Новый Структура("ИмяПараметра, ИдентификаторПараметра, ЗначениеНаличия, ПредставлениеМодуля", Неопределено, Неопределено, "Да");
	Если ИмяМодуля = "2" Тогда
		Результат.ИмяПараметра = "Версия КОРП";
		Результат.ИдентификаторПараметра = "e9ac3008-fb67-47aa-98a2-ec2c6e985896";
	ИначеЕсли ИмяМодуля = "4" Тогда
		Результат.ИмяПараметра = "Модуль DICOM";
		Результат.ИдентификаторПараметра = "aad2ce5a-3493-4462-8bc0-8511c432582e";
	ИначеЕсли ИмяМодуля = "Laboratory" Тогда
		Результат.ИмяПараметра = ИмяМодуля;
		Результат.ИдентификаторПараметра = "37f85808-6df9-4aba-91c7-3a3069de1fc8";
	ИначеЕсли ИмяМодуля = "OnDoc" Тогда
		Результат.ИмяПараметра = ИмяМодуля;
		Результат.ИдентификаторПараметра = "4d001cd8-b779-4374-ab5b-4412accfbc21";
	ИначеЕсли ИмяМодуля = "GoogleCal" Тогда
		Результат.ИмяПараметра = ИмяМодуля;
		Результат.ИдентификаторПараметра = "b635843a-1865-453b-8f53-f061049e09ef";
	ИначеЕсли ИмяМодуля = "EGISZ_InIS" Тогда
		Результат.ИмяПараметра = ИмяМодуля;
		Результат.ИдентификаторПараметра = "d386fb23-90b2-47c3-b5de-1f0536f0755f";
	КонецЕсли;
	Результат.ПредставлениеМодуля = ПредставлениеМодуля(ИмяМодуля);
	Если Результат.ПредставлениеМодуля = Неопределено Тогда
		Результат.ПредставлениеМодуля = Результат.ИдентификаторПараметра;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция ПредставлениеМодуля(ИмяМодуля)
	Представление = Неопределено;
	Если ИмяМодуля = "Laboratory" Тогда
		Представление = "Модуль интеграции с внешними лабораториями";
	ИначеЕсли ИмяМодуля = "OnDoc" Тогда
		Представление = "Модуль интеграции с сервисами OnDoc";
	ИначеЕсли ИмяМодуля = "GoogleCal" Тогда
		Представление = "Модуль интеграции с календарями Google";
	ИначеЕсли ИмяМодуля = "EGISZ_InIS" Тогда
		Представление = "Модуль интеграции с иными информационными системами ЕГИСЗ";
	ИначеЕсли ИмяМодуля = "2" Тогда
		Представление = "КОРП";
	ИначеЕсли ИмяМодуля = "4" Тогда
		Представление = "DICOM";
	КонецЕсли;
	Возврат Представление;
КонецФункции
Функция ЛицензииСодержащиеМодуль(ИмяМодуля)
	ИменаМодулей = Новый Массив;
	ИменаМодулей.Добавить(ИмяМодуля);
	Если МодулиВВерсииКОРП().Найти(ИмяМодуля) <> Неопределено Тогда
		ИменаМодулей.Добавить("2");
	КонецЕсли;
	Возврат ИменаМодулей;
КонецФункции
Функция МодулиВВерсииКОРП()
	МодулиВВерсииКОРП = Новый Массив;
	МодулиВВерсииКОРП.Добавить("Laboratory");
	МодулиВВерсииКОРП.Добавить("GoogleCal");
	Возврат МодулиВВерсииКОРП;
КонецФункции
Функция МодулиПроверяемыеПриЛюбомИмениПриложения1С()
	МодулиСПроверкойЛицензииВФоне = Новый Массив;
	МодулиСПроверкойЛицензииВФоне.Добавить("EGISZ_InIS");
	Возврат МодулиСПроверкойЛицензииВФоне;
КонецФункции
Функция МодулиТребующиеПТС()
	ИменаМодулей = Новый Массив;
	ИменаМодулей.Добавить("DICOM");
	Возврат ИменаМодулей;
КонецФункции
Функция МодулиДополнительноТребующиеКОРПВерсию()
	ИменаМодулей = Новый Массив;
	ИменаМодулей.Добавить("DICOM");
	Возврат ИменаМодулей;
КонецФункции
Функция ВидыПТСМодулей()
	Виды = Новый Структура;
	ВидыТС = Новый Массив;
	ВидыТС.Добавить(доп_Защита_Конфигурации.ИдентификаторВидаПодпискиТС_УМЦКОРП());
	ВидыТС.Добавить(доп_Защита_Конфигурации.ИдентификаторВидаПодпискиТС_УМЦ20());
	Виды.Вставить("DICOM", ВидыТС);
	Возврат Виды;
КонецФункции
Функция МетаданныеДополнительныхЛицензируемыхПродуктов()
	Попытка
		МетаданныеДополнительныхЛицензируемыхПродуктов = доп_Защита_Конфигурации.МетаданныеДополнительныхЛицензируемыхПродуктов();
	Исключение
		МетаданныеДополнительныхЛицензируемыхПродуктов = Новый Массив;
	КонецПопытки;
	Возврат МетаданныеДополнительныхЛицензируемыхПродуктов;
КонецФункции
Функция ИнтерпретацияСостоянияПодписки(ПодпискаНайдена, ВидыПТС, МетаданныеПродуктаВх = Неопределено)
	Описание = "";
	СрокПодпискиМАХ = Дата(1, 1, 1);
	Для каждого ВидПТС Из ВидыПТС Цикл
		Если МетаданныеПродуктаВх = Неопределено Тогда
			Мета = ?(ВидыПТС = доп_Защита_Конфигурации.ИдентификаторВидаПодпискиТС_УМЦКОРП(), доп_Защита_Конфигурации.СтруктураМетаданных_УМЦКОРП(), доп_Защита_Конфигурации.СтруктураМетаданных_УМЦ20());
			МетаданныеПродукта = доп_Защита_Конфигурации.МетаданныеЛицензируемогоПродукта(Мета);
		Иначе
			МетаданныеПродукта = МетаданныеПродуктаВх;
		КонецЕсли;
		Попытка
			Сведения = сл2_Сервер.ПолучитьСведенияОПодписке(МетаданныеПродукта, ВидПТС);
			Если Сведения.data <> Неопределено Тогда
				Если Сведения.data.active = Истина Тогда
					ПодпискаНайдена = Истина;
					 Прервать;
				Иначе
					СрокПодпискиСтрока = Сведения.data.expirationDate;
					Если ТипЗнч(СрокПодпискиСтрока) = Тип("Строка") Тогда
						СрокПодписки = СтроковыеФункцииКлиентСервер.СтрокаВДату(Лев(СрокПодпискиСтрока, 10));
					Иначе
						СрокПодписки = Дата(1, 1, 1);
					КонецЕсли;
					Если ЗначениеЗаполнено(СрокПодписки) Тогда
						Если СрокПодписки > СрокПодпискиМАХ Тогда
							СрокПодпискиМАХ = СрокПодписки;
							ТекущаяДата = Макс(ТекущаяДата(), ТекущаяДатаСеанса());
							Если СрокПодписки < НачалоДня(ТекущаяДата - 86400) Тогда
								СрокПодпискиМАХ = СрокПодписки;
								Описание = СтрШаблон("Подписка на технологическое сопровождение (ПТС), необходимая для использования функциональности, 								|закончилась: %1", Формат(СрокПодписки, "ДФ=dd.MM.yyyy; ДЛФ=DD"));
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Исключение
			Описание = "Нет сведений о наличии подписки на технологическое сопровождение (ПТС), необходимая для использования функциональности";
			Попытка
				Описание = Описание + Символы.ПС + Сведения.description;
			Исключение
			КонецПопытки;
		КонецПопытки;
	КонецЦикла;
	Возврат Описание;
КонецФункции
Функция УниверсальныйТекстОшибкиЛицензии()
	Возврат НСтр("ru='Возникла ошибка получения лицензии в ходе выполнения операции!'; en='An error occurred obtaining a license!'");
КонецФункции
