
Функция РезультатыИсследованийПолучить(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Метод = Запрос.ПараметрыURL.Получить("metod");
	
	Если Метод = "SignInExternalApp" Тогда
		
		Ответ = омг_ИнтеграцияСMedreview.ПолучениеJWT(Запрос);
		
	Иначе

		Ответ = Новый HTTPСервисОтвет(404);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;
	
КонецФункции

Функция РезультатыИсследованийОтправить(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Метод = Запрос.ПараметрыURL.Получить("metod");
	
	// Отключена проверка на авторизацию токеном, будет базовая авторизация
	//Авторизация = Запрос.Заголовки.Получить("Authorization");
	//
	//Если Авторизация = Неопределено Или СтрНайти(Авторизация, "Bearer") = 0 Тогда
	//	
	//	Ответ = Новый HTTPСервисОтвет(401);
	//	Возврат Ответ;
	//	
	//КонецЕсли;
	
	Если Метод = "SendResult" Тогда
		
		Ответ = омг_ИнтеграцияСMedreview.ЗаписатьРезультатыИсследования(Запрос);
		
	Иначе

		Ответ = Новый HTTPСервисОтвет(404);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Ответ;
КонецФункции

