
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_ДоступыПользователей.Пользователь КАК Пользователь,
	               |	омг_ДоступыПользователей.ОбъектДоступа КАК ОбъектДоступа
	               |ИЗ
	               |	РегистрСведений.омг_ДоступыПользователей КАК омг_ДоступыПользователей
	               |ИТОГИ ПО
	               |	Пользователь";
	ВыборкаПоПользователям = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПоПользователям.Следующий() Цикл
		СтрокаПользователей = ПользователиДоступа.Добавить();
		СтрокаПользователей.Пользователь = ВыборкаПоПользователям.Пользователь;
		СтрокаПользователей.Тип = ТипЗнч(ВыборкаПоПользователям.Пользователь);
		СтрокаПользователей.КлючСтроки = Новый УникальныйИдентификатор;
		
		ВыборкаОбъектовДоступа = ВыборкаПоПользователям.Выбрать();
		Пока ВыборкаОбъектовДоступа.Следующий() Цикл
			СтрокаОбъектовДоступа = ОбъектыДоступа.Добавить();
			СтрокаОбъектовДоступа.Объект = ВыборкаОбъектовДоступа.ОбъектДоступа;
			СтрокаОбъектовДоступа.Тип = ТипЗнч(ВыборкаОбъектовДоступа.ОбъектДоступа);
			СтрокаОбъектовДоступа.КлючСтроки = СтрокаПользователей.КлючСтроки;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиДоступаПользовательПриИзменении(Элемент)
	
	Элементы.ПользователиДоступа.ТекущиеДанные.Тип = ТипЗнч(Элементы.ПользователиДоступа.ТекущиеДанные.Пользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыДоступаОбъектПриИзменении(Элемент)

	Элементы.ОбъектыДоступа.ТекущиеДанные.Тип = ТипЗнч(Элементы.ОбъектыДоступа.ТекущиеДанные.Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиДоступаПередУдалением(Элемент, Отказ)
	
	ПользователиТекущийДанные = Элементы.ПользователиДоступа.ТекущиеДанные;
	
	НайденныеСтроки = ОбъектыДоступа.НайтиСтроки(Новый Структура("КлючСтроки", ПользователиТекущийДанные.КлючСтроки));
	
	Для Каждого СтрокаОбъектовДоступа Из НайденныеСтроки Цикл
		ОбъектыДоступа.Удалить(СтрокаОбъектовДоступа);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиДоступаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Не НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ПользователиДоступа.ТекущиеДанные.КлючСтроки = Новый УникальныйИдентификатор;
	
	ПользователиДоступаПриАктивизацииСтроки(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиДоступаПриАктивизацииСтроки(Элемент)

	ПользователиТекущийДанные = Элементы.ПользователиДоступа.ТекущиеДанные;
	
	Если Не ПользователиТекущийДанные = Неопределено Тогда
		Элементы.ОбъектыДоступа.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючСтроки", ПользователиТекущийДанные.КлючСтроки));
	Иначе
		Элементы.ОбъектыДоступа.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КлючСтроки", ""));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрименитьНаСервере()
	
	РегистрыСведений.омг_ДоступыПользователей.СоздатьНаборЗаписей().Записать();
	
	СтруктураПоиска = Новый Структура("КлючСтроки");
	Для Каждого СтрокаПользователя Из ПользователиДоступа Цикл
		
		СтруктураПоиска.КлючСтроки = СтрокаПользователя.КлючСтроки;
		НайденныеСтроки = ОбъектыДоступа.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаОбъектовДоступа Из НайденныеСтроки Цикл
			Запись = РегистрыСведений.омг_ДоступыПользователей.СоздатьМенеджерЗаписи();
			Запись.Пользователь = СтрокаПользователя.Пользователь;
			Запись.ОбъектДоступа = СтрокаОбъектовДоступа.Объект;
			Запись.Записать();
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	ПрименитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыДоступаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ПользователиТекущийДанные = Элементы.ПользователиДоступа.ТекущиеДанные;

	Если ПользователиТекущийДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектыДоступаТекущиеДанные = Элементы.ОбъектыДоступа.ТекущиеДанные;
	
	ОбъектыДоступаТекущиеДанные.КлючСтроки = ПользователиТекущийДанные.КлючСтроки;
	
КонецПроцедуры
