
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеДозаказа = ПоместитьВоВременноеХранилище(Параметры.ДанныеДозаказа, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗаявку()
	
	СтруктураПроверки = ПроверкаДозаказа(Элементы.Список.ТекущиеДанные.Ссылка);
	
	Если Не СтруктураПроверки.ДозаказВозможен Тогда
		ПоказатьПредупреждение(,"По выбранной заявке дозаказ невозможен!");
	Иначе
		Закрыть(Новый Структура("Заявка, ШтрихкодыПоСтрокам", 
			Элементы.Список.ТекущиеДанные.Ссылка, СтруктураПроверки.ШтрихкодыПоСтрокам));
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПроверки = ПроверкаДозаказа(Элементы.Список.ТекущиеДанные.Ссылка);
	
	ВыбратьЗаявку();
	
КонецПроцедуры

&НаСервере
Функция ПроверкаДозаказа(ВыбЗаявка)
	
	МассивДанныхДозаказа = ПолучитьИзВременногоХранилища(ДанныеДозаказа);
	
	Возврат Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ПроверкаБиоматериаловДозаказа(МассивДанныхДозаказа, ВыбЗаявка)
	
КонецФункции


&НаКлиенте
Процедура Выбрать(Команда)
	ВыбратьЗаявку();
КонецПроцедуры

