#Область ПрограммныйИнтерфейс

// Процедура проверяет условие проверки и, если оно не выполняется, вызывает исключение.
//
// Параметры:
//   УсловиеПроверки - Булево - Условие, котрое должно иметь значение Истина.
//   Сообщение - Строка - Сообщение, которое будет выдаваться вместе с исключением.
Процедура ВыполнитьПроверкуССообщением(УсловиеПроверки, Сообщение) Экспорт
	
	// Проверяем условие, при необходимости вызываем исключение.
	Если Не УсловиеПроверки = Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
		ВызватьИсключение (Сообщение);
	КонецЕсли;
	
КонецПроцедуры

// Конвертирует строку ФИО в структуру строк с ключами Фамилия, Имя, Отчество.
//
// Параметры:
//  ФИО	 - Строка - например, "Сергеев Сергей Сергеевич".
// 
// Возвращаемое значение:
//  Структура. 
//
Функция ФИОСтруктураИзСтроки(Знач СтрокаФИО) Экспорт
	
	СтруктураФИО = Новый Структура("Фамилия, Имя, Отчество");
	
	ФИО = СтрРазделить(СокрЛП(СтрокаФИО), " ", Ложь);
	Если ФИО.Количество() > 0 Тогда
		СтруктураФИО["Фамилия"] = ФИО[0];
	КонецЕсли;
	Если ФИО.Количество() > 1 Тогда
		СтруктураФИО["Имя"] = ФИО[1];
	КонецЕсли;
	Если ФИО.Количество() > 2 Тогда
		СтруктураФИО["Отчество"] = ФИО[2];
	КонецЕсли;
	
	Возврат СтруктураФИО;
	
КонецФункции

// Получает возраст пациента в поля структуры.
//
// Параметры:
//   ДатаРождения - Дата - Дата, от которой начинается счет возраста.
//   ДатаСреза - Дата - Дата, на которую нужно получить возраст. 
//
// Возвращаемое значение:
//   Структура:
//		*	Лет - Число
//		*	Месяцев - Число
//		*	Дней - Число
//		*	Часов - Число.
Функция ВозрастСтруктурой(ДатаРождения,ДатаСреза = Неопределено) Экспорт
	Перем Часов, КонечнаяДата, Лет, Месяцев, Дней;
	
	Если ЗначениеЗаполнено(ДатаРождения) Тогда
		КонечнаяДата=?(ЗначениеЗаполнено(ДатаСреза),ДатаСреза,ТекущаяДата());
		
		РазобратьРазностьДат(КонечнаяДата,ДатаРождения,Лет,Месяцев,Дней);
		
		Если Лет = 0 И Месяцев = 0 И Дней = 0 Тогда
			Часов = Окр ((КонечнаяДата - ДатаРождения)/3600,0);
		КонецЕсли;
	Иначе
		Лет		= 0;
		Месяцев = 0;
		Дней	= 0;
		Часов	= 0;
	КонецЕсли;
	
	Возврат Новый Структура("Лет,Месяцев,Дней,Часов",Лет,Месяцев,Дней,Часов);
КонецФункции

// Процедура КонкатенацияСтрок.
//
// Параметры:
//  Приемник - Неопределено
//  Источник - Неопределено
//  Разделитель - Строка - По умолчанию ", "
//  ДобавлятьТолькоЗаполненныйИсточник - Булево - По умолчанию Ложь
//
Процедура КонкатенацияСтрок(Приемник, Источник, Разделитель = ", ", ДобавлятьТолькоЗаполненныйИсточник = Ложь) Экспорт
	
	Если Не ДобавлятьТолькоЗаполненныйИсточник Или ЗначениеЗаполнено(Источник) Тогда
		Приемник = Приемник + ?(ПустаяСтрока(Приемник), "", Разделитель) + Источник;
	КонецЕсли;
	
КонецПроцедуры

// Возвращает первое заплненное значение из переданных
//
// Параметры:
//  Значение1	 - Произвольный - значние.
//  Значение2	 - Произвольный - значние.
//  Значение3	 - Произвольный - значние.
//  Значение4	 - Произвольный - значние.
//  Значение5	 - Произвольный - значние.
// 
// Возвращаемое значение:
//  Произвольный - первое заполненное значение.
//
Функция ЗаполненноеЗначение(Значение1, Значение2, Значение3 = Неопределено, Значение4 = Неопределено, Значение5 = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Значение1) Тогда
		Возврат Значение1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Значение2) Тогда
		Возврат Значение2;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Значение3) Тогда
		Возврат Значение3;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Значение4) Тогда
		Возврат Значение4;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Значение5) Тогда
		Возврат Значение5;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Проверяет, что проверяемый релиз более ранний, чем проверяющий.
//
// Параметры:
//  РелизПроверяемый - Строка - номер релиза.
//  РелизПроверяющий - Строка - номер релиза.
// 
// Возвращаемое значение:
//  Булево.
//
Функция РелизБолееРанний(РелизПроверяемый,РелизПроверяющий) Экспорт
	
	мсРелизПроверяемый = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(РелизПроверяемый,".");
	мсРелизПроверяющий = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(РелизПроверяющий,".");
	
	чПроверяемый = 0;
	чПроверяющий = 0;
	
	Попытка
		
		Для Каждого Элемент Из мсРелизПроверяемый Цикл
			чПроверяемый = чПроверяемый * 100 + Число(Элемент)
		КонецЦикла;
		Для Каждого Элемент Из мсРелизПроверяющий Цикл
			чПроверяющий = чПроверяющий * 100 + Число(Элемент)
		КонецЦикла;
		
		Возврат чПроверяемый < чПроверяющий;
		
	Исключение 
		Возврат Ложь;
	КонецПопытки;
КонецФункции

#Область УниверсальныеКоллекции

// Возвращает значение реквизита или свойства объекта.
//
// Параметры:
//  Объект				 - Произвольный	 - Объект, предполагающий доступ по [] к атрибутам объекта.
//  Свойство			 - Строка		 - Имя свойства.
//  ЗначениеПоУмолчанию	 - Произвольный	 - Значение по умолчанию, если свойства нет у объекта.
// 
// Возвращаемое значение:
//  Произвольный.
//
Функция СвойствоОбъекта(Объект, Свойство, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если Объект = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, Свойство) Тогда
		Возврат Объект[Свойство];
	Иначе
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
КонецФункции

// Инициализирует новый массив заданными значениями
//
// Параметры:
//  Значение1	 - Произвольный	 - значение инициализации.
//  Значение2	 - Произвольный	 - значение инициализации.
//  Значение3	 - Произвольный	 - значение инициализации.
//  Значение4	 - Произвольный	 - значение инициализации.
//  Значение5	 - Произвольный	 - значение инициализации.
//  Значение6	 - Произвольный	 - значение инициализации.
//  Значение7	 - Произвольный	 - значение инициализации.
//  Значение8	 - Произвольный	 - значение инициализации.
//  Значение9	 - Произвольный	 - значение инициализации.
//  Значение10	 - Произвольный	 - значение инициализации.
// 
// Возвращаемое значение:
//  Массив.
//
Функция НовыйМассив(Значение1 = Неопределено, Значение2 = Неопределено, Значение3 = Неопределено, Значение4 = Неопределено, Значение5 = Неопределено,
					Значение6 = Неопределено, Значение7 = Неопределено, Значение8 = Неопределено, Значение9 = Неопределено, Значение10 = Неопределено) Экспорт
	
	Массив = Новый Массив;
	
	Если Значение1 <> Неопределено Тогда
		Массив.Добавить(Значение1);
	КонецЕсли;
	
	Если Значение2 <> Неопределено Тогда
		Массив.Добавить(Значение2);
	КонецЕсли;
	
	Если Значение3 <> Неопределено Тогда
		Массив.Добавить(Значение3);
	КонецЕсли;
	
	Если Значение4 <> Неопределено Тогда
		Массив.Добавить(Значение4);
	КонецЕсли;
	
	Если Значение5 <> Неопределено Тогда
		Массив.Добавить(Значение5);
	КонецЕсли;
	
	Если Значение6 <> Неопределено Тогда
		Массив.Добавить(Значение6);
	КонецЕсли;
	
	Если Значение7 <> Неопределено Тогда
		Массив.Добавить(Значение7);
	КонецЕсли;
	
	Если Значение8 <> Неопределено Тогда
		Массив.Добавить(Значение8);
	КонецЕсли;
	
	Если Значение9 <> Неопределено Тогда
		Массив.Добавить(Значение9);
	КонецЕсли;
	
	Если Значение10 <> Неопределено Тогда
		Массив.Добавить(Значение10);
	КонецЕсли;
	
	Возврат Массив
	
КонецФункции

// Дает новый массив, полученный сортировкой исходного, не меняя исходный массив.
//
// Параметры:
//  Массив		 - Массив - исходный массив для сортировки. Не изменяется.
//  Направление	 - НаправлениеСортировки	 - направление сортировки (по умолчанию в порядке возрастания).
// 
// Возвращаемое значение:
//  Массив - отсортированный массив.
//
Функция СортироватьМассивПоПредставлению(Знач Массив, Знач Направление = Неопределено) Экспорт
	
	Если Направление = Неопределено Тогда
		Направление = НаправлениеСортировки.Возр
	КонецЕсли;
	
	Список = Новый СписокЗначений; 
	Список.ЗагрузитьЗначения(Массив);
	Список.СортироватьПоПредставлению(Направление);
	МассивОтсортированный = Список.ВыгрузитьЗначения();
	
	Возврат МассивОтсортированный;
	
КонецФункции

// Дает новый массив, полученный сортировкой исходного, не меняя исходный массив.
//
// Параметры:
//  Массив		 - Массив - исходный массив для сортировки. Не изменяется.
//  Направление	 - НаправлениеСортировки	 - направление сортировки (по умолчанию в порядке возрастания).
// 
// Возвращаемое значение:
//  Массив - отсортированный массив.
//
Функция СортироватьМассивПоЗначению(Знач Массив, Знач Направление = Неопределено) Экспорт
	
	Если Направление = Неопределено Тогда
		Направление = НаправлениеСортировки.Возр
	КонецЕсли;
	
	Список = Новый СписокЗначений; 
	Список.ЗагрузитьЗначения(Массив);
	Список.СортироватьПоЗначению(Направление);
	МассивОтсортированный = Список.ВыгрузитьЗначения();
	
	Возврат МассивОтсортированный;
	
КонецФункции

// Процедура добавляет данные из одной структуры в другую.
//
// Параметры:
//  Приемник - структура в которую добавляется данные.
//  Источник - структуры из которой берутся данные.
//  СписокПолей - Строка - имена полей источника разделенных запятыми,
//                         если пустая строка, то переносятся все поля.
//
Процедура ДобавитьВСтруктуру(Приемник, Знач Источник, Знач СписокПолей = "") Экспорт
	
	ВсеПоля = Истина;
	Если Не ПустаяСтрока(СписокПолей) Тогда
		ВсеПоля = Ложь;
		СписокПолей = Новый Структура(СписокПолей);
	КонецЕсли;
	
	ТипИсточника = ТипЗнч(Источник);
	Если ТипИсточника = Тип("Структура")
	 Или ТипИсточника = Тип("ФиксированнаяСтруктура") Тогда
		Для Каждого КлючИЗначение Из Источник Цикл
			Если ВсеПоля Или СписокПолей.Свойство(КлючИЗначение.Ключ) Тогда
				Приемник.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТипИсточника = Тип("СтрокаТаблицыЗначений") Тогда
		Колонки = Источник.Владелец().Колонки;
		Для Каждого Колонка Из Колонки Цикл
			Если ВсеПоля Или СписокПолей.Свойство(Колонка.Имя) Тогда
				Приемник.Вставить(Колонка.Имя, Источник[Колонка.Имя]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Первая строка, найденная по отбору таблицы.
//
// Параметры:
//  Таблица	 - ТаблицаЗначений, ДанныеФормыКоллекция - Таблица, поддерживающая метод НайтиСтроки(СтруктураОтбора).
//  Отбор	 - Структура	 - Отбор строк.
// 
// Возвращаемое значение:
//   - СтрокатаблицыЗначений, Неопределено.
//
Функция ПерваяСтрокаОтбораТаблицы(Таблица, Отбор) Экспорт
	
	НайденныеСтроки = Таблица.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Пересечение массивов. Результат - новый массив, с элементами, имеющимися в обоих исходных.
//
// Параметры:
//  Массив1	 - Массив	 - первый.
//  Массив2	 - Массив	 - второй.
// 
// Возвращаемое значение:
//  Массив.
//
Функция ПересечениеМассивов(Массив1, Массив2) Экспорт
	
	Пересеченение = Новый Массив;
	
	Для Каждого ЭлементМассива Из Массив1 Цикл
		Если Массив2.Найти(ЭлементМассива) <> Неопределено Тогда
			Пересеченение.Добавить(ЭлементМассива);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Пересеченение;
	
КонецФункции

// Сравнивает два массива однотипных значений (кроме коллекций значений)
//
// Параметры:
//  ПервыйМассив - Массив	 - исходный массив
//  ВторойМассив - Массив	 - сравниваемые массивы
// 
// Возвращаемое значение:
//  Булево.
//
Функция МассивыИдентичны(ПервыйМассив,ВторойМассив) Экспорт

    ЭлементовМассива = ПервыйМассив.Количество();
	МассивыСовпадают = (ЭлементовМассива = ВторойМассив.Количество()); 
	  
	Если МассивыСовпадают Тогда
		Для Сч = 1 По ЭлементовМассива Цикл
			Если ПервыйМассив[Сч-1] <> ВторойМассив[Сч-1] Тогда
				Возврат Ложь
			КонецЕсли;
		КонецЦикла; 		
	КонецЕсли;

	Возврат МассивыСовпадают

КонецФункции // МассивыИдентичны()

#КонецОбласти

#Область Комбинаторика

Функция ПолучитьСочетанияЭлементовМассива(ИсходныйМассив, КоличествоЭлементовВСочетании) Экспорт
	
	ВсегоЭлементов = ИсходныйМассив.Количество();
	Если КоличествоЭлементовВСочетании > ВсегоЭлементов Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИтоговыйМассив = Новый Массив;
	
	МассивИндексов = Новый Массив;
	Для сч = 0 По ВсегоЭлементов-1 Цикл
		МассивИндексов.Добавить(сч);
	КонецЦикла;
	
	ДобавитьВИтоговыйМассив(ИтоговыйМассив, ИсходныйМассив, МассивИндексов, КоличествоЭлементовВСочетании);
	Пока СледующийНабор(МассивИндексов, ВсегоЭлементов, КоличествоЭлементовВСочетании) Цикл
		ДобавитьВИтоговыйМассив(ИтоговыйМассив, ИсходныйМассив, МассивИндексов, КоличествоЭлементовВСочетании);
	КонецЦикла;
	
	Возврат ИтоговыйМассив;
	
КонецФункции

Процедура ДобавитьВИтоговыйМассив(ИтоговыйМассив, ИсходныйМассив, МассивИндексов, КоличествоЭлементовВСочетании)
	
	МассивСочетания = Новый Массив;
	Для сч = 0 По КоличествоЭлементовВСочетании - 1 Цикл
		МассивСочетания.Добавить(ИсходныйМассив[МассивИндексов[сч]]);
	КонецЦикла;
	ИтоговыйМассив.Добавить(МассивСочетания);
	
КонецПроцедуры

Функция СледующийНабор(МассивИндексов, ВсегоЭлементов, КоличествоЭлементовВСочетании)
	
	сч = КоличествоЭлементовВСочетании - 1;
	Пока сч >= 0 Цикл
		Если МассивИндексов[сч] < ВсегоЭлементов - КоличествоЭлементовВСочетании + сч Тогда
			МассивИндексов[сч] = МассивИндексов[сч] + 1;
			Для сч1 = сч + 1 По КоличествоЭлементовВСочетании - 1 Цикл
				МассивИндексов[сч1] = МассивИндексов[сч1 - 1] + 1;				
			КонецЦикла;
			Возврат Истина
		КонецЕсли;
		сч = сч - 1
	КонецЦикла;
	Возврат Ложь
	
КонецФункции

#КонецОбласти

Процедура ДобавитьРасшифровки(ТабличныйДокумент) Экспорт
	
	Области = Новый Соответствие;
	КоличествоКолонок = ТабличныйДокумент.ШиринаТаблицы;
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ИндивидуальнаяШиринаСтрок = СтроковыеФункцииКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.3.22.0") >= 0;
	
	Для Строка = 1 По ТабличныйДокумент.ВысотаТаблицы Цикл
		Если ИндивидуальнаяШиринаСтрок Тогда
			ОбластьСтроки = ТабличныйДокумент.Область(СтрШаблон("R%1", Строка));
			КоличествоКолонок = ОбластьСтроки.ФорматСтрок.КоличествоКолонок;
		КонецЕсли;
		
		Для Колонка = 1 По КоличествоКолонок Цикл
			ТекОбласть = ТабличныйДокумент.Область(Строка, Колонка);
			
			Если Области.Получить(ТекОбласть.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Области.Вставить(ТекОбласть.Имя, Ложь);
			
			Если ЗначениеЗаполнено(ТекОбласть.ПараметрРасшифровки) Тогда
				ТекОбласть.Расшифровка = Новый Структура("ПараметрРасшифровки", ТекОбласть.ПараметрРасшифровки);
				Продолжить;
			КонецЕсли;
			
			СтрокаПараметров = Неопределено;
			Если ТабличныйДокумент.ПолучитьОбласть(ТекОбласть.Имя).Параметры.Количество() > 0 Тогда
				Если ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Шаблон Тогда
					СтрокаПараметров = ТекОбласть.Текст;
				ИначеЕсли ТекОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Параметр Тогда
					СтрокаПараметров = ТекОбласть.Параметр;
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаПараметров = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Синонимы = Неопределено;
			СпискиВыбора = Неопределено;
			ИмяФормыЗаполнения = Неопределено;
			СтандартнаяОбработка = Ложь;
			
			Если ЗначениеЗаполнено(ТекОбласть.Примечание.Текст) Тогда
				Попытка
					ДанныеПримечания = ОбщегоНазначенияПереопределяемый.ПрочитатьСтрокуJSON(ТекОбласть.Примечание.Текст, Истина);
					Синонимы = ДанныеПримечания.Получить("Синонимы");
					СпискиВыбора = ДанныеПримечания.Получить("СпискиВыбора");
					ТекОбласть.Примечание.Текст = ДанныеПримечания.Получить("Примечание");
					ИмяФормыЗаполнения = ДанныеПримечания.Получить("ИмяФормыЗаполнения");
					СтандартнаяОбработка = ДанныеПримечания.Получить("СтандартнаяОбработка") = Истина;
				Исключение КонецПопытки;
			КонецЕсли;
			
			Если СтандартнаяОбработка Тогда
				Продолжить;
			КонецЕсли;
			
			Если Синонимы = Неопределено Тогда
				Синонимы = Новый Соответствие;
			КонецЕсли;
			
			Если СпискиВыбора = Неопределено Тогда
				СпискиВыбора = Новый Соответствие;
			КонецЕсли;
			
			ТекОбласть.Расшифровка = Новый Структура("СтрокаПараметров, Синонимы, СпискиВыбора, ИмяФормыЗаполнения", СтрокаПараметров, Синонимы, СпискиВыбора, ИмяФормыЗаполнения);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Дает массив элементов коллекции, удовлетворяющих отбору.
//
// Параметры:
//  Коллекция	 - Массив - коллекция, содержащая элементы с атрибутами, соответсвующими ключам отбора.
//  Отбор		 - Структура - отбор элементов коллекции.
// 
// Возвращаемое значение:
//  Массив из Произвольный - массив элементов коллекции.
//
Функция НайтиСтрокиКоллекции(Коллекция, Отбор) Экспорт
	
	НайденныеСтроки = Новый Массив;
	
	Для Каждого СтрокаКоллекции Из Коллекция Цикл
		СоответствуетОтборам = Истина;
		
		Для Каждого ЭлементОтбора Из Отбор Цикл
			Если СтрокаКоллекции[ЭлементОтбора.Ключ] <> ЭлементОтбора.Значение Тогда
				СоответствуетОтборам = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СоответствуетОтборам Тогда
			НайденныеСтроки.Добавить(СтрокаКоллекции);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НайденныеСтроки;
	
КонецФункции

// Находит первый элемент коллекции, удовлетворяющий отбору.
//
// Параметры:
//  Коллекция	 - Массив - коллекция, содержащая элементы с атрибутами, соответсвующими ключам отбора.
//  Отбор		 - Структура - отбор элементов коллекции.
// 
// Возвращаемое значение:
//  Произвольный - элемент коллекции.
//
Функция НайтиСтрокуКоллекции(Коллекция, Отбор) Экспорт
	
	СтрокиПоОтбору = НайтиСтрокиКоллекции(Коллекция, Отбор);
	
	Если СтрокиПоОтбору.Количество() <> 0 Тогда
		Возврат СтрокиПоОтбору[0];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ТипыДанныхСовпадают(Знач СписокТипов1, Знач СписокТипов2) Экспорт
	
	Если ТипЗнч(СписокТипов1) <> Тип("Массив") Тогда
		Если ТипЗнч(СписокТипов1) <> Тип("Тип") Тогда
			СписокТипов1 = ТипЗнч(СписокТипов1);
		КонецЕсли;
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(СписокТипов1);
		СписокТипов1 = МассивТипов;
	КонецЕсли;
	
	Если ТипЗнч(СписокТипов2) <> Тип("Массив") Тогда
		Если ТипЗнч(СписокТипов2) <> Тип("Тип") Тогда
			СписокТипов2 = ТипЗнч(СписокТипов2);
		КонецЕсли;
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(СписокТипов2);
		СписокТипов2 = МассивТипов;
	КонецЕсли;
	
	Для Каждого Тип1 Из СписокТипов1 Цикл
		Для Каждого Тип2 Из СписокТипов2 Цикл
			Если Тип1 = Тип2 Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

// КОРП
Процедура ВосстановитьПорядокНайденныхСтрок(НайденныеСтроки, Таблица) Экспорт
	
	ОбщегоНазначенияСервер.ВосстановитьПорядокНайденныхСтрок(НайденныеСтроки, Таблица);
	
КонецПроцедуры

// Период дат строкой, например, для использования в СКД отчетов.
//
// Параметры:
//  ДатаНачала		 - Дата	 - начало периода.
//  ДатаОкончания	 - Дата	 - конец периода.
//  ФорматнаяСтрока	 - Строка	 - форматная строка для представления дат периода.
//  Разделитель		 - Строка	 - разделитель между датами.
// 
// Возвращаемое значение:
//  Строка - период из двух дат.
//
Функция ВернутьСтрокойПериодДат(ДатаНачала, ДатаОкончания, ФорматнаяСтрока = "ДФ=dd.MM.yy", Разделитель = " - ") Экспорт
	
	Строка = "";
	Если ЗначениеЗаполнено(ДатаНачала) И ТипЗнч(ДатаНачала) = Тип("Дата") Тогда
		Строка = Формат(ДатаНачала,ФорматнаяСтрока);
	КонецЕсли;
	Строка = Строка + Разделитель;
	Если ЗначениеЗаполнено(ДатаОкончания) И ТипЗнч(ДатаОкончания) = Тип("Дата")  Тогда
		Строка = Строка + Формат(ДатаОкончания,ФорматнаяСтрока);
	КонецЕсли;
	Возврат Строка;
	
КонецФункции

// Установить параметр данных компоновки, если он отличается от нового значения.
// Предназначено для уменьшения неявных серверных вызовов при интерктивном редактировании 
// параметров произвольной формы с динамическим списком.
//
// Параметры:
//  Параметры		 - ПараметрыДанныхКомпоновкиДанных - Параметры.
//  ИмяПараметра	 - Строка - Имя устанавливаемого параметра.
//  НовоеЗначение	 - Произвольный - Новое значение параметра.
//
Процедура УстановитьПараметрКомпоновкиЕслиИзменился(Параметры, ИмяПараметра, НовоеЗначение) Экспорт
	
	// Сначала определяется текущее значение параметра, чтобы, если оно не изменилось, не выполнять дальше.
	ЗначениеПараметраКомпоновки = Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(ИмяПараметра));
	Если ЗначениеПараметраКомпоновки <> Неопределено
		И ЗначениеПараметраКомпоновки.Значение = НовоеЗначение
	Тогда
		Возврат;
	КонецЕсли;
	
	// Установка значения
	Параметры.УстановитьЗначениеПараметра(ИмяПараметра, НовоеЗначение);
	
КонецПроцедуры

#Область ДатаВремя

// Вычисляет количество лет, месяцев и дней между двумя датами.
//
// Параметры:
//   Дата1 -Дата - первая дата (более поздняя, часто текущая, стаж определяется по состоянию на эту дату).
//   Дата2 - Дата - вторая дата (ранняя дата, с нее начинается "течение" стажа).
//   Лет - Число - возвращается по ссылке кол-во лет между двумя датами (Дата1-Дата2).
//   Месяцев - Число - возвращается по ссылке кол-во месяцев между двумя датами (Дата1-Дата2).
//   Дней - Число - возвращается по ссылке кол-во дней между двумя датами (Дата1-Дата2).
Процедура РазобратьРазностьДат(Дата1, Дата2, Лет = 0, Месяцев = 0, Дней = 0)
	
	Лет		= 0;
	Месяцев	= 0;
	Дней	= 0;
	Если Дата1 > Дата2 Тогда
		
		ВременнаяДата = Дата1;
		Если День(ВременнаяДата) < День(Дата2) Тогда
			Дней = (ВременнаяДата - ДобавитьМесяц(ВременнаяДата,-1))/86400;
			ВременнаяДата = ДобавитьМесяц(ВременнаяДата,-1);
		КонецЕсли;
		Если Месяц(ВременнаяДата) < Месяц(Дата2) Тогда
			ВременнаяДата = ДобавитьМесяц(ВременнаяДата,-12);
			Месяцев = 12;
		КонецЕсли;
		Лет		= Макс(			 Год(ВременнаяДата)		- Год(Дата2),	0);
		Месяцев	= Макс(Месяцев	+ Месяц(ВременнаяДата)	- Месяц(Дата2),	0);
		Дней	= Макс(Дней		+ День(ВременнаяДата)	- День(Дата2),	0);
		
		// Скорректируем отображаемое значение, если "вмешалось" разное количество дней в месяцах.
		Если НачалоДня(Дата2) <> НачалоДня((ДобавитьМесяц(Дата1,-Лет*12-Месяцев)-Дней*86400)) Тогда
			Дней = Дней + (День(КонецМесяца(Дата2)) - День(НачалоМесяца(Дата2))) - (День(КонецМесяца(ДобавитьМесяц(Дата1,-1))) - День(НачалоМесяца(ДобавитьМесяц(Дата1,-1))));
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ТабличныйДокумент

Процедура УдалитьРисунокИзТабличногоДокумента(ТабличныйДокумент, ИмяРисунка) Экспорт
	
	Для Каждого Рисунок Из ТабличныйДокумент.Рисунки Цикл
		Если Рисунок.Имя = ИмяРисунка Тогда
			ТабличныйДокумент.Рисунки.Удалить(Рисунок);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьПримечанияИРасшифровкиИзТабличногоДокументаПередПодписанием(ТабличныйДокумент) Экспорт
	
	Области = Новый Массив;
	КоличествоКолонок = ТабличныйДокумент.ШиринаТаблицы;
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ИндивидуальнаяШиринаСтрок = СтроковыеФункцииКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.3.22.0") >= 0;
	
	Для Строка = 1 По ТабличныйДокумент.ВысотаТаблицы Цикл
		Если ИндивидуальнаяШиринаСтрок Тогда
			ОбластьСтроки = ТабличныйДокумент.Область(СтрШаблон("R%1", Строка));
			КоличествоКолонок = ОбластьСтроки.ФорматСтрок.КоличествоКолонок;
		КонецЕсли;
		
		Для Колонка = 1 По КоличествоКолонок Цикл
			ТекОбласть = ТабличныйДокумент.Область(Строка, Колонка);
			
			Если Области.Найти(ТекОбласть.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Области.Добавить(ТекОбласть.Имя);
			
			ТекОбласть.Примечание.Текст = "";
			Если Не (ЗначениеЗаполнено(ТекОбласть.Расшифровка)
					И ТипЗнч(ТекОбласть.Расшифровка) = Тип("Структура")
					И ТекОбласть.Расшифровка.Свойство("ПараметрРасшифровки"))
			Тогда
				ТекОбласть.Расшифровка = Неопределено;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Ищет в тексте параметры, заключенные в определенные символы, скобки
//
// Параметры:
//  Текст					 - Строка - Текст, в котором необходимо найти параметры
//  НачалоПараметра			 - Строка - Начальный символ параметра, например '<', '[' и т.д
//  КонецПараметра			 - Строка - Конечный символ параметра
//  ПроверятьКорректность	 - Булево - Определяет необходимость проверки имени найденного параметра на соответствие
//                                    требованиям платформы
//  ТолькоСамыеВложенные	 - Булево - Если в тексте имеются вложенные параметры, определяют, будут ли возвращены все или
//                                   только последние
// 
// Возвращаемое значение:
// 	Массив из Неопределено - Массив структур с полями 'Начало' - номер символа в тексте, 'Конец', 'ИмяПараметра',
//          'ИмяПараметраИсходное', 'ПараметрКорректен'
//
Функция НайтиПараметрыВТексте(Знач Текст, Знач НачалоПараметра = "<", Знач КонецПараметра = ">", ПроверятьКорректность = Истина, ТолькоСамыеВложенные = Истина) Экспорт 
	
	СписокПараметров = Новый Массив;
	СтекПараметров = Новый Массив;
	
	НачалоПараметра = Лев(НачалоПараметра, 1);
	КонецПараметра = Прав(КонецПараметра, 1);
	
	ДлинаТекста = СтрДлина(Текст);
	СтруктураПараметра = Неопределено;
	Для Сч = 1 По ДлинаТекста Цикл
		
		ТекСимвол = Сред(Текст, Сч, 1);
		Если ТекСимвол = НачалоПараметра Тогда
			СтруктураПараметра = Новый Структура("Начало, Конец, ИмяПараметра, ИмяПараметраИсходное, ПараметрКорректен", Сч, Сч, "", "", Истина);
			СтекПараметров.Добавить(СтруктураПараметра);
		ИначеЕсли ТекСимвол = КонецПараметра Тогда 
			Если СтекПараметров.Количество() > 0 Тогда 
				СтруктураПараметра = СтекПараметров[СтекПараметров.ВГраница()];
				СтруктураПараметра.Конец = Сч;
				
				ИмяПараметра = Сред(СтруктураПараметра.ИмяПараметра, 2, СтрДлина(СтруктураПараметра.ИмяПараметра) - 1);
				Если Не ПустаяСтрока(ИмяПараметра) Тогда 
					СписокПараметров.Добавить(СтруктураПараметра);
					СтруктураПараметра.ИмяПараметраИсходное = ИмяПараметра;
					СтруктураПараметра.ИмяПараметра = ИмяПараметра;
					Если ПроверятьКорректность И Не ИмяПараметраКорректно(ИмяПараметра) Тогда
						КорректноеИмяПараметра = ПривестиИмяПараметраКДопустимому(ИмяПараметра);
						СтруктураПараметра.ИмяПараметра = КорректноеИмяПараметра;
						СтруктураПараметра.ПараметрКорректен = (НРег(СтруктураПараметра.ИмяПараметра) = НРег(СтруктураПараметра.ИмяПараметраИсходное));
					КонецЕсли;
				Иначе
					СтруктураПараметра.ПараметрКорректен = Ложь;	
				КонецЕсли;
				
				СтруктураПараметра = Неопределено;
				Если ТолькоСамыеВложенные Тогда 
					СтекПараметров.Очистить();
				Иначе
					СтекПараметров.Удалить(СтекПараметров.ВГраница());
					Если СтекПараметров.Количество() > 0 Тогда 
						СтруктураПараметра = СтекПараметров[СтекПараметров.ВГраница()];
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Для Каждого ЭлементСтека Из СтекПараметров Цикл 
			ЭлементСтека.ИмяПараметра = ЭлементСтека.ИмяПараметра + ТекСимвол;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СписокПараметров;
	
КонецФункции

// Возвращает приведенное имя параметра, удовлетворяющее требованиям платформы, например, для использования в качестве
// ключа структуры.
//
// Параметры:
//  ИмяПараметра - Строка - имя параметра.
//
// Возвращаемое значение:
//  Строка - приведенное имя параметра.
//
Функция ПривестиИмяПараметраКДопустимому(Знач ИмяПараметра) Экспорт
	
	БуквыРус	= Новый Структура("Начало, Конец", КодСимвола("А"), КодСимвола("я"));
	БуквыАнг	= Новый Структура("Начало, Конец", КодСимвола("A"), КодСимвола("z"));
	Цифры		= Новый Структура("Начало, Конец", КодСимвола("0"), КодСимвола("9"));
	мсОтдельныеСимволы = Новый Массив;
	мсОтдельныеСимволы.Добавить(КодСимвола("_"));

	ПриведенноеИмя = "";
	ДлинаСтроки = СтрДлина(ИмяПараметра);
	НачалоСтроки = Истина;
	СледующийСимволБольшой = Ложь;
	Для Сч = 1 По ДлинаСтроки Цикл
		
		ТекСимвол = Сред(ИмяПараметра, Сч, 1);
		КодТекСимвола = КодСимвола(ТекСимвол);
		Если 
			(КодТекСимвола >= БуквыРус.Начало И КодТекСимвола <= БуквыРус.Конец) Или
			(КодТекСимвола >= БуквыАнг.Начало И КодТекСимвола <= БуквыАнг.Конец) Или
			(Не НачалоСтроки И КодТекСимвола >= Цифры.Начало И КодТекСимвола <= Цифры.Конец) Или
			(мсОтдельныеСимволы.Найти(КодТекСимвола) <> Неопределено)
		Тогда
		
			ПриведенноеИмя = ПриведенноеИмя + ?(СледующийСимволБольшой, ВРег(ТекСимвол), ТекСимвол);
			НачалоСтроки = Ложь;
			СледующийСимволБольшой = Ложь;
			
		Иначе
			
			СледующийСимволБольшой = Истина;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПриведенноеИмя;
	
КонецФункции

// Проверяет, удовлетворяет ли имя параметра требованиям платформы, например, для использования в качестве
// ключа структуры.
//
// Параметры:
//  ИмяПараметра - Строка - Имя параметра, переменной.
// 
// Возвращаемое значение:
// 	Булево - Истина, если имя переменной удовлетворяет требованиям платформы.
//
Функция ИмяПараметраКорректно(ИмяПараметра) Экспорт 
	
	СтруктураДляПроверки = Новый Структура;
	Попытка
		СтруктураДляПроверки.Вставить(ИмяПараметра);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область РаботаСJSON

Функция ПрочитатьСтрокуJSON(СтрокаJSON, ПрочитатьВСоответствие = Ложь) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Возврат ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
	
КонецФункции

Функция СформироватьСтрокуJSON(Значение) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
	ЗаписатьJSON(ЗаписьJSON, Значение, , "ПреобразованиеJSON", ОбщегоНазначенияБИТКлиентСервер);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ПреобразованиеJSON(Знач Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	Возврат XMLСтрока(Значение);
	
КонецФункции

#КонецОбласти

#КонецОбласти
