Функция ОтправитьСообщение(Тема, Тело) Экспорт
	
	ТекстОшибки = "";
	
	Если ДостигнутоДопустимоеКоличествоОтправокЗапроса() Тогда
		ТекстОшибки = "Достигнуто допустимое количество отправленных запросов за сегодняшний день: %1";
		ТекстОшибки = СтрШаблон(ТекстОшибки, ДопустимоеКоличествоЗапросовНаДень());
	Иначе
		ПараметрыПисьма = Новый Структура;
		ИмяОтправителяПисем = НСтр("ru = 'auto sendler LK'");
		
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Письмо.Тема = Тема;
		Текст = Письмо.Тексты.Добавить(Тело);
		Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
		
		Получатель = Письмо.Получатели.Добавить("d.pismak@divera.kz");
		Получатель.ОтображаемоеИмя = ИмяОтправителяПисем;
		
		Письмо.ИмяОтправителя = "btimed_auto";
		Письмо.Отправитель.ОтображаемоеИмя = ИмяОтправителяПисем;
		Письмо.Отправитель.Адрес = "divera.mis.sender@mail.ru";

		ИнтернетПочта = Новый ИнтернетПочта;
			
		Профиль = Новый ИнтернетПочтовыйПрофиль;

		Профиль.АдресСервераSMTP = "smtp.mail.ru";
		Профиль.ПортSMTP         = 465;
		Профиль.ИспользоватьSSLSMTP = Истина;

	    Профиль.Таймаут = 15;
		Профиль.ПользовательSMTP = "divera.mis.sender@mail.ru";
		
		Профиль.ПарольSMTP = Key();
		Попытка
			ИнтернетПочта.Подключиться(Профиль);
			ИнтернетПочта.Послать(Письмо);
		Исключение
			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция Key()
	Возврат "VHiHZQIbeWgGc3OBw7CQ"; // HFkd41VYD4rBsS2CnFMg
КонецФункции

Функция ДостигнутоДопустимоеКоличествоОтправокЗапроса()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОтправки", НачалоДня(ТекущаяДата()));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбращенияВТехПоддержкуБИТ.УИДСообщения КАК УИДСообщения
	|ИЗ
	|	РегистрСведений.ОбращенияВТехПоддержкуБИТ КАК ОбращенияВТехПоддержкуБИТ
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ОбращенияВТехПоддержкуБИТ.ДатаОтправки, ДЕНЬ) = &ДатаОтправки"
	;
	
	Выб = Запрос.Выполнить().Выбрать();
	
	Количество = Выб.Количество();
	
	Возврат Количество >= ДопустимоеКоличествоЗапросовНаДень();
	
КонецФункции

Функция ДопустимоеКоличествоЗапросовНаДень()
	
	Возврат 10;
	
КонецФункции
