
Процедура ПередЗаписью(Отказ, Замещение)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ПоследняяЗапись = ЭтотОбъект.Получить(ЭтотОбъект.Количество() -1);
	ДатаСообщения = ПоследняяЗапись.ДатаСообщения;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПоследниеСообщенияЧатов.Чат КАК Чат,
	               |	iga_ПоследниеСообщенияЧатов.ДатаСообщения КАК ДатаСообщения
	               |ИЗ
	               |	РегистрСведений.iga_ПоследниеСообщенияЧатов КАК iga_ПоследниеСообщенияЧатов
	               |ГДЕ
	               |	iga_ПоследниеСообщенияЧатов.Чат = &Чат
	               |	И iga_ПоследниеСообщенияЧатов.ЭтоВходящее = &ЭтоВходящее";
	Запрос.УстановитьПараметр("Чат", ЭтотОбъект.Отбор.Чат.Значение);
	Запрос.УстановитьПараметр("ЭтоВходящее", ПоследняяЗапись.ЭтоВходящее);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ДатаСообщения > ДатаСообщения Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	ЗаписьНового = РегистрыСведений.iga_ПоследниеСообщенияЧатов.СоздатьМенеджерЗаписи();
	ЗаписьНового.Чат = ЭтотОбъект.Отбор.Чат.Значение;
	ЗаписьНового.ДатаСообщения = ДатаСообщения;
	ЗаписьНового.ЭтоВходящее = ПоследняяЗапись.ЭтоВходящее;
	ЗаписьНового.Записать();
	
КонецПроцедуры
