
&НаКлиенте
Перем соотвКешИзображенийШаблонов;

&НаКлиенте
Перем ТегиРазрешающиеВставкуПараметров;

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = Новый Структура;
	Настройки.Вставить("МакетСтационара", Новый ХранилищеЗначения(ТекстРедактораHTML, Новый СжатиеДанных(9)));
	
	Ключ = "_" + СтрЗаменить(Параметры.Шаблон.УникальныйИдентификатор(), "-", "");
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("омг_ШаблоныHTML", Новый ХранилищеЗначения(Настройки, Новый СжатиеДанных(9)), 
		Ключ);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокИзображенийПоШаблону(ДокументHTML, Знач соотвКешИзображенийШаблонов)
	
	ЭтоWinXP = РаботаСШаблонамиHTMLКлиентСервер.ЭтоWindowsXP();
	
	СписокИзображений.Очистить();
	
	СписокЭлементов = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоИмени(ДокументHTML, "IMG", Истина);
	Для Каждого ЭлементКартинка Из СписокЭлементов Цикл
		
		Если Не ЗначениеЗаполнено(ЭлементКартинка.id)
			Или ЭлементКартинка.ЕстьАтрибут("data-bit-selected-img-id")
		Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементКартинка.src = "";
		СтруктураКартинки = соотвКешИзображенийШаблонов.Получить(ЭлементКартинка.id);
		
		Если СтруктураКартинки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = СписокИзображений.Добавить();
		НоваяСтрока.Идентификатор = СтруктураКартинки.Идентификатор;
		НоваяСтрока.Расширение = СтруктураКартинки.Расширение;
		
		Если ЭтоWinXP Тогда
			Base64Картинки = РаботаСHTMLКлиентСервер.ПолучитьДанныеИзBase64КартинкиHTML(СтруктураКартинки.АдресВХранилище);
		Иначе
			ДанныеКартинка = ПолучитьИзВременногоХранилища(СтруктураКартинки.АдресВХранилище);
			ДвоичныеДанныеКартинки = ДанныеКартинка;
			Если ТипЗнч(ДанныеКартинка) = Тип("Картинка") Тогда
				ДвоичныеДанныеКартинки = ДанныеКартинка.ПолучитьДвоичныеДанные();
			КонецЕсли;
			Base64Картинки = Base64Строка(ДвоичныеДанныеКартинки);
		КонецЕсли;
		
		НоваяСтрока.ИзображениеBase64 = Base64Картинки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ТекстРедактораHTML = "<html>" + Элементы.Документ.Документ.body.outerHTML + "</html>";
	
	ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM(ТекстРедактораHTML);

	ЗаполнитьСписокИзображенийПоШаблону(ДокументHTML, соотвКешИзображенийШаблонов);
	
	ОКНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	УстановитьПривилегированныйРежим(Истина);

	Ключ = "_" + СтрЗаменить(Параметры.Шаблон.УникальныйИдентификатор(), "-", "");
	
	Настройки = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ШаблоныHTML", Ключ);
	Если Не Настройки = Неопределено Тогда
		Настройки = Настройки.Получить();
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Настройки,);
		Если Настройки.Свойство("МакетСтационара") Тогда
			ТекстРедактораHTML = Настройки.МакетСтационара.Получить();
		Иначе
			ТекстРедактораHTML = Обработки.доп_ВыписнойЭпикриз.ПолучитьМакет("Шаблон").ПолучитьТекст();
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СписокШаблонов = Новый Массив;
	СписокШаблонов.Добавить(Параметры.Шаблон);
	РаботаСШаблонамиHTMLКлиентСервер.ИнициализироватьНастройкиИзображенийПриема(соотвКешИзображенийШаблонов, СписокШаблонов, ЭтаФорма.УникальныйИдентификатор);
	
	ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM(ТекстРедактораHTML);
	
	РаботаСШаблонамиHTMLКлиентСервер.ЗагрузитьИзображенияПриема(ДокументHTML, соотвКешИзображенийШаблонов, ЭтаФорма.УникальныйИдентификатор);
	
	ТекстРедактораHTML = "<html><body>" + РаботаСDOMКлиентСервер.ПолучитьКодТелаHTMLИзДокументаDOM(ДокументHTML) + "</body></html>";
	
	ТекПараметрВставлятьЗаголовок = Истина;
	ТекПараметрСНовойСтроки = Истина;

	ТегиРазрешающиеВставкуПараметров = Новый Массив;
	ТегиРазрешающиеВставкуПараметров.Добавить("div");
	ТегиРазрешающиеВставкуПараметров.Добавить("p");
	ТегиРазрешающиеВставкуПараметров.Добавить("body");
	ТегиРазрешающиеВставкуПараметров.Добавить("html");
	ТегиРазрешающиеВставкуПараметров.Добавить("td");
	ТегиРазрешающиеВставкуПараметров.Добавить("span");
КонецПроцедуры

&НаКлиенте
Процедура ДокументДокументСформирован(Элемент)
	
	Элементы.Документ.Документ.body.contentEditable = "true";
	Элементы.Документ.Документ.designMode = "On";

КонецПроцедуры


&НаСервере
Процедура СтандартныйМакетНаСервере()
	
	ТекстРедактораHTML = Обработки.доп_ВыписнойЭпикриз.ПолучитьМакет("Шаблон").ПолучитьТекст();
	
КонецПроцедуры


&НаКлиенте
Процедура СтандартныйМакет(Команда)
	СтандартныйМакетНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура Документ1ПриИзменении(Элемент)
	ТекстРедактораHTML = "<html>" + ТекстКодаHTML + "</html>"
КонецПроцедуры


&НаКлиенте
Процедура ГруппаСтраницыДокументПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элементы.ГруппаСтраницыДокумент.ТекущаяСтраница = Элементы.ГруппаСтраницаДокументТекст Тогда
		ТекстКодаHTML = Элементы.Документ.Документ.body.outerHTML;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция СформироватьТекстHTMLЭлемента(ВидЭлемента)
	
	ТекстHTMLЭлемента = "";
	Если ВидЭлемента = "Линия" Тогда
		
		ТекстHTMLЭлемента = "<HR>";
		
	ИначеЕсли ВидЭлемента = "Таблица" Тогда
		
		ФормаПараметровТаблицы = ПолучитьФорму("Справочник.ШаблоныHTML.Форма.ФормаВставкиТаблицы");
		ПараметрыТаблицы = ФормаПараметровТаблицы.ОткрытьМодально();
		ДокументHTML = Элементы.ПолеHTMLДокумента.Документ;
		Таблица = ДокументHTML.createElement("table");
	
		Если ПараметрыТаблицы = Неопределено Или ПараметрыТаблицы.Строки = 0 Или ПараметрыТаблицы.Колонки = 0 Тогда
			Возврат ТекстHTMLЭлемента;
		КонецЕсли;
		
		Таблица.style.borderColor = "inherit";
		Таблица.style.borderStyle = "solid";
		Таблица.style.borderCollapse = "Collapse";
		Таблица.style.width = "100%";
		Таблица.border = "1";
		
		Если ПараметрыТаблицы.Заголовок <> "" Тогда
			Таблица.createCaption();
			Таблица.caption.innerText = ПараметрыТаблицы.Заголовок;
		КонецЕсли;
		
		Для КоличествоСтрок = 1 По ПараметрыТаблицы.Строки Цикл
			НоваяСтрока = Таблица.insertRow();
			Для КоличествоСтолбцов = 1 По ПараметрыТаблицы.Колонки Цикл
				НоваяЯчейка = НоваяСтрока.insertCell();
				НоваяЯчейка.innerText = Символы.НПП;
				НоваяЯчейка.style.width = Строка(Окр(100/ПараметрыТаблицы.Колонки)) + "%";
				НоваяЯчейка.style.wordWrap = "break-word";
			КонецЦикла;
		КонецЦикла;
		
		ТекстHTMLЭлемента = Таблица.outerHTML;
		
	ИначеЕсли ВидЭлемента = "Разрыв" Тогда
		
		ТекстHTMLЭлемента = РаботаСШаблонамиHTMLКлиентСервер.ПолучитьТекстHTMLРазрывСтраницы(Истина, Ложь);
		
	ИначеЕсли ВидЭлемента = "Картинка" Тогда
		
		ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Фильтр = "Изображения (*.jpg, *.png, *.gif)|*.jpg;*.png;*.gif";
		ДиалогОткрытияФайла.Фильтр = Фильтр;
		ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		ИмяФайлаКартинки = "";
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
			ФайлКартинки = Новый Файл(ДиалогОткрытияФайла.ПолноеИмяФайла);
			
			ИдентификаторИзображения = 
				РаботаСШаблонамиHTMLКлиентСервер.ДобавитьИзображениеВКеш(соотвКешИзображенийШаблонов, ДиалогОткрытияФайла.ПолноеИмяФайла, ЭтаФорма.УникальныйИдентификатор);
				
			Если ИдентификаторИзображения <> Неопределено Тогда
				Картинка = Элементы.ПолеHTMLДокумента.Документ.createElement("image");
				Картинка.id = ИдентификаторИзображения;
				Картинка.src = соотвКешИзображенийШаблонов.Получить(ИдентификаторИзображения).АдресВХранилище;
				ТекстHTMLЭлемента = Картинка.outerHTML;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ВидЭлемента = "Комментарий" Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеВводаКомментария", ЭтотОбъект);
		ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияМногострочногоТекста(Оповещение, "", НСтр("ru = 'Текст комментария'"));
		
	КонецЕсли;
	
	Возврат ТекстHTMLЭлемента;
	
КонецФункции

&НаКлиенте
Процедура ВставитьУзелВСелекшенДокумента(ДокументHTML, Узел)
	
	doc = ДокументHTML;
	sel = ДокументHTML.getSelection();
	
	// Первый диапазон селекшена
	range = sel.getRangeAt(0);
	
	sel.removeAllRanges();
	
	// Удалить содержимое текущего селекшена
	Если range <> Неопределено Тогда
		range.deleteContents();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбрана позиция для подстановки в тексте'"));
		Возврат;
	КонецЕсли;
	
	// Получить расположение текущего селекшена
	container = range.startContainer;
	
	КурсорВТегеПараметра = Ложь;
	Тег = container;
	Пока НРег(Тег.nodeName) <> "body" Цикл
		Если Тег.nodeType <> 3 И ЗначениеЗаполнено(Тег.getAttribute("id")) Тогда
			КурсорВТегеПараметра = Истина;
			Прервать;
		КонецЕсли;
		Тег = Тег.parentNode;
	КонецЦикла;
	
	Пока ТегиРазрешающиеВставкуПараметров.Найти(НРег(container.tagName)) = Неопределено	Цикл
		Если Не КурсорВТегеПараметра И (container.tagName = Неопределено И container.nodeName = "#text") Тогда
			Прервать;
		КонецЕсли;
		container = container.parentNode;
	КонецЦикла;
	pos = range.startOffset;
	
	// Создать новый диапазон для нового селекшена
	range = ДокументHTML.createRange();
	
	Если (container.nodeType=3 И Узел.nodeType=3) Тогда
		// Если текст вставляется в textNode, делать оптимизированную вставку
		container.insertData(pos, Узел.data);
		// Установить курсор после вставленного текста
		range.setEnd(container, pos+Узел.length);
		range.setStart(container, pos+Узел.length);
		
	Иначе
		
		afterNode = Неопределено;
		beforeNode = Неопределено;
		Если (container.nodeType=3) Тогда
			// При вставке в textNode создать 2 textNode, между ними поместить insertNode
			textNode = container;
			container = textNode.parentNode;
			text = textNode.nodeValue;
			
			textBefore = Сред(text,0,pos);
			textAfter = Сред(text,pos+1);
			
			beforeNode = ДокументHTML.createTextNode(textBefore);
			afterNode = ДокументHTML.createTextNode(textAfter);
			
			// Вставить 3 новых узла перед исходным textNode, и удалить его
			container.insertBefore(afterNode, textNode);
			container.insertBefore(Узел, afterNode);
			container.insertBefore(beforeNode, Узел);
			
			// Удалить старую дочерний узел
			container.removeChild(textNode);
			
		Иначе
			
			Если ВРег(container.nodeName) = "BODY"
				И container.childNodes.length = 1
				И ВРег(container.childNodes[0].nodeName) = "DIV"
				И ВРег(container.childNodes[0].className) = "FORMAT"
			Тогда
				container = container.childNodes[0];
			КонецЕсли;
			// Иначе вставить узел
			Если container.childNodes.length >= pos И container.childNodes.length <> 0 Тогда
				Попытка
					afterNode = container.childNodes[pos];
					container.insertBefore(Узел, afterNode);
				Исключение
					container.appendChild(Узел);
				КонецПопытки;
			Иначе
				container.appendChild(Узел);
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			range.setEnd(afterNode, 0);
			range.setStart(afterNode, 0);
		Исключение
		КонецПопытки;
		
		sel.addRange(range);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДобавитьТекстHTMLВДокумент(ДокументHTML, Знач ТекстHTML, ИмяТегаИсключенияВложения = "")
	
	Если ЗначениеЗаполнено(ТекстHTML) Тогда
		НовыйУзел = ДокументHTML.createElement("span");
		НовыйУзел.innerHTML = ТекстHTML;
		
		ВставитьУзелВСелекшенДокумента(ДокументHTML, НовыйУзел);
	КонецЕсли;
	
	Возврат ДокументHTML.body.innerHTML;
	
КонецФункции

&НаКлиенте
Функция ДобавитьПараметрВШаблон(ВидПараметра, ТекПараметр = Неопределено, ВставкаЭлемента = Ложь, ВставлятьТолькоПараметр = Ложь)
	
	СНовойСтроки = Не ВставлятьТолькоПараметр И ТекПараметрСНовойСтроки;
	ВставлятьЗаголовок = Не ВставлятьТолькоПараметр И ТекПараметрВставлятьЗаголовок;
	
	Если ВставкаЭлемента Тогда
		ТекПараметр = Неопределено;
	Иначе
		// Должны вставлять параметр, но его не передали - ничего не делаем.
		Если ТекПараметр = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ТекстHTML = "";
	ДокументHTML = Элементы.Документ.Документ;
	Если ДокументHTML.getSelection().focusNode = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбрана позиция в тексте для добавления'"));
		Возврат Ложь;
	КонецЕсли;
	ТекстHTML = ДокументHTML.body.innerHTML;
	ТекстHTMLПараметра = СформироватьТекстHTMLЭлемента(ВидПараметра);
	ТекстHTML = ДобавитьТекстHTMLВДокумент(ДокументHTML, ТекстHTMLПараметра);
	Если ВидПараметра = "Картинка" Тогда
		РаботаСШаблонамиHTMLКлиентСервер.ЗагрузитьИзображенияПриема(ДокументHTML, соотвКешИзображенийШаблонов, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


&НаКлиенте
Процедура ВставитьКартинку(Команда)
		
	ДокументHTML = Элементы.Документ.Документ;
	ВидЭлемента = СтрЗаменить(Команда.Имя, "КомандаВставить", "");
	
	ДобавитьПараметрВШаблон(ВидЭлемента, , Истина);
	
КонецПроцедуры

