Перем ДопПараметры;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Свойство("ДопПараметры") Тогда
		ИдентификаторСтроки	= Параметры.ДопПараметры.ИдентификаторСтроки;
		ИмяРеквизита	= Параметры.ДопПараметры.ИмяРеквизита;
		ИмяТаблицы	= Параметры.ДопПараметры.ИмяТаблицы;
	КонецЕсли;
	
	Текст = Параметры.Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	ДопПараметры = Новый Структура("ИдентификаторСтроки, ИмяРеквизита, ИмяТаблицы", ИдентификаторСтроки, ИмяРеквизита, ИмяТаблицы);
	
	Структура = Новый Структура;	
	Структура.Вставить("ДопПараметры", ДопПараметры);
	Структура.Вставить("Текст", Текст);
	
	Закрыть(Структура);
	
КонецПроцедуры