#Область ОбработчикиСтандартныхСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьИзМакета();
	
	Если Параметры.Свойство("ТекущаяСтрока")
		И ЗначениеЗаполнено(Параметры.ТекущаяСтрока)
	Тогда
		СтрокиТаблицы = Список.НайтиСтроки(Новый Структура("Код", Параметры.ТекущаяСтрока));
		Если СтрокиТаблицы.Количество() <> 0 Тогда
			Элементы.Список.ТекущаяСтрока = СтрокиТаблицы[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Выбрать(Неопределено);
КонецПроцедуры
	
#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура Выбрать(Команда)

	ТекущееЗначение = Элементы.Список.ТекущиеДанные;
     
	Если ТекущееЗначение <> Неопределено Тогда
		ОповеститьОВыборе(ТекущееЗначение.Код);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет таблицу "Список" значениями методов модальности из макета.
// Это значение Modality DICOM-тега 0008,0060; Необходим только код в строковом виде CR, CT и прочие 
//
&НаСервере
Процедура ЗаполнитьИзМакета()
	Список.Очистить();	
	Макет	= Справочники.AETitles.ПолучитьМакет("ModalityTable").ПолучитьТекст();
	Таблица	= ОбщегоНазначения.ПрочитатьXMLВТаблицу(Макет).Данные;	
	Для Каждого стр Из Таблица Цикл
		НоваяСтрока = Список.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, стр);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

