#Область ПрограммныйИнтерфейс

Функция ПолучитьДокументыФактораРиска(Клиент) Экспорт
	Если Клиент.Пол = Перечисления.ПолФизическихЛиц.Женский Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РасчетФакторовРиска.Ссылка
		               |ИЗ
		               |	Документ.РасчетФакторовРиска КАК РасчетФакторовРиска
		               |ГДЕ
		               |	РасчетФакторовРиска.Клиент = &Клиент
		               |	И НЕ РасчетФакторовРиска.ПометкаУдаления
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	РасчетФакторовРиска.Дата";
		Запрос.УстановитьПараметр("Клиент",Клиент);
		Таблица = Запрос.Выполнить().Выгрузить();
		Если Таблица.Количество() <> 0 Тогда
			СписокЗначений = Новый СписокЗначений;
			Для Каждого стр ИЗ Таблица Цикл
				СписокЗначений.Добавить(стр.Ссылка);	
			КонецЦикла;
			Возврат СписокЗначений;
		КонецЕсли;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ПроизвестиОтборМассиваФакторовРиска(СписокЗначений, ДатаНачала , ДатаОкончания , Врач , Специализация ) Экспорт
	СписокЗначенийСОтбором = Новый СписокЗначений;
	СписокЗначенийСОтбором = СписокЗначений.Скопировать();
	
	Если Не Специализация.Пустая() Тогда 
		Специализации = МедицинскаяДеятельностьКОРП.ПолучитьПараметрМедДеятельности("СпециализацииГинекологии").Получить();
		Рез = Специализации.Найти(Специализация);
		Если Рез = Неопределено Тогда
			СписокЗначенийСОтбором.Очистить();
			Возврат СписокЗначенийСОтбором;	
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого стр Из СписокЗначенийСОтбором Цикл
		
		Если ЗначениеЗаполнено(ДатаНачала) Тогда
			Если стр.Значение.Дата < ДатаНачала Тогда
				СписокЗначенийСОтбором.Удалить(стр);
				Продолжить;	
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДатаОкончания) Тогда
			Если стр.Значение.Дата > ДатаОкончания Тогда
				СписокЗначенийСОтбором.Удалить(стр);
				Продолжить;	
			КонецЕсли;
		КонецЕсли;

		Если Не Врач.Пустая() Тогда
			Если стр.Значение.Врач1 <> Врач И стр.Значение.Врач2 <> Врач И стр.Значение.Врач3 <> Врач Тогда
				СписокЗначенийСОтбором.Удалить(стр);
				Продолжить;	
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;
	
	Возврат СписокЗначенийСОтбором;
	
КонецФункции

Функция ПолучитьHTMLПредставлениеДокумента(Документ) Экспорт
	Возврат Документ.HTMLПредставление.Получить();	
КонецФункции

// Возвращает структуру значений 
//
// Параметры:
//	Дата - не используется 
//
// Возвращаемое значение:
//  Структура с параметрами учетной политики
//
Функция ПолучитьНастройкиМедДеятельности(Дата=Неопределено)   Экспорт 
	
	нзПарамМедУчета = РегистрыСведений.НастройкиМедицинскогоУчета.СоздатьНаборЗаписей();
	нзПарамМедУчета.Прочитать();
	
	мПарамМедУчета = Новый Структура;
	
	Если нзПарамМедУчета.Количество()<>0 Тогда
		
		мПарамМедУчета = Новый Структура;
		мМетаданныеРесурсы = Метаданные.РегистрыСведений.НастройкиМедицинскогоУчета.Ресурсы;
		Для Каждого Ресурс Из мМетаданныеРесурсы Цикл
			мПарамМедУчета.Вставить(Ресурс.Имя, нзПарамМедУчета[0][Ресурс.Имя]); 
		КонецЦикла;

	Иначе
		мПарамМедУчета = ПолучитьМедДеятельностьПоУмолчанию();                                         
	КонецЕсли;
	
	Возврат мПарамМедУчета;
	
КонецФункции                                                                                    

// Возвращает значение параметра 
//
// Параметры:
//  ИмяПараметра - имя параметра
//	Дата		 - не используется 
//
// Возвращаемое значение:
//  определяется типом значения параметра
//
Функция ПолучитьПараметрМедДеятельности(ИмяПараметра, Дата=Неопределено)   Экспорт 
	
	Перем Возв;
	
	мПарамМедУчета = РегистрыСведений.НастройкиМедицинскогоУчета.СоздатьНаборЗаписей();
	мПарамМедУчета.Прочитать();
	
	Если мПарамМедУчета.Количество() <> 0 Тогда
		Возврат мПарамМедУчета[0][ИмяПараметра]; 
	Иначе
		Возврат ПолучитьЗначениеПараметраМедДеятельностиПоУмолчанию(ИмяПараметра)
	КонецЕсли;
	
КонецФункции

// Возвращает значение параметра по умолчанию
//
// Параметры:
//  ИмяПараметра - имя параметра
//
// Возвращаемое значение:
//  определяется типом значения параметра
//
Функция ПолучитьЗначениеПараметраМедДеятельностиПоУмолчанию(ИмяПараметра) Экспорт
	                                                                                                
	Если ИмяПараметра = "" Тогда                                                   
	Иначе
		Возврат Метаданные.РегистрыСведений.НастройкиМедицинскогоУчета.Ресурсы[ИмяПараметра].Тип.ПривестиЗначение(Неопределено);
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьПараметрыИзШаблона(Строка) Экспорт
	
	Массив = Новый Массив;
	
	ИмяПарметраПрав = Прав(Строка,СтрДлина(Строка) - Найти(Строка, "[")); 
	ИмяПарметра = Лев(ИмяПарметраПрав, Найти(ИмяПарметраПрав, "]") - 1);
	Массив.Добавить(ИмяПарметра);
	Если Найти(ИмяПарметраПрав,"[") <> 0 Тогда
		Рез = ПолучитьПараметрыИзШаблона(ИмяПарметраПрав);
		Для каждого стр Из Рез Цикл
			Массив.Добавить(стр);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Массив;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает структуру значений по умолчанию
//
// Параметры:
//	Нет
//
// Возвращаемое значение:
//  Структура с параметрами учетной политики
//
Функция ПолучитьМедДеятельностьПоУмолчанию()
	
	мМетаданные	= Метаданные.РегистрыСведений.НастройкиМедицинскогоУчета.Ресурсы;
	СтруктураВозврата = Новый Структура;
	Для Каждого Реквизит из мМетаданные Цикл
		
		СтруктураВозврата.Вставить(Реквизит.Имя, ПолучитьЗначениеПараметраМедДеятельностиПоУмолчанию(Реквизит.Имя));
		
	КонецЦикла;
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти
