
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Получатель") 
		И ЗначениеЗаполнено(Параметры.Получатель) 
	Тогда	
		ПолучательОтбор = ОбщегоНазначения.ИмяЗначенияПеречисления(Параметры.Получатель);	
	КонецЕсли;
	
	ЗаполнитьДеревоАлгоритмовКэш();
	ЗаполнитьСписокВыбораПолучатель();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьДеревоАлгоритмов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбратьИЗакрыть();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолучательОтборПриИзменении(Элемент)
	
	ЗаполнитьДеревоАлгоритмов();
	
КонецПроцедуры

&НаКлиенте
Процедура СтандартныеАлгоритмыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьИЗакрыть();

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
Процедура ЗаполнитьДеревоАлгоритмовКэш()

	Алгоритмы = Справочники.ВычисляемыеЗначенияПараметров.ПолучитьСтандартныеАлгоритмыВычисляемыхЗначений();
	
	Для Каждого КлючИЗначение Из Алгоритмы Цикл
		СтрокаАлгоритма = СтандартныеАлгоритмыКэш.Добавить();
		СтрокаАлгоритма.ИмяАлгоритма = КлючИЗначение.Ключ;
		ЗаполнитьЗначенияСвойств(СтрокаАлгоритма, КлючИЗначение.Значение);
		СтрокаАлгоритма.Представление = КлючИЗначение.Значение.Описание;
	КонецЦикла;
	
	СтандартныеАлгоритмыКэш.Сортировать("Группа, Представление");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДеревоАлгоритмов()

	Дерево = СтандартныеАлгоритмы.ПолучитьЭлементы();
	Дерево.Очистить();
	Группа = "";
	ЭлементыГруппировки = Неопределено;
	 
	Для Каждого Алгоритм Из СтандартныеАлгоритмыКэш Цикл
				
		Если Не ЗначениеЗаполнено(ПолучательОтбор) 
			Или ПолучательАлгоритмаВОтборе(Алгоритм.Получатель) 
		Тогда
		
			Если Не ЗначениеЗаполнено(Группа) Или Группа <> Алгоритм.Группа Тогда
				СтрокаГруппировки = Дерево.Добавить();
				СтрокаГруппировки.Представление = Алгоритм.Группа;
				ЭлементыГруппировки = СтрокаГруппировки.ПолучитьЭлементы();
				Группа = Алгоритм.Группа;
			КонецЕсли;
			
			Если ЭлементыГруппировки <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ЭлементыГруппировки.Добавить(), Алгоритм);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучательАлгоритмаВОтборе(СтрокаПолучатель)

	Получатели = СтрРазделить(СтрокаПолучатель, ",", Ложь);
	
	Для Каждого Получатель Из Получатели Цикл
		Если ПолучательОтбор = СокрЛП(Получатель) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьСписокВыбораПолучатель()

	Для Каждого ЗначениеПеречисления Из Перечисления.ПолучателиВычисляемогоЗначения Цикл
		Элементы.ПолучательОтбор.СписокВыбора.Добавить(ОбщегоНазначения.ИмяЗначенияПеречисления(ЗначениеПеречисления), Строка(ЗначениеПеречисления));
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИЗакрыть()
	
	ТекДанные = Элементы.СтандартныеАлгоритмы.ТекущиеДанные;
	Если ЗначениеЗаполнено(Текданные.Алгоритм) Тогда
		Структура = Новый Структура("ИмяАлгоритма, Алгоритм, СвязанныеПоля, Комментарий, Представление");
		ЗаполнитьЗначенияСвойств(Структура, ТекДанные);
		ЭтотОбъект.Закрыть(Структура);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Невозможно выбрать группу!");		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти