
&НаСервере
Процедура ОбновитьСписокШаблоновНаСервере()
	
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	МассивШаблонов = Бот.ПолучитьСписокШаблонов();
	
	Идентификаторы = Новый Массив;
	
	Для Каждого СтруктураШаблона Из МассивШаблонов.templates Цикл
		Если Не СтруктураШаблона.category = "MARKETING"
			И Не СтруктураШаблона.category = "UTILITY" Тогда
			Продолжить;
		КонецЕсли;
		Идентификаторы.Добавить(СтруктураШаблона.templateId);
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ШаблоныСообщений.Ссылка КАК Ссылка,
	               |	iga_ШаблоныСообщений.Идентификатор КАК Идентификатор
	               |ИЗ
	               |	Справочник.iga_ШаблоныСообщений КАК iga_ШаблоныСообщений
	               |ГДЕ
	               |	iga_ШаблоныСообщений.Идентификатор В(&Идентификаторы)";
	Запрос.УстановитьПараметр("Идентификаторы", Идентификаторы);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СуществующиеШаблоны = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		СуществующиеШаблоны.Вставить(Выборка.Идентификатор, Выборка.Ссылка);
	КонецЦикла;
	
	Для Каждого Шаблон Из МассивШаблонов.templates Цикл
		
		СсылкаШаблон = СуществующиеШаблоны.Получить(Шаблон.templateId);
		
		Если Не СсылкаШаблон = Неопределено Тогда
			СуществующиеШаблоны.Удалить(Шаблон.templateId);
			СправочникШаблон = СсылкаШаблон.ПолучитьОбъект();
		Иначе
			СправочникШаблон = Справочники.iga_ШаблоныСообщений.СоздатьЭлемент();
			СправочникШаблон.Наименование = ?(Шаблон.Свойство("vertical"), Шаблон.vertical, Шаблон.elementName);
			СправочникШаблон.Идентификатор = Шаблон.templateId;
		КонецЕсли;                        
		СправочникШаблон.Статус = Перечисления.iga_СтатусыПодтвержденияШаблонов.ПолучитьПеречислениеПоСтатусу(Шаблон.status);
		СправочникШаблон.ИмяШаблона = Шаблон.elementName;
		
		НайденныйЯзык = Справочники.iga_ЯзыкиЧатов.НайтиПоРеквизиту("КодЯзыка", Шаблон.languageCode);
		
		Если НайденныйЯзык.Пустая() Тогда
			ЯзыкОбъект = Справочники.iga_ЯзыкиЧатов.СоздатьЭлемент();
			ЯзыкОбъект.Наименование = Шаблон.languageCode;
			ЯзыкОбъект.КодЯзыка = Шаблон.languageCode;
			ЯзыкОбъект.Записать();
			НайденныйЯзык = ЯзыкОбъект.Ссылка;
		КонецЕсли;
		
		СправочникШаблон.Язык = НайденныйЯзык;
		Если Шаблон.Свойство("vertical") Тогда
			СправочникШаблон.КраткоеОписание = Шаблон.vertical;
		Иначе
			СправочникШаблон.КраткоеОписание = "Без описания";
		КонецЕсли;
		
		Если Шаблон.templateType = "IMAGE" Тогда
			СправочникШаблон.ТипСодержимого = Перечисления.iga_ТипыСодержимогоШаблона.Изображение;
		Иначе
			СправочникШаблон.ТипСодержимого = Перечисления.iga_ТипыСодержимогоШаблона.Текст;
		КонецЕсли;
		
		containerMeta = ПрочитатьЗначениеJSON(Шаблон.containerMeta);
		
		Если iga_ОбщегоНазначенияКлиентСервер.КоличествоПараметровВТексте(containerMeta.data) = 0
			Или СправочникШаблон.ТекстСообщения = "" Тогда
			СправочникШаблон.ТекстСообщения = containerMeta.data;
		КонецЕсли;
		Если Шаблон.category = "MARKETING" Тогда
			СправочникШаблон.Категория = Перечисления.iga_КатегорииШаблонов.Маркетинг;
		Иначе
			СправочникШаблон.Категория = Перечисления.iga_КатегорииШаблонов.Утилита;
		КонецЕсли;
		Если containerMeta.Свойство("buttons") Тогда
			
			ПараметрыВосстановления = Новый Соответствие;
			
			Для Каждого СтруктураКнопки Из containerMeta.buttons Цикл
				Если СтруктураКнопки.Свойство("example") Тогда
					Если ТипЗнч(СтруктураКнопки.example) = Тип("Строка") Тогда
						НайденнаяСтрока = СправочникШаблон.Кнопки.Найти(СтруктураКнопки.example, "ЗначениеПримера");
						Если Не НайденнаяСтрока = Неопределено Тогда
							ПараметрыВосстановления.Вставить(СтруктураКнопки.example, НайденнаяСтрока.ПараметрКнопки);
						КонецЕсли;
					Иначе
						НайденнаяСтрока = СправочникШаблон.Кнопки.Найти(СтруктураКнопки.example[0], "ЗначениеПримера");
						Если Не НайденнаяСтрока = Неопределено Тогда
							ПараметрыВосстановления.Вставить(СтруктураКнопки.example[0], НайденнаяСтрока.ПараметрКнопки);
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
				
			СправочникШаблон.Кнопки.Очистить();
			Для Каждого СтруктураКнопки Из containerMeta.buttons Цикл
				СтрокаКнопки = СправочникШаблон.Кнопки.Добавить();
				Если СтруктураКнопки.type = "URL" Тогда
					СтрокаКнопки.Тип = Перечисления.iga_ТипыКнопокСообщения.ПереходПоСсылке;
					СтрокаКнопки.Значение = СтруктураКнопки.url;
				ИначеЕсли СтруктураКнопки.type = "QUICK_REPLY" Тогда
					СтрокаКнопки.Тип = Перечисления.iga_ТипыКнопокСообщения.Ответ;
				Иначе
					СтрокаКнопки.Тип = Перечисления.iga_ТипыКнопокСообщения.НомерТелефона;
					СтрокаКнопки.Значение = СтруктураКнопки.phone_number;
				КонецЕсли;
				СтрокаКнопки.Заголовок = СтруктураКнопки.text;
				Если СтруктураКнопки.Свойство("example") Тогда
					Если ТипЗнч(СтруктураКнопки.example) = Тип("Строка") Тогда
						СтрокаКнопки.ЗначениеПримера = СтруктураКнопки.example;
					Иначе
						СтрокаКнопки.ЗначениеПримера = СтруктураКнопки.example[0];
					КонецЕсли;
					ПараметрКнопки = ПараметрыВосстановления.Получить(СтрокаКнопки.ЗначениеПримера);
					Если Не ПараметрКнопки = Неопределено Тогда
						СтрокаКнопки.ПараметрКнопки = ПараметрКнопки;
					Иначе
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Шаблон """ + СправочникШаблон.Наименование +""" требует внимания. Есть кнопки с параметрами.";
						Сообщение.Сообщить();
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		СправочникШаблон.Записать();
		
	КонецЦикла;
	
	Для Каждого ЭлементСоответствия Из СуществующиеШаблоны Цикл
		СправочникШаблон = ЭлементСоответствия.Значение.ПолучитьОбъект();
		СправочникШаблон.Статус = Перечисления.iga_СтатусыПодтвержденияШаблонов.Создан;
		СправочникШаблон.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокШаблонов(Команда)
	
	ОбновитьСписокШаблоновНаСервере();
	Элементы.Список.Обновить();
	ПоказатьПредупреждение(, "Шаблоны успешно обновлены!", 60, "Обновление шаблонов");
	
КонецПроцедуры
