
Функция ПолучитьПеречислениеПоСтатусу(Статус) Экспорт
	
	Если Статус = "APPROVED" Тогда
		Возврат Перечисления.iga_СтатусыПодтвержденияШаблонов.Подтвержден;
	ИначеЕсли Статус = "PENDING" Тогда
		Возврат Перечисления.iga_СтатусыПодтвержденияШаблонов.НаПроверке;
	ИначеЕсли Статус = "FAILED" Тогда
		Возврат Перечисления.iga_СтатусыПодтвержденияШаблонов.ОшибкаШаблона;
	ИначеЕсли Статус = "REJECTED" Тогда
		Возврат Перечисления.iga_СтатусыПодтвержденияШаблонов.Отклонен;
	ИначеЕсли Статус = "PAUSED" Тогда
		Возврат Перечисления.iga_СтатусыПодтвержденияШаблонов.Приостановлен;
	КонецЕсли;

КонецФункции