#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Таблица = ПолучитьДиагнозы();	
	ВнешниеНаборыДанных = Новый Структура("Данные",Таблица);
	
	ОсновнойМакетОформления = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойМакетОформленияСКД");
	//
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	ПараметрМакет = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("МакетОформления");
	ПараметрМакет.Значение = ОсновнойМакетОформления;
	ПараметрМакет.Использование = Истина;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();    
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	// Инициализация процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	// Получение результата
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДиагнозы()
	ПараметрыОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.Найти("НачалоПериода").Значение);
	Запрос.УстановитьПараметр("КонецПериода",  ПараметрыОтчета.Найти("КонецПериода").Значение);
	Запрос.УстановитьПараметр("СписокФилиалов", ПроцедурыСпециализацииПоставки.ФилиалыОрганизации(ПараметрыОтчета.Найти("Филиал").Значение));
	Запрос.УстановитьПараметр("ОкончательныйДиагноз",  Перечисления.КлассификацииДиагнозов.Окончательный);
	Запрос.УстановитьПараметр("УчитываемыеКлассификацииОстротыДиагноза",  УчитываемыеКлассификацииОстротыДиагноза());
	
	ОтборВозраста = ПараметрыОтчета.Найти("ОтборПоВозрасту").Значение;
	Запрос.УстановитьПараметр("ОтборВозраста", ОтборВозраста);
	
	Группа = ПараметрыОтчета.Найти("Группа").Значение;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Диагнозы.Регистратор.Клиент КАК Клиент,
		|	Диагнозы.Регистратор.ПервичныйПрием КАК СлучайЗаболевания,
		|	Диагнозы.Регистратор КАК Документ,
		|	Диагнозы.Диагноз КАК Диагноз,
		|	Диагнозы.Период КАК Период
		|ПОМЕСТИТЬ СлучаиЗаболевания
		|ИЗ
		|	РегистрСведений.Диагнозы КАК Диагнозы
		|ГДЕ
		|	Диагнозы.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И Диагнозы.Классификация1 = &ОкончательныйДиагноз
		|	И Диагнозы.Классификация2 В(&УчитываемыеКлассификацииОстротыДиагноза)
		|	И Диагнозы.Регистратор.Филиал В(&СписокФилиалов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СлучаиЗаболевания.Клиент КАК Клиент,
		|	СлучаиЗаболевания.СлучайЗаболевания КАК СлучайЗаболевания,
		|	СлучаиЗаболевания.Диагноз КАК Диагноз,
		|	МИНИМУМ(СлучаиЗаболевания.Период) КАК Период
		|ПОМЕСТИТЬ СлучаиЗаболеванияДатыВыявления
		|ИЗ
		|	СлучаиЗаболевания КАК СлучаиЗаболевания
		|
		|СГРУППИРОВАТЬ ПО
		|	СлучаиЗаболевания.Клиент,
		|	СлучаиЗаболевания.СлучайЗаболевания,
		|	СлучаиЗаболевания.Диагноз
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Диагнозы.Клиент КАК Клиент,
		|	Диагнозы.Диагноз.КодДиагноза КАК КодДиагноза,
		|	Диагнозы.Диагноз КАК Диагноз,
		|	Диагнозы.Документ КАК Документ
		|ИЗ
		|	(ВЫБРАТЬ
		|		СлучаиЗаболевания.Документ КАК Документ,
		|		СлучаиЗаболевания.Диагноз КАК Диагноз,
		|		СлучаиЗаболевания.Клиент КАК Клиент,
		|		СлучаиЗаболевания.Период КАК Период
		|	ИЗ
		|		СлучаиЗаболевания КАК СлучаиЗаболевания
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СлучаиЗаболеванияДатыВыявления КАК СлучаиЗаболеванияДатыВыявления
		|			ПО СлучаиЗаболевания.Период = СлучаиЗаболеванияДатыВыявления.Период
		|				И СлучаиЗаболевания.Диагноз = СлучаиЗаболеванияДатыВыявления.Диагноз
		|				И СлучаиЗаболевания.СлучайЗаболевания = СлучаиЗаболеванияДатыВыявления.СлучайЗаболевания) КАК Диагнозы
		|ГДЕ
		|	(&ОтборВозраста = 0
		|			ИЛИ ДОБАВИТЬКДАТЕ(Диагнозы.Клиент.ДатаРождения, ГОД, &ОтборВозраста) > Диагнозы.Период)";
	
	ТаблицаДиагнозов = Запрос.Выполнить().Выгрузить();
		
	УдаляемыеСтроки = Новый Массив;
	Для каждого СтрокаДиагноза Из ТаблицаДиагнозов Цикл
		КодДиагноза = СтрокаДиагноза.КодДиагноза;
		
		ВходитВГруппу = Ложь;
		МассивГрупп = СтрРазделить(Группа,",",Ложь);
		Для каждого ГруппаДиагноза Из МассивГрупп Цикл
			ВходитВГруппу = МедицинскаяДеятельность.ДиагнозВДиапазонеКодов(КодДиагноза, ГруппаДиагноза);
			Если ВходитВГруппу Тогда				
				Прервать;
			КонецЕсли; 		
		КонецЦикла; 
		Если Не ВходитВГруппу Тогда
			УдаляемыеСтроки.Добавить(СтрокаДиагноза);	
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого СтрокаДляУдаления Из УдаляемыеСтроки Цикл
		ТаблицаДиагнозов.Удалить(СтрокаДляУдаления);	
	КонецЦикла; 
	
	Возврат ТаблицаДиагнозов;
КонецФункции

Функция УчитываемыеКлассификацииОстротыДиагноза()
	
	// Сведения о числе зарегистрированных заболеваний с диагнозом, установленным впервые в жизни, 
	// включают число заболеваний, выявленных впервые в жизни для хронических болезней,
	// а также каждый случай заболевания острыми болезнями, который может возникать неоднократно в течение отчетного года
	// (например, грипп, кишечные инфекции, острый инфаркт миокарда и т.п.).
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.КлассификацииДиагнозов.Острое);
	Результат.Добавить(Перечисления.КлассификацииДиагнозов.ХроническоеВпервыеВыявленное);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
