#Область ПрограммныйИнтерфейс

// Получает ставку НДС номенклатуры
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номенклатура.
//  Период		 - Дата							 - Дата получения.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтавкиНДС.
//
Функция СтавкаНДС(Номенклатура, Период) Экспорт
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ВидСтавки = Номенклатура.ВидСтавкиНДС;
	Иначе
		ВидСтавки = Перечисления.ВидыСтавокНДС.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Перечисления.СтавкиНДС.СтавкаНДС(ВидСтавки, Период);		
КонецФункции

Функция ОсновныеСтавкиНДСпоСНО() Экспорт
	
	Ставки = Новый Соответствие;
	пчСНО = Перечисления.СистемыНалогообложения;
	пчСтавкиНДС = Перечисления.СтавкиНДС;
	
	Ставки.Вставить(пчСНО.Общая,						   пчСтавкиНДС.НДС20);
	Ставки.Вставить(пчСНО.ПатентнаяСистемаНалогообложения, пчСтавкиНДС.БезНДС);
	Ставки.Вставить(пчСНО.УпрощеннаяДоход,				   пчСтавкиНДС.БезНДС);
	Ставки.Вставить(пчСНО.УпрощеннаяДоходМинусРасход,	   пчСтавкиНДС.БезНДС);
	Ставки.Вставить(пчСНО.ЕдиныйСельскохозяйственныйНалог, пчСтавкиНДС.БезНДС);
	
	Возврат Ставки;
	
КонецФункции

Функция ПолучитьСтавкуНДСДляУСН(Организация, Период,омг_СтраховаяПрограмма) Экспорт 
	
	///////////////////////////////////////////////////////////////////////////////
	// ОМГ  
	
	//Возврат РегистрыСведений.СтавкиНДСПриУСН.ПолучитьСтавкуНДСДляУСН(Организация, Период); 
	Если ЗначениеЗаполнено(омг_СтраховаяПрограмма) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоглашенияСтрахования.омг_ВидДоговораНДС.омг_СтавкаНДС КАК омг_СтавкаНДС
		|ИЗ
		|	Справочник.СоглашенияСтрахования КАК СоглашенияСтрахования
		|ГДЕ
		|	СоглашенияСтрахования.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", омг_СтраховаяПрограмма);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Возврат ВыборкаДетальныеЗаписи.омг_СтавкаНДС
		КонецЕсли;
		
	Иначе	
		Возврат РегистрыСведений.СтавкиНДСПриУСН.омг_ПолучитьСтавкуНДСДляУСН(Организация, Период);
	КонецЕсли;   
	
	// ОМГ  
	/////////////////////////////////////////////////////////////////////////////// 
	
КонецФункции

// Есть право ли изменять ставку НДС в денежных документах (ПКО,РКО,ОПК,ВПК).
// 
// Возвращаемое значение:
//  Булево.
//
Функция ЕстьПравоИзменятьСтавкуНДС_ДенежныеДокументы() Экспорт
	
	Возврат Пользователи.ЭтоПолноправныйПользователь()
		Или УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(,"РазрешитьМенятьСтавкуНДСВДенежныхДокументах");
	
КонецФункции

#КонецОбласти
