
Функция ПолучитьЧатКлиента(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ЧатыКлиентов.Клиент КАК Клиент,
	               |	iga_ЧатыКлиентов.Чат КАК Чат
	               |ИЗ
	               |	РегистрСведений.iga_ЧатыКлиентов КАК iga_ЧатыКлиентов
	               |ГДЕ
	               |	iga_ЧатыКлиентов.Клиент = &Клиент";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Чат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	
КонецФункции

Функция ПолучитьНомерМесенджера(Клиент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_Чаты.Идентификатор КАК Идентификатор
	               |ИЗ
	               |	РегистрСведений.iga_ЧатыКлиентов КАК iga_ЧатыКлиентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.iga_Чаты КАК iga_Чаты
	               |		ПО iga_ЧатыКлиентов.Чат = iga_Чаты.Ссылка
	               |ГДЕ
	               |	iga_ЧатыКлиентов.Клиент = &Клиент";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	Если Выборка.Следующий() Тогда
		
		НормальныйНомер = "7" + Прав(iga_ОбщегоНазначенияКлиентСервер.ТолькоЦифры(Выборка.Идентификатор), 10);
		
		Возврат НормальныйНомер;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПроверкаНомераТелефона(НомерТелефона) Экспорт
	
	Возврат Новый Структура("Успешно", Истина); //iga_МетодыРаботыСБотом.ПроверитьНомерТелефонаНаВацап(НомерТелефона);
	
КонецФункции

Процедура СохранитьНомерВКонтактнойИнформации(Клиент, НомерТелефона) Экспорт
	
	ЗаписьНомера = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	ЗаписьНомера.Объект = Клиент;
	ЗаписьНомера.Вид = Константы.iga_ВидКонтактнойИнформацииМесенджера.Получить();
	ЗаписьНомера.Тип = ЗаписьНомера.Вид.Тип;
	ЗаписьНомера.Представление = НомерТелефона;
	ЗаписьНомера.Записать();
	
КонецПроцедуры

Процедура ПривязатьЧатККлиенту(Клиент, ЧатСсылка) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	НоваяСвязь = РегистрыСведений.iga_ЧатыКлиентов.СоздатьМенеджерЗаписи();
	НоваяСвязь.Клиент = Клиент;
	НоваяСвязь.Чат = ЧатСсылка;
	НоваяСвязь.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПолучитьЧатПоНомеру(НомерТелефона, Клиент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЧатСсылка = iga_МетодыРаботыСБотом.НайтиЧатПоНомеруТелефона(НомерТелефона);
	
	Если ЧатСсылка = Неопределено Тогда
		НовыйЧат = Справочники.iga_Чаты.СоздатьЭлемент();
		НовыйЧат.Наименование = Строка(Клиент) + "("+ НомерТелефона +"@c.us)";
		НовыйЧат.Идентификатор = НомерТелефона +"@c.us";
		НовыйЧат.Записать();
		ЧатСсылка = НовыйЧат.Ссылка;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ВОзврат ЧатСсылка;
	
КонецФункции

Функция ПолучитьЯзыкЧата(ЧатСсылка) Экспорт
	
	Возврат iga_МетодыРаботыСБотом.ПолучитьЗначениеПараметраОбщения(ЧатСсылка, "Язык", Неопределено);
	
КонецФункции

Функция ПолучитьКлиентаПоЧату(Чат) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ЧатыКлиентов.Клиент КАК Клиент
	               |ИЗ
	               |	РегистрСведений.iga_ЧатыКлиентов КАК iga_ЧатыКлиентов
	               |ГДЕ
	               |	iga_ЧатыКлиентов.Чат = &Чат";
	Запрос.УстановитьПараметр("Чат", Чат);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Клиент;
	КонецЕсли;                 
	
	Возврат Неопределено;
	
КонецФункции


