
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ОтборПоВладельцу = ДоступныеЗначения.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоВладельцу.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
		ОтборПоВладельцу.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборПоВладельцу.ПравоеЗначение = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОтборПоВладельцу = ДоступныеЗначения.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоВладельцу.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ОтборПоВладельцу.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоВладельцу.ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОтборПоВладельцу = ДоступныеЗначения.Отбор.Элементы[0]; 
	ОтборПоВладельцу.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ОтборПоВладельцу.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоВладельцу.ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры
