#Область ПрограммныйИнтерфейс

// Макет отбора для редактирования в форме.
//
// Возвращаемое значение:
//  СхемаКомпоновкиДанных.
//
Функция ПолучитьМакетПолейШаблона() Экспорт
	Возврат ПолучитьМакет("ПоляШаблона");
КонецФункции

// Макет отбора для применения при печати чеков.
//
// Возвращаемое значение:
//  СхемаКомпоновкиДанных.
//
Функция ПолучитьМакетВыполненияОтбора() Экспорт
	Возврат ПолучитьМакет("МакетВыполненияОтбора");
КонецФункции

Функция СтавкаНДСПоНастройкеПечатиЧеков(НастройкаПечатиЧеков, Организация, Дата = Неопределено) Экспорт
	
	ДатаНДС = ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());

	СНО = НастройкаПечатиЧеков.ОсновнаяСистемаНалогообложения;
	ОсновныеСтавкиНСД = УчетНДСВызовСервера.ОсновныеСтавкиНДСпоСНО();
	пчСНО = Перечисления.СистемыНалогообложения;
	
	// Ставка по умолчанию
	СтавкаНДС = ОсновныеСтавкиНСД.Получить(СНО);
	Если СтавкаНДС = Неопределено Тогда
		СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация)
		И (	СНО = Перечисления.СистемыНалогообложения.УпрощеннаяДоход Или
			СНО = Перечисления.СистемыНалогообложения.УпрощеннаяДоходМинусРасход)
	Тогда
		СтавкаНДС = УчетНДСВызовСервера.ПолучитьСтавкуНДСДляУСН(Организация, ДатаНДС);
	КонецЕсли;	
	
	Возврат СтавкаНДС;
	
КонецФункции

#КонецОбласти