#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СпособФискализацииМатериалов = Перечисления.СпособФискализацииРасходныхМатериалов.ПечататьОтдельнойУслугой Тогда
		ПроверяемыеРеквизиты.Добавить("НоменклатураФискализацииМатериалов");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОсновнаяСистемаНалогообложения = Перечисления.СтавкиНДС.НДС5
		Или ОсновнаяСистемаНалогообложения = Перечисления.СтавкиНДС.НДС5_105
		Или ОсновнаяСистемаНалогообложения = Перечисления.СтавкиНДС.НДС7
		Или ОсновнаяСистемаНалогообложения = Перечисления.СтавкиНДС.НДС7_107
	Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("Ставки 5 и 7 процентов могут применяться только для УСН");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
