#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура РаспечататьБланк(Команда)
	ИНЗ = РаспечататьБланкНаСервере();
	БланкДД = ПолучитьИзВременногоХранилища(АдресБланка);
	ПутьЗаписи = КаталогВременныхФайлов() + ИНЗ + ".pdf";
    БланкДД.Записать(ПутьЗаписи);
    ЗапуститьПриложение(ПутьЗаписи);
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьШтрихКод(Команда)
	Если Элементы.Контейнеры.ТекущиеДанные <> Неопределено Тогда
		ШК = ПолучитьШКНаСервере(Элементы.Контейнеры.ТекущиеДанные.ИЛН);
		НастройкиПодразделения = ПолучитьНастройкиПодразделения();
		Если НастройкиПодразделения.ПечатьНаПодключаемомОборудовании Тогда
			ПечатьЧерезПодключаемоеОборудование(ШК);
		Иначе
			ПортПринтера = НастройкиПодразделения.ПортПринтера;
			Если ЗначениеЗаполнено(ШК) Тогда
				Запись = Новый ЗаписьДанных(ПортПринтера);
				Запись.Записать(ШК);
				Запись.Закрыть();
				//ВременныйФайл = КаталогВременныхФайлов() + Элементы.Контейнеры.ТекущиеДанные.ИЛН + ".txt";
				//ШК.Записать(ВременныйФайл);
				//ТекстДок = Новый ТекстовыйДокумент;
				//ТекстДок.Прочитать(ВременныйФайл);
				//ТекстДок.Записать(ПортПринтера,"utf-8");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьШКЗаявки(Команда)
	//Для каждого Контейнер Из Объект.Контейнеры Цикл 
	//	//Если Элементы.Контейнеры.ТекущиеДанные <> Неопределено Тогда
	//		ТекстДок = Новый ТекстовыйДокумент;
	//		ТекстДок.УстановитьТекст(Контейнер.ШтрихКод);
	//		ТекстДок.Записать("\\ws-00464\zebra","cp866");
	//	//КонецЕсли;
	//КонецЦикла;
	ШК = РаспечататьВсеШКНаСервере();
	НастройкиПодразделения = ПолучитьНастройкиПодразделения();
	Если НастройкиПодразделения.ПечатьНаПодключаемомОборудовании Тогда
		ПечатьЧерезПодключаемоеОборудование(ШК);
	Иначе
		ПортПринтера = НастройкиПодразделения.ПортПринтера;
		Для Каждого стрШК Из ШК Цикл
			Если стрШК <> Неопределено Тогда
				Запись = Новый ЗаписьДанных(ПортПринтера);			
				Запись.Записать(стрШК);			
				Запись.Закрыть();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция РаспечататьБланкНаСервере()
	Документ = ДанныеФормыВЗначение(Объект,тип("ДокументОбъект.invЗаявкаНаИсследование"));
	АдресБланка = ПоместитьВоВременноеХранилище(Документ.Бланк.Получить());
	//ТД = Новый ТабличныйДокумент;
	//БланкДД = ПолучитьИзВременногоХранилища(АдресБланка);
	//ПутьЗаписи = КаталогВременныхФайлов() + Документ.ИНЗ + ".pdf";
    //БланкДД.Записать(ПутьЗаписи);
	Возврат Документ.Номер
КонецФункции

&НаСервере
Функция РаспечататьВсеШКНаСервере()
	Док = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.invЗаявкаНаИсследование"));
	МассивШК = Новый Массив;
	Для каждого Контейнер Из Док.Контейнеры Цикл
		МассивШК.Добавить(Контейнер.ШтрихКод.Получить());
	КонецЦикла;
	Возврат МассивШК
КонецФункции

&НаСервере
Функция ПолучитьШКНаСервере(ИЛН)
	ШК = "";
	Док = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.invЗаявкаНаИсследование"));
	стрКонтейнеры = Док.Контейнеры.Найти(ИЛН,"ИЛН");
	Если стрКонтейнеры <> Неопределено Тогда
		ШК = стрКонтейнеры.ШтрихКод.Получить();
	КонецЕсли;
	Возврат ШК
КонецФункции

&НаСервере
Функция ПолучитьНастройкиПодразделения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	invНастройкиПодразделения.ПортПринтера КАК ПортПринтера,
		|	invНастройкиПодразделения.ПечатьНаПодключаемомОборудовании КАК ПечатьНаПодключаемомОборудовании
		|ИЗ
		|	РегистрСведений.invНастройкиПодразделения КАК invНастройкиПодразделения
		|ГДЕ
		|	invНастройкиПодразделения.Подразделение = &Подразделение";
	
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Новый Структура("ПортПринтера, ПечатьНаПодключаемомОборудовании", Выборка.ПортПринтера, Выборка.ПечатьНаПодключаемомОборудовании); 
	КонецЦикла;
	
КонецФункции

#КонецОбласти

#Область ПечатьНаПодключаемомОборудовании

&НаКлиенте
Процедура ПечатьЧерезПодключаемоеОборудование(Знач ШК)
	
	Если Не ТипЗнч(ШК) = Тип("Массив") Тогда
		Массив = Новый Массив();
		Массив.Добавить(ШК);
		ШК = Массив;
	КонецЕсли;                   
	
	ДанныеЭтикеток = Новый Массив;
	Для Каждого Эл Из ШК Цикл
		ТекстЭтикетки = ПолучитьСтрокуИзДвоичныхДанных(Эл, КодировкаТекста.OEM);
		XMLОписаниеМакета = ПолучитьXMLДляПечати(ТекстЭтикетки); //точка входа алгоритма преобразования EPL в XML
		МассивЭтикеток = Новый Массив;
		МассивЭтикеток.Добавить(Новый Структура("Количество, Поля", 1, Новый Массив())); 
		ДанныеЭтикеток.Добавить(Новый Структура("XMLОписаниеМакета, МассивЭтикеток", XMLОписаниеМакета, МассивЭтикеток));
	КонецЦикла;
	
	ДопДанные = Новый Структура;
	ДопДанные.Вставить("Счетчик", 0);
	ДопДанные.Вставить("КоличествоДанных", 	ДанныеЭтикеток.Количество());
	ДопДанные.Вставить("ДанныеЭтикеток", ДанныеЭтикеток);
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПечатьЧерезПодключаемоеОборудованиеПродолжение", ЭтотОбъект, ДопДанные);
	ЛабораторияКлиент.НапечататьЭтикеткиПоДокументуПредВыбором(ОповещениеПриЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧерезПодключаемоеОборудованиеПродолжение(Результат, ДопДанные) Экспорт
	
	Если Результат.Результат Тогда 
		ИдентификаторУстройства = Результат.ИдентификаторУстройства;
		ДопДанные.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
		ЛабораторияКлиент.НапечататьЭтикеткиПоДокументуПродолжение(Новый Структура("Результат", Истина), ДопДанные);
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не удалось найти подключенный принтер на текущем рабочем месте!");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьXMLДляПечати(знач ВходныеДанныеСтр, ИмяФайлаДляЗаписи = "", ШиринаЭтикетки=42,ВысотаЭтикетки=25, ИмяШрифта="MS Sans Serif")
	
    // значение каждой стркои может быть расшифровано по следующему примеру, где цифра - это ПОРЯДОК
	// 1  - N		- Номер команды для принтера
	// 2  - S2	- Выбор шрифта, где 2 - это шрифт среднего размера
	// 3  - D5	- Выбор плотности печати, где 5 - средняя плотность
	// 4  - ZB	- Выбор направления печати, где В - печать в обратном направлении (портрет)
	// 5  - I8,10	- Установка координат начала печати (интервал - 8 точек, расстояние между символами 10 точек)
	// 6  - q335	- Выбор типа штрих-кода (335 - это Code39)
	// 7  - R48,0	- Установка ориентации штрих-кода (48 - поворот на 90 градусов)
	// 8  - Q200,20	- Установка размера штрих-кода (200 - ширина, 20 - высота) - Будем использовать для Barcode, как внешний размер
	// 9  - A116,27,2,4,1,1,N,"КЕК"	- Печать текста "КЕК" с использованием шрифта 2, плотности 4 и координатами начала печати 116, 27
    //	(Такое представление используется для печати почти всех строк - дат, названий числовых последовательностей)
	// 10 - B260,175,2,1,2,2,55,N,"123456789012"	- Печать ШТРИХ-КОДА выбранного типа с номером "123456789012" и началом в 260,175
	// 11 - P1	- Команда принтеру на печать одной копии 
	// LO = нарисовать чёрную линию (есть также LW, LS и LE) имеет 4 параметра: Координата начала Х, Координата начала У, Длинна в точках, Ширина в точкаъ
	
	
	// Описание этикетки передаётся как строка и каждый элемент разделен переходом на следующую строку.
	// Получим каждую "строку описания" штрихкода
	МассивПострочныйОписанияЭтикетки = СтрРазделить(ВходныеДанныеСтр,Строка(Символы.ПС));
    Если МассивПострочныйОписанияЭтикетки.Количество() = 0 Тогда	
		Возврат Неопределено;
	КонецЕсли;
	                  
	// Обработаем строки Массива. Нам известно, что "команда" это всегда первый символ и он имеет строгое значение
	// После чего следуют параметры через запятую (первый параметр идёт сразу после символа)
	// Для последующего заполнения будем формировать структуру, где каждой команде соответствует элемент
	// Только у A (и B в теории) могут быть несколько независимых значений, все из которых надо использовать
	// Поэтому для них значение структуры будет массивом, где каждый элемент - структура по элементу
    ОбработаннаяСтруктураЭтикетки = Новый Структура;
	МассивТекста = Новый Массив;
	МассивШтрихкодов = Новый Массив;
	МассивОбластейЭтикеток = Новый Массив;
	
	// По умолчанию значения на обработку - это размерность "в точках" (НЕ ПИКСЕЛЯХ), надо подобрать преобразование в мм
	// Заявленная ширина элементов может быть БОЛЬШЕ заданного размера, поэтому будем фиксировать их максимальное значение
	// Чтобы при нахождении несоответствий - "скукоживать" на основе Максимального значения по ширине и высоте по Цел(n) + 1
	// Т.е. заявлена ширина 20, факт.ширина 24.3, сохраним 25. Новый факт.ширина будет: Цел((24.3/25)*20) = 19 мм 
	КоэфициаентПреобразованияММ_Г = 0.105;
	КоэфициаентПреобразованияММ_В = 0.129;
	МаксШиринаЧерезЭлемент = ШиринаЭтикетки; 
	МаксВысотаЧерезЭлемент = ВысотаЭтикетки; 
	
	// Впишем размерность Этикеток. Они на входе в мм
	ПромежВычПараметров = Новый Структура;
	ПромежВычПараметров.Вставить("Width",Строка(ШиринаЭтикетки));
	ПромежВычПараметров.Вставить("Height",Строка(ВысотаЭтикетки));
	ОбработаннаяСтруктураЭтикетки.Вставить("Formatting",ПромежВычПараметров);
	
    // Получим нужные нам команды и их параметры, преобразуем в строку для удобного заполнения XML
	// Важно, что Ключ должен соответствовать реальному имени атрибута, что будет использоваться
	Для каждого СтрокаКоманды Из МассивПострочныйОписанияЭтикетки Цикл
	
		СимволКоманды = Лев(СокрЛП(СтрокаКоманды),1);	
		
		// Т.к. у нас всего три значящих значений, то сразу же проверим на них
		// Проверяем какого типа эта команда. Нам нужны конкретные для обработки
		Если СимволКоманды = "A" Тогда
         	// Печать текста
			ПараметрыНаРазбор = СтрРазделить(Сред(СтрокаКоманды,2),",");
			// На практике любое из этих значений может быть пустым
			Для Индекс = 0 По ПараметрыНаРазбор.ВГраница() Цикл
				Если ПустаяСтрока(ПараметрыНаРазбор[Индекс]) Тогда
				   ПараметрыНаРазбор[Индекс] = 0;				
				КонецЕсли;
			КонецЦикла;    

			Попытка			
				ПромежВычПараметров = Новый Структура;
				// Нам не важен КАКОЙ это идентификатор, т.к. макета нет, сделаем случайный
				ПромежВычПараметров.Вставить("FieldName",Новый УникальныйИдентификатор());
				ПромежВычПараметров.Вставить("Align","Left");
				ПромежВычПараметров.Вставить("VAlign","Top");
				
				// Вычисляем точку начала размещения для текста и максимального фактического размера
				ПромежутШирина = Окр(Число(ПараметрыНаРазбор[0])*КоэфициаентПреобразованияММ_Г);
				Если ПромежутШирина > МаксШиринаЧерезЭлемент Тогда
					// Преобразование будет выполняться со всеми элементами потом
				   	МаксШиринаЧерезЭлемент = ПромежутШирина + 1;
				КонецЕсли;
				ПромежутШирина = ШиринаЭтикетки - ПромежутШирина;
				ПромежутШирина = ?( ПромежутШирина > 0,ПромежутШирина,ПромежутШирина*(-1) ) ;
				ПромежВычПараметров.Вставить("Left", ПромежутШирина);
				
				ПромежутВысота = Окр(Число(ПараметрыНаРазбор[1])*КоэфициаентПреобразованияММ_В);
				Если ПромежутВысота > МаксВысотаЧерезЭлемент Тогда
					// Преобразование будет выполняться со всеми элементами потом
				   	МаксВысотаЧерезЭлемент = ПромежутВысота + 1; 
				КонецЕсли;
				ПромежутВысота = ВысотаЭтикетки - ПромежутВысота;
				ПромежутВысота = ?( ПромежутВысота > 0,ПромежутВысота,ПромежутВысота*(-1) );
				ПромежВычПараметров.Вставить("Top", ПромежутВысота);
				
				
				// [3] - Стандарт выбора вида шрифта печати.Для 203 dpi: 1= 6pt (8x12);  2= 7pt (10x16);
				// 3= 10pt (12x20);  4= 12pt (14x24); 5= 24pt (32x48); 
				// Значения подобраны при помощи редактора этикеток БПО
				ПромежВычПараметров.Вставить("FontName",ИмяШрифта);
			 	Если ПараметрыНаРазбор[3] = "1" Тогда
					ПромежВычПараметров.Вставить("FontSize","6");
					ПромежВычПараметров.Вставить("Width", 1*СтрДлина(ПараметрыНаРазбор[7]) );
					ПромежВычПараметров.Вставить("Height",2);
				ИначеЕсли ПараметрыНаРазбор[3] = "2" Тогда
					ПромежВычПараметров.Вставить("FontSize","7");
					ПромежВычПараметров.Вставить("Width", Окр(1.25*СтрДлина(ПараметрыНаРазбор[7])) );
					ПромежВычПараметров.Вставить("Height",3);	
				ИначеЕсли ПараметрыНаРазбор[3] = "3" Тогда
					ПромежВычПараметров.Вставить("FontSize","7");
					ПромежВычПараметров.Вставить("Width", 2*СтрДлина(ПараметрыНаРазбор[7]) );
					ПромежВычПараметров.Вставить("Height",3);
				ИначеЕсли ПараметрыНаРазбор[3] = "4" Тогда
					ПромежВычПараметров.Вставить("FontSize","8");
					ПромежВычПараметров.Вставить("Width", 2*СтрДлина(ПараметрыНаРазбор[7]) );
					ПромежВычПараметров.Вставить("Height",3.5);
				ИначеЕсли ПараметрыНаРазбор[3] = "5" Тогда
					ПромежВычПараметров.Вставить("FontSize","8");
					ПромежВычПараметров.Вставить("Width", 2*СтрДлина(ПараметрыНаРазбор[7]) );
					ПромежВычПараметров.Вставить("Height",3.5);
				Иначе
					ПромежВычПараметров.Вставить("FontSize","5");
					ПромежВычПараметров.Вставить("Width", 1*(СтрДлина(ПараметрыНаРазбор[7])) );
					ПромежВычПараметров.Вставить("Height",2);
				КонецЕсли;
				
				// [2] ориентация текста следующих преобразований 0 = 0, 1= 90, 2=180, 3=270
				// Если по итогу у нас 1 или 3 - текст в высоту. надо менять координаты И размеры местами
				ПромежутПоворот = Число(ПараметрыНаРазбор[2])*90;
				ПромежутШирина = ПромежВычПараметров.Width;
				Если ПромежутПоворот = 90
					ИЛИ ПромежутПоворот = 270
					Тогда
					// Размеры самого поля, нам нужно перевернуть
				    ПромежВычПараметров.Вставить("Width",ПромежВычПараметров.Height);
					ЧрезмернаяДлинна = (ПромежВычПараметров.Top - ПромежутШирина) < 0;
					ПромежВычПараметров.Вставить("Height",?(ЧрезмернаяДлинна,Окр(ПромежутШирина/2), ПромежутШирина) );
					ПромежВычПараметров.Вставить("Orientation",ПромежутПоворот );	
				Иначе
					// Т.к. ширина элемента рассчитывается как СТРДлина, то запретим превышение максимального размера
					ЧрезмернаяДлинна = ПромежВычПараметров.Left + ПромежутШирина; 
					Если ЧрезмернаяДлинна > ШиринаЭтикетки Тогда
					    ПромежВычПараметров.Вставить("Width", Окр((ШиринаЭтикетки - ПромежВычПараметров.Left)/1.5));
					КонецЕсли;
					ПромежутПоворот = ПромежутПоворот - 180;
					ПромежВычПараметров.Вставить("Orientation",Макс(ПромежутПоворот, ПромежутПоворот*(-1)) );
				КонецЕсли;
				
				// [6] N - обратить цвета. N -нет, R -да, игнорируем
				ПромежВычПараметров.Вставить("Multiline","false");
				ПромежВычПараметров.Вставить("TypeFill","Constant");
				ПромежВычПараметров.Вставить("Value",СтрЗаменить(ПараметрыНаРазбор[7],"""",""));
				
				МассивТекста.Добавить(ПромежВычПараметров);
			Исключение			
			КонецПопытки;
			
		ИначеЕсли СимволКоманды = "B" Тогда
			// Печать штрихкодов
			ПараметрыНаРазбор = СтрРазделить(Сред(СтрокаКоманды,2),",");
			// На практике любое из этих значений может быть пустым
			Для Индекс = 0 По ПараметрыНаРазбор.ВГраница() Цикл
				Если ПустаяСтрока(ПараметрыНаРазбор[Индекс]) Тогда
				   ПараметрыНаРазбор[Индекс] = 0;				
				КонецЕсли;
			КонецЦикла;	
			
			Попытка			
				ПромежВычПараметров = Новый Структура;
				// Нам не важен КАКОЙ это идентификатор, т.к. макета нет, сделаем случайный
				ПромежВычПараметров.Вставить("FieldName",Новый УникальныйИдентификатор());
					
				// Вычисляем точку начала размещения для текста и максимального фактического размера
				ПромежутШирина = Окр(Число(ПараметрыНаРазбор[0])*КоэфициаентПреобразованияММ_Г);				
				Если ПромежутШирина > МаксШиринаЧерезЭлемент Тогда
				   	МаксШиринаЧерезЭлемент = ПромежутШирина + 1;
				КонецЕсли;
				ПромежутШирина = ШиринаЭтикетки - ПромежутШирина;
				ПромежутШирина = ?( ПромежутШирина > 0,ПромежутШирина,ПромежутШирина*(-1) ) ;
				ПромежВычПараметров.Вставить("Left", ПромежутШирина);

				ПромежутВысота = Окр(Число(ПараметрыНаРазбор[1])*КоэфициаентПреобразованияММ_В);
				Если ПромежутВысота > МаксВысотаЧерезЭлемент Тогда
				   	МаксВысотаЧерезЭлемент = ПромежутВысота + 1; 
				КонецЕсли;
				ПромежутВысота = ВысотаЭтикетки - ПромежутВысота;
				ПромежутВысота = ?( ПромежутВысота > 0,ПромежутВысота,ПромежутВысота*(-1) );
				ПромежВычПараметров.Вставить("Top", ПромежутВысота);
								
				// [7] печатать код в человекочитаемом виде (с расшифровкой снизу): B=да or N=нет.
				ПромежВычПараметров.Вставить("TypeFill","Constant");
				ПромежВычПараметров.Вставить("Value",СтрЗаменить(ПараметрыНаРазбор[8],"""",""));
				Если ПараметрыНаРазбор[7] = "N" Тогда
					ПромежВычПараметров.Вставить("PrintHRI","false"); 	
				Иначе
				   	ПромежВычПараметров.Вставить("PrintHRI","true");
					ПромежВычПараметров.Вставить("FontSize","3");	
				    ПромежВычПараметров.Вставить("CheckSymbol","false");
				КонецЕсли;

				// [3]  - кодовое обозначение типа кодировки баркода. По умолчанию ставим Code39
				Если ПараметрыНаРазбор[3] = "3" или ПараметрыНаРазбор[3] = "335" Тогда
				    ПромежВычПараметров.Вставить("Type","Code39");
				ИначеЕсли ПараметрыНаРазбор[3] = "1" Тогда
					ПромежВычПараметров.Вставить("Type","Code128");
				ИначеЕсли ПараметрыНаРазбор[3] = "2" Тогда	
					ПромежВычПараметров.Вставить("Type","EAN39"); 
				ИначеЕсли ПараметрыНаРазбор[3] = "9" Тогда	
					ПромежВычПараметров.Вставить("Type","Code93");       
				Иначе
				    ПромежВычПараметров.Вставить("Type","Code128");				
				КонецЕсли;
				
				
				// ЭКСТРЕННЫЕ ЗНАЧЕНИЯ, НА СЛУЧАЙ ОТСУТСТВИЯ СТАНДАРТНОГО. В стандартной работе использоваться не должно
				// [6] - высота штрихкода в пикселях, [5]  - ширина белой полосы, [4] - ширина чёрной полосы, [8] - длинна кодируемой информации
				ВысотаШтрихкода = Окр( Число(ПараметрыНаРазбор[6]) *КоэфициаентПреобразованияММ_В );
				ШиринаШтрихкода = Окр( ( Число(ПараметрыНаРазбор[5]) + Число(ПараметрыНаРазбор[4]) )*
										КоэфициаентПреобразованияММ_Г*СтрДлина(ПараметрыНаРазбор[8]) );
				
				// Слишком узкие пропорции, обычно они слишком узкие
				Если Окр(ВысотаШтрихкода/ШиринаШтрихкода,1) < 0.3  Тогда
					 ВысотаШтрихкода = Окр(ШиринаШтрихкода*0.3);
				ИначеЕсли Окр(ВысотаШтрихкода/ШиринаШтрихкода) > 3 Тогда	
				     ВысотаШтрихкода = ШиринаШтрихкода*3;
				ИначеЕсли Окр(ВысотаШтрихкода/ШиринаШтрихкода) = 1 Тогда
					 ШиринаШтрихкода = ШиринаШтрихкода*3;
				КонецЕсли;
				
				ПромежВычПараметров.Вставить("Height",ВысотаШтрихкода);
				ПромежВычПараметров.Вставить("Width",ШиринаШтрихкода);
																
				// [2] ориентация текста следующих преобразований 0 = 0, 1= 90, 2=180, 3=270
				ПромежутПоворот = Число(ПараметрыНаРазбор[2])*90;
								Если ПромежутПоворот = 90
					ИЛИ ПромежутПоворот = 270
					Тогда
					
					// Размеры самого поля
					ПромежутШирина = ПромежВычПараметров.Width;
				    ПромежВычПараметров.Вставить("Width",ПромежВычПараметров.Height);
					ПромежВычПараметров.Вставить("Height",ПромежутШирина);
					ПромежВычПараметров.Вставить("Orientation", ПромежутПоворот );
				Иначе
					ПромежутПоворот = ПромежутПоворот - 180;
					ПромежВычПараметров.Вставить("Orientation",Макс(ПромежутПоворот, ПромежутПоворот*(-1)) );
				КонецЕсли;		
																			
				МассивШтрихкодов.Добавить(ПромежВычПараметров);	
				Исключение			
				КонецПопытки;
			
		ИначеЕсли СимволКоманды = "Q" Тогда   
			
			// Установка размера штрих-кода, имеет два параметра: Ширина,Высота
			ПараметрыНаРазбор = СтрРазделить(Сред(СтрокаКоманды,2),",");
			Для Индекс = 0 По ПараметрыНаРазбор.ВГраница() Цикл
				Если ПустаяСтрока(ПараметрыНаРазбор[Индекс]) Тогда
				   ПараметрыНаРазбор[Индекс] = 0;				
				КонецЕсли;
			КонецЦикла;	
			
			Попытка			
				
				ВысотаШтрихкода = Окр(Число(ПараметрыНаРазбор[1])*КоэфициаентПреобразованияММ_В);
				ШиринаШтрихкода = Окр(Число(ПараметрыНаРазбор[0])*КоэфициаентПреобразованияММ_Г);
				
				// Слишком узкие пропорции, обычно они слишком узкие
				Если Окр(ВысотаШтрихкода/ШиринаШтрихкода,1) < 0.3  Тогда
					 ВысотаШтрихкода = Окр(ШиринаШтрихкода*0.3);
				ИначеЕсли Окр(ВысотаШтрихкода/ШиринаШтрихкода) > 3 Тогда	
				     ВысотаШтрихкода = ШиринаШтрихкода*3;
				ИначеЕсли Окр(ВысотаШтрихкода/ШиринаШтрихкода) = 1 Тогда
					 ШиринаШтрихкода = ШиринаШтрихкода*3;
				КонецЕсли;
				
				ПромежВычПараметров = Новый Структура;
				ПромежВычПараметров.Вставить("Width",ШиринаШтрихкода );
				ПромежВычПараметров.Вставить("Height",ВысотаШтрихкода );
			                               
	            ОбработаннаяСтруктураЭтикетки.Вставить("BarcodeSizeParams",ПромежВычПараметров);
				// Используем только один размер ля всех штрихкодов. Стандарт - один штрихкод
			Исключение			
			КонецПопытки;
		ИначеЕсли СимволКоманды = "L" Тогда   
			
			// Это разделитель, имеет 4 параметра: Начало Х, Начало У, Ширина, Высота
			// Состоит из двух Символов: LO, LS, LW, LE ...
			// Нам важен сам факт такого символа - это означает, что объекты, которые разделяет этот элемент,
			// Нельзя приближать по Х или У (в зависимости от того какой параметр больше - Ширина или Высота)
			ПараметрыНаРазбор = СтрРазделить(Сред(СтрокаКоманды,3),",");
			Для Индекс = 0 По ПараметрыНаРазбор.ВГраница() Цикл
				Если ПустаяСтрока(ПараметрыНаРазбор[Индекс]) Тогда
				   ПараметрыНаРазбор[Индекс] = 0;				
				КонецЕсли;
			КонецЦикла;	
			
			Попытка			
				ПромежВычПараметров = Новый Структура;
				ПромежВычПараметров.Вставить("Left", Окр(Число(ПараметрыНаРазбор[0])*КоэфициаентПреобразованияММ_Г) );
				ПромежВычПараметров.Вставить("Top", Окр(Число(ПараметрыНаРазбор[1])*КоэфициаентПреобразованияММ_В) );
				ПромежВычПараметров.Вставить("TypeFill","Constant"); 
				ПромежВычПараметров.Вставить("Multiline","false");
                ПромежВычПараметров.Вставить("Align","Left");
                ПромежВычПараметров.Вставить("VAlign","Top");
				ПромежВычПараметров.Вставить("FieldName", Новый УникальныйИдентификатор() );
                ПромежВычПараметров.Вставить("FontSize","2");
				ПромежВычПараметров.Вставить("FontName","MS Sans Serif");
									
				ПромежутШирина = Окр(Число(ПараметрыНаРазбор[2])*КоэфициаентПреобразованияММ_Г);
				ПромежутВысота = Окр(Число(ПараметрыНаРазбор[3])*КоэфициаентПреобразованияММ_В);

				// Вертикальная черта
				Если ПромежутШирина < ПромежутВысота Тогда
					ПромежВычПараметров.Вставить("Width", 1 );
					ПромежВычПараметров.Вставить("Height", ПромежутВысота );
					ПромежВычПараметров.Вставить("Orientation",270);
					ПромежВычПараметров.Вставить("Value", СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", ПромежутВысота) );
				Иначе
				// Горизонтальная черта	
					ПромежВычПараметров.Вставить("Width", ПромежутШирина );
					ПромежВычПараметров.Вставить("Height", 1 );
					ПромежВычПараметров.Вставить("Orientation",180);
                    ПромежВычПараметров.Вставить("Value", СтроковыеФункцииКлиентСервер.СформироватьСтрокуСимволов("_", ПромежутШирина) );
				КонецЕсли;            
				
				МассивОбластейЭтикеток.Добавить(ПромежВычПараметров);       
			Исключение			
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	// -- Подправляем данные после их начального считывания --
	// Размерность этикетки - большая, а не преобразованная, только для ЭТИКЕТОК СТАНДАРТНОГО ВИДА
	// Будем считать стандартный - это когда один штрихкод на всю этикетку и нет никаких разделений границ поля
	// преобразуем и саму этикетку, 
	СтруктураОбщегоРазмераШтрихкода = Неопределено;
	ОбработаннаяСтруктураЭтикетки.Свойство("BarcodeSizeParams",СтруктураОбщегоРазмераШтрихкода);
	Если МассивШтрихкодов.Количество() = 1 
	И МассивОбластейЭтикеток.Количество() = 0
	Тогда
		Если СтруктураОбщегоРазмераШтрихкода <> Неопределено Тогда
			
			Если Окр(СтруктураОбщегоРазмераШтрихкода.Height/ВысотаЭтикетки,1) <> Окр(1/3,1) Тогда
				СтруктураОбщегоРазмераШтрихкода.Вставить("Height", Окр(ВысотаЭтикетки/3) );
			КонецЕсли;
			Если Окр(СтруктураОбщегоРазмераШтрихкода.Width/ШиринаЭтикетки,1) <> Окр(3/5,1) Тогда
				СтруктураОбщегоРазмераШтрихкода.Вставить("Width", Окр((ШиринаЭтикетки*3)/5) );
			КонецЕсли;
			
			ОбработаннаяСтруктураЭтикетки.Вставить("BarcodeSizeParams",СтруктураОбщегоРазмераШтрихкода);
		КонецЕсли;	
	КонецЕсли;
	
	// При необходимости подгоним размеры элементов под заявленные
	Если МаксШиринаЧерезЭлемент > ШиринаЭтикетки
	ИЛИ  МаксВысотаЧерезЭлемент > ВысотаЭтикетки
	Тогда
	    ПодогнатьРазмер =  Истина; 
	Иначе
		ПодогнатьРазмер = Ложь;
	КонецЕсли;
	
	
	// Составим массив всех элементов (сткрутура с 4 координатами, типом (Т/Ш), индексом в массиве. МАССИВ НЕ ДОЛЖЕН МЕНЯТЬ ПОРЯДОК)
	// При необходимости сначала будем подгонять координаты начала. Ширину и длинну текста не трогаем, т.к. она жёстко задана на символ
	МассивРамокВсехЭлем = РаспределитьИРасчитатьЭлементыПоОбластямЭтикетки(МассивОбластейЭтикеток,МассивШтрихкодов,МассивТекста,СтруктураОбщегоРазмераШтрихкода,
								Новый Структура("ШиринаЭтикетки,ВысотаЭтикетки,ПодогнатьРазмер, МаксВысотаВысч, МаксШиринаВысч",
												ШиринаЭтикетки, ВысотаЭтикетки, ПодогнатьРазмер,МаксВысотаЧерезЭлемент, МаксШиринаЧерезЭлемент) );
								
	// -- Формируем XML представление этикетки -- 
	// МассивРамокВсехЭлементов - это массив со ВСЕМИ элементам всей этикетки, у которых были изменены данные
	// Инициализируем класс "ЗаписьXML"
	НайденноеЗначениеСвойства = Неопределено;
	ЗаписьЭтикетки = Новый ЗаписьXML;
	
	// объявляем XML-файла и заполним его принятыми данными
	Если ИмяФайлаДляЗаписи = "" Тогда
		ЗаписьЭтикетки.УстановитьСтроку("UTF-8");
	Иначе
		ЗаписьЭтикетки.ОткрытьФайл(ИмяФайлаДляЗаписи, "UTF-8");
	КонецЕсли; 
	ЗаписьЭтикетки.ЗаписатьОбъявлениеXML();
		
	// Корневой элемент - формат полотна, указываем размер ВСЕЙ этикетки 
	ЗаписьЭтикетки.ЗаписатьНачалоЭлемента("Formatting");
    Для каждого КлючЗначениеСтруктуры Из ОбработаннаяСтруктураЭтикетки.Formatting Цикл	
		ЗаписьЭтикетки.ЗаписатьАтрибут(КлючЗначениеСтруктуры.Ключ,КлючЗначениеСтруктуры.Значение);
	КонецЦикла;

	// Проходимся по всем текстам и штрихкодам, получаем их размеры и их остальные значения
	Для каждого ЭлементНаполненияСтруктурой Из МассивРамокВсехЭлем Цикл
		
		// Поменяем местами точки начала по высоте и ширине зркально
		Если ЭлементНаполненияСтруктурой.ТипЭлем = "Ш" Тогда
			
			ЗаписьЭтикетки.ЗаписатьНачалоЭлемента("Barcode");
			СтруктураДляЧтения = МассивШтрихкодов[ЭлементНаполненияСтруктурой.Индекс];
            СтруктураДляЧтения.Left = ЭлементНаполненияСтруктурой.ОтступЛев;
			СтруктураДляЧтения.Width = ЭлементНаполненияСтруктурой.Ширина; 
			СтруктураДляЧтения.Height = ЭлементНаполненияСтруктурой.Высота;
			СтруктураДляЧтения.Top = ?(ЭлементНаполненияСтруктурой.Вертикален,   //(СтруктураДляЧтения.Orientation=90 ИЛИ СтруктураДляЧтения.Orientation=270),
										Макс(1,(ЭлементНаполненияСтруктурой.ОтступВерх - ЭлементНаполненияСтруктурой.Высота)),
										ЭлементНаполненияСтруктурой.ОтступВерх); 
										
            Для каждого КлючЗначениеШтрихкода Из СтруктураДляЧтения Цикл
				ЗаписьЭтикетки.ЗаписатьАтрибут(КлючЗначениеШтрихкода.Ключ,Строка(КлючЗначениеШтрихкода.Значение));
			КонецЦикла;	
		Иначе
			
			ЗаписьЭтикетки.ЗаписатьНачалоЭлемента("Text");
			СтруктураДляЧтения = МассивТекста[ЭлементНаполненияСтруктурой.Индекс];
			СтруктураДляЧтения.Left = ЭлементНаполненияСтруктурой.ОтступЛев;
			СтруктураДляЧтения.Width = ЭлементНаполненияСтруктурой.Ширина;
			СтруктураДляЧтения.Height = ЭлементНаполненияСтруктурой.Высота;
			СтруктураДляЧтения.Top = ?(ЭлементНаполненияСтруктурой.Вертикален,  //(СтруктураДляЧтения.Orientation=90 ИЛИ СтруктураДляЧтения.Orientation=270),
										Макс(1,(ЭлементНаполненияСтруктурой.ОтступВерх - ЭлементНаполненияСтруктурой.Высота)),
										ЭлементНаполненияСтруктурой.ОтступВерх); 
										
			Для каждого КлючЗначениеТекста Из СтруктураДляЧтения Цикл
				ЗаписьЭтикетки.ЗаписатьАтрибут(КлючЗначениеТекста.Ключ,Строка(КлючЗначениеТекста.Значение));	
			КонецЦикла;			
		КонецЕсли;
		
	    ЗаписьЭтикетки.ЗаписатьКонецЭлемента(); 
		
	КонецЦикла;

	Для каждого ЭлементРазделитель Из МассивОбластейЭтикеток Цикл
		ЗаписьЭтикетки.ЗаписатьНачалоЭлемента("Text");
		
		// Если элемент будет начинаться с 0, то это будет ошибка
		Если ЭлементРазделитель.Orientation = 270 Тогда
			ЭлементРазделитель.Top = Макс(ЭлементРазделитель.Top, 1);;
			ЭлементРазделитель.Height = ВысотаЭтикетки - ЭлементРазделитель.Top - 1;
		Иначе
		    ЭлементРазделитель.Left = Макс(ЭлементРазделитель.Left, 1);
            ЭлементРазделитель.Width = ШиринаЭтикетки - ЭлементРазделитель.Left - 1;
		КонецЕсли;
		
		
		Для каждого КлючЗначениеЭлемента Из ЭлементРазделитель Цикл
				ЗаписьЭтикетки.ЗаписатьАтрибут(КлючЗначениеЭлемента.Ключ,Строка(КлючЗначениеЭлемента.Значение));
		КонецЦикла;
	
		ЗаписьЭтикетки.ЗаписатьКонецЭлемента(); 
	КонецЦикла;
	
	// Закрывает корневой элемент
	ЗаписьЭтикетки.ЗаписатьКонецЭлемента();
	РезультатСтрока = ЗаписьЭтикетки.Закрыть(); // Закрываем файл
	
	Возврат ?(ПустаяСтрока(РезультатСтрока), СтрШаблон("Успешно записано в файл %1",ИмяФайлаДляЗаписи),РезультатСтрока);
		
КонецФункции

// Функция - Распределить и расчитать элементы по областям этикетки
//
// Параметры:
//  МассВсехОбл			 - Массив структур	 - значения рамки области в этикетке Width, Height, Left, Top
//  МассШтрихкоды		 - Массив структур	 - значения расшифрованного Штрихкода (имеет всю информацию для принтера)
//  МассТекста			 - Массив структур	 - значения расшифрованного Текста (имеет всю информацию для принтера)
//  СтруктОбщийШтрихкод	 - Структура	 - Структура значений штрихкода общего
//  СтруктРазмеры		 - Структура	 - Значения рамок и проч, ключи -  ПодогнатьРазмер,  ШиринаЭтикетки, ВысотаЭтикетки,
//	   		   МаксВысотаЧерезЭлемент, МаксШиринаЧерезЭлемент
// 
// Возвращаемое значение:
//  Массив структур -
//
&НаСервереБезКонтекста
Функция РаспределитьИРасчитатьЭлементыПоОбластямЭтикетки(знач МассВсехОбл, знач МассШтрихкоды, знач МассТекста,СтруктОбщийШтрихкод, СтруктРазмеры )
	
	МассивРамокВсехЭлем = Новый Массив;
    ИтоговыйМассив = Новый Массив;

	Для ИндексМассива = 0 По МассТекста.Количество() - 1 Цикл

		TextСтруктурой = МассТекста[ИндексМассива];
		ПромежутВысота = TextСтруктурой.Top;
		ПромежутШирина = TextСтруктурой.Left;
		
		Если СтруктРазмеры.ПодогнатьРазмер Тогда
			// подгоняем данные и переводим в нужное состояние, т.к. арифметика существует, то значение точно не отрицательное
			ПромежутВысота = Окр( (ПромежутВысота/СтруктРазмеры.МаксВысотаВысч)*СтруктРазмеры.ВысотаЭтикетки );
			TextСтруктурой.Вставить("Top", ПромежутВысота );
			
			ПромежутШирина = Окр( (ПромежутШирина/СтруктРазмеры.МаксШиринаВысч)*СтруктРазмеры.ШиринаЭтикетки ); 
			TextСтруктурой.Вставить("Left", ПромежутШирина);
		КонецЕсли;
		
		МассТекста[ИндексМассива] = TextСтруктурой;
		МассивРамокВсехЭлем.Добавить(Новый Структура("ОтступЛев,ОтступВерх,Ширина,Высота,ТипЭлем, Индекс, Вертикален",
									TextСтруктурой.Left,TextСтруктурой.Top,TextСтруктурой.Width,TextСтруктурой.Height,
									"Т",ИндексМассива, (TextСтруктурой.Orientation=90 ИЛИ TextСтруктурой.Orientation=270)) );
	КонецЦикла;
	
	// Пройдёмся по всем штрихкодам
	Для ИндексМассива = 0 По МассШтрихкоды.Количество() - 1 Цикл
		
		BarcodeСтруктурой = МассШтрихкоды[ИндексМассива];
		ПромежутВысота = Число(BarcodeСтруктурой.Top); 
		ПромежутШирина = Число(BarcodeСтруктурой.Left);
		
		Если СтруктРазмеры.ПодогнатьРазмер Тогда
			// подгоняем данные
			ПромежутВысота = Окр( (ПромежутВысота/СтруктРазмеры.МаксВысотаВысч)*СтруктРазмеры.ВысотаЭтикетки );
			ПромежутШирина = Окр( (ПромежутШирина/СтруктРазмеры.МаксШиринаВысч)*СтруктРазмеры.ШиринаЭтикетки );
			BarcodeСтруктурой.Вставить("Top", ПромежутВысота );
			BarcodeСтруктурой.Вставить("Left", ПромежутШирина );
		КонецЕсли;
		
		// У Штрихкода приоритезируем - Общую ширину над частной и Частную высоту над Общей
		Если СтруктОбщийШтрихкод <> Неопределено Тогда
			
			BarcodeСтруктурой.Вставить("Width", СтруктОбщийШтрихкод.Width );
			
			Если BarcodeСтруктурой.Height < 1 
				ИЛИ МассШтрихкоды.Количество() = 1
				Тогда
				BarcodeСтруктурой.Вставить("Height", СтруктОбщийШтрихкод.Height );
			КонецЕсли;
		КонецЕсли;
		
		МассШтрихкоды[ИндексМассива] = BarcodeСтруктурой;
		МассивРамокВсехЭлем.Добавить(Новый Структура("ОтступЛев,ОтступВерх,Ширина,Высота,ТипЭлем, Индекс, Вертикален",
									BarcodeСтруктурой.Left,BarcodeСтруктурой.Top,BarcodeСтруктурой.Width,
									BarcodeСтруктурой.Height,"Ш",ИндексМассива,(BarcodeСтруктурой.Orientation=90 ИЛИ BarcodeСтруктурой.Orientation=270)));	
	КонецЦикла;
	
	                       
	// Будем работать с этикеткой как полотно с 1...n количеством областей (область разделена линией)
	// Стандартная этикетка имеет одну область
	Если МассВсехОбл.Количество() = 0 Тогда
	   	// Упорядочиваем все элементы и проверяем их коллизии между собой и с размерами этикетки 
		// Тут храняться только данные координат, индекс и тип массива для определения
		ИтоговыйМассив = ПроверитьМассивКоординатЭлементовНаКоллизию(МассивРамокВсехЭлем,
							Новый Структура("Высота,Ширина",СтруктРазмеры.ВысотаЭтикетки,СтруктРазмеры.ШиринаЭтикетки),
							Новый Структура("Мин_Х,Макс_Х,Мин_У,Макс_У,ОтступРамка",0,0,0,0,1), Ложь);

	Иначе
		// Несколько областей, отстортируем для каждой его элементы и проставим границы
		// В процессе работы будем принимать размер области подобно полотну (координаты от 0 до границы области справа снизу)
		// После чего будем преобразовывать результат
		Прошлое_У = 0;
		Прошлое_Х = 0;
		ОтступРамки = 1;

		// Будем нормализовать под наименьший штрихкод
		МинШир_Штрихкод = СтруктРазмеры.ШиринаЭтикетки;
		МинВыс_Штрихкод = СтруктРазмеры.ВысотаЭтикетки;
		
		// обойдём все области и все элементы в областях  -От левого края до разделителя
		// Left, Top, Width, Height
		Для каждого СтруктураОбласти Из МассВсехОбл Цикл
			
			МассивРамокВОбласти = Новый Массив;
			// Если горизонтальная, то возьмём как точка отсчёта за вычетом предыдщего, для вертикальной аналогично
			Если СтруктураОбласти.Height = 1 Тогда
				
			    ВысотаОбласти = СтруктураОбласти.Top - Прошлое_У; 
				ШиринаОбласти = СтруктураОбласти.Width;
				ПраваяГраница_У = СтруктураОбласти.Top; 
				ПраваяГраница_Х = СтруктураОбласти.Width;

			Иначе        // СтруктураОбласти.Width = 0
				ВысотаОбласти = СтруктураОбласти.Height;
				ШиринаОбласти =  СтруктураОбласти.Left - Прошлое_Х;	
				ПраваяГраница_У = СтруктураОбласти.Height;
				ПраваяГраница_Х =  СтруктураОбласти.Left;
			КонецЕсли;
			
			
			// Заполним все входящие элементы в область  "ОтступЛев,ОтступВерх,Ширина,Высота,ТипЭлем, Индекс, Вертикален"
			Для каждого ЭлементДляВставки Из МассивРамокВсехЭлем Цикл
				
				Если ЭлементДляВставки.ОтступЛев >= (Прошлое_Х)
				И ЭлементДляВставки.ОтступВерх >= (Прошлое_У)
				И ЭлементДляВставки.ОтступЛев <= (ПраваяГраница_Х)
				И ЭлементДляВставки.ОтступВерх <= (ПраваяГраница_У) 
				Тогда
					МассивРамокВОбласти.Добавить(ЭлементДляВставки);	
				КонецЕсли;
			КонецЦикла;			
			
			Если МассивРамокВОбласти.Количество() = 0 Тогда
				Прошлое_У = СтруктураОбласти.Top;
				Прошлое_Х = СтруктураОбласти.Left;
				Продолжить;
			Иначе
				Для каждого ЭлементНаУдаление Из МассивРамокВОбласти Цикл
					Элемент = МассивРамокВсехЭлем.Найти(ЭлементНаУдаление);
					МассивРамокВсехЭлем.Удалить(Элемент);
				КонецЦикла;
			КонецЕсли;
			
			МассивРамокВОбласти = ПроверитьМассивКоординатЭлементовНаКоллизию(МассивРамокВОбласти,
							Новый Структура("Высота,Ширина",ВысотаОбласти,ШиринаОбласти),
							Новый Структура("Мин_Х,Макс_Х,Мин_У,Макс_У,ОтступРамка",0,0,0,0,ОтступРамки));
							
			// Полученное "перемещаем" в общий массив, предварительно "переместив" элементы на величину сдвига области
			Для каждого ЭлементыОбласти Из МассивРамокВОбласти Цикл  
				
				Если ЭлементыОбласти.ТипЭлем = "Ш" Тогда
					Если ЭлементыОбласти.Высота < МинВыс_Штрихкод Тогда
						МинВыс_Штрихкод = ЭлементыОбласти.Высота;	
					КонецЕсли; 
					Если ЭлементыОбласти.Ширина < МинШир_Штрихкод Тогда
						МинШир_Штрихкод = ЭлементыОбласти.Ширина;	
					КонецЕсли;
				КонецЕсли;

				ЭлементыОбласти.ОтступЛев = ЭлементыОбласти.ОтступЛев + Прошлое_Х;				
				ЭлементыОбласти.ОтступВерх = ЭлементыОбласти.ОтступВерх + Прошлое_У;
				ИтоговыйМассив.Добавить(ЭлементыОбласти);
			КонецЦикла;
			
			Прошлое_У = СтруктураОбласти.Top;
			Прошлое_Х = СтруктураОбласти.Left;
		КонецЦикла;
		
		// Оставшиеся элементы расположены от последних Прошлое_у и Прошлое_Х до конца этикетки
		Если МассивРамокВсехЭлем.Количество() > 0 Тогда
			
			ВысотаОбласти = СтруктРазмеры.ВысотаЭтикетки - Прошлое_У; 
			ШиринаОбласти = СтруктРазмеры.ШиринаЭтикетки - Прошлое_Х;
			
			МассивРамокВсехЭлем  = ПроверитьМассивКоординатЭлементовНаКоллизию(МассивРамокВсехЭлем,
							Новый Структура("Высота,Ширина",ВысотаОбласти,ШиринаОбласти),
							Новый Структура("Мин_Х,Макс_Х,Мин_У,Макс_У,ОтступРамка",0,0,0,0,ОтступРамки));
		
			Для каждого ЭлементыОбласти Из МассивРамокВсехЭлем Цикл  
				
				Если ЭлементыОбласти.ТипЭлем = "Ш" Тогда
					Если ЭлементыОбласти.Высота < МинВыс_Штрихкод Тогда
						МинВыс_Штрихкод = ЭлементыОбласти.Высота;	
					КонецЕсли; 
					Если ЭлементыОбласти.Ширина < МинШир_Штрихкод Тогда
						МинШир_Штрихкод = ЭлементыОбласти.Ширина;	
					КонецЕсли;
				КонецЕсли;

				ЭлементыОбласти.ОтступЛев = ЭлементыОбласти.ОтступЛев + Прошлое_Х;				
				ЭлементыОбласти.ОтступВерх = ЭлементыОбласти.ОтступВерх + Прошлое_У;
				ИтоговыйМассив.Добавить(ЭлементыОбласти);
			КонецЦикла	
		КонецЕсли;
		
		// Нормализуем Все штрихкоды - приравняем их размеры к минимальным
		Для ИндексИтога = 0 По ИтоговыйМассив.ВГраница() Цикл
			Если ИтоговыйМассив[ИндексИтога].ТипЭлем = "Ш" Тогда
				ИтоговыйМассив[ИндексИтога].Высота = МинВыс_Штрихкод;	
				ИтоговыйМассив[ИндексИтога].Ширина = МинШир_Штрихкод;	
			КонецЕсли;
		КонецЦикла;
		
   КонецЕсли;
   
   Возврат ИтоговыйМассив;
	
КонецФункции


// Сначала упорядочим все элементы. Порядок будет идти такой, что "первая строка" элементов - это минимальные по Y и все по X
// И так будут идти все строки. Каждый элемент сначала проверяем по следующим правилам:
// 1 - Если текущий элемент пересекается со следующим по X - то мы его передвигаем на минимум вправо
// 2 - Если текущий элемент пересекается с элементами по Y (следующая "строка") - ТЕ элементы мы передвигаем на минимум вниз
// 3 - Опционально - Если текущий элемент слишком далеко от максимального допустимого расстояния между элементами ПО Х
// То мы тот элемент "пододвигаем ближе вплоть до максимального допустимого расстояния", Для Y аналогично для ВСЕХ элементов
// 4 - После проверок коллизий по крайним точкам смотрим - входит ли всё в этикетку. Для решения этого вопроса перемещаем ВСЕ
// элементы внутри этикетки. Недопустимым считается выход за пределы или "наезд на края" (т.е. первый элемент должен начинаться 
// не раньше значения 2 с любой стороны). Если обычного передвижения недостаточно - то выполняем пункт 2, но теперь максимально
// допустимым считается значение, которое расчитывается по тому размеру выхода за край этикетки
// Функция - Проверить массив координат элементов на коллизию
//
// Параметры:
//  НачМассивЭлементов	 - Массив	- Массив структур, описывающий каждый элемент, имеет такие ключи как
// 		ОтступЛев,ОтступВерх,Ширина,Высота (все число), ТипЭлем (Строка "Ш" или "Т"), Индекс, Вертикален. 
//  СтруктураЭтикетки	 - Структура	- Параметры этикетки, которые нужно указать. Имеет ключи "Ширина" и "Высота"
//  СтруктураДопРасстояний	- Структура	-  "Мин_Х,Макс_Х,Мин_У,Макс_У,ОтступРамка" 
//
// Возвращаемое значение:
//   Массив - переделанный НачМассивЭлементов
//
&НаСервереБезКонтекста
Функция ПроверитьМассивКоординатЭлементовНаКоллизию(знач НачМассивЭлементов, СтруктураЭтикетки, СтруктураДопРасстояний, СмещатьПо_Х = Истина)
		
	// Заранее сдвинем без формирования двумерного массива все элементы, чтобы они (не связано друг с другом), были близки по Х
	// БЕЗ проверки по У  !!  
	Если СмещатьПо_Х Тогда
		НачМассивЭлементов = СмещениеМассиваПо_Х(НачМассивЭлементов, СтруктураДопРасстояний.Макс_Х);
	КонецЕсли;
	
	// Сформируем двумерный массив, упорядоченный по У, по Х, с которым будем потом работать
	ДвумерныйМассивНаОбход = ФормДвумерногоМассиваПо_У_По_Х(НачМассивЭлементов);
	 

	// Проверим На коллизии
	Мин_Х_ВсеЭлементы = СтруктураЭтикетки.Ширина;
	Макс_Х_ВсеЭлементы = 0; 
	
	ДвумерныйМассивНаОбход = ИзменитьРазмер_Х_У(ДвумерныйМассивНаОбход,СтруктураДопРасстояний.Мин_Х,СтруктураДопРасстояний.Макс_Х,
												СтруктураДопРасстояний.Мин_У,СтруктураДопРасстояний.Макс_У,,, Мин_Х_ВсеЭлементы, Макс_Х_ВсеЭлементы);
													
	// Теперь проверим по минимальным и максимальным значениям Х и У у получившихся элементов - вписываемся ли мы
	// Т.к. Двумерный массив рассортирован по возрастанию У, то просто возьмём самый первый элемент [0][0]
	// Как минимальный У. Максимальное значение У - [Последний][0]
	КрайнийЭлемент = ДвумерныйМассивНаОбход[0][0];
	Мин_У_ВсеЭлементы = ?(КрайнийЭлемент.Вертикален, КрайнийЭлемент.ОтступВерх - КрайнийЭлемент.Высота,КрайнийЭлемент.ОтступВерх);
	КрайнийЭлемент = ДвумерныйМассивНаОбход[ДвумерныйМассивНаОбход.ВГраница()][0];
	Макс_У_ВсеЭлементы = ?(КрайнийЭлемент.Вертикален, КрайнийЭлемент.ОтступВерх, КрайнийЭлемент.ОтступВерх + КрайнийЭлемент.Высота);
	
	
	// Проверим заранее размеры итогового полотна - больше ли он самой этикетки 
	// Проверим без этого
	Если ((Макс_Х_ВсеЭлементы - Мин_Х_ВсеЭлементы) > СтруктураЭтикетки.Ширина ИЛИ
	(Макс_У_ВсеЭлементы - Мин_У_ВсеЭлементы) > СтруктураЭтикетки.Высота)
	И  (СтруктураДопРасстояний.Макс_Х > 0 ИЛИ СтруктураДопРасстояний.Макс_У  > 0 )
	Тогда
		//Если есть возможность уменьшить расстояние - максимально допустимое <> 0, то уменьшим
		ДвумерныйМассивНаОбход = ИзменитьРазмер_Х_У(ДвумерныйМассивНаОбход,0,0,0,0, Ложь,,0,0);
		ДвумерныйМассивНаОбход = МаксимизироватьШтрихкод(ДвумерныйМассивНаОбход,СтруктураЭтикетки.Ширина,СтруктураЭтикетки.Высота);
		
	Иначе
		// По идее сюда проваливаемся и если текст получился слишком большим по какой-то из сторон, но его нельзя легко исправить переставлением
		// Если будут фактические проблемы (в теории их быть не должно), то либо тут менять, либо в момент подготовки областей!
		
		// Увеличим по максимуму штрих-код, после чего попробуем переместить все элементы внутри 
		ДвумерныйМассивНаОбход = МаксимизироватьШтрихкод(ДвумерныйМассивНаОбход,СтруктураЭтикетки.Ширина,СтруктураЭтикетки.Высота,
												СтруктураДопРасстояний.Мин_Х,СтруктураДопРасстояний.Мин_У,СтруктураДопРасстояний.ОтступРамка);
	КонецЕсли;	
		
	// получим одномерный массив, чтобы было удобно
	ИтоговыйМассивВсехЭлементов = Новый Массив;
	Для каждого СтрокаМассива Из ДвумерныйМассивНаОбход Цикл
		Для каждого ЭлементИзСтроки Из СтрокаМассива Цикл		
			ИтоговыйМассивВсехЭлементов.Добавить(ЭлементИзСтроки);			
		КонецЦикла;
	КонецЦикла;
	
	Возврат ИтоговыйМассивВсехЭлементов;
	
КонецФункции

// ДвойнойМассивНаОбход - это двумерный массив, где первое измерение - У, второе - Х
&НаСервереБезКонтекста
Функция ИзменитьРазмер_Х_У(Знач ДвумерМассивНаОбход, МинРасст_Х, МаксРасст_Х, МинРасст_У, МаксРасст_У, ПроверитьПересечениеЭлементов = Истина,
							ПроверитьОтдалениеЭлементов = Истина, Мин_Х_ВсеЭлементы = 0, Макс_Х_ВсеЭлементы = 0)

	// Теперь можно обойти сверху-вниз и слева-направо все элементы и отрегулировать их коллизии
	Для Индекс_У = 0 По ДвумерМассивНаОбход.ВГраница() Цикл
		
		// Получаем строку по У
		МассивЗнач_У = ДвумерМассивНаОбход[Индекс_У];
		
		// Для проверки справа
		Для Индекс_Х = 0 По МассивЗнач_У.ВГраница() Цикл
			
			ТекущийЭлемент = МассивЗнач_У[Индекс_Х];
			Тек_Макс_Х = ТекущийЭлемент.ОтступЛев + ТекущийЭлемент.Ширина; 
				
			Если Мин_Х_ВсеЭлементы > ТекущийЭлемент.ОтступЛев Тогда
				Мин_Х_ВсеЭлементы = ТекущийЭлемент.ОтступЛев;
			КонецЕсли;
			Если Макс_Х_ВсеЭлементы < Тек_Макс_Х Тогда
				Макс_Х_ВсеЭлементы = Тек_Макс_Х; 
			КонецЕсли;
			
			// Проверка правого элемента. Если это последний элемент по Х, то у него нет правых соседий
			Если Индекс_Х < МассивЗнач_У.ВГраница() Тогда
				
				//	Разность = (Прав_Мин_Х - Тек_Макс_Х)
				ПравыйЭлемент = МассивЗнач_У[Индекс_Х + 1];
				РасстояниеМеждуЭлем_Х = (ПравыйЭлемент.ОтступЛев) - Тек_Макс_Х;
				
				// Проверка коллизий справа. Если Тек_Макс_Х > Прав_Мин_Х - то перемещаем по оси Х правый элемент
				Если ПроверитьПересечениеЭлементов 
					И РасстояниеМеждуЭлем_Х < 0
					Тогда
					РасстояниеМеждуЭлем_Х = РасстояниеМеждуЭлем_Х*(-1) + МинРасст_Х;
					ПравыйЭлемент.ОтступЛев = ПравыйЭлемент.ОтступЛев + РасстояниеМеждуЭлем_Х; 
					МассивЗнач_У[Индекс_Х + 1] = ПравыйЭлемент;
					
					// Слишком далеко, сократим расстояние	
				ИначеЕсли ПроверитьОтдалениеЭлементов
					И (РасстояниеМеждуЭлем_Х) > МаксРасст_Х
					Тогда
					
					ПравыйЭлемент.ОтступЛев = Тек_Макс_Х + МаксРасст_Х; 
					МассивЗнач_У[Индекс_Х + 1] = ПравыйЭлемент;
				КонецЕсли;
			КонецЕсли;
			
			// Проверка по У оси. Если это последний элемент оси Y - то нам его проверять не надо 
			Если Индекс_У < ДвумерМассивНаОбход.ВГраница() Тогда
				
				// У нижних элементов неизвестное кол-во и мы не знаем какой из них может быть "неправильного расстояния"
				// Для Вертикальных элементов "ОтступВерх" - это НИЖНЕЕ значение, а "ОтступВерх - Высота" - ВЕРХНЕЕ значение
				Тек_Макс_У = ?(ТекущийЭлемент.Вертикален, ТекущийЭлемент.ОтступВерх, ТекущийЭлемент.ОтступВерх + ТекущийЭлемент.Высота);
				Тек_Мин_У = ?(ТекущийЭлемент.Вертикален, ТекущийЭлемент.ОтступВерх - ТекущийЭлемент.Высота, ТекущийЭлемент.ОтступВерх);
				
				ИндексСледРяда_У = Индекс_У + 1;
				// Может быть ситуация, когда под текущим есть пересечение, но в массиве их разъединяет дургой элемент
				// и изменение не пройдёт
				НайденХотьОдинПодТекущим = Ложь;
				Для ИндексСледРяда_Х = 0 По ДвумерМассивНаОбход[ИндексСледРяда_У].ВГраница() Цикл
					
					// Проверка коллизий снизу. Если Тек_Макс_У > Нижние_Мин_У 
					ЭлементНижеПоУ = ДвумерМассивНаОбход[ИндексСледРяда_У][ИндексСледРяда_Х];
					Ниж_Мин_У = ?(ЭлементНижеПоУ.Вертикален, ЭлементНижеПоУ.ОтступВерх - ЭлементНижеПоУ.Высота, ЭлементНижеПоУ.ОтступВерх);

					РасстояниеМеждуЭлем_У = Ниж_Мин_У - Тек_Макс_У; 
					
					// проверяем только те элементы, что находятся ПОД текущим элементом по оси Х
					// Если  Элем2_Мин_Х - Элем1_Макс_Х < 0 ИЛИ Элем1_Мин_Х - Элем2_Макс_Х < 0 - элемент либо ссправа, либо слева
					ЭлементыНеДругПодДругом = ((ЭлементНижеПоУ.ОтступЛев - Тек_Макс_Х) > 0) 
								ИЛИ ((ТекущийЭлемент.ОтступЛев - (ЭлементНижеПоУ.ОтступЛев+ЭлементНижеПоУ.Ширина)) < 0);
					НайденХотьОдинПодТекущим = (ЭлементыНеДругПодДругом ИЛИ НайденХотьОдинПодТекущим); 
					// Накладываются
					Если ПроверитьПересечениеЭлементов
						И ЭлементыНеДругПодДругом 
						И РасстояниеМеждуЭлем_У < 0
						Тогда					
						РасстояниеМеждуЭлем_У = РасстояниеМеждуЭлем_У*(-1) + МинРасст_У;
						ЭлементНижеПоУ.ОтступВерх = ЭлементНижеПоУ.ОтступВерх + РасстояниеМеждуЭлем_У; 
						ДвумерМассивНаОбход[ИндексСледРяда_У][ИндексСледРяда_Х] = ЭлементНижеПоУ;
						
						// Слишком далеко, сократим расстояние	
					ИначеЕсли ПроверитьОтдалениеЭлементов
						И ЭлементыНеДругПодДругом
						И РасстояниеМеждуЭлем_У > МаксРасст_У
						Тогда
						ЭлементНижеПоУ.ОтступВерх = ?(ЭлементНижеПоУ.Вертикален,ЭлементНижеПоУ.ОтступВерх - (РасстояниеМеждуЭлем_У - МаксРасст_У),
													Тек_Макс_У + МаксРасст_У); 

						ДвумерМассивНаОбход[ИндексСледРяда_У][ИндексСледРяда_Х] = ЭлементНижеПоУ;
					КонецЕсли;
				КонецЦикла;
				
				// Мы не нашли элемента снизу, проверим - существует ли он вообще. Повторим верхний код
				Пока Не НайденХотьОдинПодТекущим
				И ИндексСледРяда_У < ДвумерМассивНаОбход.ВГраница()
				Цикл
					ИндексСледРяда_У = ИндексСледРяда_У + 1;
				
					Для ИндексСледРяда_Х = 0 По ДвумерМассивНаОбход[ИндексСледРяда_У].ВГраница() Цикл
						
						// Проверка коллизий снизу. Если Тек_Макс_У > Нижние_Мин_У 
						ЭлементНижеПоУ = ДвумерМассивНаОбход[ИндексСледРяда_У][ИндексСледРяда_Х];
						Ниж_Мин_У = ?(ЭлементНижеПоУ.Вертикален, ЭлементНижеПоУ.ОтступВерх - ЭлементНижеПоУ.Высота, ЭлементНижеПоУ.ОтступВерх);
						
						РасстояниеМеждуЭлем_У = Ниж_Мин_У - Тек_Макс_У; 
						
						// проверяем только те элементы, что находятся ПОД текущим элементом по оси Х
						// Если  Элем2_Мин_Х - Элем1_Макс_Х < 0 ИЛИ Элем1_Мин_Х - Элем2_Макс_Х < 0 - элемент либо ссправа, либо слева
						ЭлементыНеДругПодДругом = ((ЭлементНижеПоУ.ОтступЛев - Тек_Макс_Х) > 0) 
						ИЛИ ((ТекущийЭлемент.ОтступЛев - (ЭлементНижеПоУ.ОтступЛев+ЭлементНижеПоУ.Ширина)) < 0);
						НайденХотьОдинПодТекущим = (ЭлементыНеДругПодДругом ИЛИ НайденХотьОдинПодТекущим); 
						// Накладываются
						Если ПроверитьПересечениеЭлементов
							И ЭлементыНеДругПодДругом 
							И РасстояниеМеждуЭлем_У < 0
							Тогда					
							РасстояниеМеждуЭлем_У = РасстояниеМеждуЭлем_У*(-1) + МинРасст_У;
							ЭлементНижеПоУ.ОтступВерх = ЭлементНижеПоУ.ОтступВерх + РасстояниеМеждуЭлем_У; 
							ДвумерМассивНаОбход[ИндексСледРяда_У][ИндексСледРяда_Х] = ЭлементНижеПоУ;
							
							// Слишком далеко, сократим расстояние	
						ИначеЕсли ПроверитьОтдалениеЭлементов
							И ЭлементыНеДругПодДругом
							И РасстояниеМеждуЭлем_У > МаксРасст_У
							Тогда
							ЭлементНижеПоУ.ОтступВерх = ?(ЭлементНижеПоУ.Вертикален,ЭлементНижеПоУ.ОтступВерх - (РасстояниеМеждуЭлем_У - МаксРасст_У),
							Тек_Макс_У + МаксРасст_У); 
							
							ДвумерМассивНаОбход[ИндексСледРяда_У][ИндексСледРяда_Х] = ЭлементНижеПоУ;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;				
				
			КонецЕсли;	
		КонецЦикла;
		
		ДвумерМассивНаОбход[Индекс_У] = МассивЗнач_У;
	КонецЦикла;
	
	Возврат ДвумерМассивНаОбход;
	
КонецФункции

// Сместим все элменты по Х без проверок по У и вернём перемещённые элементы массивом со структурами	
&НаСервереБезКонтекста
Функция СмещениеМассиваПо_Х(знач НачМассивЭлементов, Макс_Расст_Х)

	ДвумерныйМассивУпорядочен = Новый Массив; 
   	СписокИмеющихся_Х = Новый СписокЗначений;
	
	// Т.к. упорядочиваем список сначала по У, потом будем проходить и получать минимальные
	Для ИндексТекЭлемента = 0 По НачМассивЭлементов.ВГраница() Цикл
		Если СписокИмеющихся_Х.НайтиПоЗначению(НачМассивЭлементов[ИндексТекЭлемента].ОтступЛев) = Неопределено Тогда
			СписокИмеющихся_Х.Добавить(НачМассивЭлементов[ИндексТекЭлемента].ОтступЛев,Строка(ИндексТекЭлемента));
		КонецЕсли;
	КонецЦикла;
	СписокИмеющихся_Х.СортироватьПоЗначению(); 
	
	// Заполним последовательно массив, нам не важно значение по У, т.к. основная задача - убрать "пропасть" между элементами,
	// Которые в отсортированными по У и по Х не будут считать себя "соседями" (но фактически расположены рядом)
	// Проверим все элементы, чтобы не гадать какие значения У встречаются, будем использовать ранее созданный список
	Пока НачМассивЭлементов.Количество() > 0 Цикл
		
		Текущий_Х = СписокИмеющихся_Х.Получить(0).Значение;
		СписокИмеющихся = Новый СписокЗначений;
		
		Для ИндексТекЭлемента = 0 По НачМассивЭлементов.ВГраница() Цикл
			Если НачМассивЭлементов[ИндексТекЭлемента].ОтступЛев = Текущий_Х Тогда
				 СписокИмеющихся.Добавить(НачМассивЭлементов[ИндексТекЭлемента].ОтступЛев,Строка(ИндексТекЭлемента));
			КонецЕсли;
		КонецЦикла;
		
		// Получим все наши значения для текущей строки, отсортируем их и удалим лишнее
		Если СписокИмеющихся.Количество() > 0 Тогда  	
			
			МассивСтрока_Г = Новый Массив;
			
			Для каждого ЭлементСписка Из СписокИмеющихся Цикл
				МассивСтрока_Г.Добавить(НачМассивЭлементов[Число(ЭлементСписка.Представление)]);
			КонецЦикла;
			
			Для каждого ЭлементМассиваНаУдаление Из МассивСтрока_Г Цикл
				Элемент = НачМассивЭлементов.Найти(ЭлементМассиваНаУдаление);
				НачМассивЭлементов.Удалить(Элемент);
			КонецЦикла; 
			ДвумерныйМассивУпорядочен.Добавить(МассивСтрока_Г);
		КонецЕсли; 
		СписокИмеющихся_Х.Удалить(0);
	КонецЦикла;	
	
	// Мы используем двумерный массив, объединив значения по одинаковому Х.
	// Пройдёмся по элементам, если Первое значение внутреннего массива в пределах максимального Х,
	// То значит следующие в текущем ряду тоже в пределах. Если нет, то мы передвигаем ВЕСЬ СЛЕДУЮЩИЙ РЯД левее.
	Для Индекс_Группы_Х = 0 По ДвумерныйМассивУпорядочен.ВГраница() - 1 Цикл
		
		ТекущийЭлемент = ДвумерныйМассивУпорядочен[Индекс_Группы_Х][0];
		ПравыйКрай_Текущий = ТекущийЭлемент.ОтступЛев + ТекущийЭлемент.Ширина;
		СледИндекс = Индекс_Группы_Х + 1;
		СледующийЭлемент = ДвумерныйМассивУпорядочен[СледИндекс][0];
		
		// Проверим значения по Х. Вертикален или нет - нам не важно, это не влияет
		//ОтступЛев,ОтступВерх,Ширина,Высота (все число), ТипЭлем (Строка "Ш" или "Т"), Индекс,Вертикален
		Если (СледующийЭлемент.ОтступЛев - ПравыйКрай_Текущий) > Макс_Расст_Х Тогда
			
			Новый_Левый_Край_След = ПравыйКрай_Текущий + Макс_Расст_Х;
			
			Для Индекс_Элемента_Х = 0 По ДвумерныйМассивУпорядочен[СледИндекс].ВГраница() Цикл 			
				СледующийЭлемент = ДвумерныйМассивУпорядочен[СледИндекс][Индекс_Элемента_Х];
				СледующийЭлемент.ОтступЛев = Новый_Левый_Край_След;
				ДвумерныйМассивУпорядочен[СледИндекс][Индекс_Элемента_Х] = СледующийЭлемент;				
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ОдномерныйСгруппированныйМассив = Новый Массив;
	Для каждого Группа_Х Из ДвумерныйМассивУпорядочен Цикл
		Для каждого Элемент_Х Из Группа_Х Цикл
			ОдномерныйСгруппированныйМассив.Добавить(Элемент_Х);
		КонецЦикла;	
	КонецЦикла;
	
	Возврат ОдномерныйСгруппированныйМассив;
	
КонецФункции


// Упорядочим входящий массив, получим промежуточный массив, где Первый уровень - это массивы,
//отсортированные по Y, Второй - все значения в этом пределе по X.
&НаСервереБезКонтекста
Функция ФормДвумерногоМассиваПо_У_По_Х(знач НачМассивЭлементов)

	ДвумерныйМассивУпорядочен = Новый Массив; 
   	СписокИмеющихся_У = Новый СписокЗначений;

	// Т.к. упорядочиваем список сначала по У, потом будем проходить и получать минимальные
	Для ИндексТекЭлемента = 0 По НачМассивЭлементов.ВГраница() Цикл
		Если СписокИмеющихся_У.НайтиПоЗначению(НачМассивЭлементов[ИндексТекЭлемента].ОтступВерх) = Неопределено Тогда
			СписокИмеющихся_У.Добавить(НачМассивЭлементов[ИндексТекЭлемента].ОтступВерх,Строка(ИндексТекЭлемента));
		КонецЕсли;
	КонецЦикла;
	СписокИмеющихся_У.СортироватьПоЗначению();       	
	
	// Проверим все элементы, чтобы не гадать какие значения У встречаются, будем использовать ранее созданный список
	Пока НачМассивЭлементов.Количество() > 0 Цикл
		
		СписокИмеющихся_Х = Новый СписокЗначений;
		Текущий_У = СписокИмеющихся_У.Получить(0).Значение;
		
		Для ИндексТекЭлемента = 0 По НачМассивЭлементов.ВГраница() Цикл
			Если НачМассивЭлементов[ИндексТекЭлемента].ОтступВерх = Текущий_У Тогда	
				 СписокИмеющихся_Х.Добавить(НачМассивЭлементов[ИндексТекЭлемента].ОтступЛев,Строка(ИндексТекЭлемента));
			КонецЕсли;
		КонецЦикла;
		
		// Получим все наши значения для текущей строки, отсортируем их и удалим лишнее
		Если СписокИмеющихся_Х.Количество() > 0 Тогда 
			
			СписокИмеющихся_Х.СортироватьПоЗначению();
			МассивСтрока_Г = новый массив;  
			
			Для каждого ЭлементСписка Из СписокИмеющихся_Х Цикл
				МассивСтрока_Г.Добавить(НачМассивЭлементов[Число(ЭлементСписка.Представление)]);
			КонецЦикла;
			
			Для каждого ЭлементМассиваНаУдаление Из МассивСтрока_Г Цикл
				Элемент = НачМассивЭлементов.Найти(ЭлементМассиваНаУдаление);
				НачМассивЭлементов.Удалить(Элемент);
			КонецЦикла; 
			
			ДвумерныйМассивУпорядочен.Добавить(МассивСтрока_Г);
		КонецЕсли; 
		
		СписокИмеющихся_У.Удалить(0);
	КонецЦикла;	
	
	Возврат ДвумерныйМассивУпорядочен;
	
КонецФункции


&НаСервереБезКонтекста
Функция МаксимизироватьШтрихкод(знач ДвумерМассивНаОбход, ШиринаРамки, ВысотаРамки, МинХ_МеждуЭл = 0, МинУ_МеждуЭл = 0, МинОтступ = 1)
	
	// Получим кол-во всего штрихкодов, также получим мин-макс по каждой стороне и высчитаем "доступное" кол-во вверх и вниз	
	КрайнийЭлемент = ДвумерМассивНаОбход[0][0];
	Мин_У = ?(КрайнийЭлемент.Вертикален, КрайнийЭлемент.ОтступВерх - КрайнийЭлемент.Высота, КрайнийЭлемент.ОтступВерх);
	КрайнийЭлемент = ДвумерМассивНаОбход[ДвумерМассивНаОбход.ВГраница()][0];
	Макс_У = ?(КрайнийЭлемент.Вертикален, КрайнийЭлемент.ОтступВерх, КрайнийЭлемент.ОтступВерх + КрайнийЭлемент.Высота);
	
	Мин_Х = ШиринаРамки;
	Макс_Х = 0;
	ВсегоШтрихкодов = Новый Массив;	
	Для Индекс_У = 0 По ДвумерМассивНаОбход.ВГраница() Цикл
		
		// Получаем строку по У
		МассивЗнач_У = ДвумерМассивНаОбход[Индекс_У];
		Для Индекс_Х = 0 По МассивЗнач_У.ВГраница() Цикл
			
			ТекущийЭлемент = МассивЗнач_У[Индекс_Х];
			Тек_Макс_Х = ТекущийЭлемент.ОтступЛев + ТекущийЭлемент.Ширина; 
			
			Если Мин_Х > ТекущийЭлемент.ОтступЛев Тогда
				Мин_Х = ТекущийЭлемент.ОтступЛев;
			КонецЕсли;
			Если Макс_Х < Тек_Макс_Х Тогда
				Макс_Х = Тек_Макс_Х; 
			КонецЕсли;
			
			Если ТекущийЭлемент.ТипЭлем = "Ш" Тогда 
				ДанныеШтрихкода = Новый Структура("Индекс_У, Индекс_Х, Ширина, Высота",Индекс_У,Индекс_Х,ТекущийЭлемент.Ширина,ТекущийЭлемент.Высота); 
				ВсегоШтрихкодов.Добавить(ДанныеШтрихкода);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
	Если ВсегоШтрихкодов.Количество() > 0 Тогда 
		// Возьмём целое значение, потому что при значениях 3.2 и 3.7 мы сможем позволить себе только 3.
		// Добавим припуск на отступ - т.к. может быть ситуация, когда штрихкод заканчивается на границе этикетки
		Перемещение_По_У = Цел((ВысотаРамки - (Макс_У - Мин_У) - МинОтступ*2)/ВсегоШтрихкодов.Количество());
		Перемещение_По_У = Макс(0,Перемещение_По_У);
	    Перемещение_По_Х = Цел((ШиринаРамки - (Макс_Х - Мин_Х) - МинОтступ*2)/ВсегоШтрихкодов.Количество()); 
		Перемещение_По_Х = Макс(0,Перемещение_По_Х);
		
		Для каждого СтруктураШтрихкода Из ВсегоШтрихкодов Цикл
			ЗаменяемыйШтрихкод = ДвумерМассивНаОбход[СтруктураШтрихкода.Индекс_У][СтруктураШтрихкода.Индекс_Х];
			ЗаменяемыйШтрихкод.Ширина = ЗаменяемыйШтрихкод.Ширина + Перемещение_По_Х;
			ЗаменяемыйШтрихкод.Высота = ЗаменяемыйШтрихкод.Высота + Перемещение_По_У;
			ДвумерМассивНаОбход[СтруктураШтрихкода.Индекс_У][СтруктураШтрихкода.Индекс_Х] = ЗаменяемыйШтрихкод;
		КонецЦикла; 
		// Штрихкоды будут наезжать, необходим вызов ИзменитьРазмер_Х_У 	
		ДвумерМассивНаОбход = ИзменитьРазмер_Х_У(ДвумерМассивНаОбход,МинХ_МеждуЭл,0,МинУ_МеждуЭл,0,,Ложь,0,0);
	КонецЕсли;
	
	// Берём за данность, что у нас уже полностью готовы все рамки (они не пересекаются и не слишком далеко) 
	// Осталось их только попытаться установить в полотно. Отступ обязан быть хотя бы 1, иначе будет ошибка
	// Переместим всё по Минимальному У и Минимальному Х
	// Берём отступ единожды, т.к. мы перемещаем К ЛЕВОМУ ВЕРХНЕМУ УГЛУ  
	// УСЛОВИЕ НУЖНО, ЧТОБЫ РАМКА НЕ ВЫХОДИЛА ЗА МИНИМАЛЬНЫЕ ЗНАЧЕНИЯ! Кто уберёт - будет титулован как "Горькая жопка огурца"
	Перемещение_По_У = ?(Мин_У < 1, Мин_У - МинОтступ, Макс(0, Мин_У - МинОтступ));
	Перемещение_По_Х = ?(Мин_Х < 1, Мин_Х - МинОтступ, Макс(0, Мин_Х - МинОтступ));
	
	Для Индекс_У = 0 По ДвумерМассивНаОбход.ВГраница() Цикл
		
		МассивЗнач_У = ДвумерМассивНаОбход[Индекс_У];
		Для Индекс_Х = 0 По МассивЗнач_У.ВГраница() Цикл
			
			ТекущийЭлемент = МассивЗнач_У[Индекс_Х];
			ТекущийЭлемент.ОтступЛев = ТекущийЭлемент.ОтступЛев - Перемещение_По_Х;
			ТекущийЭлемент.ОтступВерх = ТекущийЭлемент.ОтступВерх - Перемещение_По_У; 
			
			// Растягиваем самый последний по X элемент (самый правый)
			Если НЕ ТекущийЭлемент.Вертикален
			И Индекс_Х = МассивЗнач_У.ВГраница()
			Тогда
				ТекущийЭлемент.Ширина = ШиринаРамки - ТекущийЭлемент.ОтступЛев - 1;
			КонецЕсли;
			
			ДвумерМассивНаОбход[Индекс_У][Индекс_Х] = ТекущийЭлемент;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ДвумерМассивНаОбход;	
КонецФункции 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры

#КонецОбласти
