#Область ПрограммныйИнтерфейс

// Возвращает возраст в родительном падеже.
//
// Параметры:
//  ВозрастЛет		 - Число - лет.
//  ВозрастМесяцев	 - Число - месяцев.
//  ВозрастДней		 - Число - дней.
// 
// Возвращаемое значение:
//   - Строка.
//
Функция СтрокаВозраст(ВозрастЛет, ВозрастМесяцев, ВозрастДней) Экспорт
	Возврат СтрокаГод(ВозрастЛет) + СтрокаМесяцев(ВозрастМесяцев) + СтрокаДней(ВозрастДней);	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтрокаГод(ВозрастЛет)
	
	Возраст = Формат(ВозрастЛет,"ЧГ=0; ЧН="); 	
	Послед = Число(Прав(Возраст,1));
	
	Если ВозрастЛет = 0 Тогда
		Возраст = "";
	ИначеЕсли Послед = 1 И ВозрастЛет <> 11 Тогда
		Возраст = Возраст + " года ";
	Иначе
		Возраст = Возраст + " лет ";	
	КонецЕсли;
	
	Возврат Возраст;
	
КонецФункции

Функция СтрокаМесяцев(ВозрастМесяцев)
	
	Возраст = Формат(ВозрастМесяцев, "ЧГ=0; ЧН=");
	Послед = Число(Прав(Возраст,1));
	
	Если ВозрастМесяцев = 0 Тогда
		Возраст = "";
	ИначеЕсли Послед = 1 И ВозрастМесяцев <> 11 Тогда
		Возраст = Возраст + " месяца ";
	Иначе
		Возраст = Возраст + " месяцев ";
	КонецЕсли;
		
	Возврат Возраст;
	
КонецФункции

Функция СтрокаДней(ВозрастДней)
	
	Возраст = Формат(ВозрастДней, "ЧГ=0; ЧН=");
	Послед = Число(Прав(Возраст,1));
	
	Если ВозрастДней = 0 Тогда
		Возраст = "";
	ИначеЕсли Послед = 1 И ВозрастДней <> 11 Тогда 
		Возраст = Возраст + " дня"
	Иначе
		Возраст = Возраст + " дней"
	КонецЕсли;
	
	Возврат Возраст;
	
КонецФункции

#КонецОбласти
