
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Чат = Параметры.Чат;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_Чаты.Ссылка КАК Чат,
	               |	iga_Чаты.Идентификатор КАК ИдЧата,
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Заявка КАК Заявка,
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Работа КАК Работа,
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Статус КАК Статус,
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.ДатаЗаписи КАК ДатаЗаписи
	               |ИЗ
	               |	Справочник.iga_Чаты КАК iga_Чаты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.iga_СтатусыПодтвержденияСтрокЗаявок КАК iga_СтатусыПодтвержденияСтрокЗаявок
	               |		ПО iga_Чаты.Клиент = iga_СтатусыПодтвержденияСтрокЗаявок.Заявка.Клиент
	               |ГДЕ
	               |	НЕ iga_СтатусыПодтвержденияСтрокЗаявок.Обработано
	               |	И НЕ iga_СтатусыПодтвержденияСтрокЗаявок.Статус = &СтатусПодтверждена
	               |	И НЕ iga_СтатусыПодтвержденияСтрокЗаявок.Статус = &СтатусПусто
	               |	И НЕ iga_СтатусыПодтвержденияСтрокЗаявок.Статус = &СтатусНеОтвечает
	               |	И iga_Чаты.Ссылка = &Чат";
	Запрос.УстановитьПараметр("СтатусПодтверждена", Перечисления.iga_СтатусыПодтвержденияЗаявок.Подтверждено);
	Запрос.УстановитьПараметр("СтатусПусто", Перечисления.iga_СтатусыПодтвержденияЗаявок.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтатусНеОтвечает", Перечисления.iga_СтатусыПодтвержденияЗаявок.ПустаяСсылка());
	Запрос.УстановитьПараметр("Чат", Чат);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СписокПозиций.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПозицийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПозицийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Функция ОтметитьОтработку()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОтработанныеЗаявки = Новый Массив;
	
	Язык = iga_МетодыРаботыСБотом.ПолучитьЗначениеПараметраОбщения(Чат, "Язык");
	
	Для Каждого Позиция Из СписокПозиций Цикл
		Если Не Позиция.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Запись = РегистрыСведений.iga_СтатусыПодтвержденияСтрокЗаявок.СоздатьМенеджерЗаписи();
		Запись.Заявка = Позиция.Заявка;
		Запись.Работа = Позиция.Работа;
		Запись.ДатаЗаписи = Позиция.ДатаЗаписи;
		Запись.Прочитать();
		Запись.Статус = Позиция.Статус;
		Если Запись.Выбран() Тогда 
			Запись.Обработано = Истина;
			Запись.Записать();
			ОтработанныеЗаявки.Добавить(Позиция.Заявка);
		КонецЕсли;
		
		Если Запись.Статус = Перечисления.iga_СтатусыПодтвержденияЗаявок.НеОтвечает Тогда
			
			Шаблон = Справочники.iga_ШаблоныСообщений.Предопределенный(
				Перечисления.iga_ВидыПредопределенныхШаблонов.СообщениеОбОтменеБезОтвета, Язык);
			Если Не ЗначениеЗаполнено(Шаблон) Тогда
				Продолжить;
			КонецЕсли;
			ЗаписьОбОтмене = РегистрыСведений.iga_ОповещенияПоВремени.СоздатьМенеджерЗаписи();
			ЗаписьОбОтмене.Чат = Чат;
			ЗаписьОбОтмене.Заявка = Позиция.Заявка;
			ЗаписьОбОтмене.ДатаЗаписи = Запись.ДатаЗаписи;
			ЗаписьОбОтмене.ШаблонОповещения = Шаблон;
			ЗаписьОбОтмене.ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(Запись.ДатаЗаписи, "ЧАС", -3);
			Если Час(ЗаписьОбОтмене.ДатаОповещения) > 20 Тогда
				ЗаписьОбОтмене.ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(НачалоДня(ЗаписьОбОтмене.ДатаОповещения), "ЧАС", 20);
			ИначеЕсли Час(ЗаписьОбОтмене.ДатаОповещения) < 6 Тогда
				ЗаписьОбОтмене.ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(НачалоДня(НачалоДня(ЗаписьОбОтмене.ДатаОповещения)-1), "ЧАС", 20);
			КонецЕсли;
			ЗаписьОбОтмене.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОтработанныеЗаявки", ОтработанныеЗаявки);
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ОповещенияПоВремени.Заявка КАК Заявка,
	               |	iga_ОповещенияПоВремени.ДатаОповещения КАК ДатаОповещения,
	               |	iga_ОповещенияПоВремени.Выполнено КАК Выполнено,
	               |	iga_ОповещенияПоВремени.ТребуетсяПодтверждение КАК ТребуетсяПодтверждение,
	               |	iga_ОповещенияПоВремени.ДатаЗаписи КАК ДатаЗаписи,
	               |	iga_ОповещенияПоВремени.Чат КАК Чат
	               |ИЗ
	               |	РегистрСведений.iga_ОповещенияПоВремени КАК iga_ОповещенияПоВремени
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_СтатусыПодтвержденияСтрокЗаявок КАК iga_СтатусыПодтвержденияСтрокЗаявок
	               |		ПО iga_ОповещенияПоВремени.Заявка = iga_СтатусыПодтвержденияСтрокЗаявок.Заявка
	               |			И iga_ОповещенияПоВремени.ДатаЗаписи = iga_СтатусыПодтвержденияСтрокЗаявок.ДатаЗаписи
	               |			И (iga_СтатусыПодтвержденияСтрокЗаявок.Статус В (&СтатусыПодтверждения))
	               |ГДЕ
	               |	iga_ОповещенияПоВремени.Заявка В(&ОтработанныеЗаявки)
	               |	И НЕ iga_СтатусыПодтвержденияСтрокЗаявок.Работа ЕСТЬ NULL
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	iga_ОповещенияПоВремени.ТребуетсяПодтверждение,
	               |	iga_ОповещенияПоВремени.Выполнено,
	               |	iga_ОповещенияПоВремени.Чат,
	               |	iga_ОповещенияПоВремени.ДатаОповещения,
	               |	iga_ОповещенияПоВремени.Заявка,
	               |	iga_ОповещенияПоВремени.ДатаЗаписи";
	СтатусыПодтверждения = Новый Массив;
	СтатусыПодтверждения.Добавить(Перечисления.iga_СтатусыПодтвержденияЗаявок.Отменено);
	СтатусыПодтверждения.Добавить(Перечисления.iga_СтатусыПодтвержденияЗаявок.Перенесено);
	Запрос.УстановитьПараметр("СтатусыПодтверждения", СтатусыПодтверждения);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаписьОповещения = РегистрыСведений.iga_ОповещенияПоВремени.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьОповещения, Выборка);
		ЗаписьОповещения.Прочитать();
		Если ЗаписьОповещения.Выбран() Тогда
			ЗаписьОповещения.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Асинх Процедура Отработано(Команда)
	
	Ответ = Ждать ВопросАсинх("Установить отработку по выбранным позициям?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да,, КодВозвратаДиалога.Нет);
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Успех = ОтметитьОтработку();
	Если Успех Тогда
		Закрыть(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПозицийСтатусПриИзменении(Элемент)
	
	Элементы.СписокПозиций.ТекущиеДанные.Пометка = Истина;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СписокПозицийНоваяДатаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	
КонецПроцедуры
