
#Область РаботаСJSON

Функция ПрочитатьСтрокуJSON(СтрокаJSON, ПрочитатьВСоответствие = Ложь) Экспорт 
	
	#Если ВебКлиент Тогда
		Возврат ОбщегоНазначенияПереопределяемый.ПрочитатьСтрокуJSON(СтрокаJSON, ПрочитатьВСоответствие);  
	#Иначе
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		Возврат ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
	#КонецЕсли
		
КонецФункции

Функция СформироватьСтрокуJSON(Значение) Экспорт 
	
	#Если ВебКлиент Тогда
		Возврат ОбщегоНазначенияПереопределяемый.СформироватьСтрокуJSON(Значение);
	#Иначе
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();	
		ЗаписатьJSON(ЗаписьJSON, Значение);
		Возврат ЗаписьJSON.Закрыть();
	#КонецЕсли
	
КонецФункции

#КонецОбласти

#Область РаботаВФорме

Функция ПолучитьКореньВетвиДерева(Ветвь) Экспорт
	
	Родитель = Ветвь.ПолучитьРодителя();
	Пока Родитель <> Неопределено Цикл
		Ветвь = Родитель;
		Родитель = Ветвь.ПолучитьРодителя();
	КонецЦикла;
	
	Возврат Ветвь;
	
КонецФункции

Функция НайтиСтрокиВДеревеФормы(ДеревоФормы, Отбор, ВозвращатьПервую = Истина) Экспорт
	
	Если Отбор.Количество() = 0 Тогда
		Если ВозвращатьПервую Тогда 
			Возврат Неопределено;
		Иначе
			Возврат Новый Массив;
		КонецЕсли;
	КонецЕсли;
	
	МассивСтрок = Новый Массив;
	НайтиСтрокиВДеревеФормыРекурсивно(ДеревоФормы, Отбор, ВозвращатьПервую, МассивСтрок);
	
	Если ВозвращатьПервую Тогда 
		Возврат ?(МассивСтрок.Количество() > 0, МассивСтрок[0], Неопределено);
	КонецЕсли;
	
	Возврат МассивСтрок;
	
КонецФункции

Процедура НайтиСтрокиВДеревеФормыРекурсивно(УзелДерева, Отбор, ВозвращатьПервую, МассивСтрок) 
	
	Для Каждого СтрокаУзла Из УзелДерева.ПолучитьЭлементы() Цикл
		
		СтрокаНайдена = Истина;
		Для Каждого кзЭлементОтбора Из Отбор Цикл
			Если СтрокаУзла[кзЭлементОтбора.Ключ] <> кзЭлементОтбора.Значение Тогда
				СтрокаНайдена = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаНайдена Тогда 
			МассивСтрок.Добавить(СтрокаУзла);
			Если ВозвращатьПервую Тогда 
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		НайтиСтрокиВДеревеФормыРекурсивно(СтрокаУзла, Отбор, ВозвращатьПервую, МассивСтрок);
		
		Если ВозвращатьПервую И МассивСтрок.Количество() > 0 Тогда 
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьФлажкиВДереве(СтрокаДерева, ИмяПоляФлажка = "Установлено", ИмяПоляУстановленныхДочерних = "УстановленоДетей") Экспорт
	
	ПересчитатьФлажкиВДеревеРекурсивноВниз(СтрокаДерева, ИмяПоляФлажка, ИмяПоляУстановленныхДочерних);
	ПересчитатьФлажкиВДеревеРекурсивноВверх(СтрокаДерева.ПолучитьРодителя(), ИмяПоляФлажка, ИмяПоляУстановленныхДочерних);
	
КонецПроцедуры

Процедура ПересчитатьФлажкиВДеревеРекурсивноВниз(УзелДерева, ИмяПоляФлажка = "Установлено", ИмяПоляУстановленныхДочерних = "УстановленоДетей") Экспорт 
	
	УзелДерева[ИмяПоляУстановленныхДочерних] = 0;
	ЭлементыУзла = УзелДерева.ПолучитьЭлементы();
	Для Каждого Элемент Из ЭлементыУзла Цикл
		Элемент[ИмяПоляФлажка] = УзелДерева[ИмяПоляФлажка];
		УзелДерева[ИмяПоляУстановленныхДочерних] = УзелДерева[ИмяПоляУстановленныхДочерних] + Элемент[ИмяПоляФлажка];
		ПересчитатьФлажкиВДеревеРекурсивноВниз(Элемент, ИмяПоляФлажка, ИмяПоляУстановленныхДочерних);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьФлажкиВДеревеРекурсивноВверх(РодительУзла, ИмяПоляФлажка = "Установлено", ИмяПоляУстановленныхДочерних = "УстановленоДетей") Экспорт 
	
	Если РодительУзла = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	РодительУзла[ИмяПоляФлажка] = 0;
	РодительУзла[ИмяПоляУстановленныхДочерних] = 0;
	ЭлементыРодителя = РодительУзла.ПолучитьЭлементы();
	Для Каждого Элемент Из ЭлементыРодителя Цикл
		Если Элемент[ИмяПоляФлажка] = 1 Тогда
			РодительУзла[ИмяПоляУстановленныхДочерних] = РодительУзла[ИмяПоляУстановленныхДочерних] + 1;
		ИначеЕсли Элемент[ИмяПоляФлажка] = 2 Тогда 
			РодительУзла[ИмяПоляУстановленныхДочерних] = РодительУзла[ИмяПоляУстановленныхДочерних] + 0.5;	
		КонецЕсли;
	КонецЦикла;
	
	Если РодительУзла[ИмяПоляУстановленныхДочерних] = ЭлементыРодителя.Количество() Тогда 
		РодительУзла[ИмяПоляФлажка] = 1;
	ИначеЕсли РодительУзла[ИмяПоляУстановленныхДочерних] > 0 Тогда 
		РодительУзла[ИмяПоляФлажка] = 2;
	КонецЕсли;
	
	ПересчитатьФлажкиВДеревеРекурсивноВверх(РодительУзла.ПолучитьРодителя(), ИмяПоляФлажка, ИмяПоляУстановленныхДочерних);
	
КонецПроцедуры

Функция НайтиТаблицуПоляФормы(Элемент) Экспорт 
	
	Если ТипЗнч(Элемент) = Тип("ТаблицаФормы") Тогда
		Возврат Элемент;
	ИначеЕсли Элемент.Родитель = Неопределено Тогда
		Возврат Неопределено;
	Иначе
		Возврат НайтиТаблицуПоляФормы(Элемент.Родитель);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область РаботаСЦветом

&НаКлиенте
Функция ЧислоВDec(СтрокаЧисло, Основание = Неопределено, Шаблон = "0123456789ABCDEF") Экспорт
	
	Если Основание = Неопределено Тогда
		Основание = СтрДлина(Шаблон);
	КонецЕсли;
	
	СтрокаЧисло = ВРег(СтрокаЧисло);
	Шаблон = ВРег(Шаблон);	
	ДлинаСтроки = СтрДлина(СтрокаЧисло);
	Результат = 0;
	Для Сч = 1 По ДлинаСтроки Цикл
		
		ТекСимвол = Сред(СтрокаЧисло, Сч,1);
		ЧислоВДесят = (Найти(Шаблон, ТекСимвол) - 1);
		Результат = Результат * Основание + ЧислоВДесят;		
		
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

Функция ЦветИзHex(Знач ЦветHex) Экспорт
	
	ЦветHex = СтрЗаменить(СтрЗаменить(ЦветHex, " ", ""), "#", "");	
    Если СтрДлина(ЦветHex) < 6 Тогда
    	Возврат Новый Цвет;
	ИначеЕсли СтрДлина(ЦветHex) = 8 Тогда
		ЦветHex = Сред(ЦветHex, 3);
	КонецЕсли;
	
    r = ЧислоВДесятичную(Сред(ЦветHex, 1, 2));
    g = ЧислоВДесятичную(Сред(ЦветHex, 3, 2));
    b = ЧислоВДесятичную(Сред(ЦветHex, 5, 2));
	
	Возврат Новый Цвет(r,g,b);
	
КонецФункции

Функция ЦветВHex(Цвет) Экспорт 
	
	АбсолютныйЦвет = Цвет;
	Если Цвет.Вид <> ВидЦвета.Абсолютный Тогда
		АбсолютныйЦвет = ПреобразоватьЦветВАбсолютный(Цвет);
	КонецЕсли;
	
	Возврат "#" + 
		СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ЧислоИзДесятичной(АбсолютныйЦвет.Красный, 16), 2, "0") + 
		СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ЧислоИзДесятичной(АбсолютныйЦвет.Зеленый, 16), 2, "0") +
		СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ЧислоИзДесятичной(АбсолютныйЦвет.Синий, 16), 2, "0");
	
КонецФункции

Функция ПреобразоватьЦветВАбсолютный(Цвет) Экспорт 
	
	Если Цвет.Вид = ВидЦвета.Абсолютный Тогда 
		Возврат Цвет;
	КонецЕсли;
		
	ФорматированныйДокумент = Новый ФорматированныйДокумент;
	ФорматированныйДокумент.УстановитьФорматированнуюСтроку(Новый ФорматированнаяСтрока("Цвет", , Цвет));
	
	// Web-цвета сразу конвертируются в абсолютные
	АбсолютныйЦвет = ФорматированныйДокумент.Элементы[0].Элементы[0].ЦветТекста;
	Если АбсолютныйЦвет.Вид = ВидЦвета.Абсолютный Тогда 
		Возврат АбсолютныйЦвет;
	КонецЕсли;
	
	// Если нет, конвертируем цвет переустановкой HTML
	ТекстHTML = "";
	Вложения = Новый Структура;
	ФорматированныйДокумент.ПолучитьHTML(ТекстHTML, Вложения); 
	ФорматированныйДокумент.УстановитьHTML(ТекстHTML, Вложения); 
	АбсолютныйЦвет = ФорматированныйДокумент.Элементы[0].Элементы[0].ЦветТекста;
	Если АбсолютныйЦвет.Вид = ВидЦвета.Абсолютный Тогда 
		Возврат АбсолютныйЦвет;
	КонецЕсли;
	
	Возврат Новый Цвет(0, 0, 0);
	
КонецФункции

Функция ЧислоИзДесятичной(Знач Значение, Основание)
	
	Результат = "";
	СтрокаСимволы = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	
	Пока Значение > 0 Цикл
		Результат = Сред(СтрокаСимволы, Значение % Основание + 1, 1) + Результат;
		Значение = Цел(Значение / Основание) ;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ЧислоВДесятичную(Знач Значение, Основание = Неопределено, Шаблон = "0123456789ABCDEF")
	
	Если Основание = Неопределено Тогда
		Основание = СтрДлина(Шаблон);
	КонецЕсли;

	СтрокаЧисло = ВРег(Строка(Значение));
	ШаблонВРег = ВРег(Шаблон);	
	ДлинаСтроки = СтрДлина(СтрокаЧисло);
	Результат = 0;
	Для Сч = 1 По ДлинаСтроки Цикл
		ТекСимвол = Сред(СтрокаЧисло, Сч,1);
		ЧислоВДесят = (Найти(ШаблонВРег, ТекСимвол) - 1);
		Результат = Результат * Основание + ЧислоВДесят;		
	КонецЦикла;

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Прочее

Функция УИДВСтроку(УИД, ДобавлятьПрефикс = Истина) Экспорт
	
	Возврат ?(ДобавлятьПрефикс, "_", "") + СтрЗаменить(Строка(УИД), "-", "_");
	
КонецФункции

Функция ПолучитьПредставлениеИнтервалаМесяцГод(ДатаНачала, Знач ДатаОтсчета = Неопределено) Экспорт
	
	Возраст = "";
	Если ЗначениеЗаполнено(ДатаНачала) Тогда
		Если ДатаОтсчета = Неопределено Тогда
			ДатаОтсчета = ТекущаяДата();
		КонецЕсли;
		
		ВозрастЛет = Год(ДатаОтсчета) - Год(ДатаНачала) - ?(ДеньГода(ДатаОтсчета) < ДеньГода(ДатаНачала),1,0);
		
		// Для детей до 3 лет выводится количество месяцев
		Если ВозрастЛет >= 0 И ВозрастЛет < 3 Тогда
			
			Если ВозрастЛет >= 1 Тогда
				Возраст = Формат(ВозрастЛет,"ЧГ=0; ЧН="); 
				Послед = Число(Прав(Возраст,2));
				Если Послед > 20 Тогда 
					Послед = Послед % 10;
				КонецЕсли;
				// Склонение года
				Если Послед = 1 Тогда
					Возраст = Возраст + " год";
				ИначеЕсли Послед = 0 Или Послед > 4 Тогда
					Возраст = Возраст + " лет";	
				Иначе
					Возраст = Возраст + " года";
				КонецЕсли;
			КонецЕсли;
			
			ВозрастМесяцев = 0;
			
			счДата	= ДобавитьМесяц(НачалоМесяца(ДатаНачала),12 * ВозрастЛет);
			счДата  = ДобавитьМесяц(счДата,1);
			ТекДата	= ДатаОтсчета;
			Пока счДата < ТекДата Цикл
				ВозрастМесяцев = ВозрастМесяцев + 1;
				счДата = ДобавитьМесяц(счДата,1);
			КонецЦикла;
			
			Если ВозрастМесяцев >= 12 Тогда
				
				ВозрастЛет = ВозрастЛет + Цел(ВозрастМесяцев / 12);
				ВозрастМесяцев = ВозрастМесяцев - 12 * Цел(ВозрастМесяцев / 12);
				
			КонецЕсли;
			
			Если ВозрастМесяцев = 0 Тогда
				Возраст = "менее месяца";
			Иначе
				Возраст = Возраст + " " + Формат(ВозрастМесяцев,"ЧН=0");
				// Склонение месяца
				Если ВозрастМесяцев = 1 Тогда
					Возраст = Возраст + " месяц";
				ИначеЕсли ВозрастМесяцев >= 2 И ВозрастМесяцев <= 4 Тогда
					Возраст = Возраст + " месяца";
				Иначе
					Возраст = Возраст + " месяцев";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ВозрастЛет >= 3 Тогда
			
			Возраст = Формат(ВозрастЛет,"ЧГ=0; ЧН="); 
			Послед = Число(Прав(Возраст,2));
			Если Послед > 20 Тогда 
				Послед = Послед % 10;
			КонецЕсли;
			// Склонение года
			Если Послед = 1 Тогда
				Возраст = Возраст + " год";
			ИначеЕсли Послед > 4 Тогда
				Возраст = Возраст + " лет";	
			Иначе
				Возраст = Возраст + " года";
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Возраст;
	
КонецФункции

Функция ПрочитатьТекстДвоичныхДанных(ДвоичныеДанные) Экспорт 
	
	Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(Поток);
	
	Возврат ТекстовыйДокумент.ПолучитьТекст();
	
КонецФункции

#КонецОбласти
