
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = Новый Структура;
	Настройки.Вставить("ТипКартыСтационара", ТипКартыСтационара);
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("омг_ПрочиеНастройкиСистемы", Новый ХранилищеЗначения(Настройки, Новый СжатиеДанных(9)));
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОКНаСервере();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ПрочиеНастройкиСистемы");
	Если Не Настройки = Неопределено Тогда
		Настройки = Настройки.Получить();
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Настройки,);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры


