
&НаСервереБезКонтекста
Процедура ПереместитьВверхНаСервере(СТД)
	Ссылка = Справочники.НастройкиПланаВеденияБеременности.НайтиПоКоду(СТД.Код);
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	НастройкиПланаВеденияБеременности.Ссылка
	               |ИЗ
	               |	Справочник.НастройкиПланаВеденияБеременности КАК НастройкиПланаВеденияБеременности
	               |ГДЕ
	               |	НастройкиПланаВеденияБеременности.Код < &Код
	               |	И НастройкиПланаВеденияБеременности.Родитель = &Родитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НастройкиПланаВеденияБеременности.Код УБЫВ"; 
				   
	Запрос.УстановитьПараметр("Родитель", Ссылка.Родитель);
	Запрос.УстановитьПараметр("Код", СТД.Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбъектИсх = Ссылка.ПолучитьОбъект();
		ОбъектИзм = Выборка.Ссылка.ПолучитьОбъект();
		КодИсх = ОбъектИсх.Код;
		КодИзм = ОбъектИзм.Код;
		ОбъектИсх.Код = 99999999999;
		ОбъектИсх.Записать();
		ОбъектИзм.Код = КодИсх;
		ОбъектИзм.Записать();
		ОбъектИсх.Код = КодИзм;
		ОбъектИсх.Записать();

			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	СТД = Элементы.Список.ТекущиеДанные;
	ПереместитьВверхНаСервере(СТД);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПереместитьВнизНаСервере(СТД)
	Ссылка = Справочники.НастройкиПланаВеденияБеременности.НайтиПоКоду(СТД.Код);
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	НастройкиПланаВеденияБеременности.Ссылка
	               |ИЗ
	               |	Справочник.НастройкиПланаВеденияБеременности КАК НастройкиПланаВеденияБеременности
	               |ГДЕ
	               |	НастройкиПланаВеденияБеременности.Код > &Код
	               |	И НастройкиПланаВеденияБеременности.Родитель = &Родитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НастройкиПланаВеденияБеременности.Код ВОЗР"; 
				   
	Запрос.УстановитьПараметр("Родитель", Ссылка.Родитель);
	Запрос.УстановитьПараметр("Код", СТД.Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОбъектИсх = Ссылка.ПолучитьОбъект();
		ОбъектИзм = Выборка.Ссылка.ПолучитьОбъект();
		КодИсх = ОбъектИсх.Код;
		КодИзм = ОбъектИзм.Код;
		ОбъектИсх.Код = 99999999999;
		ОбъектИсх.Записать();
		ОбъектИзм.Код = КодИсх;
		ОбъектИзм.Записать();
		ОбъектИсх.Код = КодИзм;
		ОбъектИсх.Записать();

			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	СТД = Элементы.Список.ТекущиеДанные;
	ПереместитьВнизНаСервере(СТД);
	Элементы.Список.Обновить();
КонецПроцедуры
