
&НаКлиенте
Процедура БессрочнаяПриИзменении(Элемент)
	Если Объект.Бессрочная Тогда
        Объект.ДатаОкончания = '00010101';
    КонецЕсли;
    УправлениеФормойКлиент();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 УправлениеФормой();
КонецПроцедуры
 &НаКлиенте
Процедура УправлениеФормойКлиент()
    Элементы.ДатаОкончания.Доступность = НЕ Объект.Бессрочная;
    Элементы.ДатаОкончания.АвтоОтметкаНезаполненного = НЕ Объект.Бессрочная;
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
    Элементы.ДатаОкончания.Доступность = НЕ Объект.Бессрочная;
    Элементы.ДатаОкончания.АвтоОтметкаНезаполненного = НЕ Объект.Бессрочная;
КонецПроцедуры