&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ПараметрыФормы)
    Если ПараметрыФормы <> Неопределено Тогда
        ЭтотОбъект.HTML = ПараметрыФормы.Получить("HTML");
        ЭтотОбъект.Заголовок = ПараметрыФормы.Получить("Заголовок");
    КонецЕсли;
КонецПроцедуры
 &НаКлиенте
Процедура ПриОткрытии()
    // Обновляем элементы формы
    Элементы.Форма.Заголовок = ЭтотОбъект.Заголовок;
    Элементы.ПолеHTML.Текст = ЭтотОбъект.HTML;  // Используем Текст вместо Дополнительно
	 КонецПроцедуры
