
&НаСервере
Процедура ОткрытьКалендарьНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКалендарь(Команда) 
	
	ДанныеАРМ = Новый Структура;
	ДанныеАРМ.Вставить("ФормаВызова", "Обработка.омг_АРМРегистратора.Форма.Форма_85");
	
	ПараметрыФормы = Новый Структура("Данные");
	ПараметрыФормы.Данные = ДанныеАРМ;
	
	ОткрытьФорму("Отчет.КалендарьПланирования.Форма.ФормаОтчетаУпр_85", ПараметрыФормы);
	//ОткрытьКалендарьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокКлиентов(Команда)
	ОткрытьФорму("Справочник.Клиенты.Форма.ФормаСписка_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЗаявок(Команда)
	ОткрытьФорму("Документ.Заявка.Форма.ФормаСписка_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПродажи(Команда)
	ОткрытьФорму("Отчет.Продажи.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокПриходныхОрдеров(Команда)
	ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.Форма.ФормаСпискаУпр_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокРасходныхОрдеров(Команда)
	ОткрытьФорму("Документ.РасходныйКассовыйОрдер.Форма.ФормаСпискаУпр_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокОплатПлатежнойКартой(Команда)
	ОткрытьФорму("Документ.ОплатаПлатежнойКартой.Форма.ФормаСпискаУпр_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокВозвратовНаПлатежнуюКарту(Команда)
	ОткрытьФорму("Документ.ВозвратПоПлатежнойКарте.Форма.ФормаСпискаУпр_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокОказанийУслуг(Команда)
	ОткрытьФорму("Документ.ОказаниеУслуг.Форма.ФормаСписка_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетОплаты(Команда)
	ОткрытьФорму("Отчет.Оплаты.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетВедомостьПоДенежнымСредствам(Команда)
	ОткрытьФорму("Отчет.ДвижениеДенежныхСредствВКассах.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетДвижениеДенежныхСредств(Команда)
	ОткрытьФорму("Отчет.ДвиженияДенежныхСредств.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьУправлениеФискальнымУстройством(Команда)
	ОткрытьФорму("ОбщаяФорма.УправлениеФискальнымУстройством");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбучение(Команда)
	ОткрытьФорму("Обработка.омг_Обучение.Форма.Форма_85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАРМПостовойМедсестры(Команда)
	ОткрытьФорму("ОбщаяФорма.АРМПостовойМедсестры85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАРМПалатнойМедсестры(Команда)
	ОткрытьФорму("ОбщаяФорма.АРМПалатнойМедсестры85");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокЛабораторныхЗаявок(Команда)
	ОткрытьФорму("Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СменаПароля(Команда)
	ОткрытьФорму("ОбщаяФорма.СменаПароля", , ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура омг_ОткрытьПрайсЛист(Команда)
	ОткрытьФорму("Отчет.ПрайсЛистПоНоменклатуре.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетДляРегистраторов(Команда)
	ОткрытьФорму("Отчет.омг_ОтчетДляРегистраторов.Форма");
КонецПроцедуры
