
Процедура омг_ОтправкаРасписанияN8N() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = омг_ИнтеграцияСN8NПовтИсп.ПолучитьНастройки();
	
	ДанныеПароля = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ИнтеграцияСN8N", "Пароль");
	
	Если Настройки.Адрес = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не установлены настройки интеграции с N8N";
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Интеграция с N8N", 
			УровеньЖурналаРегистрации.Предупреждение, Метаданные.ОбщиеМодули.омг_ИнтеграцияСN8N.Модуль,,
			"Невозможно выполнить обмен с N8N. Настройки интеграции не заполнены.");
		
		Возврат;
	КонецЕсли;
	
	Попытка
		HTTPСоединение = Новый HTTPСоединение(Настройки.Адрес, 
			?(Настройки.Порт = 0, Неопределено, Настройки.Порт), 
			Настройки.Пользователь, ?(ДанныеПароля = Неопределено, "", ДанныеПароля.Получить()),, 60, 
			?(Настройки.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL, Неопределено));
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось установить соединение с сервером. Проверьте настройки интеграции с N8N";
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Интеграция с N8N", 
			УровеньЖурналаРегистрации.Ошибка, Метаданные.ОбщиеМодули.омг_ИнтеграцияСN8N.Модуль,,
			"Не удалось установить соединение с сервером. Проверьте настройки интеграции с N8N.");
		
		Возврат;
	КонецПопытки;
	
	
	ЗапросРасписание = Новый Запрос;
	ЗапросРасписание.Текст = 
	"ВЫБРАТЬ
	|	омг_ЗанятоеВремяЗаявок.Сотрудник КАК Сотрудник,
	|	омг_ЗанятоеВремяЗаявок.ДатаНачала КАК ДатаНачала,
	|	омг_ЗанятоеВремяЗаявок.ДатаОкончания КАК ДатаОкончания,
	|	омг_ЗанятоеВремяЗаявок.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	РегистрСведений.омг_ЗанятоеВремяЗаявок КАК омг_ЗанятоеВремяЗаявок
	|ГДЕ
	|	омг_ЗанятоеВремяЗаявок.ДатаНачала >= &НачалоТекущегоДня
	|
	|СГРУППИРОВАТЬ ПО
	|	омг_ЗанятоеВремяЗаявок.Сотрудник,
	|	омг_ЗанятоеВремяЗаявок.ДатаНачала,
	|	омг_ЗанятоеВремяЗаявок.ДатаОкончания,
	|	омг_ЗанятоеВремяЗаявок.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Заявки.Сотрудник КАК Сотрудник,
	|	КонтактнаяИнформация.Представление КАК Представление
	|ПОМЕСТИТЬ ВТ_ТелеграмСотрудников
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ПО ВТ_Заявки.Сотрудник = КонтактнаяИнформация.Объект
	|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Другое))
	|			И (КонтактнаяИнформация.Вид = &ВидКонтактнойИнформацииТелеграм)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Заявки.Сотрудник КАК Сотрудник,
	|	ВТ_Заявки.ДатаНачала КАК ДатаНачала,
	|	ВТ_Заявки.ДатаОкончания КАК ДатаОкончания,
	|	ЕСТЬNULL(ВТ_ТелеграмСотрудников.Представление, """") КАК Телеграм,
	|	ВТ_Заявки.Регистратор.Клиент КАК Клиент,
	|	ЕСТЬNULL(ВТ_Заявки.Регистратор.Клиент.Представление, """") КАК КлиентПредставление,
	|	ЕСТЬNULL(ВТ_ТелеграмСотрудников.Сотрудник.Представление, """") КАК СотрудникПредставление,
	|	ЕСТЬNULL(ВТ_Заявки.Регистратор.Филиал.Наименование, """") КАК ФилиалНаименование,
	|	ЕСТЬNULL(ВТ_ТелеграмСотрудников.Сотрудник.Код, """") КАК СотрудникКод,
	|	ЕСТЬNULL(ВТ_Заявки.Регистратор.Филиал.Код, """") КАК ФилиалКод
	|ИЗ
	|	ВТ_Заявки КАК ВТ_Заявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТелеграмСотрудников КАК ВТ_ТелеграмСотрудников
	|		ПО ВТ_Заявки.Сотрудник = ВТ_ТелеграмСотрудников.Сотрудник";
	ЗапросРасписание.УстановитьПараметр("НачалоТекущегоДня", НачалоДня(ТекущаяДата()));
	ЗапросРасписание.УстановитьПараметр("ВидКонтактнойИнформацииТелеграм", Настройки.ВидКонтактнойИнформацииТелеграм);
	
	РезультатРасписания = ЗапросРасписание.Выполнить();  
	ВыборкаРезультатаРасписания = РезультатРасписания.Выбрать();
	МассивДанных = Новый Массив;
	Пока ВыборкаРезультатаРасписания.Следующий() Цикл
		
		СтруктураСотрудника = Новый Структура;
		СтруктураСотрудника.Вставить("clinic", ВыборкаРезультатаРасписания.ФилиалНаименование);
		СтруктураСотрудника.Вставить("clinicCode", ВыборкаРезультатаРасписания.ФилиалКод);
		СтруктураСотрудника.Вставить("personal", ВыборкаРезультатаРасписания.СотрудникПредставление);
		СтруктураСотрудника.Вставить("personalCode", ВыборкаРезультатаРасписания.СотрудникКод);
		СтруктураСотрудника.Вставить("patient", ВыборкаРезультатаРасписания.КлиентПредставление);
		СтруктураСотрудника.Вставить("startDate", ВыборкаРезультатаРасписания.ДатаНачала);
		СтруктураСотрудника.Вставить("endDate", ВыборкаРезультатаРасписания.ДатаОкончания);
		СтруктураСотрудника.Вставить("telegramId", ВыборкаРезультатаРасписания.Телеграм);
		МассивДанных.Добавить(СтруктураСотрудника);
		
	КонецЦикла;
	ДанныеОРасписании = Новый Структура;
	ДанныеОРасписании.Вставить("schedules", МассивДанных);
	
	//Текст = ЗаписатьЗначениеJSON(Структура);
	//Структура = ПрочитатьЗначениеJSON(Текст);
	
	//сериализуем в json
	ЗаписьJSON = Новый ЗаписьJSON;               
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеОРасписании);
	СтрокаДляТела = ЗаписьJSON.Закрыть();
	// Отправка
	ЗаголовокЗапросаHTTP = Новый Соответствие();
	//передаем в заголовках размер и тип данных на отправку
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокЗапросаHTTP.Вставить("HashServ", омг_ДополнительныеАлгоритмы.ПолучитьТекущийХэшБазы());
	//создадим заголовок запроса
	ЗапросHTTP = Новый HTTPЗапрос("/webhook/" + Настройки.ИдентификаторВебхука, ЗаголовокЗапросаHTTP);
	//загрузить строку в тело
	ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаДляТела);
	//отсылаем POST-запрос на обработку. 
	
	Попытка
		ОтветHTTP = HTTPСоединение.ОтправитьДляОбработки(ЗапросHTTP);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось отправить данные расписания. Подробности в журнале регистрации.";
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Интеграция с N8N", 
			УровеньЖурналаРегистрации.Ошибка, Метаданные.ОбщиеМодули.омг_ИнтеграцияСN8N.Модуль, "Не удалось отправить данные расписания",
			ОписаниеОшибки());
	КонецПопытки;
	
	Если Не ОтветHTTP.КодСостояния = 200 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось отправить данные расписания. Тело ответа в журнале регистрации. Код состояния: " + ОтветHTTP.КодСостояния;
		Сообщение.Сообщить();
		
		ЗаписьЖурналаРегистрации("Интеграция с N8N", 
			УровеньЖурналаРегистрации.Ошибка, Метаданные.ОбщиеМодули.омг_ИнтеграцияСN8N.Модуль, "Не удалось отправить данные расписания",
			ОтветHTTP.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
