#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ОбщегоНазначенияСервер.ПолучитьРеквизитСсылки(ПараметрКоманды, "ЭтоГруппа") Тогда
		
		Если ОбщегоНазначения.ЕстьПравоДоступа("ИнтерактивноеДобавление", "Документ.Событие") Тогда
			ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Клиент",ПараметрКоманды));
			ОткрытьФорму("Документ.Событие.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
		Иначе
			ПоказатьПредупреждение(,НСтр("ru='Нет права на добавление документа.'"));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти