#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьКойкоМеста(Команда)
	
	Если РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтаФорма) Тогда 
		Если Объект.КоличествоМест > 0 Тогда 
			СоздатьКойкоМестаНаСервере(Объект.Ссылка,Объект.КоличествоМест);
			Оповестить("СозданиеКоек");
			УстановитьДоступностьЭлементов();
		Иначе 
			Предупреждение("Укажите вместимость!");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КоличествоМестПриИзменении(Элемент)
	
	КоличествоКойкоМестПарам = КоличествоКойкоМест(Объект.Ссылка);
	
	Если Объект.КоличествоМест < КоличествоКойкоМестПарам И КоличествоКойкоМестПарам <> 0 Тогда 
		Предупреждение("Указанная вместимость меньше количества созданных койко-мест");
		Объект.КоличествоМест = КоличествоКойкоМестПарам;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПрофильНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.КлассификаторыМинЗдрава.ФормаВыбора", Новый Структура("Отбор, ВыборГруппИЭлементов", Новый Структура("ВидКлассификатора", ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.НоменклатураКоечногоФондаМедицинскойОрганизации")), ИспользованиеГруппИЭлементов.ГруппыИЭлементы),ЭтотОбъект,,,,Новый ОписаниеОповещения("Профиль_ПослеВыбора", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

&НаСервереБезКонтекста
Функция КоличествоКойкоМест(Палата)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КойкоМеста.Ссылка) КАК КоличествоКойкоМест
	                      |ИЗ
	                      |	Справочник.КойкоМеста КАК КойкоМеста
	                      |ГДЕ
	                      |	КойкоМеста.Владелец = &Палата");
	Запрос.УстановитьПараметр("Палата",Палата);					  
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.КоличествоКойкоМест;
	Иначе 
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	Если Объект.Ссылка.Пустая() Тогда 
		Элементы.СоздатьКойкоМеста.Доступность = Ложь;
	Иначе 
		Элементы.СоздатьКойкоМеста.Доступность = ?(КоличествоКойкоМест(Объект.Ссылка) = 0,Истина,Ложь);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьКойкоМестаНаСервере(Палата, КоличествоМест)
	
	МассивКоек = Новый Массив;
	
	Для инд = 1 По КоличествоМест Цикл 
		НовоеКойкоМесто = Справочники.КойкоМеста.СоздатьЭлемент();
		НовоеКойкоМесто.Наименование = СокрЛП(Палата.Префикс + " Койка №" + Строка(инд));
		НовоеКойкоМесто.Владелец = Палата;
		НовоеКойкоМесто.Записать();
		МассивКоек.Добавить(НовоеКойкоМесто.Ссылка);
	КонецЦикла;
	
	РегистрыСведений.ДвижениеКоечногоФонда.ВыполнитьДвижениеКоечногоФонда(МассивКоек, Палата,,,Истина);

КонецПроцедуры
		
&НаКлиенте
Процедура Профиль_ПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.Профиль = Результат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти