#Область ПрограммныйИнтерфейс

// Выполнияет расчет алгоритма параметра расчета.
//
// Параметры:
//  ПараметрРасчета		 - Стурктура - параметры расчета.
//  ПарамерыВычисления	 - Стурктура - значения параметров контекста алгоритма.
//  ПроизошлаОшибка		 - Булево	 - признак ошибки
// 
// Возвращаемое значение:
//  Число.
//
Функция ВыполнитьРасчетАлгоритмаПараметраРасчета(ПараметрРасчета, ПарамерыВычисления, ПроизошлаОшибка = Ложь) Экспорт
		
	Перем Сотрудник, НачалоПериода, КонецПериода, Документ, Параметры;
	ПарамерыВычисления.Свойство("Сотрудник",	Сотрудник);
	ПарамерыВычисления.Свойство("НачалоПериода",НачалоПериода);
	ПарамерыВычисления.Свойство("КонецПериода",	КонецПериода);
	ПарамерыВычисления.Свойство("Документ",		Документ);  
	ПарамерыВычисления.Свойство("Параметры",	Параметры);
	Результат = 0;
	
	// безопасный режим выполнения кода и безопасный режим разделения данных для всех разделителей 
	УстановитьБезопасныйРежим(Истина);
                                 
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		МассивРазделителей = МодульРаботаВМоделиСервиса.РазделителиКонфигурации();
	Иначе
		МассивРазделителей = Новый Массив;
	КонецЕсли;
	
	Для Каждого ИмяРазделителя Из МассивРазделителей Цикл
		УстановитьБезопасныйРежимРазделенияДанных(ИмяРазделителя, Истина);
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		Выполнить(ПараметрРасчета.АлгоритмРасчета);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		ПроизошлаОшибка = Истина;
	КонецПопытки;
	Если ТранзакцияАктивна() Тогда
		ОтменитьТранзакцию();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти