#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НередактируемыеЭлементы = Новый Массив;
	НередактируемыеЭлементы.Добавить(Элементы.Код);
	НередактируемыеЭлементы.Добавить(Элементы.ПолноеНаименование);
	
	ИнтеграцияЕГИСЗСлужебныйСервер.НастроитьДоступностьЭлементовКлассификатора(Объект, НередактируемыеЭлементы);
	
	// Добавлено Макеев (
	
	// Отключение элемента РФ
	Элементы.УИДЕГИСЗ.Видимость = Ложь;
	// )
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = Объект.ПолноеНаименование;
КонецПроцедуры

#КонецОбласти