&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект, ПараметрКоманды);
	ПоказатьВводЧисла(ОписаниеОповещения, 100, "Введите количество сообщений для загрузки:", 10);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКоличества(Результат, ЧатСсылка) Экспорт
	
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	
	ЗагрузитьИсториюНаСервере(ЧатСсылка, Результат);
	
	ПоказатьПредупреждение(,"Загрузка завершена", 60, "История сообщений обновлена");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИсториюНаСервере(ЧатСсылка, Количество)
	
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	
	ИдЧата = iga_ОбщегоНазначенияСервер.ПолучитьЗначенияРеквизитов(ЧатСсылка, "Идентификатор");
	
	МассивИстории = Бот.ПолучитьИсториюЧатаИзСервиса(ИдЧата, Количество);
	Бот.ЗагрузитьИсториюВБазу(ЧатСсылка, ИдЧата, МассивИстории, Ложь);
	
КонецПроцедуры