
#Область ПрограммныйИнтерфейс

#Область ЗагрузкаИзЕГИСЗ

// Возвращает идентификатор классификатора источника на сайте росминздрава.
// 
// Возвращаемое значение:
//   - Строка
//
Функция ПолучитьOIDСправочника() Экспорт
	
	Возврат "1.2.643.5.1.13.13.99.2.1057";
	
КонецФункции

// Описывает соответствие между именем реквизита в классификаторе и его именем в базе 1С.
// 
// Возвращаемое значение:
//   - Соответствие.
//
Функция ПолучитьСопоставленийРеквизитовИXMLСправочникаЕГИСЗ() Экспорт
	
	Сопоставление = Новый Соответствие;
	Сопоставление.Вставить("ID", "УИДЕГИСЗ");
	Сопоставление.Вставить("NAME", "Наименование");
	
	Возврат Сопоставление;
	
КонецФункции

Функция ПолучитьПорядокПоискаСуществующихОбъектов() Экспорт
	
	ПорядокПоиска = Новый Массив;
	
	ПоляПоиска = Новый Структура;
	ПоляПоиска.Вставить("УИДЕГИСЗ", "УИДЕГИСЗ");
	ПоляПоиска.Вставить("OIDСправочникаИсточника", "OIDСправочникаИсточника");
	ПорядокПоиска.Добавить(ПоляПоиска);
	
	Возврат ПорядокПоиска;
	
КонецФункции

// Возвращает массив структур, ключ которой - имя реквизита справочника, а значение - имя поля таблицы актуальных в общей форме загрузки.
// 
// Возвращаемое значение:
//   - Массив
//
Функция ПолучитьЗагружаемыеПоляЕГИСЗ() Экспорт
	
	Поля = Новый Структура;
	
	Поля.Вставить("УИДЕГИСЗ",	"УИДЕГИСЗ");
	Поля.Вставить("Наименование", "Наименование");
	
	Возврат Поля;
	
КонецФункции

#КонецОбласти

Процедура ПоместитьВАрхивЭлементыПрошлыхКлассификаторов() Экспорт
	
	НачатьТранзакцию();
	Выб = Справочники.КаналыГоспитализации.Выбрать();
	Пока Выб.Следующий() Цикл
		Если Выб.OIDСправочникаИсточника <> ПолучитьOIDСправочника() Тогда
			Объект = Выб.ПолучитьОбъект();
			Объект.Архив = Истина;
			Объект.ПометкаУдаления = Истина;
			Объект.Записать();
		КонецЕсли;
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти
