 
 
 &НаСервере
 Процедура ПраваДоступа()
	 Если не РольДоступна("ПолныеПрава") Тогда 
		 Клиника = Неопределено;
		 Клиника = омг_ДополнительныеАлгоритмы.ПолучитьКлиникуСотрудника();
		 Организация = Неопределено;
		 Организация = омг_ДополнительныеАлгоритмы.ПолучитьОрганизациюСотрудника();
		 Если ЗначениеЗаполнено(Клиника) Тогда
			 Нашли = ложь;
			 Для каждого строкаОтбора из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
				 
				 Если ТипЗНЧ(строкаОтбора) = Тип("ОтборКомпоновкиДанных") Тогда
					 
					 Для каждого строкаОтбораПодробно из строкаОтбора.Элементы Цикл
						 Если строкаОтбораПодробно.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Филиал") и строкаОтбораПодробно.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно 
							 Тогда
							 строкаОтбораПодробно.ПравоеЗначение = Клиника; 
							 строкаОтбораПодробно.Использование = Истина;
							 Нашли = Истина;
						 КонецЕсли; 
						 
					 КонецЦикла; 
					 Если не Нашли Тогда
						 
						 ОтборПоКлинике = строкаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
						 ОтборПоКлинике.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Филиал");
						 ОтборПоКлинике.ПравоеЗначение = Клиника;
						 ОтборПоКлинике.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
					 КонецЕсли;
				 КонецЕсли;  	
			 КонецЦикла; 
			 
		 ИначеЕсли  ЗначениеЗаполнено(Организация) Тогда
			 Нашли = ложь;
			 Для каждого строкаОтбора из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
				 
				 Если ТипЗНЧ(строкаОтбора) = Тип("ОтборКомпоновкиДанных") Тогда
					 
					 Для каждого строкаОтбораПодробно из строкаОтбора.Элементы Цикл
						 Если строкаОтбораПодробно.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Филиал.Организация") и строкаОтбораПодробно.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно 
							 Тогда
							 строкаОтбораПодробно.ПравоеЗначение = Организация;
							 строкаОтбораПодробно.Использование = Истина;
							 Нашли = Истина;
						 КонецЕсли;
					 КонецЦикла;
					 Если не Нашли Тогда
						 ОтборПоКлинике = строкаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
						 ОтборПоКлинике.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Филиал.Организация");
						 ОтборПоКлинике.ПравоеЗначение = Организация;
						 ОтборПоКлинике.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
					 КонецЕсли; 
				 КонецЕсли;  	
			 КонецЦикла; 
			 
		 КонецЕсли;
		 
	 КонецЕсли; 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура ПриОткрытии(Отказ)
	 ПраваДоступа()
 КонецПроцедуры
