
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.омг_НоменклатураИзСписковДляЗарплаты.Записывать = Истина;
	
	УслугиПодробноДляДвижения = УслугиПодробно.Выгрузить();
	УслугиПодробноДляДвижения.Свернуть("Услуга,ИсходнаяУслугаГруппа,Приоритет");
	
	Для Каждого ТекСтрокаУслуги Из УслугиПодробноДляДвижения Цикл   
		
		Движение = Движения.омг_НоменклатураИзСписковДляЗарплаты.Добавить();
		Движение.Услуга = ТекСтрокаУслуги.Услуга; 
		Движение.Документ = ЭтотОбъект.Ссылка;   
		Движение.Приоритет = ТекСтрокаУслуги.Приоритет;   
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ТабУслуги = ЭтотОбъект.Услуги.Выгрузить();
		ТабУслуги.Свернуть("Услуга");
		УслугиПодробно.Очистить();
		Для Каждого ТекСтрокаУслуги Из ТабУслуги Цикл   
			Если не ТекСтрокаУслуги.Услуга.ЭтоГруппа Тогда
				СтрУслугиПодробно = УслугиПодробно.Добавить();
				СтрУслугиПодробно.Услуга = ТекСтрокаУслуги.Услуга; 
				СтрУслугиПодробно.Приоритет = 1;   
			иначе 
				УслугиИзГруппы = омг_ДополнительныеАлгоритмы.ВернутьСписокУслугСприоритетом(ТекСтрокаУслуги.Услуга);	
				Для каждого УслугиИзГруппыСтрока из УслугиИзГруппы Цикл
					СтрУслугиПодробно = УслугиПодробно.Добавить();
					СтрУслугиПодробно.Услуга = УслугиИзГруппыСтрока.Услуга; 
					СтрУслугиПодробно.Приоритет = УслугиИзГруппыСтрока.Приоритет; 
					СтрУслугиПодробно.ИсходнаяУслугаГруппа = ТекСтрокаУслуги.Услуга; 
				КонецЦикла;
			КонецЕСли;
		КонецЦикла;	
	КонецЕсли;   
	
КонецПроцедуры 

