#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);
	
		
	ЗаполнитьНачальныеНастройкиОтбора();
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Иначе
		ЗагрузитьСохраненныеНастройкиОтбора();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.НастройкаОтбораСотрудников = Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки());
	
КонецПроцедуры

#КонецОбласти

#Область ОтборСотрудников

&НаСервере
Процедура ЗаполнитьНачальныеНастройкиОтбора()
	
	СхемаКомпоновкиДанных = Документы.НачислениеЗарплаты.ПолучитьМакет("СхемаКомпоновкиДанных");
	
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);	
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСохраненныеНастройкиОтбора()
	
	ЗначениеНастроекОтбора = ПолучитьНастройкиОтбора();
	
	Если ТипЗнч(ЗначениеНастроекОтбора) = Тип("НастройкиКомпоновкиДанных") Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(ЗначениеНастроекОтбора);
	КонецЕсли;
	
КонецПроцедуры

// Если в реквизите объекта НастройкаОтбораСотрудников сохранены настройки построителя отчета (которые
// не подходят для компоновщика настроек), то возвращаем настройки компоновщика по умолчанию 
&НаСервере
Функция ПолучитьНастройкиОтбора(ТолькоПроверить = Ложь)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ЗначениеНастроекОтбора = ДокументОбъект.НастройкаОтбораСотрудников.Получить();
	
	Возврат ЗначениеНастроекОтбора;	
		
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ДанныеДляРасчета.Количество() > 0 Тогда
		
		ТекстВопроса = НСтр("ru = 'Таблица с данными расчета будет очищена. Продолжить?'");
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да) =
			КодВозвратаДиалога.Нет 
		Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	РассчитатьНаСервере(Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
    Диалог = Новый ДиалогРедактированияСтандартногоПериода();                                 
    Диалог.Период = Новый СтандартныйПериод(Объект.НачалоПериода, Объект.КонецПериода);        
    Если (Диалог.Редактировать()) Тогда
        Объект.НачалоПериода = Диалог.Период.ДатаНачала;
        Объект.КонецПериода = Диалог.Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура РассчитатьНаСервере(ИмяКоманды)
	
	Объект.ДанныеДляРасчета.Очистить();
	ТабДанныеДляРасчета = Объект.ДанныеДляРасчета.Выгрузить();
	
	мсСписокСотрудников = Документы.ДанныеДляРасчетаВЗУП.ПолучитьСписокСотрудниковПоОтборам(КомпоновщикНастроек);  
	
	Отбор = Новый Структура;
	Если ИмяКоманды = "ЗаполнитьПоОрганизации" Тогда
		Отбор.Вставить("ИмяРеквизита", "Филиал.Организация");
		Отбор.Вставить("Значение", Объект.Филиал.Организация);	
	ИначеЕсли ИмяКоманды = "ЗаполнитьПоФилиалу" Тогда
		Отбор.Вставить("Значение", Объект.Филиал);
		Отбор.Вставить("ИмяРеквизита", "Филиал");
	Иначе
		Отбор = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиПоказателейЗУП.Сотрудник,
	|	НастройкиПоказателейЗУП.ПоказательЗУП,
	|	НастройкиПоказателейЗУП.ФормаУчастия,
	|	НастройкиПоказателейЗУП.ВидПараметра,
	|	НастройкиПоказателейЗУП.ПоказательРасчета,
	|	НастройкиПоказателейЗУП.ЗначениеПараметра,
	|	НастройкиПоказателейЗУП.ДатаНачала,
	|	НастройкиПоказателейЗУП.ДатаОкончания
	|ИЗ
	|	РегистрСведений.НастройкиПоказателейЗУП КАК НастройкиПоказателейЗУП
	|ГДЕ
	|	НастройкиПоказателейЗУП.ДатаНачала <= &ДатаОкончания
	|	И (НастройкиПоказателейЗУП.ДатаОкончания >= &ДатаНачала
	|			ИЛИ НастройкиПоказателейЗУП.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	|	И НастройкиПоказателейЗУП.Сотрудник В(&Сотрудники)
	|	И НастройкиПоказателейЗУП.ПоказательЗУП.ВидДокументаЗУП = &ВидДокументаЗУП";
	
	Запрос.УстановитьПараметр("ДатаНачала", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ДатаОкончания", Объект.КонецПериода);
	Запрос.УстановитьПараметр("Сотрудники", мсСписокСотрудников);
	Запрос.УстановитьПараметр("ВидДокументаЗУП", Объект.ВидДокументаЗУП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураСотрудник = Новый Структура("Сотрудник, ФормаУчастия, ВидПараметра, ПоказательРасчета, ЗначениеПараметра, ДатаНачала, ДатаОкончания");
		ЗаполнитьЗначенияСвойств(СтруктураСотрудник, Выборка);
		
		СтруктураСотрудник.ДатаНачала = Макс(Выборка.ДатаНачала, Объект.НачалоПериода);
		Если ЗначениеЗаполнено(Выборка.ДатаОкончания) Тогда
			СтруктураСотрудник.ДатаОкончания = Мин(Выборка.ДатаОкончания, Объект.КонецПериода);
		Иначе
			СтруктураСотрудник.ДатаОкончания = Объект.КонецПериода;
		КонецЕсли;
		
		СотрудникСумма = РасчетЗаработнойПлаты.ПолучитьВыработкуНаСотрудника(СтруктураСотрудник, Отбор);
		
		Для Каждого ЗначСуммы Из СотрудникСумма Цикл
			НоваяСтрока = ТабДанныеДляРасчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			НоваяСтрока.Значение = ЗначСуммы.Сумма;
		КонецЦикла;
		
	КонецЦикла;
		
	ТабДанныеДляРасчета.Свернуть("Сотрудник, ВидПараметра, ПоказательРасчета, ПоказательЗУП", "Значение");
	Объект.ДанныеДляРасчета.Загрузить(ТабДанныеДляРасчета);
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры

