
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не РольДоступна("омг_МедсестраПЗБ") И Не Параметры.Свойство("ОткрытиеПоКоманде") Тогда
		Отказ = Истина;
	КонецЕсли;
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();

	СтруктураПараметров = РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);
	
	Подбор.Параметры.УстановитьЗначениеПараметра("Филиал", Объект.Филиал);
	ОсновнойПрейскурант = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойПрейскурант");
	Подбор.Параметры.УстановитьЗначениеПараметра("ОсновнойПрейскурант", ОсновнойПрейскурант);

	Если Параметры.Ключ.Пустая() Тогда 
		
		Объект.Дата = "";
	КонецЕсли;
	
	Если Не Элементы.Найти("КнопкаФилиал") = Неопределено Тогда
		Элементы.КнопкаФилиал.Видимость = Ложь;
	КонецЕсли;
	Если Не Объект.Статус = Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Открыта Тогда
		УстановитьДоступностьЗаявки(Элементы, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтоги()
	
	Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ПересчитатьИтоги(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоИИН(Команда)

	ОткрытьФорму("ОбщаяФорма.ФормаПоискаКлиентаУпр",,ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ОбновитьЖурнал(ТекущийОбъект, Объект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПациента(Пациент)
	
	СтруктураДанных = Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ПолучитьДанныеПациента(Пациент);
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Клиенты") Тогда
		
		ДанныеПациента = ПолучитьДанныеПациента(ВыбранноеЗначение);

		ЗаполнитьЗначенияСвойств(Объект, ДанныеПациента);
		
	КонецЕсли;

	ПересчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеОтветаНаВопросОПодбореКонтейнеров(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуБиоматериаловПоАнализам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьБиоматериалы(Команда)
	
	ТекстВопроса = "Заполнить список контейнеров? Таблица будет перезаполнена";
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросОПодбореКонтейнеров", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура БиоматериалыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура БиоматериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ОбновитьЖурнал(ТекущийОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеОтметкиАнализовДляКонтейнеров(СписокЗначений, ДопПараметры) Экспорт
	
	Если СписокЗначений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("КодСтроки", Элементы.Биоматериалы.ТекущиеДанные.КодСтроки);
	
	НайденныеСтроки = Объект.АнализыПоКонтейнерам.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		НайденноеЗначение = СписокЗначений.НайтиПоЗначению(СтрокаТаблицы.Номенклатура);
		Если НайденноеЗначение = Неопределено Или Не НайденноеЗначение.Пометка Тогда
			Объект.АнализыПоКонтейнерам.Удалить(СтрокаТаблицы);
		КонецЕсли;                                             
		
	КонецЦикла;
	
	Для Каждого ПозицияСписка Из СписокЗначений Цикл
		Если ПозицияСписка.Пометка Тогда
			
			
			Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
				Если СтрокаТаблицы.Номенклатура = ПозицияСписка.Значение Тогда
					ПозицияСписка.Пометка = Ложь;
				КонецЕсли;
			КонецЦикла;
			
			Если ПозицияСписка.Пометка Тогда
				СтрокаТаблицы = Объект.АнализыПоКонтейнерам.Добавить();
				СтрокаТаблицы.КодСтроки = СтруктураПоиска.КодСтроки;
				СтрокаТаблицы.Номенклатура = ПозицияСписка.Значение;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура БиоматериалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.БиоматериалыСостав Тогда
		
		СтруктураПоиска = Новый Структура("КодСтроки", Элементы.Биоматериалы.ТекущиеДанные.КодСтроки);
		
		СписокВыбора = Новый СписокЗначений;
		
		Для Каждого СтрокаТаблицы Из Объект.АнализыПоКонтейнерам Цикл
			Если СписокВыбора.НайтиПоЗначению(СтрокаТаблицы.Номенклатура) = Неопределено Тогда 
				СписокВыбора.Добавить(СтрокаТаблицы.Номенклатура);
			КонецЕсли;
		КонецЦикла;
		
		ОтмеченныеСтроки = Объект.АнализыПоКонтейнерам.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаТаблицы Из ОтмеченныеСтроки Цикл
			НайденноеЗначение = СписокВыбора.НайтиПоЗначению(СтрокаТаблицы.Номенклатура);
			Если Не НайденноеЗначение = Неопределено Тогда
				НайденноеЗначение.Пометка = Истина;
			Иначе 
				Объект.АнализыПоКонтейнерам.Удалить(СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтметкиАнализовДляКонтейнеров", ЭтаФорма);
		СписокВыбора.ПоказатьОтметкуЭлементов(ОписаниеОповещения, "Анализы");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтправитьЗаявкуВЛИС(Заявка)
	
	Возврат омг_ИнтеграцияСЛИС.СоздатьЗаявкуВЛИСИПолучитьКонтейнеры(Заявка);
	
КонецФункции

&НаКлиенте
Процедура Обработчик_ПослеОтветаНаВопросОбОтправкеВЛИС(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = Истина Тогда
		Возврат;
	КонецЕсли;
	
	омг_ЗаявкаЛИСОбщиеКлиентскиеПроцедуры.Обработчик_ПослеОтветаНаВопросОбОтправкеВЛИС(ЭтаФорма, Объект);
	
	УстановитьДоступностьЗаявки(Элементы, Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПроизвестиЗаборМатериалов(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросОбОтправкеВЛИС", ЭтаФорма);
	ОткрытьФорму("Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Форма.ФормаВопроса",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудника();
	 Пользователь = Пользователи.ТекущийПользователь();
	 Медсестра =  Пользователь.Сотрудник;
     Возврат Медсестра;
КонецФункции

&НаКлиенте
Процедура КонтейнерыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСостояниеПоДаннымЛИСНаСервере(Заявка)
	
	омг_ИнтеграцияСЛИС.ОбновлениеСостоянияОтправленныхЗаявокВЛИС(Заявка);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеОтветаНаВопросООбновленииЛИС(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	
	ОбновитьСостояниеПоДаннымЛИСНаСервере(Объект.Ссылка);
	
	Прочитать();
	
	ПоказатьПредупреждение(, "Операция обновления завершена.");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеПоДаннымЛИС(Команда)
	
	ТекстВопроса = "Выполнить обновления по данным ЛИС?";
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросООбновленииЛИС", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура СканироватьКодПробы(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВводаШтрихкодаЗаявки", ЭтаФорма);
	ПоказатьВводСтроки(ОписаниеОповещения,, "Штрихкод", 100, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеВводаШтрихкодаЗаявки(Штрихкод, ДопПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущийЭлемент = Элементы.Анализы Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана позиция анализа для подвязки штрихкода!";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	Элементы.Анализы.ТекущиеДанные.Проба = Штрихкод;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Не ТипЗнч(Данные) = Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийЭлемент = Элементы.НомерЗаявки Тогда
		Объект.НомерЗаявки = Данные;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаявку(Команда)
	СтатусОтменена = ПолучитьСтатусОтмены(); 
	Объект.Статус = СтатусОтменена;
КонецПроцедуры  

&НаСервере
Функция ПолучитьСтатусОтмены()
	СтатусОтменена = Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Отменена; 
	Возврат СтатусОтменена; 
КонецФункции 

&НаСервере
Процедура ЗаполнитьТаблицуБиоматериаловПоАнализам();
	
	Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ЗаполнитьТаблицуБиоматериаловПоАнализам(Объект);
	
КонецПроцедуры


&НаКлиенте
Процедура НомерЗаявкиПриИзменении(Элемент)
	
	Для Каждого СтрокаАнализа Из Объект.Анализы Цикл
		СтрокаАнализа.Проба = Объект.НомерЗаявки;
	КонецЦикла;
	
	
	Для Каждого СтрокаАнализа Из Объект.Биоматериалы Цикл
		СтрокаАнализа.Проба = Объект.НомерЗаявки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НайтиИОткрытьЗаявкуПоШтрихкоду(Штрихкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС
	               |ГДЕ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.НомерЗаявки = &НомерЗаявки";
	Запрос.УстановитьПараметр("НомерЗаявки", Штрихкод);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаявкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
	
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ЗаявкаОбъект);
	ЗначениеВРеквизитФормы(ЗаявкаОбъект, "Объект");
	
	ПредставлениеПациента = Строка(ЗаявкаОбъект.Пациент) + ", " + Формат(Объект.ДатаРождения, "ДЛФ=D");
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура Обработчик_ПослеВводаШтрихкода(Штрихкод, ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаявкаНайдена = НайтиИОткрытьЗаявкуПоШтрихкоду(Штрихкод);
	Если Не ЗаявкаНайдена Тогда
		ПоказатьПредупреждение(, "По введенному штрихкоду заявка не найдена!");
	Иначе
		Если Объект.Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Открыта") Тогда
			УстановитьДоступностьЗаявки(Элементы, Истина);
		Иначе
			УстановитьДоступностьЗаявки(Элементы, Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПриИзменении(Элемент)
	
	Обработчик_ПослеВводаШтрихкода(Поиск, Неопределено);
	
КонецПроцедуры


&НаКлиенте
Процедура ВвестиШтрихкод(Команда)
		
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВводаШтрихкода", ЭтаФорма);
	ПоказатьВводСтроки(ОписаниеОповещения, "", "Штрихкод заявки", 13);
	
КонецПроцедуры


&НаСервере
Процедура ЗакрытьЗаявкуНаСервере()
	
	ЗначениеВРеквизитФормы(Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.СоздатьДокумент(), "Объект");
	УстановитьДоступностьЗаявки(Элементы, Ложь);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЗаявки(Элементы, Доступность = Истина)
	
	Элементы.ФормаПроизвестиЗаборМатериалов.Доступность = Доступность;
	Элементы.Биоматериалы.ТолькоПросмотр = Не Доступность;
	Элементы.Контейнеры.ТолькоПросмотр = Не Доступность;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьЗаявку(Команда)
	ЗакрытьЗаявкуНаСервере();
	ТекущийЭлемент = Элементы.Поиск;
	Поиск = "";
	ПредставлениеПациента = "";
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Заголовок = "Рабочее место медсестры ПЗБ";
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ЗаписатьЖурнал(ТекущийОбъект, Объект);

КонецПроцедуры

