
&НаКлиенте
Процедура Актуализировать(Команда)
	АктуализироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура АктуализироватьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиРазрешительногоРежима.ТокенАвторизации КАК ТокенАвторизации
		|ИЗ
		|	РегистрСведений.НастройкиРазрешительногоРежима КАК НастройкиРазрешительногоРежима
		|ГДЕ
		|	НастройкиРазрешительногоРежима.Используется = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СчетчикПопыток = 1;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Результат = МаркировкаРазрешительныйРежим.ВыполнитьАктуализациюCDNПлощадокДлительнаяОперация(Новый Структура("КлючСессии, ОбновлятьБезПроверкиДатыОбновления", ВыборкаДетальныеЗаписи.ТокенАвторизации, Истина));
		Если Не ЗначениеЗаполнено(Результат.ТекстОшибки) Тогда
			ОбщегоНазначения.СообщитьПользователю("Актуализация выполнена успешно");
			Прервать;
		Иначе
			ОбщегоНазначения.СообщитьПользователю(Результат.ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	

КонецПроцедуры
