 
 Функция ДанныеДрайвераОборудования(ИдентификаторДрайвера) Экспорт
	 
	 ТекущийЯзык = ТекущийЯзык();
	 КодЯзыка = ?(ТипЗнч(ТекущийЯзык) = Тип("Строка"), ТекущийЯзык, ТекущийЯзык.КодЯзыка); 
	 
	 ДанныеДрайвера = Новый Структура();
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ДрайверыОборудованияПереопределяемый.Ссылка КАК Ссылка,
	 |	ДрайверыОборудованияПереопределяемый.Наименование КАК Наименование,
	 |	ДрайверыОборудованияПереопределяемый.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
	 |	ДрайверыОборудованияПереопределяемый.ВерсияДрайвера КАК ВерсияДрайвера,       
	 |	ДрайверыОборудованияПереопределяемый.ИмяМакетаДрайвера КАК ИмяМакетаДрайвера,
	 |	ДрайверыОборудованияПереопределяемый.СнятСПоддержки КАК СнятСПоддержки, 
	 |	ДрайверыОборудованияПереопределяемый.СообщениеПриИспользовании КАК СообщениеПриИспользовании,
	 |	ДрайверыОборудованияПереопределяемый.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	 |	ДрайверыОборудованияПереопределяемый.ТипОборудования КАК ТипОборудования,
	 |	ДрайверыОборудованияПереопределяемый.Предопределенный КАК Предопределенный,
	 |	ДрайверыОборудованияПереопределяемый.СпособПодключения КАК СпособПодключения,  
	 |	ДрайверыОборудованияПереопределяемый.БезопасноеПодключение КАК БезопасноеПодключение
	 |ИЗ
	 |	Справочник.ДрайверыОборудования КАК ДрайверыОборудованияПереопределяемый
	 |ГДЕ
	 |	ДрайверыОборудованияПереопределяемый.Ссылка = &Идентификатор";
	 
	 Запрос.УстановитьПараметр("Идентификатор", ИдентификаторДрайвера.Ссылка.ДрайверОборудования);
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 Выборка = РезультатЗапроса.Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
		 
		 // Заполним структуру данных устройства.
		 ДанныеДрайвера.Вставить("Ссылка"                   , Выборка.Ссылка);
		 ДанныеДрайвера.Вставить("Наименование"             , Выборка.Наименование);
		 ДанныеДрайвера.Вставить("ИдентификаторОбъекта"     , Выборка.ИдентификаторОбъекта);
		 ДанныеДрайвера.Вставить("ВерсияДрайвера"           , Выборка.ВерсияДрайвера);
		 ДанныеДрайвера.Вставить("СнятСПоддержки"           , Выборка.СнятСПоддержки);           
		 ДанныеДрайвера.Вставить("СообщениеПриИспользовании", Выборка.СообщениеПриИспользовании);  
		 ДанныеДрайвера.Вставить("ИмяПредопределенныхДанных", Выборка.ИмяПредопределенныхДанных);
		 ДанныеДрайвера.Вставить("ТипыОборудования"         , МенеджерОборудования.ПараметрыТипыОборудования(Выборка.ТипОборудования));  
		 ДанныеДрайвера.Вставить("ТипОборудования"          , Выборка.ТипОборудования);  
		 ДанныеДрайвера.Вставить("ТипОборудованияИмя"       , XMLСтрока(Выборка.ТипОборудования));   
		 ДанныеДрайвера.Вставить("БезопасноеПодключение"    , Выборка.БезопасноеПодключение);   
		 
		 СпособПодключения = Выборка.СпособПодключения;
		 ПодключениеИзМакета = СпособПодключения = Перечисления.СпособПодключенияДрайвера.ИзМакета;
		 ПодключениеЛокальноПоИдентификатору = СпособПодключения = Перечисления.СпособПодключенияДрайвера.ЛокальноПоИдентификатору;
		 
		 ШаблонЛокализации = Неопределено;    
		 МакетДоступен = Ложь;
		 ИмяМакетаДрайвера = "";
		 
		 Если ПодключениеИзМакета Тогда  
			 ИмяДрайвера = Выборка.ИмяПредопределенныхДанных;
			 ИмяМакетаДрайвера = Выборка.ИмяМакетаДрайвера;
			 МенеджерОборудования.ЗаполнитьДанныеМакетов(ИмяДрайвера, ИмяМакетаДрайвера, МакетДоступен, ШаблонЛокализации, КодЯзыка); 
		 КонецЕсли;       
		 ДанныеДрайвера.Вставить("СпособПодключения"        , СпособПодключения);
		 ДанныеДрайвера.Вставить("ПодключениеИзМакета"      , ПодключениеИзМакета);
		 ДанныеДрайвера.Вставить("ПодключениеЛокальноПоИдентификатору", ПодключениеЛокальноПоИдентификатору);
		 ДанныеДрайвера.Вставить("ИмяМакетаДрайвера"  , ИмяМакетаДрайвера);
		 ДанныеДрайвера.Вставить("МакетДоступен"      , МакетДоступен);
		 ДанныеДрайвера.Вставить("ШаблонЛокализации"  , ШаблонЛокализации);        
		 
	 КонецЦикла;
	 
	 Возврат ДанныеДрайвера;
	 
 КонецФункции
 
 // Настраивает подключаемое оборудование в форме,
 // устанавливает флаг ИспользоватьПодключаемоеОборудование в форме
 // Параметры:
 //   Форма - Форма, в которой необходимо настроить подключаемое оборудование.
 //
 
 Процедура НастроитьПодключаемоеОборудование(Форма, ПрефиксыЭлементовФормы = "Товары") Экспорт
	 
	 ТипыПодключенногоОборудования = МенеджерОборудованияСерверПовтИсп.ТипыПодключенногоОборудования();
	 
	 Форма.ИспользоватьПодключаемоеОборудование = ИспользоватьПодключаемоеОборудование(ТипыПодключенногоОборудования);
	 
 КонецПроцедуры
 
 // Проверяет, что включена ф.о "Использовать подключаемое оборудование",
 // настроено ли оборудование и авторизовался пользователь,
 // а не внешний пользователь.
 
 Функция ИспользоватьПодключаемоеОборудование(ТипыПодключенногоОборудования = Неопределено) Экспорт
	 
	 //ИспользоватьПодключаемоеОборудование = ПолучитьФункциональнуюОпцию("ИспользоватьПодключаемоеОборудование"); 
	 ИспользоватьПодключаемоеОборудование = Истина;
	 ПользовательАвторизовался 			 = ТипЗнч(Пользователи.АвторизованныйПользователь()) = Тип("СправочникСсылка.Пользователи");
	 
	 Если ТипыПодключенногоОборудования = Неопределено Тогда
		 ТипыПодключенногоОборудования = МенеджерОборудованияСерверПовтИсп.ТипыПодключенногоОборудования();
	 КонецЕсли;
	 
	 Возврат
	 ИспользоватьПодключаемоеОборудование
	 И ПользовательАвторизовался
	 И ТипыПодключенногоОборудования <> Неопределено
	 И ТипыПодключенногоОборудования.Количество() > 0;
	 
 КонецФункции
 
 
 Функция ПолучитьОрганизацию(Филиал) Экспорт
	 Возврат Филиал.Организация	
 КонецФункции	
 
 // Возвращает валюту регламентированного учета
 // Если переданная в качестве параметра валюта уже заполнена - возвращает ее.
 // Если валюта не передана в качестве параметра или передан пустой,
 // валюту рег. учета. Если валюта рег. учета не заполнена - возвращает пустую ссылку на валюту
 //
 // Параметры:
 // Валюта - СправочникСсылка.Валюты - Валюта, которую нужно заполнить
 //
 // Возвращаемое значение:
 // СправочникСсылка.Валюты
 //
 
 Функция ПолучитьВалютуРегламентированногоУчета(Знач Валюта = Неопределено) Экспорт
	 
	 Если Не ЗначениеЗаполнено(Валюта) Тогда
		 Возврат Справочники.Валюты.НайтиПоКоду("398");
	 Иначе
		 Возврат Валюта;
	 КонецЕсли;
	 
 КонецФункции 
 
 Функция ТекстРазделителяЗапросовПакета() Экспорт
	 
	 ТекстРазделителя =
	 "
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |";
	 
	 Возврат ТекстРазделителя;
	 
 КонецФункции
 
 Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт
	 
	 //ЗначениеСтавки = 0;	
	 //Если ТипЗнч(СтавкаНДС) = Тип("СправочникСсылка.СтавкиНДС") Тогда		
	 //	ЗначениеСтавки = СтавкаНДС.Ставка;
	 //КонецЕсли;
	 //
	 //Возврат ЗначениеСтавки;
	 
	 Возврат 0;
	 
 КонецФункции 
 
 
 Функция ДанныеФизЛица(Организация, ФизЛицо, ДатаСреза) Экспорт
	 
	 Результат = Новый Структура("Фамилия, Имя, Отчество, Представление, 
	 |ТабельныйНомер, Должность, ПодразделениеОрганизации, 
	 |ДокументВид, ДокументСерия, ДокументНомер,  
	 |ДокументДатаВыдачи, ДокументКемВыдан,УдалитьНеСклонятьФамилию, Пол");
	 
	 ЕстьРаботникиОрганизации = Метаданные.РегистрыСведений.Найти("РаботникиОрганизаций") <> Неопределено;
	 
	 //ЗапросПоЛицам = Новый Запрос();
	 //ЗапросПоЛицам.УстановитьПараметр("ДатаСреза",   ДатаСреза);
	 //ЗапросПоЛицам.УстановитьПараметр("Организация", Организация);
	 //ЗапросПоЛицам.УстановитьПараметр("ФизЛицо", ФизЛицо);
	 //ЗапросПоЛицам.УстановитьПараметр("парамУволен", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	 //ЗапросПоЛицам.Текст =
	 //"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	 //|	ФИОФизЛицСрезПоследних.Фамилия,
	 //|	ФИОФизЛицСрезПоследних.Имя,
	 //|	ФИОФизЛицСрезПоследних.Отчество,
	 //|	ФИОФизЛицСрезПоследних.УдалитьНеСклонятьФамилию,
	 //|	ФизическиеЛица.Пол";
	 //Если ЕстьРаботникиОрганизации Тогда
	 //ЗапросПоЛицам.Текст = ЗапросПоЛицам.Текст + ",
	 //|	РаботникиОрганизацийСрезПоследних.Сотрудник.Код КАК ТабельныйНомер,
	 //|	РаботникиОрганизацийСрезПоследних.Должность,
	 //|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации";
	 //Иначе
	 //ЗапросПоЛицам.Текст = ЗапросПоЛицам.Текст + ",
	 //|	ФизическиеЛица.Должность";
	 //КонецЕсли;
	 //ЗапросПоЛицам.Текст = ЗапросПоЛицам.Текст + ",
	 //|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументВид,
	 //|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументСерия,
	 //|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументНомер,
	 //|	ПаспортныеДанныеФизЛицСрезПоследних.ДокументДатаВыдачи,
	 //|	ВЫРАЗИТЬ(ПаспортныеДанныеФизЛицСрезПоследних.ДокументКемВыдан КАК СТРОКА(1000)) КАК ДокументКемВыдан
	 //|ИЗ
	 //|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	 //|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
	 //|				&ДатаСреза, 
	 //|				ФизЛицо = &ФизЛицо) КАК ФИОФизЛицСрезПоследних
	 //|		ПО ФизическиеЛица.Ссылка = ФИОФизЛицСрезПоследних.ФизЛицо
	 //|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПаспортныеДанныеФизЛиц.СрезПоследних(
	 //|				&ДатаСреза, 
	 //|				ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеФизЛицСрезПоследних
	 //|		ПО ФизическиеЛица.Ссылка = ПаспортныеДанныеФизЛицСрезПоследних.ФизЛицо";
	 //Если ЕстьРаботникиОрганизации Тогда
	 //ЗапросПоЛицам.Текст = ЗапросПоЛицам.Текст + "
	 //|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	 //|				&ДатаСреза, 
	 //|				Сотрудник.ФизЛицо = &ФизЛицо 
	 //|				И Организация = &Организация
	 //|				И (Сотрудник.ВидЗанятости <> ЗНАЧЕНИЕ(Перечисление.ВидыЗанятостиВОрганизации.ВнутреннееСовместительство))) КАК РаботникиОрганизацийСрезПоследних
	 //|		ПО ФизическиеЛица.Ссылка = РаботникиОрганизацийСрезПоследних.Сотрудник.Физлицо
	 //|       	И  РаботникиОрганизацийСрезПоследних.ПричинаИзмененияСостояния <> &парамУволен";
	 //КонецЕсли;
	 //ЗапросПоЛицам.Текст = ЗапросПоЛицам.Текст + "
	 //|ГДЕ
	 //|	ФизическиеЛица.Ссылка = &ФизЛицо";
	 //Если ЕстьРаботникиОрганизации Тогда
	 //ЗапросПоЛицам.Текст = ЗапросПоЛицам.Текст + "
	 //|
	 //|УПОРЯДОЧИТЬ ПО
	 //|	РаботникиОрганизацийСрезПоследних.Период УБЫВ
	 //|";
	 //КонецЕсли;
	 //
	 //Данные = ЗапросПоЛицам.Выполнить().Выбрать();
	 //Если Данные.Следующий() Тогда
	 //	ЗаполнитьЗначенияСвойств(Результат, Данные);
	 //	Результат.Представление = "" +Данные.Фамилия +" "+ Данные.Имя+" "+ Данные.Отчество;
	 //КонецЕсли;
	 
	 Возврат Результат;
	 
 КонецФункции // ДанныеФизЛица()
 
 
 Функция ДанныеФизЛицаТекущегоПользователя(Организация, ДатаСреза = Неопределено, ФИОКратко = Истина) Экспорт
	 ФизическоеЛицо      = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователи.ТекущийПользователь(), "ФизическоеЛицо");
	 ДатаПолученияДанных = ?(ЗначениеЗаполнено(ДатаСреза), ДатаСреза, ОбщегоНазначения.ТекущаяДатаПользователя());
	 
	 СтруктураВозврата  = Новый Структура("Представление, Должность");
	 
	 Если ЗначениеЗаполнено(ФизическоеЛицо) Тогда
		 УстановитьПривилегированныйРежим(Истина);
		 ДанныеФизЛица = ДанныеФизЛица(Организация, ФизическоеЛицо, ДатаПолученияДанных);
		 УстановитьПривилегированныйРежим(Ложь);
		 
		 ЗаполнитьЗначенияСвойств(СтруктураВозврата, ДанныеФизЛица);
	 КонецЕсли;
	 
	 Возврат СтруктураВозврата;
 КонецФункции
 
 
 
 Функция ПолучитьВерсиюФФД(Знач ВерсияФН, Знач ВерсияККТ) Экспорт
	 ВерсияККТ = ДополнитьНомерВерсииФФД(ВерсияККТ);
	 ВерсияФН  = ДополнитьНомерВерсииФФД(ВерсияФН);
	 
	 // Определеляем максимальную версию ФФД поддерживаемую ФН
	 ВерсияФН = ?(СравнитьВерсии(ВерсияФН, "1.0.5.0") > 0, ВерсияФН, "1.0.5.0");
	 
	 // Итоговая версия определяется минимальной из версий поддерживаемых ФН и ККТ
	 ВерсияФормата = ?(СравнитьВерсии(ВерсияФН, ВерсияККТ) > 0, ВерсияККТ, ВерсияФН);
	 
	 Возврат ВерсияФормата;
 КонецФункции
 
 
 Функция СравнитьВерсии(Знач СтрокаВерсии1, Знач СтрокаВерсии2) Экспорт
	 
	 Строка1 = ?(ПустаяСтрока(СтрокаВерсии1), "0.0.0.0", СтрокаВерсии1);
	 Строка2 = ?(ПустаяСтрока(СтрокаВерсии2), "0.0.0.0", СтрокаВерсии2);
	 Версия1 = СтрРазделить(Строка1, ".");
	 Если Версия1.Количество() <> 4 Тогда
		 ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		 НСтр("ru = 'Неправильный формат параметра %1: %2'"), "СтрокаВерсии1", СтрокаВерсии1);
	 КонецЕсли;
	 Версия2 = СтрРазделить(Строка2, ".");
	 Если Версия2.Количество() <> 4 Тогда
		 ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		 НСтр("ru = 'Неправильный формат параметра %1: %2'"), "СтрокаВерсии2", СтрокаВерсии2);
	 КонецЕсли;
	 
	 Результат = 0;
	 Для Разряд = 0 По 3 Цикл
		 Результат = Число(Версия1[Разряд]) - Число(Версия2[Разряд]);
		 Если Результат <> 0 Тогда
			 Возврат Результат;
		 КонецЕсли;
	 КонецЦикла;
	 Возврат Результат;
	 
 КонецФункции     
 
 Функция ДополнитьНомерВерсииФФД(НомерВерсии) Экспорт
	 Если НЕ ЗначениеЗаполнено(НомерВерсии) Тогда
		 Возврат "1.0.0.0";
	 КонецЕсли;
	 
	 НомерВерсииВМассив = СтрРазделить(НомерВерсии, ".");
	 
	 Для НомерРазряда = НомерВерсииВМассив.Количество() По 3 Цикл
		 НомерВерсииВМассив.Добавить("0");
	 КонецЦикла;
	 
	 Возврат СтрСоединить(НомерВерсииВМассив, ".");
 КонецФункции    
 
 Процедура ДополнитьСведенияЧека(ДокументОснование,СтрВозврата) Экспорт	
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ЕСТЬNULL(ОказаниеУслуг.Филиал, """") КАК Филиал,
	 |	ЕСТЬNULL(ОказаниеУслуг.Клиент, """") КАК Клиент,
	 |	ЕСТЬNULL(ОказаниеУслуг.Клиент.ИНН, """") КАК КлиентИНН,
	 |	ЕСТЬNULL(ОказаниеУслуг.Клиент.ДатаРождения, """") КАК КлиентДатаРождения,
	 |	ЕСТЬNULL(ОказаниеУслуг.омг_ИспользуемыйТерминал, """") КАК омг_ИспользуемыйТерминал,
	 |	ОказаниеУслуг.ВидОперации КАК ВидОперации
	 |ИЗ
	 |	Документ.ОказаниеУслуг КАК ОказаниеУслуг
	 |ГДЕ
	 |	ОказаниеУслуг.Ссылка = &Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КонтактнаяИнформация.Представление КАК Представление
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Вид.Наименование = &ФактическийАдрес
	 |	И КонтактнаяИнформация.Объект = &Филиал
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КонтактнаяИнформация.Представление КАК Представление
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Вид.Наименование = &РабочийТелефон
	 |	И КонтактнаяИнформация.Объект = &Филиал
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КонтактнаяИнформация.Представление КАК Представление
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Вид.Наименование = &Инстаграм
	 |	И КонтактнаяИнформация.Объект = &Организация
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ЛицензииМедицинскойДеятельностиСрезПоследних.Период КАК ДатаВыдачиЛицензии,
	 |	ЛицензииМедицинскойДеятельностиСрезПоследних.НомерЛицензии КАК НомерЛицензии
	 |ИЗ
	 |	РегистрСведений.ЛицензииМедицинскойДеятельности.СрезПоследних(&Период, Филиал.Ссылка = &Организация) КАК ЛицензииМедицинскойДеятельностиСрезПоследних";
	 
	 Запрос.УстановитьПараметр("РабочийТелефон", "Рабочий телефон");
	 Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	 Запрос.УстановитьПараметр("ФактическийАдрес", "Фактический адрес");
	 Запрос.УстановитьПараметр("Филиал", ДокументОснование.Филиал);
	 Запрос.УстановитьПараметр("Инстаграм", "Инстаграм");
	 Запрос.УстановитьПараметр("Организация", ДокументОснование.Организация);
	 Запрос.УстановитьПараметр("Период", ДокументОснование.Дата);
	 
	 
	 РезультатЗапроса = Запрос.ВыполнитьПакет();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать(); 
	 ВыборкаАдрес = РезультатЗапроса[1].Выбрать();
	 ВыборкаТелефон = РезультатЗапроса[2].Выбрать();
	 ВыборкаИнстаграм = РезультатЗапроса[3].Выбрать(); 
	 ВыборкаЛицензии = РезультатЗапроса[4].Выбрать();
	 
	 Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		 СтрВозврата.Вставить("Филиал",ВыборкаДетальныеЗаписи.Филиал);
		 СтрВозврата.Вставить("Клиент",ВыборкаДетальныеЗаписи.Клиент);
		 СтрВозврата.Вставить("КлиентИНН",ВыборкаДетальныеЗаписи.КлиентИНН);
		 СтрВозврата.Вставить("КлиентДатаРождения",ВыборкаДетальныеЗаписи.КлиентДатаРождения); 
		 СтрВозврата.Вставить("омг_ИспользуемыйТерминал",ВыборкаДетальныеЗаписи.омг_ИспользуемыйТерминал);
		 СтрВозврата.Вставить("ВидОперации",ВыборкаДетальныеЗаписи.ВидОперации);
		 
	 Иначе
		 СтрВозврата.Вставить("Филиал","");
		 СтрВозврата.Вставить("Клиент","");
		 СтрВозврата.Вставить("КлиентИНН","");
		 СтрВозврата.Вставить("КлиентДатаРождения","");
		 СтрВозврата.Вставить("омг_ИспользуемыйТерминал","");
		 СтрВозврата.Вставить("ВидОперации","");
		 
	 КонецЕсли;
	 
	 Если ВыборкаАдрес.Следующий() Тогда
		 СтрВозврата.Вставить("ФактическийАдрес",ВыборкаАдрес.Представление);	
	 Иначе
		 СтрВозврата.Вставить("ФактическийАдрес","")
	 КонецЕсли;    
	 
	 Если ВыборкаТелефон.Следующий() Тогда
		 СтрВозврата.Вставить("РабочийТелефон",ВыборкаТелефон.Представление);	
	 Иначе
		 СтрВозврата.Вставить("РабочийТелефон","")
	 КонецЕсли;  
	 
	 Если ВыборкаИнстаграм.Следующий() Тогда
		 СтрВозврата.Вставить("Инстаграм",ВыборкаИнстаграм.Представление);	
	 Иначе
		 СтрВозврата.Вставить("Инстаграм","")
	 КонецЕсли;
	 
	 Если ВыборкаЛицензии.Следующий() Тогда
		 
		 СтрВозврата.Вставить("ДатаВыдачиЛицензии",ВыборкаЛицензии.ДатаВыдачиЛицензии);
		 СтрВозврата.Вставить("НомерЛицензии",ВыборкаЛицензии.НомерЛицензии);
	 иначе
		 СтрВозврата.Вставить("ДатаВыдачиЛицензии","");
		 СтрВозврата.Вставить("НомерЛицензии","");
		 		 
	 КонецЕсли;
	 СтрВозврата.Вставить("НомерДокумента",ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокументОснование.Номер)); 
	 
 КонецПроцедуры	     
 
  Функция ДополнитьСведенияВовзврата(ДокументОснование) Экспорт	
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ФискальныеОперацииРК.НомерЧека КАК ФП,
	 |	ФискальныеОперацииРК.ДатаВремяЧека КАК ДатамВремя,
	 |	ФискальныеОперацииРК.ОбщаяСуммаЧека КАК ОбщаяСумма,
	 |	ФискальныеОперацииРК.РегистрационныйНомерКассы КАК РНК,
	 |	ФискальныеОперацииРК.АвтономныйРежимРаботыКассы КАК ПризнакАвтономности
	 |ИЗ
	 |	РегистрСведений.ФискальныеОперацииРК КАК ФискальныеОперацииРК
	 |ГДЕ
	 |	ФискальныеОперацииРК.ДокументОснование = &ДокументОснование";
	 
	 Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование.ДокументОснование);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	 
	 СтрВозврата = Новый Структура; 
	 
	 Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		 
		 СтрВозврата.Вставить("ФП",ВыборкаДетальныеЗаписи.ФП);
		 СтрВозврата.Вставить("ДатамВремя",ВыборкаДетальныеЗаписи.ДатамВремя);
		 СтрВозврата.Вставить("ОбщаяСумма",ВыборкаДетальныеЗаписи.ОбщаяСумма);
		 СтрВозврата.Вставить("РНК",ВыборкаДетальныеЗаписи.РНК); 
		 СтрВозврата.Вставить("ПризнакАвтономности",ВыборкаДетальныеЗаписи.ПризнакАвтономности);
		 
	 КонецЕсли;
	 
	 Возврат СтрВозврата;
	 
 КонецФункции	

 ////////////////////////////////////////////////////////////////////////////////
 //ПЕЧАТЬ ЧЕКОВ
 
 Функция ПараметрыОперацииФискализацииЧека(Реквизиты, ДанныеПечатиЧека, ВерсияФормата, СообщениеОбОшибке) Экспорт
	 
	 //Шапка чека
	 ОбщиеПараметры = МенеджерОборудованияКлиентСерверПереопределяемый.ПараметрыОперацииФискализацииЧека();
	 
	 ОбщиеПараметры.ТипРасчета        = Реквизиты.ТипРасчета;
	 ОбщиеПараметры.ДокументОснование = Реквизиты.ДокументОснование;	
	 ОбщиеПараметры.Электронно        = Ложь;
	 
	 ОбщиеПараметры.НомерКассы     = "00001";
	 ОбщиеПараметры.НомерЧека      = ОбщегоНазначения.ПолучитьНомерНаПечать(Реквизиты.Ссылка);
	 ОбщиеПараметры.НомерСмены     = 1;
	 
	 //Сведения = ОбщегоНазначенияБКВызовСервера.СведенияОЮрФизЛице(Реквизиты.Организация,Реквизиты.Дата);
	 
	 ОбщиеПараметры.ОрганизацияНазвание       = Реквизиты.Организация.НаименованиеПолное;
	 ОбщиеПараметры.ОрганизацияИНН            = Реквизиты.Организация.ИНН;
	 ОбщиеПараметры.АдресМагазина             = Реквизиты.Организация.ЮридическийАдрес;
	 ОбщиеПараметры.СерияСвидетельстваПоНДС   = Реквизиты.Организация.СерияСвидетельстваПоНДС;
	 ОбщиеПараметры.НомерСвидетельстваПоНДС   = Реквизиты.Организация.НомерСвидетельстваПоНДС;
	 ОбщиеПараметры.ПолучательИИН             = Реквизиты.ПолучательИИН;
	 
	 ДанныеКассира = ДанныеФизЛицаТекущегоПользователя(Реквизиты.Организация, Реквизиты.Дата);
	 ПозицииЧека   = ОбщиеПараметры.ПозицииЧека;
	 
	 Если ДанныеКассира.Представление <> Неопределено Тогда
		 ОбщиеПараметры.Кассир = СокрЛП(СтрШаблон("%1 %2", Строка(ДанныеКассира.Должность), ДанныеКассира.Представление));
	 КонецЕсли;
	 
	 ЭтоВерсия105 = ЗначениеЗаполнено(ВерсияФормата) И НЕ (ОбщегоНазначенияКлиентСервер.СравнитьВерсии("1.0.5.0", ВерсияФормата) > 0);
	 ЭтоВерсия110 = ЗначениеЗаполнено(ВерсияФормата) И НЕ (ОбщегоНазначенияКлиентСервер.СравнитьВерсии("1.1.0.0", ВерсияФормата) > 0);
	 
	 ДокументРасшифровкиПозиций = Неопределено;
	 Реквизиты.Свойство("ДокументРасшифровкиПозиций", ДокументРасшифровкиПозиций);
	 
	 ИтогоСуммаЧеков = 0;
	 
	 Если ЗначениеЗаполнено(ДокументРасшифровкиПозиций) Тогда
		 
		 //ТекстЗапроса = ТекстЗапросаОплаченныеПозицииНоменклатуры10(ДокументРасшифровкиПозиций);
		 ТекстЗапроса = "";
		 Если ТекстЗапроса <> "" Тогда
			 
			 ДокументыОснования = Новый Массив;
			 ДокументыОснования.Добавить(ДокументРасшифровкиПозиций);
			 
			 Запрос = Новый Запрос;
			 Запрос.Текст = ТекстЗапроса;
			 Запрос.УстановитьПараметр("МассивДокументов", ДокументыОснования);
			 Запрос.УстановитьПараметр("ДатаДокумента"   , Реквизиты.Дата);
			 Запрос.УстановитьПараметр("ВалютаДокумента" , Реквизиты.ВалютаДокумента);
			 Запрос.УстановитьПараметр("ПустаяСтавкаНДС" , Справочники.СтавкиНДС.ПустаяСсылка());
			 
			 ТаблицаПозицииЧека = Запрос.Выполнить().Выгрузить();
			 
			 Если ТаблицаПозицииЧека.Итог("Сумма") = Реквизиты.СуммаДокумента Тогда
				 
				 Для Каждого Позиция Из ТаблицаПозицииЧека Цикл
					 
					 СтрокаПозицииЧека = МенеджерОборудованияКлиентСерверПереопределяемый.ПараметрыФискальнойСтрокиЧека();
					 ЗаполнитьЗначенияСвойств(СтрокаПозицииЧека, Позиция);
					 
					 СтрокаПозицииЧека.Наименование = Позиция.НоменклатураНаименование;
					 СтрокаПозицииЧека.СтавкаНДС    = ПолучитьСтавкуНДС(Позиция.СтавкаНДС);
					 СтрокаПозицииЧека.НомерСекции  = 1;
					 
					 СтрокаПозицииЧека.КодЕдиницыИзмерения          = СокрЛП(Позиция.КодЕдиницыИзмерения);
					 СтрокаПозицииЧека.НаименованиеЕдиницыИзмерения = Позиция.НаименованиеЕдиницыИзмерения;
					 
					 СтрокаПозицииЧека.Вставить("СтавкаНДССсылка", Позиция.СтавкаНДС);
					 Если НЕ ЗначениеЗаполнено(Позиция.СтавкаНДС) Тогда
						 СтрокаПозицииЧека.ОсвобожденныйОборотНДС = Истина;
					 Иначе
						 СтавкаНДС = Позиция.СтавкаНДС;
						 СтрокаПозицииЧека.ОсвобожденныйОборотНДС = СтавкаНДС.ДляОсвобожденногоОборота ИЛИ СтавкаНДС.МестоРеализацииНеРК;
					 КонецЕсли;
					 
					 ПозицииЧека.Добавить(СтрокаПозицииЧека);
					 ИтогоСуммаЧеков = ИтогоСуммаЧеков + СтрокаПозицииЧека.Сумма;
					 
				 КонецЦикла;
				 
			 КонецЕсли;
			 
		 КонецЕсли;
		 
	 КонецЕсли;
	 
	 Если ИтогоСуммаЧеков <> Реквизиты.СуммаДокумента И ПозицииЧека.Количество() = 0  Тогда	
		 
		 ИтогоСуммаЧеков = 0;
		 
		 Отбор = Новый Структура("СтавкаНДС");
		 РасшифровкаПлатежа = ДанныеПечатиЧека.РасшифровкаПлатежа;
		 РасшифровкаПлатежа.Свернуть("СтавкаНДС, ССЫЛКА", "СуммаПлатежа, СуммаВзаиморасчетов, СуммаНДС, Цена, Количество");
		 
		 ЕдиницаИзмеренияПоУмолчанию = Новый Структура("КодЕдиницыИзмерения, НаименованиеЕдиницыИзмерения", 796, "шт");
		 
		 Для Каждого ОплачиваемыйДокумент  Из РасшифровкаПлатежа Цикл
			 
			 СтрокаПозицииЧека = МенеджерОборудованияКлиентСерверПереопределяемый.ПараметрыФискальнойСтрокиЧека(); 
			 //СтрокаПозицииЧека.Наименование           = Реквизиты.НаименованиеВСтрокеЧека;
			 СтрокаПозицииЧека.Наименование           = Строка(ОплачиваемыйДокумент.ССЫЛКА);
			 СтрокаПозицииЧека.Количество             = ОплачиваемыйДокумент.Количество;
			 СтрокаПозицииЧека.Цена                   = ОплачиваемыйДокумент.Цена;
			 СтрокаПозицииЧека.ЦенаСоСкидками         = ОплачиваемыйДокумент.СуммаПлатежа;
			 СтрокаПозицииЧека.Сумма                  = ОплачиваемыйДокумент.СуммаПлатежа;
			 СтрокаПозицииЧека.СтавкаНДС              = ОплачиваемыйДокумент.СтавкаНДС;
			 СтрокаПозицииЧека.СуммаНДС               = ОплачиваемыйДокумент.СуммаНДС;
			 СтрокаПозицииЧека.ПризнакСпособаРасчета  = Неопределено;
			 СтрокаПозицииЧека.ПризнакПредметаРасчета = Неопределено;
			 СтрокаПозицииЧека.НомерСекции            = Реквизиты.НомерСекции;
			 СтрокаПозицииЧека.КодЕдиницыИзмерения    = ЕдиницаИзмеренияПоУмолчанию.КодЕдиницыИзмерения;
			 СтрокаПозицииЧека.НаименованиеЕдиницыИзмерения = ЕдиницаИзмеренияПоУмолчанию.НаименованиеЕдиницыИзмерения;
			 
			 СтрокаПозицииЧека.Вставить("СтавкаНДССсылка", ОплачиваемыйДокумент.СтавкаНДС);
			 Если НЕ ЗначениеЗаполнено(ОплачиваемыйДокумент.СтавкаНДС) Тогда
				 СтрокаПозицииЧека.ОсвобожденныйОборотНДС = Истина;
			 Иначе
				 СтавкаНДС = ОплачиваемыйДокумент.СтавкаНДС;
				 СтрокаПозицииЧека.ОсвобожденныйОборотНДС = Ложь;
			 КонецЕсли;
			 
			 ПозицииЧека.Добавить(СтрокаПозицииЧека);
			 
			 ИтогоСуммаЧеков = ИтогоСуммаЧеков + ОплачиваемыйДокумент.СуммаПлатежа;
			 
		 КонецЦикла;
		 
	 КонецЕсли;
	  
	СуммаДокумента = 0;
	СммаБезнал = Реквизиты.СуммаДокумента;
	ПолученоНаличными = 0;
	Запрос = Новый Запрос;

	Запрос.Текст = ПолучитьТекстЗапросаПлатежногоДокумента(Реквизиты.ДокументОснование.Ссылка);
	
	Запрос.УстановитьПараметр("Ссылка", Реквизиты.ДокументОснование.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		 СуммаДокумента = ВыборкаДетальныеЗаписи.СуммаДокумента; 
		 ПолученоНаличными = ВыборкаДетальныеЗаписи.ПолученоНаличными;
		 СммаБезнал = СуммаДокумента - ПолученоНаличными; 
	КонецЕсли;
	

	Если СммаБезнал > 0 и ПолученоНаличными > 0 Тогда
	 СтрокаОплаты = Новый Структура();	
	 СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Электронно);
	 СтрокаОплаты.Вставить("Сумма", СммаБезнал);
	 ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты); 
	 СтрокаОплаты = Новый Структура();
	 СтрокаОплаты.Вставить("ТипОплаты", Перечисления.ТипыОплатыККТ.Наличные);
	 СтрокаОплаты.Вставить("Сумма", ПолученоНаличными);
	 ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
	 иначе
	 СтрокаОплаты = Новый Структура(); 	 
	 СтрокаОплаты.Вставить("ТипОплаты", Реквизиты.ТипОплаты);
	 СтрокаОплаты.Вставить("Сумма", Реквизиты.СуммаДокумента);
	 ОбщиеПараметры.ТаблицаОплат.Добавить(СтрокаОплаты);
 	 КонецЕсли;
	 
	 //Данные по первичному чеку для возврата
	ЧекПродажи = Документы.ОказаниеУслуг.ПустаяСсылка();
	Если ТипЗнч(ДокументРасшифровкиПозиций) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
		
		ЧекПродажи = ДокументРасшифровкиПозиций; 
		
	КонецЕсли;

	ОбщиеПараметры.Вставить("ДанныеПервичногоЧека", ПодключаемоеОборудованиеБКВызовСервера.СтруктураФискальнойОперацииРК());
	ОбщиеПараметры.Вставить("ЧекПродажи", ЧекПродажи);

	 Возврат ОбщиеПараметры;
	 
 КонецФункции
 
 Функция ТекстЗапросаОплаченныеПозицииНоменклатуры10(ДокументРасшифровкиПозиций)
	 
	 ТекстЗапроса = "";
	 ТипДокумента = ТипЗнч(ДокументРасшифровкиПозиций);
	 
	 Если ТипДокумента = Тип("ДокументСсылка.АктОбОказанииПроизводственныхУслуг") Тогда
		 
		 ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		 |	ТаблицаДокумента.Номенклатура КАК Номенклатура,
		 |	ТаблицаДокумента.Количество КАК Количество,
		 |	ТаблицаДокумента.Цена КАК Цена,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.Сумма
		 |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |	КОНЕЦ КАК Сумма,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СтавкаНДС
		 |		ИНАЧЕ &ПустаяСтавкаНДС
		 |	КОНЕЦ КАК СтавкаНДС,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СуммаНДС
		 |		ИНАЧЕ 0
		 |	КОНЕЦ КАК СуммаНДС,
		 |	ТаблицаДокумента.Ссылка.ВалютаДокумента КАК Валюта,
		 |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС КАК ЦенаВключаетНДС,
		 |	ТаблицаДокумента.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
		 |	ПРЕДСТАВЛЕНИЕ(ТаблицаДокумента.ЕдиницаИзмерения) КАК НаименованиеЕдиницыИзмерения
		 |ПОМЕСТИТЬ ТаблицаНоменклатуры
		 |ИЗ
		 |	Документ.АктОбОказанииПроизводственныхУслуг.Услуги КАК ТаблицаДокумента
		 |ГДЕ
		 |	ТаблицаДокумента.Ссылка В(&МассивДокументов)
		 |;";
		 
	 КонецЕсли;
	 
	 Если ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
		 
		 ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		 |	ТаблицаДокумента.Номенклатура КАК Номенклатура,
		 |	ТаблицаДокумента.Количество КАК Количество,
		 |	ТаблицаДокумента.Цена КАК Цена,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ВЫБОР
		 |					КОГДА ТаблицаДокумента.Ссылка.УчитыватьАкциз И ТаблицаДокумента.Ссылка.СуммаВключаетАкциз
		 |						ТОГДА ТаблицаДокумента.Сумма
		 |					ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаАкциза
		 |				КОНЕЦ
		 |		ИНАЧЕ ВЫБОР
		 |				КОГДА ТаблицаДокумента.Ссылка.УчитыватьАкциз И ТаблицаДокумента.Ссылка.СуммаВключаетАкциз
		 |					ТОГДА ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |				ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС + ТаблицаДокумента.СуммаАкциза
		 |			КОНЕЦ
		 |	КОНЕЦ КАК Сумма,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СтавкаНДС
		 |		ИНАЧЕ &ПустаяСтавкаНДС
		 |	КОНЕЦ КАК СтавкаНДС,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СуммаНДС
		 |		ИНАЧЕ 0
		 |	КОНЕЦ КАК СуммаНДС,
		 |	ТаблицаДокумента.Ссылка.ВалютаДокумента КАК Валюта,
		 |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС КАК ЦенаВключаетНДС,
		 |	ТаблицаДокумента.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
		 |	ПРЕДСТАВЛЕНИЕ(ТаблицаДокумента.ЕдиницаИзмерения) КАК НаименованиеЕдиницыИзмерения
		 |ПОМЕСТИТЬ ТаблицаНоменклатуры
		 |ИЗ
		 |	Документ.ВозвратТоваровОтПокупателя.Товары КАК ТаблицаДокумента
		 |ГДЕ
		 |	ТаблицаДокумента.Ссылка В(&МассивДокументов)
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	ТаблицаДокумента.Номенклатура,
		 |	ТаблицаДокумента.Количество,
		 |	ТаблицаДокумента.Цена,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.Сумма
		 |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |	КОНЕЦ,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СтавкаНДС
		 |		ИНАЧЕ &ПустаяСтавкаНДС
		 |	КОНЕЦ,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СуммаНДС
		 |		ИНАЧЕ 0
		 |	КОНЕЦ,
		 |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
		 |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
		 |	&ТекстЕдиницыНоменклатура
		 |ИЗ
		 |	Документ.ВозвратТоваровОтПокупателя.Услуги КАК ТаблицаДокумента
		 |ГДЕ
		 |	ТаблицаДокумента.Ссылка В(&МассивДокументов)
		 |;";
		 
	 КонецЕсли;
	 
	 Если ТипДокумента = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		 
		 ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		 |	ТаблицаДокумента.Номенклатура КАК Номенклатура,
		 |	ТаблицаДокумента.Количество КАК Количество,
		 |	ТаблицаДокумента.Цена КАК Цена,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.Сумма
		 |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |	КОНЕЦ КАК Сумма,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СтавкаНДС
		 |		ИНАЧЕ &ПустаяСтавкаНДС
		 |	КОНЕЦ КАК СтавкаНДС,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СуммаНДС
		 |		ИНАЧЕ 0
		 |	КОНЕЦ КАК СуммаНДС,
		 |	ТаблицаДокумента.Ссылка.ВалютаДокумента КАК Валюта,
		 |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС КАК ЦенаВключаетНДС,
		 |	ТаблицаДокумента.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
		 |	ПРЕДСТАВЛЕНИЕ(ТаблицаДокумента.ЕдиницаИзмерения) КАК НаименованиеЕдиницыИзмерения
		 |ПОМЕСТИТЬ ТаблицаНоменклатуры
		 |ИЗ
		 |	Документ.ВозвратТоваровПоставщику.Товары КАК ТаблицаДокумента
		 |ГДЕ
		 |	ТаблицаДокумента.Ссылка В(&МассивДокументов)
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	ТаблицаДокумента.Номенклатура,
		 |	ТаблицаДокумента.Количество,
		 |	ТаблицаДокумента.Цена,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.Сумма
		 |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |	КОНЕЦ,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СтавкаНДС
		 |		ИНАЧЕ &ПустаяСтавкаНДС
		 |	КОНЕЦ,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СуммаНДС
		 |		ИНАЧЕ 0
		 |	КОНЕЦ,
		 |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
		 |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
		 |	&ТекстЕдиницыНоменклатура
		 |ИЗ
		 |	Документ.ВозвратТоваровПоставщику.Услуги КАК ТаблицаДокумента
		 |ГДЕ
		 |	ТаблицаДокумента.Ссылка В(&МассивДокументов)
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	ТаблицаДокумента.ОсновноеСредство,
		 |	1,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.Сумма
		 |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |	КОНЕЦ,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.Сумма
		 |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |	КОНЕЦ,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СтавкаНДС
		 |		ИНАЧЕ &ПустаяСтавкаНДС
		 |	КОНЕЦ,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СуммаНДС
		 |		ИНАЧЕ 0
		 |	КОНЕЦ,
		 |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
		 |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
		 |	&ТекстЕдиницыПоУмолчанию
		 |ИЗ
		 |	Документ.ВозвратТоваровПоставщику.ОС КАК ТаблицаДокумента
		 |ГДЕ
		 |	ТаблицаДокумента.Ссылка В(&МассивДокументов)
		 |;";
		 
	 КонецЕсли;
	 
	 Если ТипДокумента = Тип("ДокументСсылка.ПередачаНМА") Тогда
		 
		 ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		 |	ТаблицаДокумента.НематериальныйАктив КАК Номенклатура,
		 |	1 КАК Количество,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.Сумма
		 |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |	КОНЕЦ КАК Цена,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.Сумма
		 |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |	КОНЕЦ КАК Сумма,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СтавкаНДС
		 |		ИНАЧЕ &ПустаяСтавкаНДС
		 |	КОНЕЦ КАК СтавкаНДС,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СуммаНДС
		 |		ИНАЧЕ 0
		 |	КОНЕЦ КАК СуммаНДС,
		 |	ТаблицаДокумента.ВалютаДокумента КАК Валюта,
		 |	ТаблицаДокумента.СуммаВключаетНДС КАК ЦенаВключаетНДС,
		 |	&ТекстЕдиницыПоУмолчанию
		 |ПОМЕСТИТЬ ТаблицаНоменклатуры
		 |ИЗ
		 |	Документ.ПередачаНМА КАК ТаблицаДокумента
		 |ГДЕ
		 |	ТаблицаДокумента.Ссылка В(&МассивДокументов)
		 |;";
		 
	 КонецЕсли;
	 
	 Если ТипДокумента = Тип("ДокументСсылка.ПередачаОС") Тогда
		 
		 ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		 |	ТаблицаДокумента.ОсновноеСредство КАК Номенклатура,
		 |	1 КАК Количество,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.Сумма
		 |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |	КОНЕЦ КАК Цена,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.Сумма
		 |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |	КОНЕЦ КАК Сумма,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СтавкаНДС
		 |		ИНАЧЕ &ПустаяСтавкаНДС
		 |	КОНЕЦ КАК СтавкаНДС,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СуммаНДС
		 |		ИНАЧЕ 0
		 |	КОНЕЦ КАК СуммаНДС,
		 |	ТаблицаДокумента.Ссылка.ВалютаДокумента КАК Валюта,
		 |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС КАК ЦенаВключаетНДС,
		 |	&ТекстЕдиницыПоУмолчанию
		 |ПОМЕСТИТЬ ТаблицаНоменклатуры
		 |ИЗ
		 |	Документ.ПередачаОС.ОС КАК ТаблицаДокумента
		 |ГДЕ
		 |	ТаблицаДокумента.Ссылка В(&МассивДокументов)
		 |;";
		 
	 КонецЕсли;
	 
	 Если ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		 
		 ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		 |	ТаблицаДокумента.Номенклатура КАК Номенклатура,
		 |	ТаблицаДокумента.Количество КАК Количество,
		 |	ТаблицаДокумента.Цена КАК Цена,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ВЫБОР
		 |					КОГДА ТаблицаДокумента.Ссылка.УчитыватьАкциз И ТаблицаДокумента.Ссылка.СуммаВключаетАкциз
		 |						ТОГДА ТаблицаДокумента.Сумма
		 |					ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаАкциза
		 |				КОНЕЦ
		 |		ИНАЧЕ ВЫБОР
		 |				КОГДА ТаблицаДокумента.Ссылка.УчитыватьАкциз И ТаблицаДокумента.Ссылка.СуммаВключаетАкциз
		 |					ТОГДА ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |				ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС + ТаблицаДокумента.СуммаАкциза
		 |			КОНЕЦ
		 |	КОНЕЦ КАК Сумма,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СтавкаНДС
		 |		ИНАЧЕ &ПустаяСтавкаНДС
		 |	КОНЕЦ КАК СтавкаНДС,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СуммаНДС
		 |		ИНАЧЕ 0
		 |	КОНЕЦ КАК СуммаНДС,
		 |	ТаблицаДокумента.Ссылка.ВалютаДокумента КАК Валюта,
		 |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС КАК ЦенаВключаетНДС,
		 |	ТаблицаДокумента.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
		 |	ПРЕДСТАВЛЕНИЕ(ТаблицаДокумента.ЕдиницаИзмерения) КАК НаименованиеЕдиницыИзмерения
		 |ПОМЕСТИТЬ ТаблицаНоменклатуры
		 |ИЗ
		 |	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаДокумента
		 |ГДЕ
		 |	ТаблицаДокумента.Ссылка В(&МассивДокументов)
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	ТаблицаДокумента.Номенклатура,
		 |	ТаблицаДокумента.Количество,
		 |	ТаблицаДокумента.Цена,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.Сумма
		 |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |	КОНЕЦ,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СтавкаНДС
		 |		ИНАЧЕ &ПустаяСтавкаНДС
		 |	КОНЕЦ,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СуммаНДС
		 |		ИНАЧЕ 0
		 |	КОНЕЦ,
		 |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
		 |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
		 |	&ТекстЕдиницыНоменклатура
		 |ИЗ
		 |	Документ.РеализацияТоваровУслуг.Услуги КАК ТаблицаДокумента
		 |ГДЕ
		 |	ТаблицаДокумента.Ссылка В(&МассивДокументов)
		 |;";
		 
	 КонецЕсли;
	 
	 Если ТипДокумента = Тип("ДокументСсылка.РеализацияУслугПоПереработке") Тогда
		 
		 ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		 |	ТаблицаДокумента.Номенклатура КАК Номенклатура,
		 |	ТаблицаДокумента.Количество КАК Количество,
		 |	ТаблицаДокумента.Цена КАК Цена,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.Сумма
		 |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |	КОНЕЦ КАК Сумма,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СтавкаНДС
		 |		ИНАЧЕ &ПустаяСтавкаНДС
		 |	КОНЕЦ КАК СтавкаНДС,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СуммаНДС
		 |		ИНАЧЕ 0
		 |	КОНЕЦ КАК СуммаНДС,
		 |	ТаблицаДокумента.Ссылка.ВалютаДокумента КАК Валюта,
		 |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС КАК ЦенаВключаетНДС,
		 |	&ТекстЕдиницыНоменклатура
		 |ПОМЕСТИТЬ ТаблицаНоменклатуры
		 |ИЗ
		 |	Документ.РеализацияУслугПоПереработке.Услуги КАК ТаблицаДокумента
		 |ГДЕ
		 |	ТаблицаДокумента.Ссылка В(&МассивДокументов)
		 |;";
		 
	 КонецЕсли;
	 
	 Если ТипДокумента = Тип("ДокументСсылка.СчетНаОплатуПокупателю") Тогда
		 
		 ТекстЗапроса = ТекстЗапроса + "ВЫБРАТЬ
		 |	ТаблицаДокумента.Номенклатура КАК Номенклатура,
		 |	ТаблицаДокумента.Количество КАК Количество,
		 |	ТаблицаДокумента.Цена КАК Цена,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ВЫБОР
		 |					КОГДА ТаблицаДокумента.Ссылка.УчитыватьАкциз И ТаблицаДокумента.Ссылка.СуммаВключаетАкциз
		 |						ТОГДА ТаблицаДокумента.Сумма
		 |					ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаАкциза
		 |				КОНЕЦ
		 |		ИНАЧЕ ВЫБОР
		 |				КОГДА ТаблицаДокумента.Ссылка.УчитыватьАкциз И ТаблицаДокумента.Ссылка.СуммаВключаетАкциз
		 |					ТОГДА ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |				ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС + ТаблицаДокумента.СуммаАкциза
		 |			КОНЕЦ
		 |	КОНЕЦ КАК Сумма,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СтавкаНДС
		 |		ИНАЧЕ &ПустаяСтавкаНДС
		 |	КОНЕЦ КАК СтавкаНДС,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СуммаНДС
		 |		ИНАЧЕ 0
		 |	КОНЕЦ КАК СуммаНДС,
		 |	ТаблицаДокумента.Ссылка.ВалютаДокумента КАК Валюта,
		 |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС КАК ЦенаВключаетНДС,
		 |	ТаблицаДокумента.ЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
		 |	ПРЕДСТАВЛЕНИЕ(ТаблицаДокумента.ЕдиницаИзмерения) КАК НаименованиеЕдиницыИзмерения
		 |ПОМЕСТИТЬ ТаблицаНоменклатуры
		 |ИЗ
		 |	Документ.СчетНаОплатуПокупателю.Товары КАК ТаблицаДокумента
		 |ГДЕ
		 |	ТаблицаДокумента.Ссылка В(&МассивДокументов)
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	ТаблицаДокумента.Номенклатура,
		 |	ТаблицаДокумента.Количество,
		 |	ТаблицаДокумента.Цена,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.Сумма
		 |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |	КОНЕЦ,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СтавкаНДС
		 |		ИНАЧЕ &ПустаяСтавкаНДС
		 |	КОНЕЦ,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СуммаНДС
		 |		ИНАЧЕ 0
		 |	КОНЕЦ,
		 |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
		 |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
		 |	&ТекстЕдиницыНоменклатура
		 |ИЗ
		 |	Документ.СчетНаОплатуПокупателю.Услуги КАК ТаблицаДокумента
		 |ГДЕ
		 |	ТаблицаДокумента.Ссылка В(&МассивДокументов)
		 |
		 |ОБЪЕДИНИТЬ ВСЕ
		 |
		 |ВЫБРАТЬ
		 |	ТаблицаДокумента.ОсновноеСредство,
		 |	1,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.Сумма
		 |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |	КОНЕЦ,
		 |	ВЫБОР
		 |		КОГДА (ТаблицаДокумента.Ссылка.УчитыватьНДС И ТаблицаДокумента.Ссылка.СуммаВключаетНДС) ИЛИ НЕ ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.Сумма
		 |		ИНАЧЕ ТаблицаДокумента.Сумма + ТаблицаДокумента.СуммаНДС
		 |	КОНЕЦ,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СтавкаНДС
		 |		ИНАЧЕ &ПустаяСтавкаНДС
		 |	КОНЕЦ,
		 |	ВЫБОР
		 |		КОГДА ТаблицаДокумента.Ссылка.УчитыватьНДС
		 |			ТОГДА ТаблицаДокумента.СуммаНДС
		 |		ИНАЧЕ 0
		 |	КОНЕЦ,
		 |	ТаблицаДокумента.Ссылка.ВалютаДокумента,
		 |	ТаблицаДокумента.Ссылка.СуммаВключаетНДС,
		 |	&ТекстЕдиницыПоУмолчанию
		 |ИЗ
		 |	Документ.СчетНаОплатуПокупателю.ОС КАК ТаблицаДокумента
		 |ГДЕ
		 |	ТаблицаДокумента.Ссылка В(&МассивДокументов)
		 |;";
		 
	 КонецЕсли;
	 
	 Если ТекстЗапроса <> "" Тогда
		 
		 ТекстЗапроса = ТекстЗапроса + "
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	КурсВалюты.Валюта КАК Валюта,
		 |	КурсВалюты.Курс * КурсВалютыДокумента.Кратность / (КурсВалюты.Кратность * КурсВалютыДокумента.Курс) КАК КоэффициентПересчета
		 |ПОМЕСТИТЬ КурсыВалют
		 |ИЗ
		 |	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, ) КАК КурсВалюты
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&ДатаДокумента, Валюта = &ВалютаДокумента) КАК КурсВалютыДокумента
		 |		ПО (ИСТИНА)
		 |ГДЕ
		 |	КурсВалюты.Кратность <> 0
		 |	И КурсВалютыДокумента.Курс <> 0
		 |
		 |ИНДЕКСИРОВАТЬ ПО
		 |	Валюта
		 |;
		 |
		 |////////////////////////////////////////////////////////////////////////////////
		 |ВЫБРАТЬ
		 |	ТаблицаНоменклатуры.Количество             КАК Количество,
		 |	ТаблицаНоменклатуры.Сумма * ЕСТЬNULL(КурсыВалют.КоэффициентПересчета, 1) КАК Сумма,
		 |	ТаблицаНоменклатуры.СтавкаНДС              КАК СтавкаНДС,
		 |	ТаблицаНоменклатуры.СуммаНДС * ЕСТЬNULL(КурсыВалют.КоэффициентПересчета, 1) КАК СуммаНДС,
		 |	ТаблицаНоменклатуры.Валюта                 КАК Валюта,
		 |	ВЫРАЗИТЬ(ВЫБОР
		 |		КОГДА ТаблицаНоменклатуры.ЦенаВключаетНДС ТОГДА
		 |			ТаблицаНоменклатуры.Цена
		 |		КОГДА ТаблицаНоменклатуры.Количество = 0 ТОГДА
		 |			ТаблицаНоменклатуры.Сумма
		 |		ИНАЧЕ
		 |			ТаблицаНоменклатуры.Сумма / ТаблицаНоменклатуры.Количество
		 |	КОНЕЦ * ЕСТЬNULL(КурсыВалют.КоэффициентПересчета, 1) КАК ЧИСЛО(15, 2)) КАК Цена,
		 |	ВЫБОР
		 |		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаНоменклатуры.Номенклатура) = ТИП(Строка) ТОГДА
		 |			ТаблицаНоменклатуры.Номенклатура
		 |		ИНАЧЕ
		 |			ВЫРАЗИТЬ(ТаблицаНоменклатуры.Номенклатура.НаименованиеПолное КАК Строка(255))
		 |	КОНЕЦ КАК НоменклатураНаименование,
		 |	ТаблицаНоменклатуры.КодЕдиницыИзмерения КАК КодЕдиницыИзмерения,
		 |	ТаблицаНоменклатуры.НаименованиеЕдиницыИзмерения КАК НаименованиеЕдиницыИзмерения
		 |
		 |ИЗ
		 |	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
		 |		
		 |		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют
		 |		ПО ТаблицаНоменклатуры.Валюта = КурсыВалют.Валюта
		 |";
		 
		 ТекстЕдиницыПоУмолчанию = "796 КАК КодЕдиницыИзмерения,
		 | ""шт"" КАК НаименованиеЕдиницыИзмерения
		 |";
		 
		 ТекстЕдиницыНоменклатура = "ТаблицаДокумента.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК КодЕдиницыИзмерения,
		 |	ПРЕДСТАВЛЕНИЕ(ТаблицаДокумента.Номенклатура.БазоваяЕдиницаИзмерения) КАК НаименованиеЕдиницыИзмерения
		 |";
		 
		 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЕдиницыПоУмолчанию" , ТекстЕдиницыПоУмолчанию);
		 ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЕдиницыНоменклатура", ТекстЕдиницыНоменклатура);
		 
	 КонецЕсли;
	 
	 Возврат ТекстЗапроса;
	 
 КонецФункции
 
 Функция ПроверкаУстройстваВебкасса(Устройство) Экспорт
	 
	 Возврат ?(Устройство.Омг_ИспользоватьПоУмолчаниюВебКасса,Истина,Ложь);
	 
 КонецФункции	
 
 
 
 
 Процедура ОбновитьДрайвера()Экспорт
	 ОбновитьПоставляемыеДрайвера();
	 ОбновитьУстановленныеДрайвера();
 КонецПроцедуры
 
 // Обновить поставляемые драйверы в составе конфигурации.
 //                                   
 
 Процедура ОбновитьПоставляемыеДрайвера() Экспорт
	 
	 // Сканеры штрихкода
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодСканерыШтрихкода, "AddIn.ScancodeScanner", , Истина, , Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолСканерыШтрихкода, "AddIn.Scaner45", , Истина, , Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССканерыШтрихкода, "AddIn.Scanner", "Драйвер1ССканерШтрихкода", Ложь, "8.1.9.1");
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССканерыШтрихкодаNative, "AddIn.InputDevice", "Драйвер1СУстройстваВводаNative", Ложь, "9.0.8.7");
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикГексагонСканерыШтрихкода, "AddIn.ProtonScanner", "ДрайверГексагонСканерШтрихкода", Ложь);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолСканерыШтрихкода8X, "AddIn.ATOL_Scaners_1CInt", "ДрайверАТОЛУстройстваВвода8X", Ложь);
	 // Конец Сканеры штрихкода
	 
	 
	 // Фискальные регистраторы
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СФискальныйРегистраторЭмулятор, "AddIn.EmulatorFP1C", , Истина,, Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СРарусФискальныеРегистраторыФеликс, "AddIn.fr_feliksRMK1c82", "Драйвер1СРарусФискальныеРегистраторыФеликс", Ложь, , Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СРарусФискальныеРегистраторыМебиус, "AddIn.fr_moebius1c82", "Драйвер1СРарусФискальныеРегистраторыМебиус", Ложь, , Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолФискальныеРегистраторы, "AddIn.ATOL_KKM_1C", , Истина, , Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолФискальныеРегистраторыУниверсальный, "AddIn.ATOL_KKM_1C", , Истина, , Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолФискальныеРегистраторы8X, "AddIn.ATOL_KKM_1C82", "ДрайверАТОЛФискальныеРегистраторы8X", Ложь,,Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВерсияТФискальныеРегистраторы, "AddIn.KSBFR1K1C", , Истина, ,Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикККСФискальныеРегистраторы, "AddIn.SparkTF", "ДрайверККСФискальныеРегистраторы", Ложь,,Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМФискальныеРегистраторы, "AddIn.DrvFR1C", , Истина, , Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМФискальныеРегистраторыУниверсальный, "AddIn.SMDrvFR1C", "ДрайверШтрихМФискальныеРегистраторы", Ложь,,Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикОРИОНФискальныеРегистраторы, "AddIn.OrionFR_1C8", , Истина, ,Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикКристаллСервисФискальныеРегистраторыPirit, "AddIn.PiritK", "ДрайверКристаллСервисФискальныеРегистраторыPirit", Ложь, , Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикДримкасФискальныеРегистраторыVikiPrint, "AddIn.VikiP", "ДрайверДримкасФискальныеРегистраторыVikiPrint", Ложь, , Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикИскраФискальныеРегистраторыПрим, "AddIn.IskraFR", "ДрайверИскраФискальныеРегистраторыПрим", Ложь, , Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикWebkassaФискальныеРегистраторы);
	 // Конец Фискальные регистраторы.
	 
	 
	 // Принтеры чеков
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СПринтерЧеков, "AddIn.ReceiptPrinterNative", "Драйвер1СПринтерЧеков", Ложь, "3.1.4.6"); 
	 // Конец Принтеры чеков.
	 
	 
	 // Терминалы сбора данных
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолТерминалыСбораДанных, "AddIn.PDX45", , Истина, , Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикГексагонТерминалыСбораДанных, "AddIn.ProtonTSD", "ДрайверГексагонТСД", Ложь, "8.4.2");
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодТерминалыСбораДанных, "AddIn.CipherLab", , Истина, ,Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканситиТерминалыСбораДанных, "AddIn.iPOSoft_DT", , Истина, ,Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикКлеверенсТерминалыСбораДанных, "AddIn.Cleverence.TO_TSD", "ДрайверКлеверенсТСД", Ложь);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМТерминалыСбораДанных, "AddIn.Terminals", , Истина, ,Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолТерминалыСбораДанныхMobileLogistics, "AddIn.PDX1C_Int", "ДрайверАТОЛТСДMobileLogistics", Ложь);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодТерминалыСбораДанныхNative, "AddIn.CipherLab8", "ДрайверСканкодТерминалыСбораДанныхNative", Ложь, "1.0.0.9", Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикRightScanТерминалыСбораДанных, "AddIn.RSExchange", "ДрайверRightScanТерминалыСбораДанных", Ложь, "1.11");
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканситиТерминалСбораДанныхCitySoftBusiness, "AddIn.CitySoftBusinessDriver", "ДрайверСканситиТерминалСбораДанныхCitySoftBusiness", Ложь, "4.0.12.747");
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодТерминалыСбораДанныхCipherLab8G2, "AddIn.CipherLab8G2", "ДрайверСканкодТерминалыСбораДанныхCipherLab8G2", Ложь, "2.0.0.20");
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканситиТерминалСбораДанныхCitySoftLite, "AddIn.CitySoftLiteEquipmentDriver", "ДрайверСканситиТерминалСбораДанныхCitySoftLite", Ложь, "5.8.3.260");
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканситиТерминалСбораДанныхCitySoftStandart, "AddIn.CitySoftStandartDriver", "ДрайверСканситиТерминалСбораДанныхCitySoftStandart", Ложь, "4.5.0.881");
	 // Конец Терминалы сбора данных.
	 
	 // Эквайринговые терминалы
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикИНПАСЭквайринговыеТерминалыSmart, "AddIn.a_inpas1c82", , Ложь, , Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикИНПАСЭквайринговыеТерминалыUNIPOS, "AddIn.a_inpasDC1c83", "ДрайверИНПАСЭквайринговыеТерминалыUNIPOS", Ложь, "1.1.1.2");
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикTRPOSЭквайринговыеТерминалы, "AddIn.a_trpos1c82", "ДрайверTRPOSЭквайринговыеТерминалы", Ложь, "1.0.0.34");
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСБРФЭквайринговыеТерминалы, "AddIn.SBRFCOMObject|AddIn.SBRFCOMExtension", , Истина, , Истина);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикUCSEFTPOSЭквайринговыеТерминалы, "AddIn.UCS_EFTPOS", "ДрайверUCSEFTPOSЭквайринговыеТерминалы", Ложь, "1.0.9.8");
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикГАЗПРОМБАНКЭквайринговыеТерминалы, "AddIn.GPBEMVGateNativeAPI1C", "ДрайверГАЗПРОМБАНКЭквайринговыеТерминалы", Ложь, "1.0.3.5");
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикARCUS2ЭквайринговыеТерминалыIngenico, "AddIn.IngenicoDriver1C", "ДрайверARCUS2ЭквайринговыеТерминалыIngenico", Ложь, "1.0.0.2");
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикIboxProПоддержкаMPosЭквайринга, "AddIn.iboxPro", "ДрайверIboxProПоддержкаMPosЭквайринга", Ложь, "1.2.4");
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМПлатежныйТерминалYarus, "AddIn.ShtrihPayMan1C", "ДрайверШтрихМПлатежныйТерминалYarus", Ложь);
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1СЭквайринговыеТерминалыСбербанк, "AddIn.SberAcquiringTerminal", "Драйвер1СЭквайринговыеТерминалыСбербанк", Ложь, "1.0.2.2");
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикMPos2canЭквайринг, "AddIn.mPos2can", "ДрайверMPos2canЭквайринг", Ложь, "1.5.9");
	 Справочники.ДрайверыОборудования.ЗаполнитьПредопределенныйЭлемент(Перечисления.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикSKAM1CЭквайринговыеСистемы, "AddIn.skam", "ДрайверSKAM1CЭквайринговыеСистемы", Ложь, "1.0.3");
	 // Конец Эквайринговые терминалы.
	 
	 
 КонецПроцедуры
 
 // Обновить установленные драйвера.
 
 
 Процедура ОбновитьУстановленныеДрайвера() Экспорт
	 
	 // ККТ с передачей данных ОФД
	 МенеджерОборудованияВызовСервера.ОбновитьУстановленныеДрайвера(Перечисления.ТипыПодключаемогоОборудования.ККТ);
	 // Конец ККТ с передачей данных ОФД.
	 
	 // Принтеры чеков
	 МенеджерОборудованияВызовСервера.ОбновитьУстановленныеДрайвера(Перечисления.ТипыПодключаемогоОборудования.ПринтерЭтикеток);
	 // Конец Принтеры чеков.
	 
	 // Сканеры штрихкода
	 МенеджерОборудованияВызовСервера.ОбновитьУстановленныеДрайвера(Перечисления.ТипыПодключаемогоОборудования.СканерШтрихкода);
	 // Конец Сканеры штрихкода
	 
 КонецПроцедуры
 
 Функция ПолучитьПарольИзТекПользователя() Экспорт
	 УстановитьПривилегированныйРежим(Истина);
	 РезультатВозврата = Неопределено;
	 ПользовательТек = ПараметрыСеанса.ТекущийПользователь ;
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	Пользователи.Омг_ВебКассаПользователь КАК Пользователь,
	 |	Пользователи.Омг_ВебКассаПароль КАК ПарольПользователя
	 |ИЗ
	 |	Справочник.Пользователи КАК Пользователи
	 |ГДЕ
	 |	Пользователи.Ссылка = &Пользователь";
	 
	 Запрос.УстановитьПараметр("Пользователь", ПользовательТек);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 
	 Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		 Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Пользователь) и 
			 ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПарольПользователя) Тогда 	
			 
			 РезультатВозврата = Новый Структура;	
			 РезультатВозврата.Вставить("Пользователь",       ВыборкаДетальныеЗаписи.Пользователь);
			 РезультатВозврата.Вставить("ПарольПользователя", ВыборкаДетальныеЗаписи.ПарольПользователя);		
			 РезультатВозврата.Вставить("ЗапомнитьПароль", Ложь);
		 КонецЕсли;
	 КонецЕсли;
	 УстановитьПривилегированныйРежим(Ложь);
	 Возврат РезультатВозврата;
	 
 КонецФункции
 
 Функция НайтиДокументПоЧеку(НомерЧека) Экспорт         
	 
	 	ДокументРеализации = Неопределено;  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОказаниеУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОказаниеУслуг КАК ОказаниеУслуг
		|ГДЕ
		|	ОказаниеУслуг.НомерЧекаККМ = &НомерЧекаККМ";
		
		Запрос.УстановитьПараметр("НомерЧекаККМ", НомерЧека);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ДокументРеализации = ВыборкаДетальныеЗаписи.Ссылка			
		КонецЕсли;	
		
		Возврат ДокументРеализации;
		
КонецФункции

Процедура ЗаписатьДанныеОперацииПоЧеку(ДокументОснование,Данные,ПодключаемоеОборудование,СообщениеОтОборудования, ТекстЧека = "") Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
	
	ДатаВремяПечати = ТекущаяДата();
	УИДОперации = Новый УникальныйИдентификатор();
	
	ЗаписьЧека = РегистрыСведений.ИсторияПечатиОнлайнЧеков.СоздатьМенеджерЗаписи();	
	ЗаписьЧека.Документ = ДокументОснование;
	ЗаписьЧека.УИД		= УИДОперации;
	ЗаписьЧека.Прочитать();
	
	Если НЕ ЗаписьЧека.Выбран() Тогда
		ЗаписьЧека.Документ 				= ДокументОснование;
		ЗаписьЧека.УИД						= УИДОперации;
		ЗаписьЧека.СообщениеОтОборудования	= СообщениеОтОборудования;
		ЗаписьЧека.Дата						= ДатаВремяПечати;
		Если не ТекстЧека = "" Тогда  
			ЗаписьЧека.ДанныеXML				= ТекстЧека;	
		иначе
			ЗаписьЧека.ДанныеXML				= Данные;
		КонецЕсли;
		ЗаписьЧека.ПодключаемоеОборудование	= ПодключаемоеОборудование;
		ЗаписьЧека.Пользователь				= ПараметрыСеанса.ТекущийПользователь;
		СторноОперация = Ложь;
		Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОплатаПлатежнойКартой") Тогда
		СторноОперация = Ложь;
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ВозвратПоПлатежнойКарте") Тогда 
		СторноОперация = Истина; 
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда 
		СторноОперация = Ложь; 
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда 
		СторноОперация = Истина; 
		ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
		СторноОперация 			= ДокументОснование.ВидОперации = Перечисления.ВидыОперацийОказанияУслуг.ВозвратКлиенту;
		КонецЕсли;
		ЗаписьЧека.СторноОперация           = СторноОперация;
		ЗаписьЧека.Результат				= Истина;		
		ЗаписьЧека.Записать(Истина);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Функция ПолучитьНомерЧекаККМОказанияУслуг(ДокСсылка) Экспорт    
	
	НомерЧека = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОказаниеУслуг.НомерЧекаККМ КАК НомерЧекаККМ
		|ИЗ
		|	Документ.ОказаниеУслуг КАК ОказаниеУслуг
		|ГДЕ
		|	ОказаниеУслуг.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		НомерЧека = ВыборкаДетальныеЗаписи.НомерЧекаККМ;
	КонецЕсли;
	
	Возврат НомерЧека;
	
КонецФункции	

Функция ВернутьТекстЧека(ДокСсылка) Экспорт
	
	ТекстЧека = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияПечатиОнлайнЧеков.ДанныеXML КАК ДанныеXML
		|ИЗ
		|	РегистрСведений.ИсторияПечатиОнлайнЧеков КАК ИсторияПечатиОнлайнЧеков
		|ГДЕ
		|	ИсторияПечатиОнлайнЧеков.Документ = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ТекстЧека = ВыборкаДетальныеЗаписи.ДанныеXML
	КонецЕсли;

	Возврат ТекстЧека;
	
КонецФункции	

&НаСервере	
Функция омг_ПолучитьIPАдресТерминала(ЭТ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭквайринговыеТерминалы.омг_АдресТерминала КАК АдресТерминала,
	               |	ЭквайринговыеТерминалы.омг_ПортТерминала КАК ПортТерминала,
	               |	ЭквайринговыеТерминалы.омг_ИспользуемыйТерминал КАК ИспользуемыйТерминал,
	               |	ЭквайринговыеТерминалы.омг_ИнтеграцияОплатаНаТерминал КАК ИнтеграцияОплатаНаТерминал,
	               |	ЭквайринговыеТерминалыОборудование.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	               |ИЗ
	               |	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭквайринговыеТерминалы.Оборудование КАК ЭквайринговыеТерминалыОборудование
	               |		ПО (ЭквайринговыеТерминалыОборудование.Ссылка = ЭквайринговыеТерминалы.Ссылка)
	               |			И (ЭквайринговыеТерминалыОборудование.ПодключаемоеОборудование.ТипОборудования = &ТипОборудования
	               |				И ЭквайринговыеТерминалыОборудование.ПодключаемоеОборудование.УстройствоИспользуется)
	               |ГДЕ
	               |	ЭквайринговыеТерминалы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЭТ);
	Запрос.УстановитьПараметр("ТипОборудования", Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	СтруктураТерминала = Новый Структура("АдресТерминала, ПортТерминала, 
							|ИспользуемыйТерминал, ИнтеграцияОплатаНаТерминал, ПодключаемоеОборудование");
	ЗаполнитьЗначенияСвойств(СтруктураТерминала, Выборка);
	
	Возврат СтруктураТерминала;
	
КонецФункции 

Функция ПолучитьТекстЗапросаПлатежногоДокумента(Ссылка)
	Текст = "";
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
		
	Текст = 
		"ВЫБРАТЬ
		|	ОказаниеУслуг.СуммаДокумента КАК СуммаДокумента,
		|	ОказаниеУслуг.ПолученоНаличными КАК ПолученоНаличными
		|ИЗ
		|	Документ.ОказаниеУслуг КАК ОказаниеУслуг
		|ГДЕ
		|	ОказаниеУслуг.Ссылка = &Ссылка";	
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ОплатаПлатежнойКартой") Тогда
		
	Текст = 
		"ВЫБРАТЬ
		|	ОплатаПлатежнойКартой.СуммаДокумента КАК СуммаДокумента,
		|	0 КАК ПолученоНаличными
		|ИЗ
		|	Документ.ОплатаПлатежнойКартой КАК ОплатаПлатежнойКартой
		|ГДЕ
		|	ОплатаПлатежнойКартой.Ссылка = &Ссылка";	

	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВозвратПоПлатежнойКарте") Тогда
		
	Текст = 
		"ВЫБРАТЬ
		|	ВозвратПоПлатежнойКарте.СуммаДокумента КАК СуммаДокумента,
		|	0 КАК ПолученоНаличными
		|ИЗ
		|	Документ.ВозвратПоПлатежнойКарте КАК ВозвратПоПлатежнойКарте
		|ГДЕ
		|	ВозвратПоПлатежнойКарте.Ссылка = &Ссылка";
	
	
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		
	Текст = 
		"ВЫБРАТЬ
		|	ПриходныйКассовыйОрдер.СуммаДокумента КАК СуммаДокумента,
		|	ПриходныйКассовыйОрдер.СуммаДокумента КАК ПолученоНаличными
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
		|ГДЕ
		|	ПриходныйКассовыйОрдер.Ссылка = &Ссылка";
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		
	Текст = 
		"ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.СуммаДокумента КАК СуммаДокумента,
		|	РасходныйКассовыйОрдер.СуммаДокумента КАК ПолученоНаличными
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|ГДЕ
		|	РасходныйКассовыйОрдер.Ссылка = &Ссылка";

	
	КонецЕсли;	
	
 	Возврат Текст;	
	
	
КонецФункции	

Процедура ДополнитьСведенияЧекаОПК(ДокументОснование,СтрВозврата) Экспорт
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ЕСТЬNULL(ОплатаПлатежнойКартой.Филиал, """") КАК Филиал,
	 |	ЕСТЬNULL(ОплатаПлатежнойКартой.Клиент, """") КАК Клиент,
	 |	ЕСТЬNULL(ОплатаПлатежнойКартой.Клиент.ИНН, """") КАК КлиентИНН,
	 |	ЕСТЬNULL(ОплатаПлатежнойКартой.Клиент.ДатаРождения, """") КАК КлиентДатаРождения,
	 |	ЕСТЬNULL(ОплатаПлатежнойКартой.омг_ИспользуемыйТерминал, """") КАК омг_ИспользуемыйТерминал,
	 |	""Продажа"" КАК ВидОперации
	 |ИЗ
	 |	Документ.ОплатаПлатежнойКартой КАК ОплатаПлатежнойКартой
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КонтактнаяИнформация.Представление КАК Представление
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Вид.Наименование = &ФактическийАдрес
	 |	И КонтактнаяИнформация.Объект = &Филиал
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КонтактнаяИнформация.Представление КАК Представление
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Вид.Наименование = &РабочийТелефон
	 |	И КонтактнаяИнформация.Объект = &Филиал
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КонтактнаяИнформация.Представление КАК Представление
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Вид.Наименование = &Инстаграм
	 |	И КонтактнаяИнформация.Объект = &Организация";
	 
	 Запрос.УстановитьПараметр("РабочийТелефон", "Рабочий телефон");
	 Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	 Запрос.УстановитьПараметр("ФактическийАдрес", "Фактический адрес");
	 Запрос.УстановитьПараметр("Филиал", ДокументОснование.Филиал);
	 Запрос.УстановитьПараметр("Инстаграм", "Инстаграм");
	 Запрос.УстановитьПараметр("Организация", ДокументОснование.Организация);
	 
	 
	 РезультатЗапроса = Запрос.ВыполнитьПакет();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать(); 
	 ВыборкаАдрес = РезультатЗапроса[1].Выбрать();
	 ВыборкаТелефон = РезультатЗапроса[2].Выбрать();
	 ВыборкаИнстаграм = РезультатЗапроса[3].Выбрать();
	 
	 Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		 СтрВозврата.Вставить("Филиал",ВыборкаДетальныеЗаписи.Филиал);
		 СтрВозврата.Вставить("Клиент",ВыборкаДетальныеЗаписи.Клиент);
		 СтрВозврата.Вставить("КлиентИНН",ВыборкаДетальныеЗаписи.КлиентИНН);
		 СтрВозврата.Вставить("КлиентДатаРождения",ВыборкаДетальныеЗаписи.КлиентДатаРождения); 
		 СтрВозврата.Вставить("омг_ИспользуемыйТерминал",ВыборкаДетальныеЗаписи.омг_ИспользуемыйТерминал);
		 СтрВозврата.Вставить("ВидОперации",ВыборкаДетальныеЗаписи.ВидОперации);
		 
	 Иначе
		 СтрВозврата.Вставить("Филиал","");
		 СтрВозврата.Вставить("Клиент","");
		 СтрВозврата.Вставить("КлиентИНН","");
		 СтрВозврата.Вставить("КлиентДатаРождения","");
		 СтрВозврата.Вставить("омг_ИспользуемыйТерминал","");
		 СтрВозврата.Вставить("ВидОперации","");
		 
	 КонецЕсли;
	 
	 Если ВыборкаАдрес.Следующий() Тогда
		 СтрВозврата.Вставить("ФактическийАдрес",ВыборкаАдрес.Представление);	
	 Иначе
		 СтрВозврата.Вставить("ФактическийАдрес","")
	 КонецЕсли;    
	 
	 Если ВыборкаТелефон.Следующий() Тогда
		 СтрВозврата.Вставить("РабочийТелефон",ВыборкаТелефон.Представление);	
	 Иначе
		 СтрВозврата.Вставить("РабочийТелефон","")
	 КонецЕсли;  
	 
	 Если ВыборкаИнстаграм.Следующий() Тогда
		 СтрВозврата.Вставить("Инстаграм",ВыборкаИнстаграм.Представление);	
	 Иначе
		 СтрВозврата.Вставить("Инстаграм","")
	 КонецЕсли;
	 
	 СтрВозврата.Вставить("НомерДокумента",ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокументОснование.Номер)); 
	 
 КонецПроцедуры	
 
Процедура ДополнитьСведенияЧекаВПК(ДокументОснование,СтрВозврата) Экспорт	
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ЕСТЬNULL(ВозвратПоПлатежнойКарте.Филиал, """") КАК Филиал,
	 |	ЕСТЬNULL(ВозвратПоПлатежнойКарте.Клиент, """") КАК Клиент,
	 |	ЕСТЬNULL(ВозвратПоПлатежнойКарте.Клиент.ИНН, """") КАК КлиентИНН,
	 |	ЕСТЬNULL(ВозвратПоПлатежнойКарте.Клиент.ДатаРождения, """") КАК КлиентДатаРождения,
	 |	ЕСТЬNULL(ВозвратПоПлатежнойКарте.омг_ИспользуемыйТерминал, """") КАК омг_ИспользуемыйТерминал,
	 |	""Возврат"" КАК ВидОперации
	 |ИЗ
	 |	Документ.ВозвратПоПлатежнойКарте КАК ВозвратПоПлатежнойКарте
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КонтактнаяИнформация.Представление КАК Представление
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Вид.Наименование = &ФактическийАдрес
	 |	И КонтактнаяИнформация.Объект = &Филиал
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КонтактнаяИнформация.Представление КАК Представление
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Вид.Наименование = &РабочийТелефон
	 |	И КонтактнаяИнформация.Объект = &Филиал
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КонтактнаяИнформация.Представление КАК Представление
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Вид.Наименование = &Инстаграм
	 |	И КонтактнаяИнформация.Объект = &Организация";
	 
	 Запрос.УстановитьПараметр("РабочийТелефон", "Рабочий телефон");
	 Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	 Запрос.УстановитьПараметр("ФактическийАдрес", "Фактический адрес");
	 Запрос.УстановитьПараметр("Филиал", ДокументОснование.Филиал);
	 Запрос.УстановитьПараметр("Инстаграм", "Инстаграм");
	 Запрос.УстановитьПараметр("Организация", ДокументОснование.Организация);
	 
	 
	 РезультатЗапроса = Запрос.ВыполнитьПакет();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать(); 
	 ВыборкаАдрес = РезультатЗапроса[1].Выбрать();
	 ВыборкаТелефон = РезультатЗапроса[2].Выбрать();
	 ВыборкаИнстаграм = РезультатЗапроса[3].Выбрать();
	 
	 Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		 СтрВозврата.Вставить("Филиал",ВыборкаДетальныеЗаписи.Филиал);
		 СтрВозврата.Вставить("Клиент",ВыборкаДетальныеЗаписи.Клиент);
		 СтрВозврата.Вставить("КлиентИНН",ВыборкаДетальныеЗаписи.КлиентИНН);
		 СтрВозврата.Вставить("КлиентДатаРождения",ВыборкаДетальныеЗаписи.КлиентДатаРождения); 
		 СтрВозврата.Вставить("омг_ИспользуемыйТерминал",ВыборкаДетальныеЗаписи.омг_ИспользуемыйТерминал);
		 СтрВозврата.Вставить("ВидОперации",ВыборкаДетальныеЗаписи.ВидОперации);
		 
	 Иначе
		 СтрВозврата.Вставить("Филиал","");
		 СтрВозврата.Вставить("Клиент","");
		 СтрВозврата.Вставить("КлиентИНН","");
		 СтрВозврата.Вставить("КлиентДатаРождения","");
		 СтрВозврата.Вставить("омг_ИспользуемыйТерминал","");
		 СтрВозврата.Вставить("ВидОперации","");
		 
	 КонецЕсли;
	 
	 Если ВыборкаАдрес.Следующий() Тогда
		 СтрВозврата.Вставить("ФактическийАдрес",ВыборкаАдрес.Представление);	
	 Иначе
		 СтрВозврата.Вставить("ФактическийАдрес","")
	 КонецЕсли;    
	 
	 Если ВыборкаТелефон.Следующий() Тогда
		 СтрВозврата.Вставить("РабочийТелефон",ВыборкаТелефон.Представление);	
	 Иначе
		 СтрВозврата.Вставить("РабочийТелефон","")
	 КонецЕсли;  
	 
	 Если ВыборкаИнстаграм.Следующий() Тогда
		 СтрВозврата.Вставить("Инстаграм",ВыборкаИнстаграм.Представление);	
	 Иначе
		 СтрВозврата.Вставить("Инстаграм","")
	 КонецЕсли;
	 
	 СтрВозврата.Вставить("НомерДокумента",ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокументОснование.Номер)); 
	 
 КонецПроцедуры	
 
Процедура ДополнитьСведенияЧекаПКО(ДокументОснование,СтрВозврата) Экспорт	
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ЕСТЬNULL(ПриходныйКассовыйОрдер.Филиал, """") КАК Филиал,
	 |	ЕСТЬNULL(ПриходныйКассовыйОрдер.Клиент, """") КАК Клиент,
	 |	ЕСТЬNULL(ПриходныйКассовыйОрдер.Клиент.ИНН, """") КАК КлиентИНН,
	 |	ЕСТЬNULL(ПриходныйКассовыйОрдер.Клиент.ДатаРождения, """") КАК КлиентДатаРождения,
	 |	"""" КАК омг_ИспользуемыйТерминал,
	 |	""Продажа"" КАК ВидОперации
	 |ИЗ
	 |	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КонтактнаяИнформация.Представление КАК Представление
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Вид.Наименование = &ФактическийАдрес
	 |	И КонтактнаяИнформация.Объект = &Филиал
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КонтактнаяИнформация.Представление КАК Представление
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Вид.Наименование = &РабочийТелефон
	 |	И КонтактнаяИнформация.Объект = &Филиал
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КонтактнаяИнформация.Представление КАК Представление
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Вид.Наименование = &Инстаграм
	 |	И КонтактнаяИнформация.Объект = &Организация";
	 
	 Запрос.УстановитьПараметр("РабочийТелефон", "Рабочий телефон");
	 Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	 Запрос.УстановитьПараметр("ФактическийАдрес", "Фактический адрес");
	 Запрос.УстановитьПараметр("Филиал", ДокументОснование.Филиал);
	 Запрос.УстановитьПараметр("Инстаграм", "Инстаграм");
	 Запрос.УстановитьПараметр("Организация", ДокументОснование.Организация);
	 
	 
	 РезультатЗапроса = Запрос.ВыполнитьПакет();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать(); 
	 ВыборкаАдрес = РезультатЗапроса[1].Выбрать();
	 ВыборкаТелефон = РезультатЗапроса[2].Выбрать();
	 ВыборкаИнстаграм = РезультатЗапроса[3].Выбрать();
	 
	 Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		 СтрВозврата.Вставить("Филиал",ВыборкаДетальныеЗаписи.Филиал);
		 СтрВозврата.Вставить("Клиент",ВыборкаДетальныеЗаписи.Клиент);
		 СтрВозврата.Вставить("КлиентИНН",ВыборкаДетальныеЗаписи.КлиентИНН);
		 СтрВозврата.Вставить("КлиентДатаРождения",ВыборкаДетальныеЗаписи.КлиентДатаРождения); 
		 СтрВозврата.Вставить("омг_ИспользуемыйТерминал",ВыборкаДетальныеЗаписи.омг_ИспользуемыйТерминал);
		 СтрВозврата.Вставить("ВидОперации",ВыборкаДетальныеЗаписи.ВидОперации);
		 
	 Иначе
		 СтрВозврата.Вставить("Филиал","");
		 СтрВозврата.Вставить("Клиент","");
		 СтрВозврата.Вставить("КлиентИНН","");
		 СтрВозврата.Вставить("КлиентДатаРождения","");
		 СтрВозврата.Вставить("омг_ИспользуемыйТерминал","");
		 СтрВозврата.Вставить("ВидОперации","");
		 
	 КонецЕсли;
	 
	 Если ВыборкаАдрес.Следующий() Тогда
		 СтрВозврата.Вставить("ФактическийАдрес",ВыборкаАдрес.Представление);	
	 Иначе
		 СтрВозврата.Вставить("ФактическийАдрес","")
	 КонецЕсли;    
	 
	 Если ВыборкаТелефон.Следующий() Тогда
		 СтрВозврата.Вставить("РабочийТелефон",ВыборкаТелефон.Представление);	
	 Иначе
		 СтрВозврата.Вставить("РабочийТелефон","")
	 КонецЕсли;  
	 
	 Если ВыборкаИнстаграм.Следующий() Тогда
		 СтрВозврата.Вставить("Инстаграм",ВыборкаИнстаграм.Представление);	
	 Иначе
		 СтрВозврата.Вставить("Инстаграм","")
	 КонецЕсли;
	 
	 СтрВозврата.Вставить("НомерДокумента",ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокументОснование.Номер)); 
	 
 КонецПроцедуры	

Процедура ДополнитьСведенияЧекаРКО(ДокументОснование,СтрВозврата) Экспорт	
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ЕСТЬNULL(РасходныйКассовыйОрдер.Филиал, """") КАК Филиал,
	 |	ЕСТЬNULL(РасходныйКассовыйОрдер.Контрагент, """") КАК Клиент,
	 |	ЕСТЬNULL(РасходныйКассовыйОрдер.Контрагент.ИНН, """") КАК КлиентИНН,
	 |	ЕСТЬNULL(РасходныйКассовыйОрдер.Контрагент.ДатаРождения, """") КАК КлиентДатаРождения,
	 |	"""" КАК омг_ИспользуемыйТерминал,
	 |	""Возврат"" КАК ВидОперации
	 |ИЗ
	 |	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КонтактнаяИнформация.Представление КАК Представление
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Вид.Наименование = &ФактическийАдрес
	 |	И КонтактнаяИнформация.Объект = &Филиал
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КонтактнаяИнформация.Представление КАК Представление
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Вид.Наименование = &РабочийТелефон
	 |	И КонтактнаяИнформация.Объект = &Филиал
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	КонтактнаяИнформация.Представление КАК Представление
	 |ИЗ
	 |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	 |ГДЕ
	 |	КонтактнаяИнформация.Вид.Наименование = &Инстаграм
	 |	И КонтактнаяИнформация.Объект = &Организация";
	 
	 Запрос.УстановитьПараметр("РабочийТелефон", "Рабочий телефон");
	 Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	 Запрос.УстановитьПараметр("ФактическийАдрес", "Фактический адрес");
	 Запрос.УстановитьПараметр("Филиал", ДокументОснование.Филиал);
	 Запрос.УстановитьПараметр("Инстаграм", "Инстаграм");
	 Запрос.УстановитьПараметр("Организация", ДокументОснование.Организация);
	 
	 
	 РезультатЗапроса = Запрос.ВыполнитьПакет();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать(); 
	 ВыборкаАдрес = РезультатЗапроса[1].Выбрать();
	 ВыборкаТелефон = РезультатЗапроса[2].Выбрать();
	 ВыборкаИнстаграм = РезультатЗапроса[3].Выбрать();
	 
	 Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		 СтрВозврата.Вставить("Филиал",ВыборкаДетальныеЗаписи.Филиал);
		 СтрВозврата.Вставить("Клиент",ВыборкаДетальныеЗаписи.Клиент);
		 СтрВозврата.Вставить("КлиентИНН",ВыборкаДетальныеЗаписи.КлиентИНН);
		 СтрВозврата.Вставить("КлиентДатаРождения",ВыборкаДетальныеЗаписи.КлиентДатаРождения); 
		 СтрВозврата.Вставить("омг_ИспользуемыйТерминал",ВыборкаДетальныеЗаписи.омг_ИспользуемыйТерминал);
		 СтрВозврата.Вставить("ВидОперации",ВыборкаДетальныеЗаписи.ВидОперации);
		 
	 Иначе
		 СтрВозврата.Вставить("Филиал","");
		 СтрВозврата.Вставить("Клиент","");
		 СтрВозврата.Вставить("КлиентИНН","");
		 СтрВозврата.Вставить("КлиентДатаРождения","");
		 СтрВозврата.Вставить("омг_ИспользуемыйТерминал","");
		 СтрВозврата.Вставить("ВидОперации","");
		 
	 КонецЕсли;
	 
	 Если ВыборкаАдрес.Следующий() Тогда
		 СтрВозврата.Вставить("ФактическийАдрес",ВыборкаАдрес.Представление);	
	 Иначе
		 СтрВозврата.Вставить("ФактическийАдрес","")
	 КонецЕсли;    
	 
	 Если ВыборкаТелефон.Следующий() Тогда
		 СтрВозврата.Вставить("РабочийТелефон",ВыборкаТелефон.Представление);	
	 Иначе
		 СтрВозврата.Вставить("РабочийТелефон","")
	 КонецЕсли;  
	 
	 Если ВыборкаИнстаграм.Следующий() Тогда
		 СтрВозврата.Вставить("Инстаграм",ВыборкаИнстаграм.Представление);	
	 Иначе
		 СтрВозврата.Вставить("Инстаграм","")
	 КонецЕсли;
	 
	 СтрВозврата.Вставить("НомерДокумента",ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокументОснование.Номер)); 
	 
 КонецПроцедуры	
 
Функция НеПрименятьСкидку(Номенклатура) Экспорт

	Возврат Номенклатура.омг_НеПрименятьСкидку;	 
	 
КонецФункции	 
	 
Функция ДополнитьЗаявками(ДокОснование)	Экспорт
    ТекстВозврата = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.НомерЗаявки КАК НомерЗаявки,
		|	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ПарольЗаявки КАК ПарольЗаявки
		|ИЗ
		|	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС
		|ГДЕ
		|	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ДокументОснование = &ДокументОснование";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		
	ТекстВозврата = ТекстВозврата + "Номер заявки: " +ВыборкаДетальныеЗаписи.НомерЗаявки + Символы.ПС;	
	ТекстВозврата = ТекстВозврата + "Пароль: " +ВыборкаДетальныеЗаписи.ПарольЗаявки.Получить() + Символы.ПС;	
	КонецЦикла;	
	
	Возврат ТекстВозврата;

	
	
КонецФункции	

Функция ВернутьКассуПоРабочемуМесту() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ТекущееРабочееМесто = ПараметрыСеанса.РабочееМестоКлиента;   	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодключаемоеОборудование.омг_Касса КАК омг_Касса
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|ГДЕ
		|	ПодключаемоеОборудование.РабочееМесто = &РабочееМесто
		|	И ПодключаемоеОборудование.ТипОборудования = Значение(Перечисление.ТипыПодключаемогоОборудования.ФискальныйРегистратор)";
	
	Запрос.УстановитьПараметр("РабочееМесто", ПараметрыСеанса.РабочееМестоКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВозЗначение = Неопределено;
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ВозЗначение =  ВыборкаДетальныеЗаписи.омг_Касса
	КонецЕсли;
    УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ВозЗначение;
	
КонецФункции	


Функция ВернутьДанныеПервичногоЧека(Ссылка, ТолькоПроверка = Ложь) Экспорт

	УстановитьПривилегированныйРежим(Истина);	
	                
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФискальныеОперацииРК.ДатаВремяЧека КАК ДатаВремяЧека,
		|	ФискальныеОперацииРК.НомерЧека КАК НомерЧека,
		|	ФискальныеОперацииРК.ОбщаяСуммаЧека КАК ОбщаяСуммаЧека,
		|	ФискальныеОперацииРК.АвтономныйРежимРаботыКассы КАК АвтономныйРежимРаботыКассы,
		|	ФискальныеОперацииРК.РегистрационныйНомерКассы КАК РегистрационныйНомерКассы
		|ИЗ
		|	РегистрСведений.ФискальныеОперацииРК КАК ФискальныеОперацииРК
		|ГДЕ
		|	ФискальныеОперацииРК.ДокументОснование = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		УстановитьПривилегированныйРежим(Ложь);
		Если ТолькоПроверка Тогда
        Возврат Истина
		иначе
		Возврат ВыборкаДетальныеЗаписи;
		КонецЕсли;
	иначе 
		
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции	

Функция ПроверкаДатыПереходаНаРегистрФискальныеОперацииРК(ДатаДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	ВозЗначение = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ДатаДокумента >= НАЧАЛОПЕРИОДА(омг_ДатаПереходаНаРегистрФискальныеОперацииРК.Значение, ДЕНЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Возврат
	|ИЗ
	|	Константа.омг_ДатаПереходаНаРегистрФискальныеОперацииРК КАК омг_ДатаПереходаНаРегистрФискальныеОперацииРК";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ВозЗначение = ВыборкаДетальныеЗаписи.Возврат
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ВозЗначение;
	
КонецФункции	

Функция ПолучитьТабличныйДокументДляПечати(ЭтоЧЕк = Ложь,ТекстЧека = "") Экспорт
	
	ПечатнаяФорма = Новый ТабличныйДокумент;
	
	Если ЭтоЧЕк Тогда   
		//ВысотаСтраницы = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстЧека,Символы.ПС).Количество();
		Макет = Документы.ОказаниеУслуг.ПолучитьМакет("омг_Чек");    
		Шапка = Макет.ПолучитьОбласть("ЧекОбласть");
		Шапка2 = Макет.ПолучитьОбласть("ЧекОбласть2");
		Подвал = Макет.ПолучитьОбласть("ЧекОбласть3");
		ТекстЧека = ТекстЧека;
		НомерЗаявки = СтрНайти(ТекстЧека ,"Вы сможете отслеживать",,,);
		Если не НомерЗаявки = 0 Тогда
			НомерЗаявки = НомерЗаявки -1;  
			НомерЗаявки2 = СтрНайти(ТекстЧека ,"Nazar audaryñyz!",,,)-1;
			Шапка.Параметры.ЧекТекст1 = Сред(ТекстЧека,НомерЗаявки,НомерЗаявки2 - НомерЗаявки);
			//Шапка.Параметры.ЧекТекст1 = Сред(ТекстЧека,НомерЗаявки,НомерЗаявки2 - НомерЗаявки)
			ТекстЧека = СтрЗаменить(ТекстЧека,Шапка.Параметры.ЧекТекст1,"");	
		КонецЕсли;
		
		Шапка.Параметры.ЧекТекст = Лев(ТекстЧека,СтрНайти(ТекстЧека ,"QRInstagarm",,,)-1);  
			
		ТекстЧека2 = СтрЗаменить(СтрЗаменить(ТекстЧека,Шапка.Параметры.ЧекТекст,""),"QRInstagarm","");	
		Шапка.Параметры.QR = Новый Картинка(ИнтеграцияWebKassaВызовСервераПереопределяемый.ПолучитьQRКод("https://www.instagram.com/divera.kz/", 1, 130));				 
		ПечатнаяФорма.Вывести(Шапка); 
		ЧекТекст2 = Лев(ТекстЧека2,СтрНайти(ТекстЧека2 ,"НачалоСсылки",,,)-1);	
		Массив2 = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЧекТекст2,Символы.ПС);
		Для каждого строка2 из Массив2 Цикл    
			Шапка2.Параметры.ЧекТекст2Строка = строка2;
			ПечатнаяФорма.Вывести(Шапка2); 
		КонецЦикла;	
			//Шапка.Параметры.ЧекТекст2 = ЧекТекст2;
			СсылкаНачало = Сред(ТекстЧека,СтрНайти(ТекстЧека,"НачалоСсылки",,,) +12 );
			СсылкаКонец  = СтрНайти(Сред(ТекстЧека,СтрНайти(ТекстЧека,"НачалоСсылки",,,) +12 ),"КонецСсылки",,,);
			СсылкаНаЧек = Лев(СсылкаНачало,СсылкаКонец-1); 	
			Подвал.Параметры.QR2 = Новый Картинка(ИнтеграцияWebKassaВызовСервераПереопределяемый.ПолучитьQRКод(СсылкаНаЧек, 1, 160));
			ПечатнаяФорма.Вывести(Подвал); 
			//ТекстЧека2 = СтрЗаменить(СтрЗаменить(ТекстЧека,Шапка.Параметры.ЧекТекст,""),"QRInstagarm","");
			//QR = Макет.ПолучитьОбласть("QR"); 		
			//QR.Параметры.QR = Новый Картинка(ИнтеграцияWebKassaВызовСервераПереопределяемый.ПолучитьQRКод("https://www.instagram.com/divera.kz/", 1, 130));
			//ПечатнаяФорма.Вывести(QR);
			//
			////ТекстЧекаОбрез = ТекстЧека
			//
			//Шапка1 = Макет.ПолучитьОбласть("ЧекОбласть1"); 
			//ЧекТекст2 = Лев(ТекстЧека2,СтрНайти(ТекстЧека2 ,"НачалоСсылки",,,)-1);		
			//Шапка1.Параметры.ЧекТекст = ЧекТекст2;
			//ПечатнаяФорма.Вывести(Шапка1); 
			//
			//QR1 = Макет.ПолучитьОбласть("QR1");
			//СсылкаНачало = Сред(ТекстЧека,СтрНайти(ТекстЧека,"НачалоСсылки",,,) +12 );
			//СсылкаКонец  = СтрНайти(Сред(ТекстЧека,СтрНайти(ТекстЧека,"НачалоСсылки",,,) +12 ),"КонецСсылки",,,);
			//СсылкаНаЧек = Лев(СсылкаНачало,СсылкаКонец-1); 
			//
			//QR1.Параметры.QR = Новый Картинка(ИнтеграцияWebKassaВызовСервераПереопределяемый.ПолучитьQRКод(СсылкаНаЧек, 1, 160));
			//ПечатнаяФорма.Вывести(QR1); 
			
			ПечатнаяФорма.ШиринаСтраницы = 58; 
			ПечатнаяФорма.ПолеСверху = 1;
			ПечатнаяФорма.ПолеСлева = 1;
			ПечатнаяФорма.ПолеСправа = 1; 
			ПечатнаяФорма.ПолеСнизу = 10; 
			ПечатнаяФорма.АвтоМасштаб = Истина; 
			ПечатнаяФорма.ОтображатьЗаголовки = Ложь;
			ПечатнаяФорма.ОтображатьСетку = Ложь;
			//ПечатнаяФорма.РазмерСтраницы="Custom";
			//ПечатнаяФорма.ВысотаСтраницы=ВысотаСтраницы;
			//ПечатнаяФорма.ШиринаСтраницы=58;		
			КонецЕсли;	
		
		Возврат ПечатнаяФорма;    
	
КонецФункции



