
Процедура ЗаполнитьВторичныйПрием(Прием, Заявка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОсновнойШаблонВрача = МедицинскаяДеятельность.ПолучитьОсновнойШаблонОсмотраСотрудника(Прием.Врач, Ложь);
	
	ВерсияШаблона = ВерсионированиеШаблонов.ПолучитьВерсиюШаблона(ОсновнойШаблонВрача, Прием.Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	омг_СвязанныеШаблоны.ПервичныйШаблон КАК ПервичныйШаблон,
	|	омг_СвязанныеШаблоны.ВторичныйШаблон КАК ВторичныйШаблон,
	|	ПриемШаблоныПриема.Ссылка КАК ПервичныйПрием,
	|	ЕСТЬNULL(ПриемШаблоныПриема.Ссылка.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК Дата
	|ИЗ
	|	РегистрСведений.омг_СвязанныеШаблоны КАК омг_СвязанныеШаблоны
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Прием.ШаблоныПриема КАК ПриемШаблоныПриема
	|		ПО (ПриемШаблоныПриема.ШаблонПриема = омг_СвязанныеШаблоны.ПервичныйШаблон)
	|			И (ПриемШаблоныПриема.Ссылка.МедицинскаяКарта = &МедицинскаяКарта)
	|ГДЕ
	|	омг_СвязанныеШаблоны.ПервичныйШаблон = &ПервичныйШаблон
	|	И ЛОЖЬ В
	|			(ВЫБРАТЬ
	|				Заявка.омг_ЭтоПервичныйПрием КАК омг_ЭтоПервичныйПрием
	|			ИЗ
	|				Документ.Заявка КАК Заявка
	|			ГДЕ
	|				Заявка.Ссылка = &Заявка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ";
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("ПервичныйШаблон", ОсновнойШаблонВрача);
	Запрос.УстановитьПараметр("МедицинскаяКарта", Прием.МедицинскаяКарта);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Прием.ПервичныйПрием = Выборка.ПервичныйПрием;
		Прием.ШаблоныПриема.Добавить().ШаблонПриема = Выборка.ВторичныйШаблон;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаполнитьМедПерсонал(Объект,Заявка = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина); 
	Если не Заявка = Неопределено Тогда
		Если Заявка.омг_МедПерсонал.Количество() > 0 Тогда 	
			Объект.омг_МедПерсонал.Загрузить(Заявка.омг_МедПерсонал.Выгрузить()); 			
		КонецЕсли;	
	КонецЕсли;
	
	Если Объект.омг_МедПерсонал.Количество() = 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	омг_СвязиМедПерсонала.Врач КАК Врач,
		|	омг_СвязиМедПерсонала.Медсестра КАК Медсестра,
		|	омг_СвязиМедПерсонала.омг_РольПерсонала КАК Роль,
		|	омг_СвязиМедПерсонала.Период КАК Период,
		|	омг_СвязиМедПерсонала.Медсестра.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.омг_СвязиМедПерсонала КАК омг_СвязиМедПерсонала
		|ГДЕ
		|	омг_СвязиМедПерсонала.Врач = &Врач
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		Запрос.УстановитьПараметр("Врач", Объект.Врач);
		РезультатЗапроса = Запрос.Выполнить().Выбрать(); 
		
		СтрПоиска = Новый Структура;
		СтрПоиска.Вставить("Роль",Перечисления.омг_РолиПерсонала.Медсестра);
		Если РезультатЗапроса.НайтиСледующий(СтрПоиска) Тогда
			СтрокаМедПерсонала = Объект.омг_МедПерсонал.Добавить();
			СтрокаМедПерсонала.Сотрудник = РезультатЗапроса.Медсестра;
			СтрокаМедПерсонала.Должность = РезультатЗапроса.Должность;
			СтрокаМедПерсонала.Роль = РезультатЗапроса.Роль;	
		КонецЕсли;	
		РезультатЗапроса.Сбросить();
		СтрПоиска = Новый Структура;
		СтрПоиска.Вставить("Роль",Перечисления.омг_РолиПерсонала.Лаборант);
		Если РезультатЗапроса.НайтиСледующий(СтрПоиска) Тогда
			СтрокаМедПерсонала = Объект.омг_МедПерсонал.Добавить();
			СтрокаМедПерсонала.Сотрудник = РезультатЗапроса.Медсестра;
			СтрокаМедПерсонала.Должность = РезультатЗапроса.Должность;
			СтрокаМедПерсонала.Роль = РезультатЗапроса.Роль;	
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры     


Функция ВернутьМедПерсоналПоИсточникам(Заявка,СтрМедПерсонала) Экспорт
	
 
	ТабМедПерсонала = Заявка.омг_МедПерсонал.Выгрузить();
	
	Если Заявка.омг_МедПерсонал.Количество() = 0 Тогда
		ТабМедПерсонала.Очистить();
		Для каждого строкаСтр из СтрМедПерсонала Цикл
			Если ЗначениеЗаполнено(строкаСтр.Значение) Тогда
				Если строкаСтр.Ключ = "омг_МедСестра" Тогда
					Роль = Перечисления.омг_РолиПерсонала.Медсестра; 
				ИначеЕсли строкаСтр.Ключ = "омг_Лаборант" Тогда
					Роль = Перечисления.омг_РолиПерсонала.Лаборант;
				иначе продолжить
				КонецЕсли;
				СтрТабМедПерсонала = ТабМедПерсонала.Добавить();
				СтрТабМедПерсонала.Сотрудник = строкаСтр.Значение;
				СтрТабМедПерсонала.Должность = строкаСтр.Значение.Должность;
				СтрТабМедПерсонала.Роль = Роль;	
			КонецЕсли;
		КонецЦикла;	 	
	КонецЕсли;      
	
	Возврат ТабМедПерсонала;
	
КонецФункции


Функция ПолучитьТекущуюМедсестру(Врач) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_СвязиМедПерсоналаСрезПоследних.Период КАК Период,
	               |	омг_СвязиМедПерсоналаСрезПоследних.Врач КАК Врач,
	               |	омг_СвязиМедПерсоналаСрезПоследних.Медсестра КАК Медсестра
	               |ИЗ
	               |	РегистрСведений.омг_СвязиМедПерсонала.СрезПоследних КАК омг_СвязиМедПерсоналаСрезПоследних
	               |ГДЕ
	               |	омг_СвязиМедПерсоналаСрезПоследних.Врач = &Врач
	               |	И омг_СвязиМедПерсоналаСрезПоследних.омг_РольПерсонала = &Медсестра";
	Запрос.УстановитьПараметр("Врач", Врач); 
	Запрос.УстановитьПараметр("Медсестра", Перечисления.омг_РолиПерсонала.Медсестра);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.Сотрудники.БезМедсестры;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Выборка.Медсестра;
	
КонецФункции    

Функция ПолучитьТекущийМедПерсоналПоВрачу(Врач) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_СвязиМедПерсоналаСрезПоследних.Период КАК Период,
	               |	омг_СвязиМедПерсоналаСрезПоследних.Врач КАК Врач,
	               |	омг_СвязиМедПерсоналаСрезПоследних.Медсестра КАК Медсестра,
	               |	омг_СвязиМедПерсоналаСрезПоследних.омг_РольПерсонала КАК омг_РольПерсонала
	               |ИЗ
	               |	РегистрСведений.омг_СвязиМедПерсонала.СрезПоследних КАК омг_СвязиМедПерсоналаСрезПоследних
	               |ГДЕ
	               |	омг_СвязиМедПерсоналаСрезПоследних.Врач = &Врач";
	Запрос.УстановитьПараметр("Врач", Врач);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено; 
	иначе
		Выборка = РезультатЗапроса.Выбрать();
		Возврат Выборка;
	КонецЕсли;
	
	
КонецФункции


Процедура УстановитьТекущуюМедсестру(Врач, Медсестра, Дата = Неопределено) Экспорт
	
	ТекущаяМедсестра = ПолучитьТекущуюМедсестру(Врач);
	
	Если ТекущаяМедсестра = Медсестра Тогда
		Возврат;
	КонецЕсли;
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Врач = Пользователи.ТекущийПользователь() Тогда
		ПараметрыСеанса.омг_ТекущаяМедсестра = Медсестра;
	КонецЕсли;
	
	Запись = РегистрыСведений.омг_СвязиМедПерсонала.СоздатьМенеджерЗаписи();
	Запись.Врач = Врач;
	Запись.Период = Дата;
	Запись.Медсестра = Медсестра;
	Запись.омг_РольПерсонала = Перечисления.омг_РолиПерсонала.Медсестра;
	Запись.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ЭтоВрач() Экспорт
	
	Возврат РольДоступна("омг_Врач");
	
КонецФункции

Процедура ОбновитьСтатусЗаявки(Прием, Отказ) Экспорт  
		
	Если ЗначениеЗаполнено(Прием.ДокументОснование) и ТипЗнч(Прием.ДокументОснование) = Тип("ДокументСсылка.Заявка") Тогда  
		УстановитьПривилегированныйРежим(Истина);
		Заявка = Прием.ДокументОснование.ПолучитьОбъект();
		Если не Отказ и Прием.Проведен Тогда
			
			Заявка.Омг_СостояниеПоПриемам = Справочники.ВидыСостоянийЗаявок.Прием; 
			Попытка  
			Заявка.ОбменДанными.Загрузка = Истина;
			Заявка.Записать();    
			Исключение
			КонецПопытки;
		иначе 
			
			Заявка.Омг_СостояниеПоПриемам = Справочники.ВидыСостоянийЗаявок.ПустаяСсылка();
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВЫБОР
			|		КОГДА Прием.Проведен
			|			ТОГДА 1
			|		ИНАЧЕ ВЫБОР
			|				КОГДА НЕ Прием.ПометкаУдаления
			|					ТОГДА 2
			|			КОНЕЦ
			|	КОНЕЦ КАК Статус
			|ИЗ
			|	Документ.Прием КАК Прием
			|ГДЕ
			|	Прием.ДокументОснование = &Заявка";
			
			Запрос.УстановитьПараметр("Заявка", Заявка.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			СтрПоиска = Новый Структура;
			СтрПоиска.Вставить("Статус", 2);  
			Если ВыборкаДетальныеЗаписи.НайтиСледующий(СтрПоиска) Тогда
				Заявка.Омг_СостояниеПоПриемам = Справочники.ВидыСостоянийЗаявок.СозданаНаСайте;		
			КонецЕсли;  
			ВыборкаДетальныеЗаписи.Сбросить(); 
			СтрПоиска = Новый Структура;
			СтрПоиска.Вставить("Статус", 1);
			Если ВыборкаДетальныеЗаписи.НайтиСледующий(СтрПоиска) Тогда
				Заявка.Омг_СостояниеПоПриемам = Справочники.ВидыСостоянийЗаявок.Прием;		
			КонецЕсли;
			Попытка
			Заявка.Записать();
			Исключение
			КонецПопытки;		
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь); 
		
	КонецЕсли; 
	
КонецПроцедуры	


Функция ВернутьМедПерсоналПоВрачу(Врач,Роль) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_СвязиМедПерсонала.Врач КАК Врач,
	               |	омг_СвязиМедПерсонала.Медсестра КАК Медсестра,
	               |	омг_СвязиМедПерсонала.омг_РольПерсонала КАК Роль,
	               |	омг_СвязиМедПерсонала.Период КАК Период,
	               |	омг_СвязиМедПерсонала.Медсестра.Должность КАК Должность
	               |ИЗ
	               |	РегистрСведений.омг_СвязиМедПерсонала КАК омг_СвязиМедПерсонала
	               |ГДЕ
	               |	омг_СвязиМедПерсонала.Врач = &Врач
	               |	И омг_СвязиМедПерсонала.омг_РольПерсонала = &Роль
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Врач", Врач);
	Запрос.УстановитьПараметр("Роль", Роль);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();   
	
	Если РезультатЗапроса.Следующий() Тогда  

		РезультатВозврата = РезультатЗапроса.Медсестра;
	
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Ложь); 
	
	Возврат РезультатВозврата;
	
КонецФункции

Функция омг_РольДоступна(Роль) Экспорт
	
	Возврат РольДоступна(Роль);
	
КонецФункции

Процедура омгСкорректироватьДвиженияПриемаОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	//Если ЗначениеЗаполнено(Источник.ДокументОснование) Тогда
	//	
	//	Если ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.Заявка") Тогда
	//		Запрос = Новый Запрос;
	//		Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	Прием.Ссылка КАК Ссылка
	//		|ИЗ
	//		|	Документ.Прием КАК Прием
	//		|ГДЕ
	//		|	Прием.Проведен
	//		|	И Прием.ДокументОснование = &Заявка";
	//		
	//		Запрос.УстановитьПараметр("Заявка", Источник.ДокументОснование);
	//		
	//		РезультатЗапроса = Запрос.Выполнить();
	//		
	//		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//		
	//		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//			
	//			ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();	
	//			Попытка
	//				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение)
	//			Исключение
	//				Продолжить
	//			КонецПопытки;	
	//		КонецЦикла;
	//		
	//	КонецЕсли;	
	//КонецЕсли;	
		
КонецПроцедуры

Функция ПроверитьПериодДействияНабора(ПроверочнаяДата,Набор) Экспорт
	
	ВозрЗначение = Ложь;
	
	ПустаяДата = Дата("00010101");
    омг_ДатаНачалДействияНабора = ПустаяДата;
	омг_ДатаОкончанияДействияНабора = ПустаяДата;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.омг_ДатаНачалДействияНабора КАК омг_ДатаНачалДействияНабора,
		|	Номенклатура.омг_ДатаОкончанияДействияНабора КАК омг_ДатаОкончанияДействияНабора
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Набор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		омг_ДатаНачалДействияНабора  =  ВыборкаДетальныеЗаписи.омг_ДатаНачалДействияНабора;
		омг_ДатаОкончанияДействияНабора = ВыборкаДетальныеЗаписи.омг_ДатаОкончанияДействияНабора;
	КонецЕсли;
	
	Если омг_ДатаНачалДействияНабора = ПустаяДата и омг_ДатаОкончанияДействияНабора = ПустаяДата Тогда
		 ВозрЗначение = Истина
	ИначеЕсли НачалоДня(омг_ДатаНачалДействияНабора) <= ПроверочнаяДата и ПроверочнаяДата <= КонецДня(омг_ДатаОкончанияДействияНабора) Тогда
		 ВозрЗначение = Истина
	КонецЕсли;	 
	
	Возврат ВозрЗначение;
	
КонецФункции	

Процедура омг_ПриЗаписиЗаявкиПриЗаписи(Источник, Отказ) Экспорт
	
	//Если не Отказ Тогда
	//	
	//	НаборЗаписей = РегистрыСведений.омг_ЗанятоеВремяЗаявок.СоздатьНаборЗаписей();
	//	
	//	НаборЗаписей.Отбор.Регистратор.Установить(Источник.Ссылка); 
	//	Если Источник.Состояние = Справочники.ВидыСостоянийЗаявок.Отменена или Источник.ПометкаУдаления Тогда
	//		НаборЗаписей.Записать(); 			
	//	иначе		
	//		Запрос = Новый Запрос;
	//		Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	ВЫБОР
	//		|		КОГДА ЗаявкаРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	//		|			ТОГДА ЗаявкаРаботы.Ссылка.Сотрудник
	//		|		ИНАЧЕ ЗаявкаРаботы.Сотрудник
	//		|	КОНЕЦ КАК Сотрудник,
	//		|	ЗаявкаРаботы.Ссылка.Дата КАК Период,
	//		|	ЗаявкаРаботы.ДатаНачала КАК ДатаНачала,
	//		|	ЗаявкаРаботы.ДатаОкончания КАК ДатаОкончания
	//		|ИЗ
	//		|	Документ.Заявка.Работы КАК ЗаявкаРаботы
	//		|ГДЕ
	//		|	ЗаявкаРаботы.Ссылка = &Ссылка
	//		|
	//		|СГРУППИРОВАТЬ ПО
	//		|	ЗаявкаРаботы.Ссылка.Дата,
	//		|	ЗаявкаРаботы.ДатаНачала,
	//		|	ЗаявкаРаботы.ДатаОкончания,
	//		|	ВЫБОР
	//		|		КОГДА ЗаявкаРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	//		|			ТОГДА ЗаявкаРаботы.Ссылка.Сотрудник
	//		|		ИНАЧЕ ЗаявкаРаботы.Сотрудник
	//		|	КОНЕЦ";
	//		
	//		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	//		
	//		
	//		РезультатЗапроса = Запрос.Выполнить();
	//		
	//		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//		
	//		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//			
	//			Если ВыборкаДетальныеЗаписи.ДатаОкончания > ВыборкаДетальныеЗаписи.ДатаНачала и ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сотрудник) Тогда	
	//				
	//				НоваяЗапись = НаборЗаписей.Добавить();	
	//				ЗаполнитьЗначенияСвойств(НоваяЗапись,ВыборкаДетальныеЗаписи); 
	//				
	//			КонецЕсли;
	//		КонецЦикла;  	
	//		
	//		Попытка	
	//			НаборЗаписей.Записать();   
	//		Исключение
	//			Отказ = Истина;
	//			Возврат;
	//		КонецПопытки;	
	//	КонецЕсли;	
	//КонецЕсли;
	
	омг_Idoctor.ОтправитьРасписаниеНаСервере(Источник.Сотрудник,,Источник.ДатаНачала);
	
КонецПроцедуры

Функция ДополнитьСтрокамиИзЧекапов(ТабДокументоРаботы,СписокОбъектов,ДатаНачала,ДатаОкончания,Филиал = Неопределено)Экспорт
	
	СписокДокументов = ТабДокументоРаботы.ВыгрузитьКолонку("ДокументСсылка");
	Запрос = Новый Запрос;
	ТекстФилиал = "";
	Если не Филиал = Неопределено Тогда
		
		   ТекстФилиал = Символы.ПС +  " И ЗаявкаРаботы.Ссылка.Филиал = &Филиал";
		   Запрос.УстановитьПараметр("Филиал", Филиал);
		   
	КонецЕсли;	
		
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаРаботы.Ссылка КАК Ссылка,
		|	ЗаявкаРаботы.ДатаНачала КАК Дата,
		|	ЗаявкаРаботы.ДатаНачала КАК ДокументДатаНачала,
		|	ЗаявкаРаботы.ДатаОкончания КАК ДокументДатаОкончания,
		|	ЗаявкаРаботы.ДатаНачала КАК ДатаНачала,
		|	ЗаявкаРаботы.ДатаОкончания КАК ДатаОкончания,
		|	ЗаявкаРаботы.Ссылка КАК ДокументСсылка,
		|	ЗаявкаРаботы.Ссылка.Клиент КАК КлиентСсылка,
		|	ЗаявкаРаботы.Ссылка.Состояние.Цвет КАК СостояниеЦвет,
		|	ЗаявкаРаботы.Сотрудник КАК ОБЪЕКТ,
		|	ЗаявкаРаботы.Номенклатура КАК Работа,
		|	ЗаявкаРаботы.Сотрудник.Подразделение КАК СотрудникПодразделение,
		|	ЗаявкаРаботы.Сотрудник.Подразделение.Код КАК СотрудникПодразделениеКод
		|ИЗ
		|	Документ.Заявка.Работы КАК ЗаявкаРаботы
		|ГДЕ
		|	ЗаявкаРаботы.Сотрудник В(&СписокСотрудников)
		|	И НЕ ЗаявкаРаботы.Ссылка.Ссылка В (&СписокДокументов)
		|	И ЗаявкаРаботы.ДатаНачала >= &ДатаНачала
		|	И ЗаявкаРаботы.ДатаОкончания <= &ДатаОкончания
		|	И ЗаявкаРаботы.Ссылка.Состояние.ТипСостояния <> ЗНАЧЕНИЕ(Перечисление.ТипыСостоянийЗаявок.Отменена)
		|	И ЗаявкаРаботы.Ссылка.ПометкаУдаления = ЛОЖЬ" + ТекстФилиал;
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.УстановитьПараметр("СписокДокументов", СписокДокументов);
	Запрос.УстановитьПараметр("СписокСотрудников", СписокОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стр = ТабДокументоРаботы.Добавить();
		ЗаполнитьЗначенияСвойств(Стр,ВыборкаДетальныеЗаписи.Ссылка);
		ЗаполнитьЗначенияСвойств(Стр,ВыборкаДетальныеЗаписи)
	КонецЦикла;
	
	Возврат ТабДокументоРаботы;
	
КонецФункции	

Функция ПроверкаНаИсключениеИзВыработки(Знач СсылкаНаЭлемент) Экспорт
	
	РодителиЭлемента = Новый Массив;
	
	РодителиЭлемента.Вставить(0, СсылкаНаЭлемент);
	
	Пока ЗначениеЗаполнено(СсылкаНаЭлемент.Родитель) Цикл
			РодителиЭлемента.Вставить(0, СсылкаНаЭлемент.Родитель);
			СсылкаНаЭлемент = СсылкаНаЭлемент.Родитель;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_ИсключенияДляВыработкиСотрудников.ГруппаНоменклатуры КАК ГруппаНоменклатуры
		|ИЗ
		|	РегистрСведений.омг_ИсключенияДляВыработкиСотрудников КАК омг_ИсключенияДляВыработкиСотрудников
		|ГДЕ
		|	омг_ИсключенияДляВыработкиСотрудников.ГруппаНоменклатуры В (&МассГрупп)";
	
	Запрос.УстановитьПараметр("МассГрупп", РодителиЭлемента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат  Истина
		
	КонецЕсли;   
	
		Возврат  Ложь
					
КонецФункции

Процедура омг_ПриЗаписиИнтеграцияСЕИПОтправкаНачисленийНаКартуПриЗаписи(Источник, Отказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не Источник.СостояниеЧековККМ = Перечисления.СостоянияЧековККМ.ЧекиПробиты Или Отказ Или Не Источник.омг_СтраховаяПрограмма.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КартыСкидок.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.КартыСкидок КАК КартыСкидок
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.омг_СоответствиеСкидокВидамКарт КАК омг_СоответствиеСкидокВидамКарт
	               |		ПО КартыСкидок.ВидКарты = омг_СоответствиеСкидокВидамКарт.ВидКарты,
	               |	(ВЫБРАТЬ
	               |		ОказаниеУслугРаботы.Ссылка КАК Ссылка
	               |	ИЗ
	               |		Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
	               |	ГДЕ
	               |		НЕ ОказаниеУслугРаботы.Номенклатура В ИЕРАРХИИ
	               |					(ВЫБРАТЬ
	               |						омг_НастройкиИнтеграцииСЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |					ИЗ
	               |						РегистрСведений.омг_НастройкиИнтеграцииСЛИС КАК омг_НастройкиИнтеграцииСЛИС)
	               |		И ОказаниеУслугРаботы.Ссылка = &Документ) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	НЕ омг_СоответствиеСкидокВидамКарт.ВидСкидки.КодЕИП = """"
	               |	И КартыСкидок.Ссылка = &Ссылка
	               |	И НЕ ВложенныйЗапрос.Ссылка ЕСТЬ NULL";
	Запрос.УстановитьПараметр("Ссылка", Источник.КартаКлиента);
	Запрос.УстановитьПараметр("Документ", Источник.Ссылка);
	ПропуститьДокумент = Запрос.Выполнить().Пустой();
	
	Если ПропуститьДокумент Тогда
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.омг_ДокументыНачисленийНаКартыЕИП.СоздатьМенеджерЗаписи();
	Запись.Документ = Источник.Ссылка;
	Запись.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура омг_ПриПроведенииОказанияУслугОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
    ПроверкаПостоянныхКлиентов(Источник, Отказ, РежимПроведения);  
		
	ПроверкаСостоянияЧеков(Источник, Отказ, РежимПроведения);
	
	ПроверкаПриемов(Источник, Отказ, РежимПроведения)

КонецПроцедуры

Процедура ПроверкаПостоянныхКлиентов(Источник, Отказ, РежимПроведения) Экспорт
	
	Если не Отказ Тогда 
		
		ЕстьПривелегии = ПривилегированныйРежим();
		
		Если не ЕстьПривелегии Тогда
			УстановитьПривилегированныйРежим(Истина)
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОказаниеУслугРаботы.Ссылка КАК Ссылка,
		|	ОказаниеУслугРаботы.Ссылка.Дата КАК Дата,
		|	ОказаниеУслугРаботы.Ссылка.Клиент КАК Клиент,
		|	ОказаниеУслугРаботы.Ссылка.НомерЧекаККМ КАК НомерЧекаККМ,
		|	ОказаниеУслугРаботы.Ссылка.ВидОперации КАК ВидОперации,
		|	ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма КАК омг_СтраховаяПрограмма,
		|	ОказаниеУслугРаботы.Ссылка.ДокументОснование КАК ДокументОснование,
		|	ОказаниеУслугРаботы.Ссылка.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ОказаниеУслугРаботы.Номенклатура.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|				ТОГДА ОказаниеУслугРаботы.Номенклатура.Родитель.Родитель.Родитель.Родитель.Код <> ""00000001705""
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ОказаниеУслугРаботы.Номенклатура.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|						ТОГДА ОказаниеУслугРаботы.Номенклатура.Родитель.Родитель.Родитель.Код <> ""00000001705""
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ОказаниеУслугРаботы.Номенклатура.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|								ТОГДА ОказаниеУслугРаботы.Номенклатура.Родитель.Родитель.Код <> ""00000001705""
		|							ИНАЧЕ ВЫБОР
		|									КОГДА ОказаниеУслугРаботы.Номенклатура.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|										ТОГДА ОказаниеУслугРаботы.Номенклатура.Родитель.Код <> ""00000001705""
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ
		|	И СТРНАЙТИ(ОказаниеУслугРаботы.Номенклатура.Наименование, ""забор"") = 0
		|	И ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма = ЗНАЧЕНИЕ(Справочник.СоглашенияСтрахования.ПустаяСсылка)
		|	И ОказаниеУслугРаботы.Ссылка.Проведен
		|	И ОказаниеУслугРаботы.Ссылка.НомерЧекаККМ > 0
		|	И ОказаниеУслугРаботы.Ссылка.Дата >= &ДатаПрошлыйГод
		|	И ОказаниеУслугРаботы.Ссылка.Клиент = &Клиент
		|	И ОказаниеУслугРаботы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ПродажаКлиенту)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОказаниеУслугРаботы.Ссылка,
		|	ОказаниеУслугРаботы.Ссылка.Дата,
		|	ОказаниеУслугРаботы.Ссылка.Клиент,
		|	ОказаниеУслугРаботы.Ссылка.НомерЧекаККМ,
		|	ОказаниеУслугРаботы.Ссылка.ВидОперации,
		|	ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма,
		|	ОказаниеУслугРаботы.Ссылка.ДокументОснование,
		|	ОказаниеУслугРаботы.Ссылка.СуммаДокумента
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОказаниеУслугРаботы.Ссылка КАК Ссылка,
		|	ОказаниеУслугРаботы.Ссылка.Дата КАК Дата,
		|	ОказаниеУслугРаботы.Ссылка.Клиент КАК Клиент,
		|	ОказаниеУслугРаботы.Ссылка.НомерЧекаККМ КАК НомерЧекаККМ,
		|	ОказаниеУслугРаботы.Ссылка.ВидОперации КАК ВидОперации,
		|	ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма КАК омг_СтраховаяПрограмма,
		|	ОказаниеУслугРаботы.Ссылка.ДокументОснование КАК ДокументОснование,
		|	ОказаниеУслугРаботы.Ссылка.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ОказаниеУслугРаботы.Номенклатура.Родитель.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|				ТОГДА ОказаниеУслугРаботы.Номенклатура.Родитель.Родитель.Родитель.Родитель.Код <> ""00000001705""
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ОказаниеУслугРаботы.Номенклатура.Родитель.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|						ТОГДА ОказаниеУслугРаботы.Номенклатура.Родитель.Родитель.Родитель.Код <> ""00000001705""
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ОказаниеУслугРаботы.Номенклатура.Родитель.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|								ТОГДА ОказаниеУслугРаботы.Номенклатура.Родитель.Родитель.Код <> ""00000001705""
		|							ИНАЧЕ ВЫБОР
		|									КОГДА ОказаниеУслугРаботы.Номенклатура.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|										ТОГДА ОказаниеУслугРаботы.Номенклатура.Родитель.Код <> ""00000001705""
		|								КОНЕЦ
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ
		|	И СТРНАЙТИ(ОказаниеУслугРаботы.Номенклатура.Наименование, ""забор"") = 0
		|	И ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма = ЗНАЧЕНИЕ(Справочник.СоглашенияСтрахования.ПустаяСсылка)
		|	И ОказаниеУслугРаботы.Ссылка.Проведен
		|	И ОказаниеУслугРаботы.Ссылка.НомерЧекаККМ > 0
		|	И ОказаниеУслугРаботы.Ссылка.Дата >= &ДатаПрошлыйГод
		|	И ОказаниеУслугРаботы.Ссылка.Клиент = &Клиент
		|	И ОказаниеУслугРаботы.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийОказанияУслуг.ВозвратКлиенту)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОказаниеУслугРаботы.Ссылка,
		|	ОказаниеУслугРаботы.Ссылка.Дата,
		|	ОказаниеУслугРаботы.Ссылка.Клиент,
		|	ОказаниеУслугРаботы.Ссылка.НомерЧекаККМ,
		|	ОказаниеУслугРаботы.Ссылка.ВидОперации,
		|	ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма,
		|	ОказаниеУслугРаботы.Ссылка.ДокументОснование,
		|	ОказаниеУслугРаботы.Ссылка.СуммаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОказаниеУслуг.ДокументОснование.Дата КАК ДокументОснованиеДата,
		|	ЕСТЬNULL(ОказаниеУслуг.ДокументОснование.Дата, НЕОПРЕДЕЛЕНО) КАК Поле1
		|ИЗ
		|	Документ.ОказаниеУслуг КАК ОказаниеУслуг
		|ГДЕ
		|	ОказаниеУслуг.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Клиенты.омг_ПостоянныйКлиент КАК ПостоянныйКлиент
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|ГДЕ
		|	Клиенты.Ссылка = &Клиент";
		

		Запрос.УстановитьПараметр("ДатаПрошлыйГод", НачалоДня(ДобавитьМесяц(Источник.Дата,-12)));
		Запрос.УстановитьПараметр("Клиент", Источник.Клиент);
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);

		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		ВыборкаПоБудущимДокументам = РезультатЗапроса[0].Выбрать();
		ВыборкаПоБудущимВозвратам = РезультатЗапроса[1].Выбрать();
		ДокументОснованиеДата = РезультатЗапроса[2].Выбрать(); 
		ПостоянныйКлиентВыборка = РезультатЗапроса[3].Выбрать();
		ПостоянныйКлиентВыборка.Следующий();
		ДокументОснованиеДата.Следующий();
		ДокументОснованиеДата = ДокументОснованиеДата.ДокументОснованиеДата;
		МасВремени = Новый Массив;
		Пока ВыборкаПоБудущимДокументам.Следующий() Цикл
			ПостоянныйКлиент = Истина;
			ВыборкаПоБудущимВозвратам.Сбросить();
			СтрПоиска = Новый Структура;
			СтрПоиска.Вставить("ДокументОснование",ВыборкаПоБудущимДокументам.Ссылка);
			Если ВыборкаПоБудущимВозвратам.НайтиСледующий(СтрПоиска) Тогда
				Если ВыборкаПоБудущимВозвратам.СуммаДокумента >= ВыборкаПоБудущимДокументам.СуммаДокумента Тогда
					ПостоянныйКлиент = Ложь;	 
				КонецЕсли; 
				Если РежимПроведения = Неопределено и ВыборкаПоБудущимДокументам.Ссылка = Источник.ДокументОснование Тогда
					ПостоянныйКлиент = Истина;
				КонецЕсли;
			КонецЕсли; 
			Если ПостоянныйКлиент Тогда  
				Если РежимПроведения = Неопределено и ВыборкаПоБудущимДокументам.Ссылка = Источник.Ссылка Тогда 
				иначе
					МасВремени.Добавить(ВыборкаПоБудущимДокументам.Ссылка.МоментВремени());
				КонецЕсли;
			КонецЕсли;			
		КонецЦикла;  
		
		КолВремен = МасВремени.Количество();
		
		Если КолВремен > 0 Тогда   
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	омг_ПостоянныеКлиенты.Период КАК Период,
			|	омг_ПостоянныеКлиенты.Клиент КАК Клиент,
			|	омг_ПостоянныеКлиенты.ОказаниеУслуг КАК ОказаниеУслуг,
			|	омг_ПостоянныеКлиенты.Постоянный КАК Постоянный,
			|	омг_ПостоянныеКлиенты.ДоДаты КАК ДоДаты
			|ИЗ
			|	РегистрСведений.омг_ПостоянныеКлиенты КАК омг_ПостоянныеКлиенты
			|ГДЕ
			|	омг_ПостоянныеКлиенты.Клиент = &Клиент
			|	И омг_ПостоянныеКлиенты.Период >= &ДатаНачала";
			
			Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Источник.Дата));
			Запрос.УстановитьПараметр("Клиент", Источник.Клиент);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
				
				НоваяЗапись = РегистрыСведений.омг_ПостоянныеКлиенты.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(НоваяЗапись,ВыборкаДетальныеЗаписи);
				НоваяЗапись.Удалить();
				
			КонецЦикла;
			
			сч = 1;   
			ВремяДата1 = Источник.Дата;  
		
			ДатаМин = ?(Источник.ВидОперации = Перечисления.ВидыОперацийОказанияУслуг.ВозвратКлиенту,ДокументОснованиеДата,Источник.Дата);
			
			Для каждого СтрМасВремени из МасВремени Цикл
				
				Если сч = 2 и СтрМасВремени.Дата >= ДатаМин Тогда
					
					Если СтрМасВремени.Дата <= ДобавитьМесяц(ВремяДата1,12) Тогда
						НоваяЗапись = РегистрыСведений.омг_ПостоянныеКлиенты.СоздатьМенеджерЗаписи();
						НоваяЗапись.Период = НачалоДня(СтрМасВремени.Дата);
						НоваяЗапись.ДоДаты = КонецДня(ДобавитьМесяц(СтрМасВремени.Дата,12));
						НоваяЗапись.Клиент = Источник.Клиент;
						НоваяЗапись.ОказаниеУслуг = СтрМасВремени.Ссылка; 
						НоваяЗапись.Постоянный = Истина; 
						НоваяЗапись.Записать(Истина);					
					КонецЕсли;
					
				иначе
					сч = 2;
				КонецЕсли;
				
				ВремяДата1 = СтрМасВремени.Дата;
				
			КонецЦикла;	
		КонецЕсли; 
		
		ПостоянныйКлиент = Ложь;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_ПостоянныеКлиентыСрезПоследних.Клиент КАК Клиент,
		|	омг_ПостоянныеКлиентыСрезПоследних.ДоДаты КАК ДоДаты,
		|	омг_ПостоянныеКлиентыСрезПоследних.Клиент.омг_ПостоянныйКлиент КАК ПостоянныйКлиент
		|ИЗ
		|	РегистрСведений.омг_ПостоянныеКлиенты.СрезПоследних(, Клиент = &Клиент) КАК омг_ПостоянныеКлиентыСрезПоследних";
		
		Запрос.УстановитьПараметр("Клиент", Источник.Клиент);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда  
			
			Если ВыборкаДетальныеЗаписи.ДоДаты >= ТекущаяДата() Тогда
				ПостоянныйКлиент = Истина
			КонецЕсли;	
			
		КонецЕсли;
		
		Если не ПостоянныйКлиент = ПостоянныйКлиентВыборка.ПостоянныйКлиент  Тогда
			КлиентОбъект =  Источник.Клиент.ПолучитьОбъект();
			КлиентОбъект.омг_ПостоянныйКлиент = ПостоянныйКлиент; 
			КлиентОбъект.ОбменДанными.Загрузка = Истина;
			КлиентОбъект.Записать();
		КонецЕсли;	
			
		Если не ЕстьПривелегии Тогда
			УстановитьПривилегированныйРежим(Ложь)
		КонецЕсли;

	КонецЕсли;	  
	
КонецПроцедуры	

Функция омг_ПроверкаПометкиНаУдаление(ДокСсылка) Экспорт
	
	Возврат ДокСсылка.ПометкаУдаления;
	
КонецФункции   

Функция омг_ПроверкаПроведения(ДокСсылка) Экспорт
	
	Возврат ДокСсылка.Проведен;
	
КонецФункции

Функция омг_ПроверкаВозвратов(Основание,Сотрудник,Клиент,Касса,ЭквайринговыйТерминалНаФорме,Работы) Экспорт
	
	ВозвЗначение = Истина;
	ТекстОшибки = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОказаниеУслуг.Сотрудник КАК Сотрудник,
		|	ОказаниеУслуг.Клиент КАК Клиент,
		|	ОказаниеУслуг.Касса КАК Касса
		|ИЗ
		|	Документ.ОказаниеУслуг КАК ОказаниеУслуг
		|ГДЕ
		|	ОказаниеУслуг.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ОказаниеУслуг.Клиент,
		|	ОказаниеУслуг.Касса,
		|	ОказаниеУслуг.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОказаниеУслугРаботы.Номенклатура КАК Номенклатура,
		|	СУММА(ОказаниеУслугРаботы.Количество) КАК Количество
		|ИЗ
		|	Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
		|ГДЕ
		|	ОказаниеУслугРаботы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ОказаниеУслугРаботы.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОказаниеУслугОплата.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал
		|ИЗ
		|	Документ.ОказаниеУслуг.Оплата КАК ОказаниеУслугОплата
		|ГДЕ
		|	ОказаниеУслугОплата.Ссылка = &Ссылка
		|	И ОказаниеУслугОплата.ЭквайринговыйТерминал = &ЭквайринговыйТерминал
		|
		|СГРУППИРОВАТЬ ПО
		|	ОказаниеУслугОплата.ЭквайринговыйТерминал";
	
	Запрос.УстановитьПараметр("Ссылка", Основание);
	Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ЭквайринговыйТерминалНаФорме);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаРеквизиты = РезультатЗапроса[0].Выбрать(); 
	ВыборкаНоменклатура = РезультатЗапроса[1].Выбрать();
    ВыборкаОплаты = РезультатЗапроса[2].Выбрать();
	
	Если ВыборкаРеквизиты.Следующий() Тогда
		
		Если не ВыборкаРеквизиты.Сотрудник = Сотрудник Тогда
			
			ТекстОшибки = ТекстОшибки + " Врач ";
			
		КонецЕсли;	
		
		Если не ВыборкаРеквизиты.Клиент = Клиент Тогда
			
			ТекстОшибки = ТекстОшибки + " Клиент ";
			
		КонецЕсли; 
		
		Если не ВыборкаРеквизиты.Касса = Касса Тогда
			
			ТекстОшибки = ТекстОшибки + " Касса ";
			
		КонецЕсли;
		
	иначе
		
		Возврат Ложь;

	КонецЕсли;  
	
	ТекстОшибкиНоменклатура = "";
	
	Для каждого строкаВозврата из Работы Цикл
		
		СтрПоиска = Новый Структура("Номенклатура",строкаВозврата.Номенклатура);
		ВыборкаНоменклатура.Сбросить();
		Если ВыборкаНоменклатура.НайтиСледующий(СтрПоиска) Тогда
			Если строкаВозврата.Количество > ВыборкаНоменклатура.Количество Тогда 
				ТекстОшибкиНоменклатура = ТекстОшибкиНоменклатура + " "+строкаВозврата.Номенклатура + "";
			КонецЕсли;		
		Иначе
			 ТекстОшибкиНоменклатура = ТекстОшибкиНоменклатура + " "+строкаВозврата.Номенклатура + "";
		КонецЕсли;	
			
	КонецЦикла;	
	
	ТекстОшибкиТерминал = "";

	Если ЗначениеЗаполнено(ЭквайринговыйТерминалНаФорме) и не ВыборкаОплаты.Следующий() Тогда
		
		ТекстОшибкиТерминал = "Отличается терминал в документе основания и в возврате!";
		
	КонецЕсли;
	
	Если не ТекстОшибки = "" или не ТекстОшибкиНоменклатура = "" или не ТекстОшибкиТерминал = "" Тогда
		Сообщение = Новый СообщениеПользователю;
		ТекстИтог = "";
		Если не ТекстОшибки = "" Тогда
			    ТекстИтог = "Отличаются значения " + ТекстОшибки + " в документе основания и в возврате!" + Символы.ПС;	
		КонецЕсли;
	    Если не ТекстОшибкиНоменклатура = "" Тогда
			    ТекстИтог = ТекстИтог + "Превышает количество и/или различаются следующие работы "+ ТекстОшибкиНоменклатура+ " в документе основания и в возврате!" + Символы.ПС;	
		КонецЕсли;
		
		Если не ТекстОшибкиТерминал = "" Тогда
			    ТекстИтог = ТекстИтог + ТекстОшибкиТерминал;	
		КонецЕсли;
        Сообщение.Текст = ТекстИтог;
		Сообщение.Сообщить(); 
		Возврат Ложь;
	КонецЕсли; 
	
	    Возврат Истина;
	
КонецФункции

Функция ПроверитьПервичныйПрием(ОбъектПрием) Экспорт
	
	ВозЗначение = Неопределено;
	КолДней = 0;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОМГ_НастройкиПовторныхПриемов.Клиника КАК Клиника,
	|	ОМГ_НастройкиПовторныхПриемов.Специализация КАК Специализация,
	|	ОМГ_НастройкиПовторныхПриемов.Врач КАК Врач,
	|	ОМГ_НастройкиПовторныхПриемов.КоличествоДней КАК КоличествоДней
	|ИЗ
	|	РегистрСведений.ОМГ_НастройкиПовторныхПриемов КАК ОМГ_НастройкиПовторныхПриемов
	|
	|СГРУППИРОВАТЬ ПО
	|	ОМГ_НастройкиПовторныхПриемов.Специализация,
	|	ОМГ_НастройкиПовторныхПриемов.Врач,
	|	ОМГ_НастройкиПовторныхПриемов.Клиника,
	|	ОМГ_НастройкиПовторныхПриемов.КоличествоДней
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиСпециализации.Специализация КАК Специализация
	|ИЗ
	|	Справочник.Сотрудники.Специализации КАК СотрудникиСпециализации
	|ГДЕ
	|	СотрудникиСпециализации.Ссылка = &Сотрудник";   
	
	Запрос.УстановитьПараметр("Сотрудник",ОбъектПрием.Врач);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаНастройки = РезультатЗапроса[0].Выбрать();  
	ВыборкаСпециализации = РезультатЗапроса[1].Выбрать();
	ИтоговаяСтруктура = Неопределено;
	// ищем по врачу 	 
	
	// Врач, специализаци, клиника 
	СтрПоиска = Новый Структура;
	Пока ВыборкаСпециализации.Следующий() Цикл 	
		СтрПоиска.Вставить("Врач",ОбъектПрием.Врач);
		СтрПоиска.Вставить("Клиника",ОбъектПрием.Филиал); 	
		СтрПоиска.Вставить("Специализация",ВыборкаСпециализации.Специализация);  
		ВыборкаНастройки.Сбросить();
		Если ВыборкаНастройки.НайтиСледующий(СтрПоиска) Тогда			
			КолДней = ВыборкаНастройки.КоличествоДней;
			ИтоговаяСтруктура = СтрПоиска;
			Прервать;   		
		КонецЕсли;   
	КонецЦикла;    
	
	Если КолДней = 0 Тогда	
		// Врач, специализаци 
		СтрПоиска.Вставить("Клиника",Справочники.Филиалы.ПустаяСсылка());
		Пока ВыборкаСпециализации.Следующий() Цикл 		
			СтрПоиска.Вставить("Врач",ОбъектПрием.Врач);		
			СтрПоиска.Вставить("Специализация",ВыборкаСпециализации.Специализация);  
			ВыборкаНастройки.Сбросить();
			Если ВыборкаНастройки.НайтиСледующий(СтрПоиска) Тогда	
				КолДней = ВыборкаНастройки.КоличествоДней; 
				ИтоговаяСтруктура = СтрПоиска;
				Прервать;   	
			КонецЕсли;   
		КонецЦикла;  
	КонецЕсли; 
	
	Если КолДней = 0 Тогда
		// Врач		
		СтрПоиска.Вставить("Врач",ОбъектПрием.Врач);
		СтрПоиска.Вставить("Клиника",Справочники.Филиалы.ПустаяСсылка());	
		СтрПоиска.Вставить("Специализация",Справочники.КатегорииВыработки.ПустаяСсылка());	
		ВыборкаНастройки.Сбросить();
		Если ВыборкаНастройки.НайтиСледующий(СтрПоиска) Тогда			
			КолДней = ВыборкаНастройки.КоличествоДней; 
			ИтоговаяСтруктура = СтрПоиска;
		КонецЕсли;	
	КонецЕсли;	
	
	// ищем по клинике 	 
	
	//  специализаци, клиника 
	Если КолДней = 0 Тогда	
		СтрПоиска.Вставить("Врач",Справочники.Сотрудники.ПустаяСсылка());
		Пока ВыборкаСпециализации.Следующий() Цикл 
			СтрПоиска.Вставить("Клиника",ОбъектПрием.Филиал);	
			СтрПоиска.Вставить("Специализация",ВыборкаСпециализации.Специализация);  
			ВыборкаНастройки.Сбросить();
			Если ВыборкаНастройки.НайтиСледующий(СтрПоиска) Тогда	
				КолДней = ВыборкаНастройки.КоличествоДней; 
				ИтоговаяСтруктура = СтрПоиска;
				Прервать;   	
			КонецЕсли;   
		КонецЦикла;    
		
	КонецЕсли;
	
	Если КолДней = 0 Тогда
		// Клиника		
		СтрПоиска.Вставить("Врач",Справочники.Сотрудники.ПустаяСсылка());
		СтрПоиска.Вставить("Клиника",ОбъектПрием.Филиал);	
		СтрПоиска.Вставить("Специализация",Справочники.КатегорииВыработки.ПустаяСсылка());	
		ВыборкаНастройки.Сбросить();
		Если ВыборкаНастройки.НайтиСледующий(СтрПоиска) Тогда	
			КолДней = ВыборкаНастройки.КоличествоДней; 
			ИтоговаяСтруктура = СтрПоиска;		
		КонецЕсли;	
	КонецЕсли;
	
	// ищем по специализаци 	 
	
	//  специализаци
	Если КолДней = 0 Тогда
			СтрПоиска.Вставить("Врач",Справочники.Сотрудники.ПустаяСсылка());
			СтрПоиска.Вставить("Клиника",Справочники.Филиалы.ПустаяСсылка());
		Пока ВыборкаСпециализации.Следующий() Цикл 
			СтрПоиска.Вставить("Специализация",ВыборкаСпециализации.Специализация);  
			ВыборкаНастройки.Сбросить();
			Если ВыборкаНастройки.НайтиСледующий(СтрПоиска) Тогда	
				КолДней = ВыборкаНастройки.КоличествоДней; 
				ИтоговаяСтруктура = СтрПоиска;
				Прервать;   	
			КонецЕсли;   
		КонецЦикла;    
		
	КонецЕсли;  
	
	Если не КолДней = 0 Тогда  
		//	СтрПоиска.Вставить("Врач",ОбъектПрием.Врач);
		//СтрПоиска.Вставить("Клиника",ОбъектПрием.Филиал); 	
		//СтрПоиска.Вставить("Специализация",ВыборкаСпециализации.Специализация); 	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Прием.Ссылка КАК Ссылка,
		|	СотрудникиСпециализации.Специализация КАК Специализация,
		|	Прием.Врач КАК Врач,
		|	Прием.Филиал КАК Клиника
		|ИЗ
		|	Документ.Прием КАК Прием
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.Специализации КАК СотрудникиСпециализации
		|		ПО Прием.Врач = СотрудникиСпециализации.Ссылка
		|ГДЕ
		|	Прием.Проведен
		|	И Прием.Клиент = &Клиент
		|	И Прием.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("Клиент", ОбъектПрием.Клиент);
	Запрос.УстановитьПараметр("ДатаНачала", ТекущаяДата() - (КолДней * 24*60*60 ));
	Запрос.УстановитьПараметр("ДатаОкончания", ТекущаяДата());

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтрПоиска = Новый Структура;
	
	Для Каждого Элемент Из ИтоговаяСтруктура Цикл
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			СтрПоиска.Вставить(Элемент.Ключ,Элемент.Значение)	
		КонецЕсли;	
    КонецЦикла;
	
	Если ВыборкаДетальныеЗаписи.НайтиСледующий(СтрПоиска) Тогда
	
		
		ВозЗначение = ВыборкаДетальныеЗаписи.Ссылка;
	
	КонецЕсли; 
	
	КонецЕсли; 
	Возврат  ВозЗначение
	
КонецФункции	

Процедура КонтрольПоНоменклатуре(ДокументОбъект, ЭтоУдаление = Ложь) Экспорт

	Возврат;
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаявкаСсылка = Неопределено;
		
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.Заявка") Тогда
		ЗаявкаСсылка = ДокументОбъект.Ссылка 
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(ЗаявкаСсылка) Тогда 
		
		Если ЗначениеЗаполнено(ДокументОбъект.ДокументОснование) Тогда
			Если ТипЗнч(ДокументОбъект.ДокументОснование.Ссылка) = Тип("ДокументСсылка.Заявка") Тогда
				ЗаявкаСсылка = ДокументОбъект.ДокументОснование.Ссылка	
			КонецЕсли;				
		КонецЕсли;
		
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(ЗаявкаСсылка) Тогда  
		УстановитьПривилегированныйРежим(Ложь);
		Возврат;	 	 
	КонецЕсли;	
	
	//Если не ТипЗнч(ЗаявкаСсылка) = Тип("ДокументСсылка.Заявка") Тогда  
	//	УстановитьПривилегированныйРежим(Ложь);
	//	Возврат;	 	 
	//КонецЕсли;
	//
	Запрос = Новый Запрос;
	Запрос.Текст  = 
	"ВЫБРАТЬ
	|	омг_НоменклатураЗаявок.Регистратор.Ссылка КАК ДокЗаявки,
	|	омг_НоменклатураЗаявок.Номенклатура КАК Номенклатура,
	|	омг_НоменклатураЗаявок.Клиент КАК Клиент,
	|	омг_НоменклатураЗаявок.Врач КАК Врач,
	|	омг_НоменклатураЗаявок.Филиал КАК Филиал,
	|	омг_НоменклатураЗаявок.омг_СтраховаяПрограмма КАК омг_СтраховаяПрограмма,
	|	омг_НоменклатураЗаявок.Количество КАК КоличествоВЗаявке,
	|	омг_НоменклатураЗаявок.Регистратор.Дата КАК ДатаЗаявки,
	|	омг_НоменклатураЗаявок.УникНомерСтрокиЗаявка КАК УникНомерСтрокиЗаявка
	|ИЗ
	|	РегистрСведений.омг_НоменклатураЗаявок КАК омг_НоменклатураЗаявок
	|ГДЕ
	|	омг_НоменклатураЗаявок.Регистратор.Ссылка = &ЗаявкаСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	омг_НоменклатураОказанияУслуг.Регистратор.Ссылка КАК ДокОказания,
	|	омг_НоменклатураОказанияУслуг.Номенклатура КАК Номенклатура,
	|	омг_НоменклатураОказанияУслуг.Клиент КАК Клиент,
	|	омг_НоменклатураОказанияУслуг.Врач КАК Врач,
	|	омг_НоменклатураОказанияУслуг.Филиал КАК Филиал,
	|	омг_НоменклатураОказанияУслуг.омг_СтраховаяПрограмма КАК омг_СтраховаяПрограмма,
	|	омг_НоменклатураОказанияУслуг.Количество КАК КоличествоВОказании,
	|	омг_НоменклатураОказанияУслуг.Регистратор.ДокументОснование КАК РегистраторДокументОснование,
	|	ЛОЖЬ КАК Исп,
	|	омг_НоменклатураОказанияУслуг.Регистратор.ДокументОснование КАК ДокЗаявки,
	|	омг_НоменклатураОказанияУслуг.Регистратор.Дата КАК ДатаОказания,
	|	омг_НоменклатураОказанияУслуг.Регистратор.ДокументОснование.Дата КАК ДатаЗаявки,
	|	омг_НоменклатураОказанияУслуг.СуммаВОказании КАК СуммаВОказании,
	|	омг_НоменклатураОказанияУслуг.УникНомерСтрокиОказание КАК УникНомерСтрокиОказание
	|ИЗ
	|	РегистрСведений.омг_НоменклатураОказанияУслуг КАК омг_НоменклатураОказанияУслуг
	|ГДЕ
	|	омг_НоменклатураОказанияУслуг.Регистратор.ДокументОснование = &ЗаявкаСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	омг_НоменклатураПриема.Регистратор.Ссылка КАК РегистраторСсылка,
	|	омг_НоменклатураПриема.Номенклатура КАК Номенклатура,
	|	омг_НоменклатураПриема.Клиент КАК Клиент,
	|	омг_НоменклатураПриема.Врач КАК Врач,
	|	омг_НоменклатураПриема.Филиал КАК Филиал,
	|	омг_НоменклатураПриема.омг_СтраховаяПрограмма КАК омг_СтраховаяПрограмма,
	|	омг_НоменклатураПриема.Количество КАК КоличествоВПриеме,
	|	омг_НоменклатураПриема.Регистратор.ДокументОснование КАК РегистраторДокументОснование,
	|	ЛОЖЬ КАК Исп,
	|	омг_НоменклатураПриема.Регистратор.ДокументОснование КАК ДокЗаявки,
	|	омг_НоменклатураПриема.Регистратор.ДокументОснование.Дата КАК ДатаЗаявки,
	|	омг_НоменклатураПриема.Регистратор КАК ДокПриема,
	|	омг_НоменклатураПриема.Регистратор.Дата КАК ДатаПриема,
	|	омг_НоменклатураПриема.УникНомерСтрокиПрием КАК УникНомерСтрокиПрием
	|ИЗ
	|	РегистрСведений.омг_НоменклатураПриема КАК омг_НоменклатураПриема
	|ГДЕ
	|	омг_НоменклатураПриема.Регистратор.ДокументОснование = &ЗаявкаСсылка";
	
	Запрос.УстановитьПараметр("ЗаявкаСсылка",ЗаявкаСсылка);	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ВыборкаЗаявки = РезультатЗапроса[0].Выбрать();
	ТабОказания = РезультатЗапроса[1].Выгрузить(); 
	ТабПриемы = РезультатЗапроса[2].Выгрузить();
	
	НаборЗаписейомг_НоменклатураКонтроль = РегистрыСведений.омг_НоменклатураКонтроль.СоздатьНаборЗаписей(); 
	НаборЗаписейомг_НоменклатураКонтроль.Отбор.ДокЗаявки.Установить(ЗаявкаСсылка);
	
	Пока ВыборкаЗаявки.Следующий() Цикл
		
		НоваяЗапись = НаборЗаписейомг_НоменклатураКонтроль.Добавить();  
		ЗаполнитьЗначенияСвойств(НоваяЗапись,ВыборкаЗаявки);
		КоличествоОказания = 0;
		КоличествоПрием    = 0;
		СтрПоиска = Новый Структура();
		СтрПоиска.Вставить("Номенклатура",ВыборкаЗаявки.Номенклатура);
		СтрПоиска.Вставить("Клиент",ВыборкаЗаявки.Клиент);
		СтрПоиска.Вставить("Врач",ВыборкаЗаявки.Врач);
		СтрПоиска.Вставить("Филиал",ВыборкаЗаявки.Филиал);
		СтрПоиска.Вставить("омг_СтраховаяПрограмма",ВыборкаЗаявки.омг_СтраховаяПрограмма);
		СтрПоиска.Вставить("РегистраторДокументОснование",ВыборкаЗаявки.ДокЗаявки);		
		// Ищем по Оказаниям 
		НайдСтрокиОказания = ТабОказания.НайтиСтроки(СтрПоиска);
		СуммаВОказании = 0;
		Если НайдСтрокиОказания.Количество() > 0 Тогда
			
			КоличествоЗаявки = ВыборкаЗаявки.КоличествоВЗаявке;
			Для каждого строка из НайдСтрокиОказания Цикл
				Если КоличествоЗаявки > 0 и строка.КоличествоВОказании > 0 Тогда
					Если строка.КоличествоВОказании = КоличествоЗаявки Тогда 
						КоличествоОказания = КоличествоЗаявки;					
						строка.КоличествоВОказании = 0;
						строка.Исп = Истина;
						КоличествоЗаявки = 0; 
					ИначеЕсли строка.КоличествоВОказании > КоличествоЗаявки Тогда
						КоличествоОказания = КоличествоЗаявки; 
						строка.КоличествоВОказании = строка.КоличествоВОказании - КоличествоЗаявки;
						КоличествоЗаявки = 0;
					иначе 
						КоличествоОказания = КоличествоОказания + строка.КоличествоВОказании;
						КоличествоЗаявки = КоличествоЗаявки - строка.КоличествоВОказании;
						строка.КоличествоВОказании = 0;
						строка.Исп = Истина;
					КонецЕсли;
					НоваяЗапись.ДокОказания = строка.ДокОказания;
					НоваяЗапись.ДатаОказания = строка.ДатаОказания; 
					НоваяЗапись.УникНомерСтрокиОказание = строка.УникНомерСтрокиОказание; 
					СуммаВОказании = строка.СуммаВОказании;
				КонецЕсли;	
			КонецЦикла;	
			
		КонецЕсли;
		НоваяЗапись.КоличествоВОказании = КоличествоОказания;  
	    НоваяЗапись.СуммаВОказании = КоличествоОказания * СуммаВОказании; 
		// Ищем по Приемам 
		НайдСтрокиПриема = ТабПриемы.НайтиСтроки(СтрПоиска); 
		Если НайдСтрокиПриема.Количество() > 0 Тогда
			
			КоличествоЗаявки = ВыборкаЗаявки.КоличествоВЗаявке;
			Для каждого строка из НайдСтрокиПриема Цикл
				Если КоличествоЗаявки > 0 и строка.КоличествоВПриеме > 0 Тогда
					Если строка.КоличествоВПриеме = КоличествоЗаявки Тогда 
						КоличествоПрием = КоличествоЗаявки;
						строка.КоличествоВПриеме = 0;
						строка.Исп = Истина;
						КоличествоЗаявки = 0; 
					ИначеЕсли строка.КоличествоВПриеме > КоличествоЗаявки Тогда
						КоличествоПрием = КоличествоЗаявки;
						строка.КоличествоВПриеме = строка.КоличествоВПриеме - КоличествоЗаявки;
						КоличествоЗаявки = 0;
					иначе 
						КоличествоПрием = КоличествоПрием + строка.КоличествоВПриеме;
						КоличествоЗаявки = КоличествоЗаявки - строка.КоличествоВПриеме;
						строка.КоличествоВПриеме = 0; 
						строка.Исп = Истина;
					КонецЕсли;
					НоваяЗапись.ДокПриема = строка.ДокПриема;
					НоваяЗапись.ДатаПриема = строка.ДатаПриема; 
					НоваяЗапись.УникНомерСтрокиПрием = строка.УникНомерСтрокиПрием;
				КонецЕсли;	
			КонецЦикла;	
			
		КонецЕсли;
		НоваяЗапись.КоличествоВПриеме = КоличествоПрием; 	
	КонецЦикла;
	СтрПоиска = Новый Структура();
	СтрПоиска.Вставить("Исп",Ложь);   
	НаборЗаписейомг_НоменклатураКонтроль.Записать();

	// Ищем по Не использованные строки Оказания 
	НайдСтрокиОказания = ТабОказания.НайтиСтроки(СтрПоиска); 
	Если НайдСтрокиОказания.Количество() > 0 Тогда
		Для каждого строка из НайдСтрокиОказания Цикл
			Если строка.КоличествоВОказании > 0 Тогда     
				НаборЗаписейомг_НоменклатураКонтроль = РегистрыСведений.омг_НоменклатураКонтроль.СоздатьНаборЗаписей(); 
				НаборЗаписейомг_НоменклатураКонтроль.Отбор.ДокОказания.Установить(строка.ДокОказания); 
				НаборЗаписейомг_НоменклатураКонтроль.Отбор.ДокЗаявки.Установить(Неопределено); 
				НаборЗаписейомг_НоменклатураКонтроль.Отбор.Номенклатура.Установить(строка.Номенклатура);
				НоваяЗапись = НаборЗаписейомг_НоменклатураКонтроль.Добавить();  
				ЗаполнитьЗначенияСвойств(НоваяЗапись,строка);
				НоваяЗапись.ДокЗаявки = Неопределено; 
				НоваяЗапись.ДатаЗаявки = Дата(1,1,1);
				НоваяЗапись.КоличествоВЗаявке = 0;
				НоваяЗапись.КоличествоВПриеме = 0;
				НоваяЗапись.КоличествоВОказании = строка.КоличествоВОказании;
				НоваяЗапись.СуммаВОказании = НоваяЗапись.КоличествоВОказании * строка.СуммаВОказании; 
				НоваяЗапись.ДокОказания = строка.ДокОказания;
				НоваяЗапись.ДатаОказания = строка.ДатаОказания; 
				НоваяЗапись.УникНомерСтрокиОказание = строка.УникНомерСтрокиОказание; 
				// дополняем из приемов 
				КоличествоПрием = 0;
				СтрПоиска2 = Новый Структура();
				СтрПоиска2.Вставить("Исп",Ложь); 
				СтрПоиска2.Вставить("РегистраторДокументОснование",строка.РегистраторДокументОснование); 
				СтрПоиска2.Вставить("Номенклатура",строка.Номенклатура);
				СтрПоиска2.Вставить("Клиент",строка.Клиент);
				СтрПоиска2.Вставить("Врач",строка.Врач);
				СтрПоиска2.Вставить("Филиал",строка.Филиал);
				СтрПоиска2.Вставить("омг_СтраховаяПрограмма",строка.омг_СтраховаяПрограмма);	
				НайдСтрокиПриема = ТабПриемы.НайтиСтроки(СтрПоиска2); 
				Если НайдСтрокиПриема.Количество() > 0 Тогда
					Для каждого строкаПрием из НайдСтрокиПриема Цикл
						Если строкаПрием.КоличествоВПриеме > 0 Тогда 
							КоличествоПрием = КоличествоПрием + строкаПрием.КоличествоВПриеме;
							строкаПрием.КоличествоВПриеме = 0;
							строкаПрием.Исп = Истина;
						КонецЕсли;
					НоваяЗапись.ДокПриема = строкаПрием.ДокПриема;
					НоваяЗапись.ДатаПриема = строкаПрием.ДатаПриема; 
					НоваяЗапись.УникНомерСтрокиПрием = строкаПрием.УникНомерСтрокиПрием;
					КонецЦикла;	
				КонецЕсли;
				НоваяЗапись.КоличествоВПриеме = КоличествоПрием;
				НаборЗаписейомг_НоменклатураКонтроль.Записать();
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
	// Ищем по Не использованные строки Приема 
	НайдСтрокиПриема = ТабПриемы.НайтиСтроки(СтрПоиска); 
	Если НайдСтрокиПриема.Количество() > 0 Тогда
		Для каждого строка из НайдСтрокиПриема Цикл
			Если строка.КоличествоВПриеме > 0 Тогда  
				НаборЗаписейомг_НоменклатураКонтроль = РегистрыСведений.омг_НоменклатураКонтроль.СоздатьНаборЗаписей(); 
				НаборЗаписейомг_НоменклатураКонтроль.Отбор.ДокОказания.Установить(Неопределено); 
				НаборЗаписейомг_НоменклатураКонтроль.Отбор.ДокЗаявки.Установить(Неопределено);
                НаборЗаписейомг_НоменклатураКонтроль.Отбор.ДокПриема.Установить(строка.ДокПриема);
				НаборЗаписейомг_НоменклатураКонтроль.Отбор.Номенклатура.Установить(строка.Номенклатура);
				НоваяЗапись = НаборЗаписейомг_НоменклатураКонтроль.Добавить();  
				ЗаполнитьЗначенияСвойств(НоваяЗапись,строка);
				НоваяЗапись.ДокЗаявки = Неопределено; 
				НоваяЗапись.ДатаЗаявки = Дата(1,1,1);  
				НоваяЗапись.ДокОказания = Неопределено; 
				НоваяЗапись.ДатаОказания = Дата(1,1,1);
				НоваяЗапись.КоличествоВОказании = 0;
				НоваяЗапись.КоличествоВЗаявке = 0;
				НоваяЗапись.КоличествоВПриеме = строка.КоличествоВПриеме; 
				НоваяЗапись.ДокПриема = строка.ДокПриема;
				НоваяЗапись.ДатаПриема = строка.ДатаПриема;
				НоваяЗапись.УникНомерСтрокиПрием = строка.УникНомерСтрокиПрием;
				НаборЗаписейомг_НоменклатураКонтроль.Записать();
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	
	НаборЗаписейомг_НоменклатураКонтроль.Записать();
	УстановитьПривилегированныйРежим(Ложь);  
	
КонецПроцедуры	

Функция ПолучитьПрочиеНастройкиСистемы() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ПрочиеНастройкиСистемы");
	Если Настройки = Неопределено Тогда
		Настройки = Новый Структура;
	Иначе
		Настройки = Настройки.Получить();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Настройки;
	
КонецФункции

Функция ПолучитьМакетШаблонаHTML(Шаблон) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Ключ = "_" + СтрЗаменить(Шаблон.УникальныйИдентификатор(), "-", "");
	
	Настройки = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ШаблоныHTML", Ключ);
	Если Не Настройки = Неопределено Тогда
		Настройки = Настройки.Получить();
		Если Настройки.Свойство("МакетСтационара") Тогда
			ТекстРедактораHTML = Настройки.МакетСтационара.Получить();
		Иначе
			ТекстРедактораHTML = Обработки.доп_ВыписнойЭпикриз.ПолучитьМакет("Шаблон").ПолучитьТекст();
		КонецЕсли;
	Иначе
		ТекстРедактораHTML = Обработки.доп_ВыписнойЭпикриз.ПолучитьМакет("Шаблон").ПолучитьТекст();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТекстРедактораHTML;
	
КонецФункции

Процедура омг_БлокировкаНаборовСИстекшимПериодом() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	НЕ Номенклатура.Архив
	               |	И НЕ Номенклатура.омг_ДатаОкончанияДействияНабора = ДАТАВРЕМЯ(1, 1, 1)
	               |	И Номенклатура.омг_ДатаОкончанияДействияНабора <= &ТекущаяДата
	               |	И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры";
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ВидНоменклатуры", Перечисления.ВидыНоменклатуры.Набор);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ЗаписьЖурналаРегистрации("ОМГ: Начало блокировки наборов", УровеньЖурналаРегистрации.Информация,,, "К блокировки подготовлено: " + Выборка.Количество() + " позиций.");
	
	Счетчик = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			НоменклатураОбъект = Выборка.Ссылка.ПолучитьОбъект();
			НоменклатураОбъект.Архив = Истина;
			НоменклатураОбъект.омг_ПричинаАрхивирования = "Автоматическая блокировка номенклатуры в связи с истекшим периодом действия цены.";
			НоменклатураОбъект.Записать();
			Счетчик = Счетчик + 1;
		Исключение
			
		КонецПопытки;
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("ОМГ: Окончание блокировки наборов", УровеньЖурналаРегистрации.Информация,,, "Заблокировано : " + Счетчик + " позиций.");
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПроверкаСостоянияЧеков(Источник, Отказ, РежимПроведения)
	
	ЕстьПривелегии = ПривилегированныйРежим();
	
	Если не ЕстьПривелегии Тогда
		УстановитьПривилегированныйРежим(Истина)
	КонецЕсли; 
	
	Набор = РегистрыСведений.омг_ОказанияУслугБезЧеков.СоздатьНаборЗаписей();
	Набор.Отбор.ОказаниеУслуг.Установить(Источник.Ссылка);
		
	Если не РежимПроведения = Неопределено Тогда		
		Если не Источник.СостояниеЧековККМ = Перечисления.СостоянияЧековККМ.ЧекиПробиты и
			Источник.СуммаДокумента > 0 Тогда
			НоваяЗапись = Набор.Добавить();
			НоваяЗапись.ОказаниеУслуг = Источник.Ссылка; 
			НоваяЗапись.Период = Источник.Дата;	
			НоваяЗапись.Дата = Источник.Дата;
			НоваяЗапись.Ответственный = Источник.Ответственный; 
		КонецЕсли;		
	КонецЕсли;	
	
	Набор.Записать();

	Если не ЕстьПривелегии Тогда
		УстановитьПривилегированныйРежим(Ложь)
	КонецЕсли;
			
КонецПроцедуры	


Функция омг_ОповещениеОказанияБезЧека(Ответственный,ПериодПроверки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВозЗначение = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	омг_ОказанияУслугБезЧековСрезПоследних.ОказаниеУслуг КАК ОказаниеУслуг
	|ИЗ
	|	РегистрСведений.омг_ОказанияУслугБезЧеков.СрезПоследних КАК омг_ОказанияУслугБезЧековСрезПоследних
	|ГДЕ
	|	омг_ОказанияУслугБезЧековСрезПоследних.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И омг_ОказанияУслугБезЧековСрезПоследних.Ответственный = &Ответственный";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата() - (60*60*24*ПериодПроверки)));   
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ВозЗначение = Истина
	КонецЕсли;    
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ВозЗначение;
	
КонецФункции

Функция омг_ПериодыОповещениеОказанияБезЧека() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВозЗначение = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	омг_НастройкаОповещенияОказанияУслугБезЧековСрезПоследних.ЧастотаОповещения КАК ЧастотаОповещения,
	|	омг_НастройкаОповещенияОказанияУслугБезЧековСрезПоследних.ПериодПроверки КАК ПериодПроверки
	|ИЗ
	|	РегистрСведений.омг_НастройкаОповещенияОказанияУслугБезЧеков.СрезПоследних КАК омг_НастройкаОповещенияОказанияУслугБезЧековСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ВозЗначение.Вставить("ЧастотаОповещения",ВыборкаДетальныеЗаписи.ЧастотаОповещения);
		ВозЗначение.Вставить("ПериодПроверки",ВыборкаДетальныеЗаписи.ПериодПроверки);
	иначе
		ВозЗначение.Вставить("ЧастотаОповещения",0);
		ВозЗначение.Вставить("ПериодПроверки",0);
	КонецЕсли; 
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ВозЗначение;
	
КонецФункции

Функция омг_ВыработкаВПриеме(ДатаДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ВозЗначение = Ложь;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	омг_НастройкаУчетаВыработкиСрезПоследних.УчитыватьВПриеме КАК УчитыватьВПриеме
		|ИЗ
		|	РегистрСведений.омг_НастройкаУчетаВыработки.СрезПоследних(&ДатаДокумента, ) КАК омг_НастройкаУчетаВыработкиСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
	ВозЗначение = ВыборкаДетальныеЗаписи.УчитыватьВПриеме;	
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат ВозЗначение
		
КонецФункции	


Функция омг_ВернутьСтавкуНДСДокументаОснования(ДокументОснования) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОказаниеУслуг.ОМГ_СтавкаНДС КАК ОМГ_СтавкаНДС
		|ИЗ
		|	Документ.ОказаниеУслуг КАК ОказаниеУслуг
		|ГДЕ
		|	ОказаниеУслуг.Ссылка = &ДокументОснования";
	
	Запрос.УстановитьПараметр("ДокументОснования", ДокументОснования);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.ОМГ_СтавкаНДС
		
	Иначе
		
		Возврат 0
		
	КонецЕсли;
	
	
КонецФункции

Процедура ПроверкаПриемов(Источник, Отказ, РежимПроведения)
	
	ЕстьПривелегии = ПривилегированныйРежим();
	
	Если не ЕстьПривелегии Тогда
		УстановитьПривилегированныйРежим(Истина)
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Приемомг_Заявки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Прием.омг_Заявки КАК Приемомг_Заявки
	|ГДЕ
	|	Приемомг_Заявки.Ссылка.Проведен
	|	И Приемомг_Заявки.Заявка В (&Заявки)
	|
	|СГРУППИРОВАТЬ ПО
	|	Приемомг_Заявки.Ссылка";
	
	Если Источник.ВидОперации = Перечисления.ВидыОперацийОказанияУслуг.ВозвратКлиенту Тогда
		
		  Источник = Источник.ДокументОснование.ПолучитьОбъект();
		
	КонецЕсли;
	
		
	Запрос.УстановитьПараметр("Заявки", Источник.Заявки.Выгрузить().ВыгрузитьКолонку("Заявка"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		ПриемОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ДатаКонтроля = ?(значениеЗаполнено(ПриемОбъект.ДокументОснование),ПриемОбъект.ДокументОснование.Дата,ПриемОбъект.Дата);
		
		омг_КонтрольУслугПоЗаявкам = омг_МедицинскаяДеятельность.омг_КонтрольУслугПоЗаявкам(ДатаКонтроля,ПриемОбъект.Врач);
		
		Если омг_КонтрольУслугПоЗаявкам Тогда
			ЭтотОбъект = ПриемОбъект;	
			НаборЗаписей = РегистрыНакопления.омг_НоменклатураЗаявокДляПриемов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
			
			МассивЗаявок = ЭтотОбъект.омг_Заявки.ВыгрузитьКолонку("Заявка");	
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПриемРаботы.Номенклатура КАК Номенклатура,
			|	СУММА(ЕСТЬNULL(ПриемРаботы.Количество, 0)) КАК Количество,
			|	омг_НоменклатураЗаявокДляПриемовОстатки.Заявка КАК Заявка,
			|	СУММА(ЕСТЬNULL(омг_НоменклатураЗаявокДляПриемовОстатки.КоличествоОстаток, 0)) КАК КоличествоОстатокРегистр,
			|	&Период КАК Период,
			|	ПриемРаботы.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.Прием.Работы КАК ПриемРаботы
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.омг_НоменклатураЗаявокДляПриемов.Остатки(, Заявка В (&МассивЗаявок)) КАК омг_НоменклатураЗаявокДляПриемовОстатки
			|		ПО ПриемРаботы.Номенклатура = омг_НоменклатураЗаявокДляПриемовОстатки.Номенклатура
			|ГДЕ
			|	ПриемРаботы.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	омг_НоменклатураЗаявокДляПриемовОстатки.Заявка,
			|	ПриемРаботы.Номенклатура,
			|	ПриемРаботы.Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	Номенклатура,
			|	КоличествоОстатокРегистр УБЫВ";
			
			Запрос.УстановитьПараметр("Период", ЭтотОбъект.Дата);
			Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
			Запрос.УстановитьПараметр("МассивЗаявок", МассивЗаявок);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписиПоДокументу = РезультатЗапроса.Выбрать();    			
			Сч = Истина;                                            
			ОсталосьСписать = 0; 
			ТекстОшибки = "";
			Пока ВыборкаДетальныеЗаписиПоДокументу.Следующий() Цикл
				
				Если Сч Тогда
					Номенклатура = ВыборкаДетальныеЗаписиПоДокументу.Номенклатура; 	
					ОсталосьСписать = ВыборкаДетальныеЗаписиПоДокументу.Количество;
					Сч = Ложь;
				КонецЕсли;   
				
				Если не Номенклатура = ВыборкаДетальныеЗаписиПоДокументу.Номенклатура Тогда  
					
					Если не ОсталосьСписать = 0 Тогда
						ТекстОшибки = ТекстОшибки + "В заявках указано меньше услуги " +Номенклатура+ " на " +ОсталосьСписать+ " единиц. Проведение невозможно!" + Символы.ПС;
					КонецЕсли;
					Номенклатура = ВыборкаДетальныеЗаписиПоДокументу.Номенклатура; 	
					ОсталосьСписать = ВыборкаДетальныеЗаписиПоДокументу.Количество;	
					
				КонецЕсли; 
				
				Если ОсталосьСписать > 0 Тогда  
					Если ВыборкаДетальныеЗаписиПоДокументу.КоличествоОстатокРегистр >= ОсталосьСписать Тогда  
						ОсталосьСписать = 0;
					иначе
						ОсталосьСписать = ОсталосьСписать - ВыборкаДетальныеЗаписиПоДокументу.КоличествоОстатокРегистр;
					КонецЕсли; 	
				КонецЕсли;   
				
			КонецЦикла;  
			
			Если не ОсталосьСписать = 0 Тогда
				ТекстОшибки = ТекстОшибки +ВыборкаДетальныеЗаписиПоДокументу.Номенклатура+ " на " +ОсталосьСписать+ " услуги/у." + Символы.ПС;
			КонецЕсли;     
			
			ТекстОшибкиОтсуствуетНоменклатураЗаказ = "";
			
			Для каждого строкаРаботы из ЭтотОбъект.Работы Цикл
				СтрПоиска = Новый Структура("Номенклатура",строкаРаботы.Номенклатура);
				ВыборкаДетальныеЗаписиПоДокументу.Сбросить();
				Если не ВыборкаДетальныеЗаписиПоДокументу.НайтиСледующий(СтрПоиска) Тогда
					ТекстОшибки = ТекстОшибки + строкаРаботы.Номенклатура+ " на "+строкаРаботы.Количество+" услуги/у." + Символы.ПС;
				КонецЕсли;	
			КонецЦикла;	
			
			Если не ТекстОшибки = "" Тогда
				ТекстОшибкиЗаголовок = "В документе приема указано больше услуг чем в документах " + Символы.ПС;  
				Для каждого стрМассивЗаявок из МассивЗаявок Цикл
					ТекстОшибкиЗаголовок = ТекстОшибкиЗаголовок + стрМассивЗаявок + Символы.ПС;		
				КонецЦикла;	
				ТекстОшибкиЗаголовок = ТекстОшибкиЗаголовок + "или Прием по данным услугам уже введен ранее:"+ Символы.ПС;
				ТекстОшибки = ТекстОшибкиЗаголовок + ТекстОшибки + Символы.ПС + "Проведение невозможно!";
				Сообщить(ТекстОшибки,СтатусСообщения.Важное);
			иначе
				Попытка 
					ПриемОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Продолжить
				КонецПопытки;
			КонецЕсли; 
		КонецЕсли;	
		
	КонецЦикла;
	
	Если не ЕстьПривелегии Тогда
		УстановитьПривилегированныйРежим(Ложь)
	КонецЕсли;
	
КонецПроцедуры	

Процедура омг_ПриУдаленииПроведенииОказанияУслугОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	ЕстьПривелегии = ПривилегированныйРежим();
	
	Если не ЕстьПривелегии Тогда
		УстановитьПривилегированныйРежим(Истина)
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Приемомг_Заявки.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Прием.омг_Заявки КАК Приемомг_Заявки
	|ГДЕ
	|	Приемомг_Заявки.Ссылка.Проведен
	|	И Приемомг_Заявки.Заявка В (&Заявки)
	|
	|СГРУППИРОВАТЬ ПО
	|	Приемомг_Заявки.Ссылка";
	
	Запрос.УстановитьПараметр("Заявки", Источник.Заявки.Выгрузить().ВыгрузитьКолонку("Заявка"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПриемОбъект =  ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();  
		Попытка
			ПриемОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Продолжить
		КонецПопытки;
		
	КонецЦикла;
	
	Если не ЕстьПривелегии Тогда
		УстановитьПривилегированныйРежим(Ложь)
	КонецЕсли;

КонецПроцедуры

 Функция омг_КонтрольУслугПоЗаявкам(ДатаПроверки,Врач) Экспорт
	 
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_ВрачБезКонтроля.Значение КАК Значение
		|ИЗ
		|	Константа.омг_ВрачБезКонтроля КАК омг_ВрачБезКонтроля
		|ГДЕ
		|	омг_ВрачБезКонтроля.Значение = &Врач";
	
	Запрос.УстановитьПараметр("Врач", Врач);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Ложь
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_ДатаКонтроляУслугПоЗаявкам.Значение КАК Значение
		|ИЗ
		|	Константа.омг_ДатаКонтроляУслугПоЗаявкам КАК омг_ДатаКонтроляУслугПоЗаявкам
		|ГДЕ
		|	омг_ДатаКонтроляУслугПоЗаявкам.Значение > &ПустаяДата
		|	И НАЧАЛОПЕРИОДА(омг_ДатаКонтроляУслугПоЗаявкам.Значение, ДЕНЬ) < &Дата";
	
	Запрос.УстановитьПараметр("ПустаяДата",Дата(1,1,1));
	Запрос.УстановитьПараметр("Дата",ДатаПроверки);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
        УстановитьПривилегированныйРежим(Ложь);
		Возврат Истина
		
	Иначе
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Ложь
		
	КонецЕсли;	
	
КонецФункции
//Карсаков (
Процедура ОчиститьНастройкиИнтерфейса() Экспорт 
	
	ХранилищеСистемныхНастроек.Удалить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", ИмяПользователя());

КонецПроцедуры

Процедура НастроитьИнтерфейсДляРегистратора() Экспорт
Настройки = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
		// ВАЖНО: Очищаем всё, что платформа накидала по умолчанию
	НастройкиСостава.Верх.Очистить();
	НастройкиСостава.Лево.Очистить();
	НастройкиСостава.Право.Очистить();
	НастройкиСостава.Низ.Очистить();
	
	// И только на девственно чистый макет добавляем панель открытых окон
	НастройкиСостава.Верх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
	
	Настройки.УстановитьСостав(НастройкиСостава);
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", Настройки);


КонецПроцедуры
