#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДокументОбращения") Тогда 
			ЗаполнитьНаОснованииОбращения(ДанныеЗаполнения.ДокументОбращения);	
		ИначеЕсли ДанныеЗаполнения.Свойство("ДокументОснование")
			И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.БронированиеКойкоМеста")
		Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.ДокументОснование, "Клиент, Палата, КойкоМесто, ДатаНачала, ДатаОкончания");
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		КонецЕсли;
		Если ДанныеЗаполнения.Свойство("ВидОперации") Тогда
			ВидОперации = ДанныеЗаполнения.ВидОперации;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Палата") Тогда
			Палата = ДанныеЗаполнения.Палата;
			Если Не ЗначениеЗаполнено(Прейскурант)
				И ЗначениеЗаполнено(Палата.ВидПалаты)
			Тогда
				Прейскурант = Палата.ВидПалаты.Прейскурант;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Койка") Тогда
			ЭтотОбъект.КойкоМесто = ДанныеЗаполнения.Койка;
		КонецЕсли;
		
		ДанныеЗаполнения.Свойство("Полис", Полис);
			
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОбращениеВСтационар") Тогда
		
		ЗаполнитьНаОснованииОбращения(ДанныеЗаполнения)
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.БронированиеКойкоМеста") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Клиент, Палата, КойкоМесто, ДатаНачала, ДатаОкончания");
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Палата) Тогда
		Документы.УстановкаУсловийПребывания.ЗаполнитьТарифыПоВидуПалаты(ЭтотОбъект);
		
		Если ЗначениеЗаполнено(Палата.Подразделение) Тогда
			Подразделение = Палата.Подразделение;
		КонецЕсли;
	КонецЕсли;
	
	// Прейскурант полиса имеет приоритет над прейскурантом палаты (обратное не решается размежеванием услуг)
	Если ЗначениеЗаполнено(Полис) Тогда
		ЗаполнитьПрейскурантИзПолиса();
	КонецЕсли;
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Изменения Макеев 08-01-2026 (
	Если ВидОперации = Перечисления.ВидыДвиженияВСтационаре.Выписка Тогда
		ДатаОкончания = Дата(1,1,1);
	КонецЕсли;
	
	омг_ЗаполнитьМедицинскуюКартуПередЗаписью();
КонецПроцедуры

Процедура омг_ЗаполнитьМедицинскуюКартуПередЗаписью()
	
	Если Не омг_МедицинскаяКарта.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОбращениеВСтационар.Клиент КАК Пациент,
	               |	ОбращениеВСтационар.МедицинскаяКарта.ВидКарты КАК ВидКарты,
	               |	ОбращениеВСтационар.МедицинскаяКарта КАК МедицискаяКарта
	               |ИЗ
	               |	Документ.ОбращениеВСтационар КАК ОбращениеВСтационар
	               |ГДЕ
	               |	ОбращениеВСтационар.Ссылка = &ДокументОбращения
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	омг_ТекущиеМедицинскиеКартыСрезПоследних.Пациент,
	               |	омг_ТекущиеМедицинскиеКартыСрезПоследних.ВидКарты,
	               |	омг_ТекущиеМедицинскиеКартыСрезПоследних.МедицискаяКарта
	               |ИЗ
	               |	РегистрСведений.омг_ТекущиеМедицинскиеКарты.СрезПоследних(
	               |			&Дата,
	               |			Пациент = &Пациент
	               |				И ВидКарты = &ВидКарты
	               |				И НЕ Регистратор = &ТекущийДокумент) КАК омг_ТекущиеМедицинскиеКартыСрезПоследних
	               |ГДЕ
	               |	омг_ТекущиеМедицинскиеКартыСрезПоследних.Активна";
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("Пациент", Клиент);
	Запрос.УстановитьПараметр("ВидКарты", омг_ОсновнойВидКартСтационар());
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	Запрос.УстановитьПараметр("ДокументОбращения", ДокументОбращения);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Медкарта = Выборка.МедицискаяКарта;
		
		омг_МедицинскаяКарта = Медкарта;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Изменения Макеев 08-01-2026 (
	// Укажем обязательные к заполнению поля
	Заголовок = "Проведение документа """ + СокрЛП(Ссылка) + """: ";
	
	СтруктураОбязательныхПолей = Новый Структура();
	Если ВидОперации <> Перечисления.ВидыДвиженияВСтационаре.Выписка Тогда
		Если Не ЗначениеЗаполнено(Полис) Тогда
			СтруктураОбязательныхПолей.Вставить("Прейскурант");
		КонецЕсли;
	КонецЕсли;
	
	ПроведениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Клиент",					 	"Ссылка.Клиент");
	СтруктураПолей.Вставить("Прейскурант",					"Ссылка.Прейскурант");
	СтруктураПолей.Вставить("Полис",						"Ссылка.Полис");
	СтруктураПолей.Вставить("ДатаНачала",					"Ссылка.ДатаНачала");
	СтруктураПолей.Вставить("ДатаОкончания",				"Ссылка.ДатаОкончания");
	СтруктураПолей.Вставить("Номенклатура",					"Номенклатура");
	
	РезультатЗапросаПоУслугам = ПроведениеДокументов.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Номенклатура", СтруктураПолей);
	ТаблицаУслуг          = РезультатЗапросаПоУслугам.Выгрузить();
	
	// УМЦ Проверка отраслевых условий.
	ОтраслевыеДополнения.ПроверитьЗаполнениеДокумента(ЭтотОбъект, Отказ, Заголовок);
	
	Если Не Отказ Тогда
		
		Стационар.ПроверитьВозможностьИзмененияСостоянияКойкоМеста(ЭтотОбъект,ТаблицаУслуг,Отказ);
		
	КонецЕсли;
	
	омг_ДеактивироватьМедицинскуюКарту();
	
КонецПроцедуры

Процедура омг_ДеактивироватьМедицинскуюКарту()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_ТекущиеМедицинскиеКартыСрезПоследних.Пациент КАК Пациент
	               |ИЗ
	               |	РегистрСведений.омг_ТекущиеМедицинскиеКарты.СрезПоследних(
	               |			&Дата,
	               |			Пациент = &Пациент
	               |				И НЕ Регистратор = &ТекущийДокумент) КАК омг_ТекущиеМедицинскиеКартыСрезПоследних
	               |ГДЕ
	               |	омг_ТекущиеМедицинскиеКартыСрезПоследних.МедицискаяКарта = &МедицискаяКарта";
	Запрос.УстановитьПараметр("МедицискаяКарта", омг_МедицинскаяКарта);
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("Пациент", Клиент);
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Движения.омг_ТекущиеМедицинскиеКарты.Записывать = Истина;
		Запись = Движения.омг_ТекущиеМедицинскиеКарты.Добавить();
		Запись.Пациент = Клиент;
		Запись.ВидКарты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(омг_МедицинскаяКарта, "ВидКарты");
		Запись.МедицискаяКарта = омг_МедицинскаяКарта;
		Запись.Период = Дата;
		Запись.Активна = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция омг_ОсновнойВидКартСтационар() Экспорт
	
	ПрочиеНастройки = омг_МедицинскаяДеятельность.ПолучитьПрочиеНастройкиСистемы();
	ТипКарты = Перечисления.ТипыМедицинскихКарт.Стационар;
	Если ПрочиеНастройки.Свойство("ТипКартыСтационара") Тогда
		ТипКарты = ПрочиеНастройки.ТипКартыСтационара;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипКарты", ТипКарты);
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыМедицинскихКарт.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыМедицинскихКарт КАК ВидыМедицинскихКарт
	|ГДЕ
	|	ВидыМедицинскихКарт.ТипКарты = &ТипКарты
	|	И НЕ ВидыМедицинскихКарт.Архив"
	;
	Выб = Запрос.Выполнить().Выбрать();
	
	Если Выб.Количество() = 1 Тогда
		Выб.Следующий();
		Возврат Выб.Ссылка;
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ВидОперации = Перечисления.ВидыДвиженияВСтационаре.Выписка Тогда
		
		ПроверяемыеРеквизиты.Очистить();
		ПроверяемыеРеквизиты.Добавить("Клиент");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииОбращения(ДокументОбращения)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДокументОбращения,,"Дата, Номер, ПометкаУдаления, Проведен, Ссылка");
		
	Если ЗначениеЗаполнено(ДокументОбращения.ДатаВремяГоспитализации) Тогда
		ЭтотОбъект.ДатаНачала = ДокументОбращения.ДатаВремяГоспитализации;
	КонецЕсли;
	
	ЭтотОбъект.ДокументОбращения = ДокументОбращения;
	
КонецПроцедуры

Процедура ЗаполнитьПрейскурантИзПолиса()
	
	ПрейскурантПолиса = Полис.ВидПолиса.Прейскурант;
	Если ЗначениеЗаполнено(ПрейскурантПолиса) Тогда
		Прейскурант = ПрейскурантПолиса;
	КонецЕсли;
	
КонецПроцедуры

// Проверяет правильность заполнения строк табличной части "Условия".
//
Процедура ПроверитьЗаполнениеТабличныхЧастей(ТаблицаПоУслугам, Отказ)

	// Общую процедуру проверки в этом документе звать нельзя, потому что номер строки в форме документа
	// отличается от системного.
	Для Каждого СтрокаТаблицы Из ТаблицаПоУслугам Цикл

		СтрокаНачалаСообщенияОбОшибке = "В строке табличной части Номенклатура номер "+ СокрЛП(ТаблицаПоУслугам.Индекс(СтрокаТаблицы)+ 1) 
										+" табличной части ";

		// Номенклатура.
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не заполнена Номенклатура.", Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

