
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь; 
	ТабДок.АвтоМасштаб = Истина; 
	ТабДок.ПолеСверху = 0;
	ТабДок.ПолеСнизу  = 0;
	ТабДок.ПолеСлева  = 0;
	ТабДок.ПолеСправа = 0;	
	ТабДок.Напечатать();
	//}}
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Печать(ТабДок, ПараметрКоманды);
КонецПроцедуры
