////////////////////////////////////////////////////////////////////////////////
// ИнтеграцияWebKassaКлиентСервер: общий механизм интеграции с сервисом 1С:WebKassa.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция возвращает описание ошибки сервиса.
//
Функция ПолучитьОписаниеОшибки(КодОшибки) Экспорт
	
	ОписаниеОшибки = "";
	Если КодОшибки = 1 Тогда
		ОписаниеОшибки = НСтр("ru='Неверный логин и/или пароль'");
	ИначеЕсли КодОшибки = 2 Тогда
		ОписаниеОшибки = НСтр("ru='Срок действия сессии истек'");
	ИначеЕсли КодОшибки = 3 Тогда
		ОписаниеОшибки = НСтр("ru='Пользователь не авторизован'");
	ИначеЕсли КодОшибки = 4 Тогда
		ОписаниеОшибки = НСтр("ru='Нет доступа к операции'");
	ИначеЕсли КодОшибки = 5 Тогда
		ОписаниеОшибки = НСтр("ru='Нет доступа к кассе'");
	ИначеЕсли КодОшибки = 6 Тогда
		ОписаниеОшибки = НСтр("ru='Касса не найдена'");
	ИначеЕсли КодОшибки = 7 Тогда
		ОписаниеОшибки = НСтр("ru='Касса заблокирована'");
	ИначеЕсли КодОшибки = 8 Тогда
		ОписаниеОшибки = НСтр("ru='Недостаточно суммы для изъятия'");
	ИначеЕсли КодОшибки = 9 Тогда
		ОписаниеОшибки = НСтр("ru='Ошибка валидации данных'");
	ИначеЕсли КодОшибки = 10 Тогда
		ОписаниеОшибки = НСтр("ru='Касса не активирована'");
	ИначеЕсли КодОшибки = 11 Тогда
		ОписаниеОшибки = НСтр("ru='Продолжительность смены превышает 24 часа. Для продолжения работы необходимо закрыть смену'");
	ИначеЕсли КодОшибки = 12 Тогда
		ОписаниеОшибки = НСтр("ru='Смена уже закрыта'");
	ИначеЕсли КодОшибки = 13 Тогда
		ОписаниеОшибки = НСтр("ru='Не найдена открытая смена'");
	ИначеЕсли КодОшибки = 14 Тогда
		ОписаниеОшибки = НСтр("ru='Дублирующийся код системы-источника'");
	ИначеЕсли КодОшибки = 15 Тогда
		ОписаниеОшибки = НСтр("ru='Смена не найдена'");
	ИначеЕсли КодОшибки = 1000 Тогда
		ОписаниеОшибки = НСтр("ru='Данная организация уже существует'");
	ИначеЕсли КодОшибки = 1001 Тогда
		ОписаниеОшибки = НСтр("ru='Данный пользователь уже существует'");
	ИначеЕсли КодОшибки = 1002 Тогда
		ОписаниеОшибки = НСтр("ru='Касса с данными идентификационными параметрами уже зарегистрирована в системе'");
	ИначеЕсли КодОшибки = 1003 Тогда
		ОписаниеОшибки = НСтр("ru='Активационная карта была использована ранее'");
	ИначеЕсли КодОшибки = 1004 Тогда
		ОписаниеОшибки = НСтр("ru='Неверные активационные данные'");
	ИначеЕсли КодОшибки = 1014 Тогда
		ОписаниеОшибки = НСтр("ru='Данная смена открыта. Z-отчет отсутствует.'");
	ИначеЕсли КодОшибки = 1015 Тогда
		ОписаниеОшибки = НСтр("ru='Компания партнер не найдена'");
	ИначеЕсли КодОшибки = 1016 Тогда
		ОписаниеОшибки = НСтр("ru='Неверный код подтверждения'");
	ИначеЕсли КодОшибки = 1017 Тогда
		ОписаниеОшибки = НСтр("ru='Перевод кассы невозможен. Имеются лицензии в ожидании активации.'");
	Иначе
		ОписаниеОшибки = НСтр("ru=''");
	КонецЕсли;
	
	Возврат ОписаниеОшибки;
	
КонецФункции

// Возвращает строковую константу для формирования сообщений журнала регистрации.
//
// Возвращаемое значение:
//   Строка
//
Функция СобытиеЖурналаРегистрации() Экспорт
	
	Возврат НСтр("ru = 'Интеграция 1С:WebKassa'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()); // строка записывается в ИБ
	
КонецФункции

// Функция выполняет запрос к сервису и возвращает результат выполнения операции.
//
Функция ОтправитьЗапросНаСервисWebkassa(АдресСервиса, ПутьОперации, ЗапросJSON) Экспорт
	
	РезультатЗапроса = Неопределено;
	
	СтруктураАдреса = ИнтеграцияWebKassaКлиентСерверПереопределяемый.СтруктураURI(АдресСервиса);
	Если НРег(СтруктураАдреса.Схема) = "https" Тогда
		SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
	Иначе
		SSL = Неопределено;
	КонецЕсли;
	
	Прокси = ИнтеграцияWebKassaКлиентСерверПереопределяемый.ПолучитьПрокси(НРег(СтруктураАдреса.Схема));
	Таймаут = 60; // таймаут запроса (в секундах)
	
	Попытка
		HTTPСоединение = Новый HTTPСоединение(СтруктураАдреса.Хост, СтруктураАдреса.Порт,,, Прокси,Таймаут, SSL);
		HTTPЗапрос = Новый HTTPЗапрос(ПутьОперации);
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		HTTPЗапрос.Заголовки.Вставить("Content-Charset", "utf-8");
		HTTPЗапрос.УстановитьТелоИзСтроки(ЗапросJSON, "UTF-8");//, ИспользованиеByteOrderMark.НеИспользовать);
		ОтветСервиса = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		РезультатЗапроса = ОтветСервиса.ПолучитьТелоКакСтроку("UTF-8");
	Исключение
		РезультатЗапроса = Неопределено;
	КонецПопытки;
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Рассчитывает ставку НДС по значениям суммы позиции и суммы НДС
//
Функция ВычислитьСтавкуНДС(ПозицияЧека) Экспорт
	
	СуммаПозиции = Окр(ПозицияЧека.Price * ПозицияЧека.Count, 2);
	СтавкаНДС = Окр(ПозицияЧека.Tax * 100 / (СуммаПозиции - ПозицияЧека.Discount + ПозицияЧека.Markup - ПозицияЧека.Tax),0);
	Возврат СтавкаНДС;
	
КонецФункции

Процедура ДополнитьФорматДанныхЧека(СтруктураДанных) Экспорт
	
	ОФД = Новый Структура;
	ОФД.Вставить("Host", "");
	ОФД.Вставить("Name","");
	ОФД.Вставить("Code", 0);
	ИнформацияОКассе = Новый Структура;
	ИнформацияОКассе.Вставить("UniqueNumber", "");
	ИнформацияОКассе.Вставить("RegistrationNumber", "");
	ИнформацияОКассе.Вставить("IdentityNumber", "");
	ИнформацияОКассе.Вставить("Address", "");
	ИнформацияОКассе.Вставить("Ofd", ОФД);
	ШаблоннаяСтруктураДанных = Новый Структура;
	ШаблоннаяСтруктураДанных.Вставить("CheckNumber", "");
	ШаблоннаяСтруктураДанных.Вставить("DateTime", Дата(1, 1, 1, 0, 0, 0));
	ШаблоннаяСтруктураДанных.Вставить("OfflineMode", Ложь);
	ШаблоннаяСтруктураДанных.Вставить("CashboxOfflineMode", Ложь);
	ШаблоннаяСтруктураДанных.Вставить("CheckOrderNumber", 0);
	ШаблоннаяСтруктураДанных.Вставить("ShiftNumber", 0);
	ШаблоннаяСтруктураДанных.Вставить("EmployeeName", "");
	ШаблоннаяСтруктураДанных.Вставить("TicketUrl", "");
	ШаблоннаяСтруктураДанных.Вставить("TicketPrintUrl", "");
	ШаблоннаяСтруктураДанных.Вставить("Cashbox", ИнформацияОКассе);
	
	ПроверитьУровеньСтруктуры(СтруктураДанных, ШаблоннаяСтруктураДанных);
	
КонецПроцедуры

Процедура ДополнитьФорматДанныхЧекаИстории(СтруктураДанных) Экспорт
	
	ШаблоннаяСтруктураДанных = Новый Структура;
	ШаблоннаяСтруктураДанных.Вставить("Address", "");
	ШаблоннаяСтруктураДанных.Вставить("CashboxIdentityNumber", 0);
	ШаблоннаяСтруктураДанных.Вставить("CashboxRegistrationNumber", "");
	ШаблоннаяСтруктураДанных.Вставить("CashboxUniqueNumber", "");
	ШаблоннаяСтруктураДанных.Вставить("Change", 0);
	ШаблоннаяСтруктураДанных.Вставить("CustomerXin", "");
	ШаблоннаяСтруктураДанных.Вставить("Discount", 0);
	ШаблоннаяСтруктураДанных.Вставить("DocumentNumber", 0);
	ШаблоннаяСтруктураДанных.Вставить("EmployeeCode", 0);
	ШаблоннаяСтруктураДанных.Вставить("EmployeeName", "");
	ШаблоннаяСтруктураДанных.Вставить("IsOffline", Ложь);
	ШаблоннаяСтруктураДанных.Вставить("LotteryInformation", "");
	ШаблоннаяСтруктураДанных.Вставить("Markup", 0);
	ШаблоннаяСтруктураДанных.Вставить("MarkupPercent", 0);
	ШаблоннаяСтруктураДанных.Вставить("Number", "");
	
	ОФД = Новый Структура;
	ОФД.Вставить("Host", "");
	ОФД.Вставить("Name","");
	ОФД.Вставить("Code", 0);
	ШаблоннаяСтруктураДанных.Вставить("Ofd", ОФД);
	
	ШаблоннаяСтруктураДанных.Вставить("OperationType", 2);
	ШаблоннаяСтруктураДанных.Вставить("OperationTypeText", "ПРОДАЖА");
	ШаблоннаяСтруктураДанных.Вставить("OrderNumber", 0);
	
	ПримерПлатежа = Новый Структура("Sum, PaymentTypeName", 0, "");
	Платежи = Новый Массив;
	Платежи.Добавить(ПримерПлатежа);
	ШаблоннаяСтруктураДанных.Вставить("Payments", Платежи);
	
	ПримерПозиции = Новый Структура;
	ПримерПозиции.Вставить("PositionName", "");
	ПримерПозиции.Вставить("PositionCode", "");
	ПримерПозиции.Вставить("Count", 0);
	ПримерПозиции.Вставить("Price", 0);
	ПримерПозиции.Вставить("DiscountDeleted", Ложь);
	ПримерПозиции.Вставить("DiscountPercent", 0);
	ПримерПозиции.Вставить("DiscountTenge", 0);
	ПримерПозиции.Вставить("MarkupDeleted", Ложь);
	ПримерПозиции.Вставить("Markup", 0);
	ПримерПозиции.Вставить("MarkupPercent", 0);
	ПримерПозиции.Вставить("Tax", 0);
	ПримерПозиции.Вставить("TaxPercent", 0);
	ПримерПозиции.Вставить("IsNds", Ложь);
	ПримерПозиции.Вставить("IsStorno", Ложь);
	ПримерПозиции.Вставить("Mark", "");
	ПримерПозиции.Вставить("Sum", 0);
	ПримерПозиции.Вставить("UnitCode", 0);
	
	Позиции = Новый Массив;
	Позиции.Добавить(ПримерПозиции);
	ШаблоннаяСтруктураДанных.Вставить("Positions", Позиции);
	
	ШаблоннаяСтруктураДанных.Вставить("RegistratedOn", Дата(1, 1, 1, 0, 0, 0));
	ШаблоннаяСтруктураДанных.Вставить("ShiftNumber", 0);
	ШаблоннаяСтруктураДанных.Вставить("Taken", 0);
	ШаблоннаяСтруктураДанных.Вставить("Tax", 0);
	ШаблоннаяСтруктураДанных.Вставить("TaxPercent", 0);
	ШаблоннаяСтруктураДанных.Вставить("TicketUrl", "");
	ШаблоннаяСтруктураДанных.Вставить("Total", 0);
	ШаблоннаяСтруктураДанных.Вставить("VATPayer", Ложь);
	
	ПроверитьУровеньСтруктуры(СтруктураДанных, ШаблоннаяСтруктураДанных);
	
КонецПроцедуры

// Декодирует штрихкод по алгоритму Base64 в строковый формат.
//
Функция ПреобразоватьBase64ВШтрихкод(ШтрихкодВBase64) Экспорт
	
	Возврат ИнтеграцияWebKassaКлиентСерверПереопределяемый.ПреобразоватьBase64ВШтрихкод(ШтрихкодВBase64);
	
КонецФункции

Функция УдалитьНедопустимыеСимволыXML(Знач Текст) Экспорт
	
	Возврат ИнтеграцияWebKassaКлиентСерверПереопределяемый.УдалитьНедопустимыеСимволыXML(Текст);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьУровеньСтруктуры(СтруктураДанных, Шаблон)
	
	Для каждого Элемент Из Шаблон Цикл
		НайденноеЗначение = Неопределено;
		Если Не СтруктураДанных.Свойство(Элемент.Ключ, НайденноеЗначение) Тогда
			СтруктураДанных.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЕсли;
		Если ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
			СтруктураДанных.Свойство(Элемент.Ключ, НайденноеЗначение);
			Если ТипЗнч(НайденноеЗначение) = Тип("Структура") Тогда
				//проверка вложенной структуры
				ПроверитьУровеньСтруктуры(СтруктураДанных[Элемент.Ключ], Элемент.Значение);
			Иначе
				СтруктураДанных[Элемент.Ключ] = Элемент.Значение;
			КонецЕсли;
		КонецЕсли;
		Если ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
			СтруктураДанных.Свойство(Элемент.Ключ, НайденноеЗначение);
			Если ТипЗнч(НайденноеЗначение) = Тип("Массив") Тогда
				//проверка массива с элементами-структурами
				Для каждого ЭлементМассива Из НайденноеЗначение Цикл
					ПроверитьУровеньСтруктуры(ЭлементМассива, Элемент.Значение[0]);
				КонецЦикла;
			Иначе
				СтруктураДанных[Элемент.Ключ] = Элемент.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСоответствиеНаименованийПолей(ЯзыкДляПечати) Экспорт
	СтруктураИмен = Новый Структура;
	ТипОплаты = Новый Соответствие;     
	ТипОперации = Новый Соответствие;
	Если ЯзыкДляПечати = ПредопределенноеЗначение("Перечисление.ЯзыкWebKassaФискальныеРегистраторы.Казахский") Тогда
		СтруктураИмен.Вставить("НадписьДубликат", "KÖŞIRME");
		СтруктураИмен.Вставить("НадписьФискальныйЧекФП", "FİSKÄLDI CHEK");
		СтруктураИмен.Вставить("НадписьСтоимость", "Qūny");
		СтруктураИмен.Вставить("НадписьСдача", "Qaitarym");
		СтруктураИмен.Вставить("НадписьСкидка", "Jeñildik");
		СтруктураИмен.Вставить("НадписьНаценка", "Üsteme bağa");
		СтруктураИмен.Вставить("НадписьИтого", "Barlyğy");
		СтруктураИмен.Вставить("НадписьНДС", "QQS");
		СтруктураИмен.Вставить("БИН", "JSN");
		СтруктураИмен.Вставить("НДССерия", "QQS Seriasy");
		СтруктураИмен.Вставить("ИНК", "KSN");
		СтруктураИмен.Вставить("РНК", "KTN");
		СтруктураИмен.Вставить("ЗНМ", "MZN");
		СтруктураИмен.Вставить("Кассир", "Kasaşy");
		СтруктураИмен.Вставить("Смена", "Auysym");
		СтруктураИмен.Вставить("Чек", "Chek");
		СтруктураИмен.Вставить("Покупка", "SATYP ALU");
		СтруктураИмен.Вставить("ВозвратПокупки", "SATYP ALUDY KERI QAİTARU");
		СтруктураИмен.Вставить("Продажа", "SATU");
		СтруктураИмен.Вставить("ВозвратПродажи", "SATUDY KERI QAİTARU");
		СтруктураИмен.Вставить("ИИНБИНПокупателя", "Satyp aluşynyñ BSN/JSN:");
		СтруктураИмен.Вставить("НДС", "QQS");
		СтруктураИмен.Вставить("Наличные", "Qolma-qol");
		СтруктураИмен.Вставить("БанковскаяКарта", "Bank kartasy");
		СтруктураИмен.Вставить("Мобильные", "Mobildi");
		СтруктураИмен.Вставить("ОплатаВКредит", "Nesie");
		СтруктураИмен.Вставить("ОплатаТарой", "Tara");
		СтруктураИмен.Вставить("ФискальныйЧекНомер", "Fiskäldi chek №");
		СтруктураИмен.Вставить("Время", "Uaqyty");
		СтруктураИмен.Вставить("Адрес", "Mekenjai");
		СтруктураИмен.Вставить("КодККМ", "BKM kody");
		СтруктураИмен.Вставить("ЧекСформированВАвтономномРежиме", "Chek avtonomdy rejimde qūrastyrylğan");
		СтруктураИмен.Вставить("ОператорФискальныхДанных", "Fiskäldi mälimetterdiñ operatory");
		СтруктураИмен.Вставить("НадписьДляПроверкиЧекаЗайдитеНаСайт", "Chekti tekseru üşin saitqa kiriñiz");
		СтруктураИмен.Вставить("Внесение", "Aqşa eñgizu");
		СтруктураИмен.Вставить("Выплата", "Aqşany alu");
		СтруктураИмен.Вставить("НадписьСумма", "Qūny");
		СтруктураИмен.Вставить("КонтрольнаяЛента", "BAQYLAU LENTA");
		СтруктураИмен.Вставить("КонецЛенты", "*** Lenta aiaqtalady ***");
		СтруктураИмен.Вставить("НомерПродажи", "Satu №");
		
		ТипОплаты.Вставить("Наличные", "Qolma-qol");
		ТипОплаты.Вставить("Банковская карта", "Bank kartasy");
		ТипОплаты.Вставить("Мобильные", "Mobildi");
		
		СтруктураИмен.Вставить("ТипОплаты", ТипОплаты);
		
		ТипОперации.Вставить("Покупка", "Satyp alu");
		ТипОперации.Вставить("Возврат покупки", "Satyp aludy keri qaitaru");
		ТипОперации.Вставить("Продажа", "Satu");
		ТипОперации.Вставить("Возврат продажи", "Satudy keri qaitaru");
		ТипОперации.Вставить("Изъятие денег из кассы", "Aqşany alu");
		
		СтруктураИмен.Вставить("ТипОперации", ТипОперации)
	ИначеЕсли ЯзыкДляПечати = ПредопределенноеЗначение("Перечисление.ЯзыкWebKassaФискальныеРегистраторы.Русский") Тогда
		СтруктураИмен.Вставить("НадписьДубликат", "ДУБЛИКАТ");
		СтруктураИмен.Вставить("НадписьФискальныйЧекФП", "ФИСКАЛЬНЫЙ ЧЕК ФП");
		СтруктураИмен.Вставить("НадписьСтоимость", "Стоимость");
		СтруктураИмен.Вставить("НадписьСдача", "Сдача");
		СтруктураИмен.Вставить("НадписьСкидка", "Скидка");
		СтруктураИмен.Вставить("НадписьНаценка", "Наценка");
		СтруктураИмен.Вставить("НадписьИтого", "Итого");
		СтруктураИмен.Вставить("НадписьНДС", "НДС");
		СтруктураИмен.Вставить("БИН", "БИН");
		СтруктураИмен.Вставить("НДССерия", "НДС Серия");
		СтруктураИмен.Вставить("ИНК", "ИНК");
		СтруктураИмен.Вставить("РНК", "РНК");
		СтруктураИмен.Вставить("ЗНМ", "МЗН");
		СтруктураИмен.Вставить("Кассир", "Кассир");
		СтруктураИмен.Вставить("Смена", "Смена");
		СтруктураИмен.Вставить("Чек", "Чек");
		СтруктураИмен.Вставить("Покупка", "ПОКУПКА");
		СтруктураИмен.Вставить("ВозвратПокупки", "ВОЗВРАТ ПОКУПКИ");
		СтруктураИмен.Вставить("Продажа", "ПРОДАЖА");
		СтруктураИмен.Вставить("ВозвратПродажи", "ВОЗВРАТ ПРОДАЖИ");
		СтруктураИмен.Вставить("ИИНБИНПокупателя", "ИИН/БИН покупателя:");
		СтруктураИмен.Вставить("НДС", "НДС");
		СтруктураИмен.Вставить("Наличные", "Наличные");
		СтруктураИмен.Вставить("БанковскаяКарта", "Банковская карта");
		СтруктураИмен.Вставить("Мобильные", "Мобильные");
		СтруктураИмен.Вставить("ОплатаВКредит", "Оплата в кредит");
		СтруктураИмен.Вставить("ОплатаТарой", "Оплата тарой");
		СтруктураИмен.Вставить("ФискальныйЧекНомер", "Фискальный чек №");
		СтруктураИмен.Вставить("Время", "Время");
		СтруктураИмен.Вставить("Адрес", "Адрес");
		СтруктураИмен.Вставить("КодККМ", "Код ККМ");
		СтруктураИмен.Вставить("ЧекСформированВАвтономномРежиме", "Чек сформирован в автономном режиме");
		СтруктураИмен.Вставить("ОператорФискальныхДанных", "Оператор фискальных данных");
		СтруктураИмен.Вставить("НадписьДляПроверкиЧекаЗайдитеНаСайт", "Для проверки чека зайдите на сайт");
		СтруктураИмен.Вставить("Внесение", "ВНЕСЕНИЕ");
		СтруктураИмен.Вставить("Выплата", "ВЫПЛАТА");
		СтруктураИмен.Вставить("НадписьСумма", "Сумма");
		СтруктураИмен.Вставить("КонтрольнаяЛента", "КОНТРОЛЬНАЯ ЛЕНТА");
		СтруктураИмен.Вставить("КонецЛенты", "*** Конец ленты ***");
		СтруктураИмен.Вставить("НомерПродажи", "Продажа №");
		
		ТипОплаты.Вставить("Наличные", "Наличные");
		ТипОплаты.Вставить("Банковская карта", "Банковская карта");
		ТипОплаты.Вставить("Мобильные", "Мобильные");
		
		СтруктураИмен.Вставить("ТипОплаты", ТипОплаты);
		
		ТипОперации.Вставить("Покупка", "Покупка");
		ТипОперации.Вставить("Возврат покупки", "Возврат покупки");
		ТипОперации.Вставить("Продажа", "Продажа");
		ТипОперации.Вставить("Возврат продажи", "Возврат продажи");
		ТипОперации.Вставить("Изъятие денег из кассы", "Изъятие денег из кассы");
		
		СтруктураИмен.Вставить("ТипОперации", ТипОперации);
	ИначеЕсли ЯзыкДляПечати = ПредопределенноеЗначение("Перечисление.ЯзыкWebKassaФискальныеРегистраторы.КазахскийРусский") Тогда
		СтруктураИмен.Вставить("НадписьДубликат", "KÖŞIRME/ДУБЛИКАТ");
		СтруктураИмен.Вставить("НадписьФискальныйЧекФП", "FİSKÄLDI CHEK/ФИСКАЛЬНЫЙ ЧЕК ФП");
		СтруктураИмен.Вставить("НадписьСтоимость", "Qūny/Стоимость");
		СтруктураИмен.Вставить("НадписьСдача", "Qaitarym/Сдача");
		СтруктураИмен.Вставить("НадписьСкидка", "Jeñildik somasy/Сумма скидки");
		СтруктураИмен.Вставить("НадписьНаценка", "Üsteme bağa/Наценка");
		СтруктураИмен.Вставить("НадписьИтого", "Barlyğy/Итого");
		СтруктураИмен.Вставить("НадписьНДС", "QQS q.a/В т.ч.НДС 5%");
		СтруктураИмен.Вставить("БИН", "JSN/БИН");
		СтруктураИмен.Вставить("НДССерия", "QQS Seriasy/НДС Серия");
		СтруктураИмен.Вставить("ИНК", "KJN FDO/ИНК ОФД");
		СтруктураИмен.Вставить("РНК", "KTN/РНК");
		СтруктураИмен.Вставить("ЗНМ", "MZN/ЗНМ");
		СтруктураИмен.Вставить("Кассир", "Kasaşy/Кассир");
		СтруктураИмен.Вставить("Смена", "Auysym/Смена");
		СтруктураИмен.Вставить("Чек", "Chek/Чек");
		СтруктураИмен.Вставить("Покупка", "SATYP ALU/ПОКУПКА");
		СтруктураИмен.Вставить("ВозвратПокупки", "SATYP ALUDY KERI QAİTARU/ВОЗВРАТ ПОКУПКИ  №");
		СтруктураИмен.Вставить("Продажа", "SATU/ПРОДАЖА №");
		СтруктураИмен.Вставить("ВозвратПродажи", "SATUDY KERI QAİTARU/ВОЗВРАТ ПРОДАЖИ  №");
		СтруктураИмен.Вставить("ИИНБИНПокупателя", "Satyp aluşynyñ BSN/JSN/ИИН/БИН покупателя:");
		СтруктураИмен.Вставить("НДС", "QQS/НДС");
		СтруктураИмен.Вставить("Наличные", "Qolma-qol/Наличные");
		СтруктураИмен.Вставить("БанковскаяКарта", "Bank kartasy/карта");
		СтруктураИмен.Вставить("Мобильные", "Мобильдi/Мобильные");
		СтруктураИмен.Вставить("ОплатаВКредит", "Nesie/Оплата в кредит");
		СтруктураИмен.Вставить("ОплатаТарой", "Tara/Оплата тарой");
		СтруктураИмен.Вставить("ФискальныйЧекНомер", "Fiskäldi chek/Фискальный чек №");
		СтруктураИмен.Вставить("Время", "Uaqyty/Время");
		СтруктураИмен.Вставить("Адрес", "Mekenjai/Адрес");
		СтруктураИмен.Вставить("КодККМ", "BKM kody/Код ККМ");
		СтруктураИмен.Вставить("ЧекСформированВАвтономномРежиме", "Chek avtonomdy rejimde qūrastyrylğan/Чек сформирован в автономном режиме");
		СтруктураИмен.Вставить("ОператорФискальныхДанных", "Fiskäldi mälimetterdiñ operatory/Оператор фискальных данных");
		СтруктураИмен.Вставить("НадписьДляПроверкиЧекаЗайдитеНаСайт", "Chekti tekseru üşin saitqa kiriñiz/Для проверки чека зайдите на сайт");
		СтруктураИмен.Вставить("Внесение", "Aqşa eñgizu/Внесение");
		СтруктураИмен.Вставить("Выплата", "Aqşany alu/Выплата");
		СтруктураИмен.Вставить("НадписьСумма", "Qūny/Сумма");
		СтруктураИмен.Вставить("КонтрольнаяЛента", "BAQYLAU LENTA/КОНТРОЛЬНАЯ ЛЕНТА");
		СтруктураИмен.Вставить("КонецЛенты", "*** Lenta aiaqtalady/Конец ленты ***"); 
		СтруктураИмен.Вставить("НомерПродажи", "Satu/Продажа №");
		
		
		ТипОплаты.Вставить("Наличные", "Qolma-qol/Наличные");
		ТипОплаты.Вставить("Банковская карта", "Bank kartasy/Банковская карта");
		ТипОплаты.Вставить("Мобильные", "Mobildi/Мобильные");
		
		СтруктураИмен.Вставить("ТипОплаты", ТипОплаты);
		
		ТипОперации.Вставить("Покупка", "Satyp alu/Покупка");
		ТипОперации.Вставить("Возврат покупки", "Satyp aludy keri qaitaru/Возврат покупки");
		ТипОперации.Вставить("Продажа", "Satu/Продажа");
		ТипОперации.Вставить("Возврат продажи", "Сатуды кері қайтару/Возврат продажи");
		ТипОперации.Вставить("Изъятие денег из кассы", "Ақшаны алу/Изъятие денег из кассы");
		
		СтруктураИмен.Вставить("ТипОперации", ТипОперации)
		
	КонецЕсли;
	Возврат СтруктураИмен;
КонецФункции

#КонецОбласти
