
// Возвращает занятые койки
//
// Параметры:
//  Дата - Дата	 - Дата, на которую нужно получить занятые койки
// 
// Возвращаемое значение:
//  Массив - Массив занятый коек
//
Функция ПолучитьЗанятыеКойки(Дата) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостояниеКойкоМестаСрезПоследних.КойкоМесто КАК КойкоМесто
	               |ИЗ
	               |	РегистрСведений.СостояниеКойкоМеста.СрезПоследних(&Период, ) КАК СостояниеКойкоМестаСрезПоследних
	               |ГДЕ
	               |	СостояниеКойкоМестаСрезПоследних.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийКойкоМест.Свободно)
	               |	И СостояниеКойкоМестаСрезПоследних.ДатаОкончания > &Период";
	                                              
	Запрос.УстановитьПараметр("Период", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивВозврата = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивВозврата.Добавить(Выборка.КойкоМесто);	
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

// Проверяет занята ли койка на дату
//
// Параметры:
//  Койка	 - СправочникСсылка.КойкоМеста	 - Койка для проверки
//  Дата	 - Дата	 - Дата проверки
// 
// Возвращаемое значение:
//  Булево - Истина - койка занята, Ложь - свободна 
//
Функция КойкаЗанята(Койка, Дата, Документ = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СостояниеКойкоМестаСрезПоследних.КойкоМесто КАК КойкоМесто,
	               |	СостояниеКойкоМестаСрезПоследних.Регистратор КАК Регистратор
	               |ИЗ
	               |	РегистрСведений.СостояниеКойкоМеста.СрезПоследних(&Период, ) КАК СостояниеКойкоМестаСрезПоследних
	               |ГДЕ
	               |	СостояниеКойкоМестаСрезПоследних.Состояние <> ЗНАЧЕНИЕ(Справочник.ВидыСостоянийКойкоМест.Свободно)
	               |	И СостояниеКойкоМестаСрезПоследних.КойкоМесто = &Койка";
	                                              
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Койка", Койка);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Документ = Выборка.Регистратор;	
		Возврат Истина
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
