#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьПредставленияВозраста();
	УстановитьОсновнуюНоменклатуруВакцинации();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.НоменклатураВакцинации.Количество() = 1
		И Объект.НоменклатураВакцинации[0].Основная
	Тогда
		Объект.НоменклатураВакцинации[0].Основная = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьПредставленияВозраста();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Основная(Команда)
	
	ТекущиеДанные = Элементы.НоменклатураВакцинации.ТекущиеДанные;
	ТекущиеДанные.Основная = Не ТекущиеДанные.Основная;
	ОсновнаяНоменклатура = ?(ТекущиеДанные.Основная, ТекущиеДанные.Номенклатура, Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЭтапыВозрастОтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РегулированиеВозраста(Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыВозрастДоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РегулированиеВозраста(Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыОсложненияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МногострочныйВводТекста(Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыКомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МногострочныйВводТекста(Элемент, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РегулированиеВозраста(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Этапы.ТекущиеДанные;
	
	НомерСтроки = ТекущиеДанные.НомерСтроки;
	ИмяЭлемента = Элемент.Имя;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НомерСтроки", НомерСтроки);
	
	Если ИмяЭлемента = "ЭтапыВозрастОт" Тогда
		ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru='Ввод начала этапа'"));
		ПараметрыФормы.Вставить("Месяцев",	ТекущиеДанные.МесяцевДоСтартаЭтапа);
		ПараметрыФормы.Вставить("Дней",		ТекущиеДанные.ДнейДоСтартаЭтапа);
	ИначеЕсли ИмяЭлемента = "ЭтапыВозрастДо" Тогда
		ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru='Ввод окончания этапа'"));
		ПараметрыФормы.Вставить("Месяцев",	ТекущиеДанные.МесяцевДоОкончанияЭтапа);
		ПараметрыФормы.Вставить("Дней",		ТекущиеДанные.ДнейДоОкончанияЭтапа);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеРегулирования", ЭтотОбъект, ИмяЭлемента);
	ОткрытьФорму("ОбщаяФорма.ВводВозраста", ПараметрыФормы, , , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура МногострочныйВводТекста(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяТаблицы			= Элемент.Родитель.Имя;
	ИдентификаторСтроки = Элемент.Родитель.ТекущаяСтрока;
	ИмяЭлемента			= Элемент.Имя;
	ИмяРеквизита		= Прав(ИмяЭлемента, СтрДлина(ИмяЭлемента) - СтрДлина(ИмяТаблицы));
	ТекущаяСтрока		= Объект[ИмяТаблицы].НайтиПоИдентификатору(ИдентификаторСтроки);
	Текст				= ТекущаяСтрока[ИмяРеквизита];
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	ДопПараметры.Вставить("ИмяРеквизита", ИмяРеквизита);
	ДопПараметры.Вставить("ИмяТаблицы", ИмяТаблицы);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Текст", Текст);
	ПараметрыФормы.Вставить("ДопПараметры", ДопПараметры);

	Оповещение = Новый ОписаниеОповещения("ПослеВводаТекста", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВводМногострочногоТекстаТабличнойЧасти", ПараметрыФормы, , , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураВакцинацииПриИзменении(Элемент)
	УстановитьОсновнуюНоменклатуруВакцинации();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьОсновнуюНоменклатуруВакцинации()
	
	Если Объект.НоменклатураВакцинации.Количество() = 1 Тогда
		ОсновнаяНоменклатура = Объект.НоменклатураВакцинации[0].Номенклатура;
	Иначе
		ОсновнаяНоменклатура = Неопределено;
		Для Каждого СтрокаНоменклатуры Из Объект.НоменклатураВакцинации Цикл
			Если СтрокаНоменклатуры.Основная Тогда
				ОсновнаяНоменклатура = СтрокаНоменклатуры.Номенклатура;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеРегулирования(Результат, ИмяЭлемента) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		СтрокаЭтапа = Объект.Этапы[Результат.НомерСтроки - 1];
		
		Если ИмяЭлемента = "ЭтапыВозрастОт" Тогда
			СтрокаЭтапа.МесяцевДоСтартаЭтапа	= Результат.Месяцев + Результат.Лет * 12;
			СтрокаЭтапа.ДнейДоСтартаЭтапа		= Результат.Дней;
		КонецЕсли;
		
		Если ИмяЭлемента = "ЭтапыВозрастДо" Тогда 
			СтрокаЭтапа.МесяцевДоОкончанияЭтапа	= Результат.Месяцев + Результат.Лет * 12;
			СтрокаЭтапа.ДнейДоОкончанияЭтапа	= Результат.Дней;
		КонецЕсли;
		
	КонецЕсли;

	ОбновитьПредставленияВозраста();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаТекста(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		ТекущаяСтрока = Объект[Результат.ДопПараметры.ИмяТаблицы].НайтиПоИдентификатору(Результат.ДопПараметры.ИдентификаторСтроки);
		ТекущаяСтрока[Результат.ДопПараметры.ИмяРеквизита] = Результат.Текст;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПредставленияВозраста()
	
	Для Каждого СтрокаЭтапа Из Объект.Этапы Цикл
		
		ВозрастОтЛет		= Цел(СтрокаЭтапа.МесяцевДоСтартаЭтапа / 12);
		ВозрастОтМесяцев	= СтрокаЭтапа.МесяцевДоСтартаЭтапа - Цел(СтрокаЭтапа.МесяцевДоСтартаЭтапа / 12) * 12;
		ВозрастОтДней		= СтрокаЭтапа.ДнейДоСтартаЭтапа;
		
		ВозрастДоЛет		= Цел(СтрокаЭтапа.МесяцевДоОкончанияЭтапа / 12);
		ВозрастДоМесяцев	= СтрокаЭтапа.МесяцевДоОкончанияЭтапа - Цел(СтрокаЭтапа.МесяцевДоОкончанияЭтапа / 12) * 12;
		ВозрастДоДней		= СтрокаЭтапа.ДнейДоОкончанияЭтапа;		
		
		ВозрастОт			= ВакцинацииКлиентСервер.СтрокаВозраст(ВозрастОтЛет, ВозрастОтМесяцев, ВозрастОтДней);
		ВозрастДо			= ВакцинацииКлиентСервер.СтрокаВозраст(ВозрастДоЛет, ВозрастДоМесяцев, ВозрастДоДней);
		
		Если ВозрастОт = "" Тогда
			СтрокаЭтапа.ВозрастОт = "с рождения";
		Иначе
			СтрокаЭтапа.ВозрастОт = "с "  + ВозрастОт;
		КонецЕсли;
		
		Если ВозрастДо = "" Тогда
			СтрокаЭтапа.ВозрастДо = "бессрочно";
		Иначе
			СтрокаЭтапа.ВозрастДо = "до " + ВозрастДо;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти