
#Область ПрограммныйИнтерфейс

#Область МДЛП

// Определяет, является ли склад розничным магазином
//
// Параметры:
//  Склад	 - СправочникСсылка.Склады	 - склад.
// 
// Возвращаемое значение:
//  Булево - Истина, если тип склад - розничный магазин.
//
Функция ЭтоРозничныйСклад(Склад) Экспорт
	
	Возврат (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ТипСклада") = Перечисления.ТипыСкладов.РозничныйМагазин);
	
КонецФункции

// Определяет, является ли склад отделением
//
// Параметры:
//  Склад	 - СправочникСсылка.Склады	 - склад.
// 
// Возвращаемое значение:
//  Булево - Истина, если тип склад - отделение.
//
Функция ЭтоСкладОтделения(Склад) Экспорт
	
	Возврат (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Склад, "ТипСклада") = Перечисления.ТипыСкладов.Отделение);
	
КонецФункции

#КонецОбласти

// Возвращает имя реквизита склада, с которого выбывает товар, по складскому документу.
//
// Параметры:
//  ИмяМетаданныхДокумента	 - ОбъектМетаданных	 - метаданные документа.
// 
// Возвращаемое значение:
//  Строка - имя реквизита склада отправителя, если он есть в объекте, иначе Неопределено.
//
Функция ИмяРеквизитаСкладОтправитель(ИмяМетаданныхДокумента) Экспорт
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ИмяМетаданныхДокумента);
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("СкладОтправитель", МетаданныеОбъекта) Тогда
		Возврат "СкладОтправитель";
	
	ИначеЕсли ОбщегоНазначения.ЕстьРеквизитОбъекта("Склад", МетаданныеОбъекта) Тогда
		Возврат "Склад";
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СтратегияСписанияПартийСтрокой() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Строка(Константы.СтратегияСписанияПартийТоваровПоДатам.Получить());
	
КонецФункции

// Возвращает склад, если он единственный  в базе.
// 
// Возвращаемое значение:
//  СправочникСсылка.Склады.
//
Функция ЕдинственныйСкладВБазе() Экспорт
	
	Если Не ПараметрыСеанса.УчетПоНесколькимФилиалам Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	НЕ Склады.ПометкаУдаления
		|	И НЕ Склады.ЭтоГруппа"
		;
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 1 Тогда
			Выборка.Следующий();
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.Склады.ПустаяСсылка();
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
