
Процедура ПередЗаписью(Отказ)
	
	СписокСостояний.Свернуть("Состояние");
	СписокПараметров.Свернуть("Параметр");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.ВидОбласти = Перечисления.стомВидыОбластей.Конструкция Тогда 
		ПроверяемыеРеквизиты.Добавить("НачалоКонструкции");
		ПроверяемыеРеквизиты.Добавить("СерединаКонструкции");
		ПроверяемыеРеквизиты.Добавить("КонецКонструкции");
	ИначеЕсли ЭтотОбъект.ВидОбласти = Перечисления.стомВидыОбластей.ЭлементКонструкции Тогда 
		ПроверяемыеРеквизиты.Добавить("КонструкцияРодитель");
	КонецЕсли;
	
КонецПроцедуры
