#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИзменениеСоставаСтрахуемыхСтрахуемые.Клиент КАК Клиент,
	               |	ИзменениеСоставаСтрахуемыхСтрахуемые.СерияПолиса КАК СерияПолиса,
	               |	ИзменениеСоставаСтрахуемыхСтрахуемые.НомерПолиса КАК НомерПолиса,
	               |	ИзменениеСоставаСтрахуемыхСтрахуемые.НомерСтроки КАК НомерСтроки
	               |ПОМЕСТИТЬ ВремТЧ
	               |ИЗ
	               |	Документ.ИзменениеСоставаСтрахуемых.Страхуемые КАК ИзменениеСоставаСтрахуемыхСтрахуемые
	               |ГДЕ
	               |	ИзменениеСоставаСтрахуемыхСтрахуемые.Ссылка = &Ссылка
	               |	И ИзменениеСоставаСтрахуемыхСтрахуемые.Полис = ЗНАЧЕНИЕ(Справочник.СтраховыеПолисы.ПустаяСсылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВремТЧ.НомерСтроки КАК НомерСтроки,
	               |	СтраховыеПолисы.Ссылка КАК Полис,
	               |	ВремТЧ.Клиент КАК Клиент,
	               |	ВремТЧ.СерияПолиса КАК СерияПолиса,
	               |	ВремТЧ.НомерПолиса КАК НомерПолиса
	               |ИЗ
	               |	ВремТЧ КАК ВремТЧ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтраховыеПолисы КАК СтраховыеПолисы
	               |		ПО ВремТЧ.Клиент = СтраховыеПолисы.Владелец
	               |			И (СтраховыеПолисы.ВидПолиса = &ВидПолиса)
	               |			И (НЕ СтраховыеПолисы.НеДействителен)
	               |			И (ВремТЧ.СерияПолиса ПОДОБНО СтраховыеПолисы.Серия)
	               |			И (ВремТЧ.НомерПолиса ПОДОБНО СтраховыеПолисы.Номер)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВремТЧ.Клиент КАК Клиент,
	               |	СтраховыеПолисы.Ссылка КАК Полис
	               |ИЗ
	               |	ВремТЧ КАК ВремТЧ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтраховыеПолисы КАК СтраховыеПолисы
	               |		ПО ВремТЧ.Клиент = СтраховыеПолисы.Владелец
	               |			И (СтраховыеПолисы.ВидПолиса = &ВидПолиса)
	               |			И (НЕ СтраховыеПолисы.НеДействителен)
	               |			И (СтраховыеПолисы.СрокДействия >= &ДатаДокумента
	               |				ИЛИ СтраховыеПолисы.СрокДействия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ВидПолиса", ВидПолиса);
	
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[1].Выбрать();
	ВыборкаПолисыВсе = Результат[2].Выбрать();
	Отбор = Новый Структура("Клиент");
	
	Пока Выборка.Следующий() Цикл
		
		ИскомаяСтроки = Страхуемые[Выборка.НомерСтроки-1];
		
		Если ЗначениеЗаполнено(Выборка.Полис) Тогда
			ИскомаяСтроки.Полис = Выборка.Полис;
		Иначе
			Отбор.Клиент = Выборка.Клиент;
			ВыборкаПолисыВсе.Сбросить();
			Если  Не ЗначениеЗаполнено(Выборка.НомерПолиса)
				И Не ЗначениеЗаполнено(Выборка.СерияПолиса)
				И ВыборкаПолисыВсе.НайтиСледующий(Отбор) 
			Тогда
				ИскомаяСтроки.Полис = ВыборкаПолисыВсе.Полис;
				
			Иначе	
				Если ВидОперации <> Перечисления.ВидыОперацийИзмененияСоставаСтрахуемых.ИсключениеИзСписка Тогда
					
					НовыйПолис = Справочники.СтраховыеПолисы.СоздатьЭлемент();
					НовыйПолис.Владелец = Выборка.Клиент;
					НовыйПолис.ВидПолиса = ВидПолиса;
					НовыйПолис.Контрагент = ВидПолиса.Контрагент;
					НовыйПолис.Номер = Выборка.НомерПолиса;
					НовыйПолис.Серия = Выборка.СерияПолиса;
					НовыйПолис.Записать();
					
					ИскомаяСтроки.Полис = НовыйПолис.Ссылка;
					
					Если Не ЗначениеЗаполнено(Выборка.Клиент.умцОсновнойСтраховойПолис) Тогда
						ОбъектКлиент = Выборка.Клиент.ПолучитьОбъект();
						ОбъектКлиент.умцОсновнойСтраховойПолис = НовыйПолис.Ссылка;
						ОбъектКлиент.Записать();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Записать(РежимЗаписиДокумента.Запись);
	
	// Регистр СоставыСтрахуемых
	Движения.СоставыСтрахуемых.Записывать = Истина;
	Для Каждого ТекСтрокаСтрахуемые Из Страхуемые Цикл
		Если ЗначениеЗаполнено(ТекСтрокаСтрахуемые.Полис) Тогда
			Движение = Движения.СоставыСтрахуемых.Добавить();
			Движение.Период = Дата;
			Движение.ВидПолиса = ТекСтрокаСтрахуемые.Полис.ВидПолиса;
			Движение.Полис = ТекСтрокаСтрахуемые.Полис;
			Движение.Клиент = ТекСтрокаСтрахуемые.Клиент;
			Движение.Исключен = ВидОперации = Перечисления.ВидыОперацийИзмененияСоставаСтрахуемых.ИсключениеИзСписка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
