
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Документ = Параметры.Документ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_РезультатыОбменаССервисами.Документ КАК Документ,
	               |	омг_РезультатыОбменаССервисами.ОписаниеОшибки КАК ОписаниеОшибки
	               |ИЗ
	               |	РегистрСведений.омг_РезультатыОбменаССервисами КАК омг_РезультатыОбменаССервисами
	               |ГДЕ
	               |	омг_РезультатыОбменаССервисами.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ТекстОшибки = Выборка.ОписаниеОшибки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ВключитьОбновлениеСтатусаНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись = РегистрыСведений.омг_РезультатыОбменаССервисами.СоздатьМенеджерЗаписи();
	Запись.Документ = Документ;
	Запись.Удалить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОбновлениеСтатуса(Команда)
	ВключитьОбновлениеСтатусаНаСервере();
	Закрыть(Истина);
КонецПроцедуры
