Процедура МаршрутыЛечения(Форма) Экспорт
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("ОтборВрач", омг_РабочиеМестаВызовСервера.СотрудникТекущегоПользователя());
    ОткрытьФорму("Отчет.МаршрутЛеченияПациента.Форма.ФормаОтчета_85", ПараметрыФормы, Форма);
КонецПроцедуры

Процедура ОтчетКонверсия(Форма) Экспорт

    Данные = омг_РабочиеМестаВызовСервера.ДанныеОтчетаКонверсия();
    Если Данные.КлючВарианта = Неопределено Тогда
        ПоказатьПредупреждение(, "Не найден вариант отчёта ""Конверсия событий (для операторов)""");
        Возврат;
    КонецЕсли;

    ТекПериод = Новый СтандартныйПериод;
    ТекПериод.Вариант = ВариантСтандартногоПериода.ЭтотМесяц;

    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("КлючВарианта", Данные.КлючВарианта);
    ПараметрыФормы.Вставить("Отбор", Новый Структура("Ответственный", Данные.Пользователь));
    ПараметрыФормы.Вставить("ПараметрыДанных", Новый Структура("Период", ТекПериод));
    ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);

    ОткрытьФорму("Отчет.омг_КонверсияСобытий.Форма", ПараметрыФормы, Форма);

КонецПроцедуры

Процедура Телефония(Форма) Экспорт
    ФормаСофтФон = ПолучитьФорму("Обработка.доп_Битфон.Форма.ОсновнаяФорма85");
    Если НЕ ФормаСофтФон.Открыта() Тогда
        ФормаСофтФон.Открыть();
    КонецЕсли;
    ФормаСофтФон.Активизировать();
КонецПроцедуры