
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Период = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), 1)); 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.ПолучениеФактическихДанных.ПроверитьЗаполнениеАналитик(ЭтотОбъект, "Планирование", Отказ);
	
	Если НЕ Отказ Тогда

		Движения.ОборотыПоПланированию.Записывать = Истина;
		НаборДвижений = Движения.ОборотыПоПланированию;
		
		Для Каждого СтрокаТаблицы Из Планирование Цикл
		
			Движение = НаборДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаТаблицы);
			Движение.Период = Период;
			Движение.Сценарий = Истина;
			
		КонецЦикла; 
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти