
#Область ПрограммныйИнтерфейс

// Функция вычисляет и возвращает значение по формуле в рамках своего контекста.
//
// Параметры:
//  ФормулаРасчета	 - Строка	 - текст лагоритма расчета.
//	ПараметрыПечати	 - Структура	 - параметры печати полученные алгоритмом из реквизита ПередФормированием
//  Результат		 - Произвольный	 - переменная, куда помещается итог расчета.
// 
// Возвращаемое значение:
//  Неопределено - возвращаемое значение не используется.
//
Функция ВыполнитьФормулуДляПечатиШаблона(ФормулаРасчета, ОбщиеПеременныеАлгоритмов, Результат) Экспорт
	
	ОбъектПечати = ЭтотОбъект;
	Филиал 	= РаботаСДокументамиСервер.ФилиалДокумента(ЭтотОбъект);
	Дата	= ОбщегоНазначенияКлиентСервер.СвойствоОбъекта(ЭтотОбъект, "Дата", Дата(1,1,1));
	Клиент	= ОбщегоНазначенияКлиентСервер.СвойствоОбъекта(ЭтотОбъект, "Клиент", Справочники.Клиенты.ПустаяСсылка());
	
	Выполнить(ФормулаРасчета);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
			ДанныеЗаполнения.Свойство("Клиент", Клиент);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Клиенты") Тогда
			Клиент = ДанныеЗаполнения;
		ИначеЕсли Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ДанныеЗаполнения))
			И ДанныеЗаполнения.Метаданные().Реквизиты.Найти("Клиент") <> Неопределено
		Тогда
			Клиент = ДанныеЗаполнения.Клиент;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
