Процедура Адапт_ЗапуститьМетодОбработки(
        Знач ПараметрыЗадания,
        Знач АдресРезультата) Экспорт

    АдресВХОбработки    = ПараметрыЗадания.АдресВХОбработки;
    ИмяМетода           = ПараметрыЗадания.ИмяМетода;
    ПараметрыВыполнения = ПараметрыЗадания.ПараметрыВыполнения;

    ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВХОбработки);
    ПутьКФайлуОбработки = ПолучитьИмяВременногоФайла("epf");
    ДвоичныеДанные.Записать(ПутьКФайлуОбработки);

    ПутьКФайлуДанных = "";
    Если ЗначениеЗаполнено(ПараметрыВыполнения.АдресВХФайла) Тогда
        ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПараметрыВыполнения.АдресВХФайла);
        ПутьКФайлуДанных = ПолучитьИмяВременногоФайла("xml");
        ДвоичныеДанные.Записать(ПутьКФайлуДанных);
        ПараметрыВыполнения.ИмяФайла = ПутьКФайлуДанных;
    КонецЕсли;

    Попытка
        Обработка = ВнешниеОбработки.Создать(ПутьКФайлуОбработки, Ложь);
        КодВызова = "Обработка." + ИмяМетода + "(ПараметрыВыполнения);";
        Выполнить(КодВызова);
    Исключение
        УдалитьФайлы(ПутьКФайлуОбработки);
        Если ЗначениеЗаполнено(ПутьКФайлуДанных) Тогда
            УдалитьФайлы(ПутьКФайлуДанных);
        КонецЕсли;
        ВызватьИсключение;
    КонецПопытки;

    УдалитьФайлы(ПутьКФайлуОбработки);
    Если ЗначениеЗаполнено(ПутьКФайлуДанных) Тогда
        УдалитьФайлы(ПутьКФайлуДанных);
    КонецЕсли;

КонецПроцедуры