#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаПечать.Доступность = Объект.Вид = Перечисления.ВидыДействийМедицинскогоОсмотра.Исследование;
	Элементы.НомерКабинетаДляПечати.Доступность = ВычислитьДоступностьНомераКабинета(Объект);
	
	Элементы.Врач.Доступность = Объект.ПечататьВПрограммеПрохождения И Не Объект.ТолькоДляОтметкиИсследования;
	Элементы.ТолькоДляОтметкиИсследования.Доступность = Объект.ПечататьВПрограммеПрохождения;
	
	Элементы.ТекстЗаключенияПоУмолчанию.ПодсказкаВвода = МедосмотрыКлиентСервер.ТекстЗаключенияПоУмолчанию();
	Элементы.НаименованиеДляПечати.ПодсказкаВвода = Объект.Наименование;
	
	Элементы.ВидИсследования.Доступность = Объект.Вид = Перечисления.ВидыДействийМедицинскогоОсмотра.Исследование;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АвтоформированиеЗаключения(Команда)
	
	Оповещение = Новый ОписаниеОповещения("АвтоформированиеЗаключенияПродолжение", ЭтотОбъект);
	РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтотОбъект,,Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоформированиеЗаключенияПродолжение(Результат, Параметры) Экспорт
	
	Отбор = Новый Структура("ДействиеМедосмотра", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("РегистрСведений.ДействияМедосмотровПараметрыАвтозаключений.ФормаСписка", ПараметрыФормы, ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	Элементы.НаименованиеДляПечати.ПодсказкаВвода = Объект.Наименование;
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	
	ЭтоИсследование = Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыДействийМедицинскогоОсмотра.Исследование");
	
	Элементы.ГруппаПечать.Доступность = ЭтоИсследование;
	Элементы.НомерКабинетаДляПечати.Доступность = ВычислитьДоступностьНомераКабинета(Объект);
	Элементы.ВидИсследования.Доступность = ЭтоИсследование;
	
	Объект.СвязьСКлассификатором = Неопределено;
	ОбновитьСвязьСКлассификаторомПоВиду();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьВПрограммеПрохожденияПриИзменении(Элемент)
	Элементы.Врач.Доступность = Объект.ПечататьВПрограммеПрохождения;
	Элементы.ТолькоДляОтметкиИсследования.Доступность = Объект.ПечататьВПрограммеПрохождения;
	Элементы.НомерКабинетаДляПечати.Доступность = ВычислитьДоступностьНомераКабинета(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоДляОтметкиИсследованияПриИзменении(Элемент)
	Объект.Врач = Неопределено;
	Элементы.Врач.Доступность = Объект.ПечататьВПрограммеПрохождения И Не Объект.ТолькоДляОтметкиИсследования;
	Элементы.НомерКабинетаДляПечати.Доступность = ВычислитьДоступностьНомераКабинета(Объект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВычислитьДоступностьНомераКабинета(Знач Объект)
	
	Если Объект.Вид <> ПредопределенноеЗначение("Перечисление.ВидыДействийМедицинскогоОсмотра.Исследование")
		Или (Объект.ПечататьВПрограммеПрохождения И Не Объект.ТолькоДляОтметкиИсследования)
	Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСвязьСКлассификаторомПоВиду()
	
	Если Не ЗначениеЗаполнено(Объект.Вид) 
		Или Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыДействийМедицинскогоОсмотра.Исследование") 
		И Не ЗначениеЗаполнено(Объект.ВидИсследования)
	Тогда
		Элементы.СвязьСКлассификатором.Видимость = Ложь;
		Возврат;
	Иначе
		Элементы.СвязьСКлассификатором.Видимость = Истина;
	КонецЕсли;
	
	ПараметрыВыбораПоВидуДействия = Новый Массив;
	
	Если Объект.Вид = ПредопределенноеЗначение("Перечисление.ВидыДействийМедицинскогоОсмотра.Врач") Тогда
		
		Элементы.СвязьСКлассификатором.Заголовок = НСтр("ru='Должность исполнителя'");
		
		Массив = Новый Массив(); 
		Массив.Добавить(Тип("СправочникСсылка.КлассификаторыМинЗдрава")); 
		ОписаниеТиповОтбор = Новый ОписаниеТипов(Массив);
		Элементы.СвязьСКлассификатором.ОграничениеТипа = ОписаниеТиповОтбор;
		
		ПараметрыВыбораПоВидуДействия.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ДолжностиРаботниковМедОрганизаций")));
		Элементы.СвязьСКлассификатором.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПоВидуДействия);
		
	ИначеЕсли Объект.ВидИсследования = ПредопределенноеЗначение("Перечисление.ВидыИсследованийДействийМедосмотра.ИнструментальноеИсследование") Тогда
		
		Элементы.СвязьСКлассификатором.Заголовок = НСтр("ru='Инструментальное исследование'");
		Массив = Новый Массив(); 
		Массив.Добавить(Тип("СправочникСсылка.ИнструментальныеИсследования")); 
		ОписаниеТиповОтбор = Новый ОписаниеТипов(Массив);
		Элементы.СвязьСКлассификатором.ОграничениеТипа = ОписаниеТиповОтбор;
		
	Иначе
		
		Элементы.СвязьСКлассификатором.Заголовок = НСтр("ru='Лабораторное исследование'");
		
		Массив = Новый Массив(); 
		Массив.Добавить(Тип("СправочникСсылка.КлассификаторыМинЗдрава")); 
		ОписаниеТиповОтбор = Новый ОписаниеТипов(Массив);
		Элементы.СвязьСКлассификатором.ОграничениеТипа = ОписаниеТиповОтбор;
		
		ПараметрыВыбораПоВидуДействия.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ПрофилиЛабораторныхИсследований")));
		Элементы.СвязьСКлассификатором.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПоВидуДействия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидИсследованияПриИзменении(Элемент)
	Объект.СвязьСКлассификатором = Неопределено;
	ОбновитьСвязьСКлассификаторомПоВиду();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСвязьСКлассификаторомПоВиду();
КонецПроцедуры
 
#КонецОбласти
