
Асинх Процедура ОповеститьОЗаписи(Повторно, СообщениеБезПодробностей, СтруктураЗаявки, ФормаВладелец = Неопределено, МодульОповещения = Неопределено)
	
	Если СтруктураЗаявки.Состояние = ПредопределенноеЗначение("Справочник.ВидыСостоянийЗаявок.Запланирована") Тогда
		Ответ = Ждать ВопросАсинх("Оповестить пациента о записи на прием?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, "Оповещение о записи");
	Иначе
		Ответ = Ждать ВопросАсинх("Оповестить пациента об отмене записи на прием?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, "Оповещение об отмене");
	КонецЕсли;
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура("Клиент, Форма, МодульОповещения, СообщениеБезПодробностей",
		СтруктураЗаявки.Клиент, ФормаВладелец, МодульОповещения, СообщениеБезПодробностей);
			
	ПараметрыОткрытия.Вставить("Филиал", СтруктураЗаявки.Филиал);
	ПараметрыОткрытия.Вставить("Состояние", СтруктураЗаявки.Состояние);
	ПараметрыОткрытия.Вставить("Заявка", СтруктураЗаявки.Ссылка);
	ПараметрыОткрытия.Вставить("ДатаПервойЗаписи", СтруктураЗаявки.ДатаНачала);
	
	ПараметрыОткрытия.Вставить("ОбработчикОповещения", "ПродолжитьОповещениеОЗаписи");
	
	iga_ОбработкаДанныхПоЧатамКлиент.ОткрытьФормуВводаНомераТелефона(ПараметрыОткрытия);
	
КонецПроцедуры

Процедура ОтправитьОповещениеОЗаписи(Заявка, ВладелецОповещения = Неопределено, МодульОповещения = Неопределено) Экспорт
	
	Если Не iga_УниверсальныеОбработчикиВызовСервера.ВключеноОповещениеОЗаписи() Тогда
		Возврат;
	КонецЕсли;
	
	СообщениеБезПодробностей = iga_УниверсальныеОбработчикиВызовСервера.ЕстьЗаписиДляОповещения(Заявка);
	Если СообщениеБезПодробностей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЗаявки = iga_УниверсальныеОбработчикиВызовСервера.ПолучитьДанныеДляОтправки(Заявка);
	
	ЕстьЗаписьВСтроках = Не СтруктураЗаявки.омг_БезЗаписиНесколькоВрачей;
	
	ЕстьЗаписьВШапке = Не СтруктураЗаявки.НесколькоСотрудников И Не СтруктураЗаявки.омг_БезЗаписи;
	
	Если ЕстьЗаписьВШапке Или ЕстьЗаписьВСтроках Тогда
		
		Если СтруктураЗаявки.Проведен И iga_УниверсальныеОбработчикиВызовСервера.НоваяЗапись(Заявка) Тогда 
			
			ОповеститьОЗаписи(Ложь, СообщениеБезПодробностей, СтруктураЗаявки, ВладелецОповещения, МодульОповещения);
			
		Иначе
			
			ОповеститьОЗаписи(Истина, СообщениеБезПодробностей, СтруктураЗаявки, ВладелецОповещения, МодульОповещения);
			
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры



