Функция ЭтоСервернаяБаза() Экспорт
	Возврат Найти(ВРег(СтрокаСоединенияИнформационнойБазы()), "FILE=") = 0;
КонецФункции
Функция ПлатформаWindowsИлиLinux() Экспорт
	СисИнфо = Новый СистемнаяИнформация;
	Если СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86 Или СисИнфо.ТипПлатформы = ТипПлатформы.Windows_x86_64 Или СисИнфо.ТипПлатформы = ТипПлатформы.Linux_x86 Или СисИнфо.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
Функция ПолучитьВерсиюПлатформы() Экспорт
	СисИнфо = Новый СистемнаяИнформация;
	ВерсияПлатформы = СисИнфо.ВерсияПриложения;
	Результат = СтрРазделить(ВерсияПлатформы, ".", Ложь);
	Для итератор = 0 По 3 Цикл
		Результат[итератор] = Число(Результат[итератор]);
	КонецЦикла;
	Возврат Результат;
КонецФункции
