
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_СторонниеВрачи.Код КАК Код,
	               |	омг_СторонниеВрачи.Наименование КАК Наименование
	               |ИЗ
	               |	Справочник.омг_СторонниеВрачи КАК омг_СторонниеВрачи
	               |ГДЕ
	               |	омг_СторонниеВрачи.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Данные.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Представление = Выборка.Код + " - " + Выборка.Наименование;
	
КонецПроцедуры
