#Область ПрограммныйИнтерфейс

// Обработчик события вызывается на сервере при установке номера кассовой смены.
//
// Параметры:
//  СтандартнаяОбработка - Булево - признак выполнения стандартной обработки,
//  Префикс - Строка - префикс, который будет использоваться для генерации номера
//
Процедура ПриУстановкеНовогоНомера(Объект, СтандартнаяОбработка, Префикс) Экспорт

	/////////////////////////////////////////////////////////
	// ОМГ
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КассоваяСмена.Номер КАК Номер
		|ИЗ
		|	Документ.КассоваяСмена КАК КассоваяСмена
		|ГДЕ
		|	КассоваяСмена.Ссылка <> &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтандартнаяОбработка = Ложь;
		Объект.Номер = омг_ПолучитьНовыйНомер(ВыборкаДетальныеЗаписи.Номер)
	КонецЕсли;    	

	// ОМГ
	/////////////////////////////////////////////////////////

	
КонецПроцедуры

// Обработчик события вызывается на сервере при необходимости проверки корректности заполнения кассовой смены.
//
// Параметры:
//  Отказ - Булево
//  ПроверяемыеРеквизиты - Массив - реквизиты, для которых будет выполнена проверка заполнения
//
Процедура ОбработкаПроверкиЗаполнения(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
КонецПроцедуры

// Обработчик события вызывается на сервере при вводе документа кассовая смена на основании.
//
// Параметры:
//  ДанныеЗаполнения - Произвольный - Значение, которое используется как основание для заполнения,
//  ТекстЗаполнения - Строка, Неопределено - Текст, используемый для заполнения документа
//  СтандартнаяОбработка - Булево
//
Процедура ОбработкаЗаполнения(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Обработчик события вызывается на сервере при создании на сервере формы списка Кассовая смена.
//
// Параметры:
//  Форма - открываемая форма
//
Процедура ФормаСпискаПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

// Обработчик события вызывается на сервере при создании на сервере формы документа Кассовая смена.
//
// Параметры:
//  Форма - открываемая форма
//
Процедура ФормаДокументаПриСозданииНаСервере(Форма) Экспорт
	
КонецПроцедуры

#КонецОбласти  


/////////////////////////////////////////////////////////
// ОМГ
Функция омг_ПолучитьНовыйНомер(Номер)
	
  Сч = 0;
  Пока Число(Прав(Номер, СтрДлина(Номер) - Сч)) = 0 Цикл
   Сч = Сч + 1;
  КонецЦикла;
  Префикс = Лев(Номер, Сч);
  СтарыйНомерЧислом = Число(Прав(Номер, СтрДлина(Номер) - Сч));
  НовыйНомерЧислом = СтарыйНомерЧислом + 1;
  //ФорматнаяСтрокаЧисловойЧасти = "Ч(0)" + (СтрДлина(Номер) - Сч);
  НовыйНомер = Префикс + Строка(Формат(НовыйНомерЧислом, "ЧЦ=11; ЧВН=; ЧГ=0"));
  
  Возврат НовыйНомер;
  
КонецФункции  

// ОМГ
/////////////////////////////////////////////////////////
