#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Пациент") Тогда
		Клиент = Параметры.Пациент;
	КонецЕсли;
	Если Параметры.Свойство("МедицинскаяКарта") Тогда
		МедицинскаяКарта = Параметры.МедицинскаяКарта;
	КонецЕсли;
	Если Параметры.Свойство("Дата") Тогда
		Дата = Параметры.Дата;
	Иначе
		Дата = ТекущаяДата();
	КонецЕсли;
	
	ПечататьКакПервыйЛист = Истина;
	
	Элементы.МедицинскаяКарта.СписокВыбора.ЗагрузитьЗначения(Стационар.ПолучитьМедКартыСтационара(Клиент, Истина));
	Если Не ЗначениеЗаполнено(МедицинскаяКарта) и Элементы.МедицинскаяКарта.СписокВыбора.Количество()>0 Тогда
		МедицинскаяКарта = Элементы.МедицинскаяКарта.СписокВыбора[0].Значение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МедицинскаяКарта) Тогда
		ВывестиТЛ();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ВывестиТЛ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЭлементПриИзменении(Элемент)
	
	ЗаполнитьДатуПоМедкарте();
	
	Если ЗначениеЗаполнено(МедицинскаяКарта)
		И ЗначениеЗаполнено(Дата)
	Тогда
		ВывестиТЛ();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Элементы.МедицинскаяКарта.СписокВыбора.ЗагрузитьЗначения(Стационар.ПолучитьМедКартыСтационара(Клиент, Истина));
	Если Элементы.МедицинскаяКарта.СписокВыбора.Количество() > 0 Тогда
		
		МедицинскаяКарта = Элементы.МедицинскаяКарта.СписокВыбора[0].Значение;
		ЗаполнитьДатуПоМедкарте();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МедицинскаяКарта)
		И ЗначениеЗаполнено(Дата)
	Тогда
		ВывестиТЛ();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьДатуПоМедкарте()
	
	Если ЗначениеЗаполнено(МедицинскаяКарта) Тогда
		ОписаниеПребывания = Стационар.ПолучитьОписаниеПребыванияПациентаВСтационареПоМедкарте(МедицинскаяКарта);
		Если ЗначениеЗаполнено(ОписаниеПребывания.ДатаПоступления) Тогда
			Дата = ОписаниеПребывания.ДатаПоступления;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиТЛ()
	
	Если Не ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончанияДляПостроения = Дата(3999, 12, 31); 	
	Иначе
		ДатаОкончанияДляПостроения = ДатаОкончания;
	КонецЕсли;
	Отчеты.ТемпературныйЛист.Создать().СформироватьОтчет(ТабличныйДокумент, Клиент, МедицинскаяКарта, Дата, ДатаОкончанияДляПостроения, ПечататьКакПервыйЛист);
	
КонецПроцедуры

#КонецОбласти
