&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокОбластей();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОбластей()
	
	СписокОбластей.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стомОбластиСегментов.Ссылка КАК Область,
	|	ВЫБОР
	|		КОГДА стомВариантыЗубовСписокОбластей.Область ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Установлен
	|ИЗ
	|	Справочник.стомОбластиСегментов КАК стомОбластиСегментов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.стомВариантыЗубов.СписокОбластей КАК стомВариантыЗубовСписокОбластей
	|		ПО (стомВариантыЗубовСписокОбластей.Область = стомОбластиСегментов.Ссылка)
	|			И (стомВариантыЗубовСписокОбластей.Ссылка = &ТекВариант)
	|ГДЕ
	|	НЕ стомОбластиСегментов.ПометкаУдаления
	|	И стомОбластиСегментов.ВидОбласти <> ЗНАЧЕНИЕ(Перечисление.стомВидыОбластей.ЭлементКонструкции)
	|	И ВЫБОР
	|			КОГДА &ЭтоКонструкция
	|				ТОГДА стомОбластиСегментов.ВидОбласти = ЗНАЧЕНИЕ(Перечисление.стомВидыОбластей.Конструкция)
	|			ИНАЧЕ стомОбластиСегментов.ВидОбласти = ЗНАЧЕНИЕ(Перечисление.стомВидыОбластей.ОбластьЗуба)
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("ТекВариант", Объект.Ссылка);
	Запрос.УстановитьПараметр("ЭтоКонструкция", Объект.Конструкция);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СписокОбластей.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗаполнитьСписокОбластейОбъекта();
	
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаполнитьСписокОбластейОбъекта()
	
	Объект.СписокОбластей.Очистить();
	Для Каждого СтрокаОбласть Из СписокОбластей.НайтиСтроки(Новый Структура("Установлен", Истина)) Цикл
		
		ЗаполнитьЗначенияСвойств(Объект.СписокОбластей.Добавить(), СтрокаОбласть);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкцияПриИзменении(Элемент)
	
	ЗаполнитьСписокОбластей();
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьДоступность()
	
	//видимость элементов
	Элементы.Конструкция.Видимость = Не Объект.Основной;
	Элементы.Основной.Видимость = Не Объект.Конструкция;
	Элементы.Обозначение.Видимость = Не Объект.Конструкция;
	
	Объект.Конструкция = Объект.Конструкция И Не Объект.Основной;
	Объект.Основной = Объект.Основной И Не Объект.Конструкция;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновнойПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры
