#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Подразделение") Тогда
		РаботаСФормамиСервер.УстановитьОтборСписка("Подразделение", Параметры.Подразделение, Список, ВидСравненияКомпоновкиДанных.Равно);
	Иначе
		Если Параметры.Свойство("Филиал") Тогда
			Филиал = Параметры.Филиал;	
		Иначе
			УчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику(); 
			Филиал = УчетнаяПолитика.Филиал;
		КонецЕсли;
		
		Если ПараметрыСеанса.УчетПоНесколькимФилиалам Тогда
			Элементы.ФормаВыбратьФилиал.Видимость = Истина;
			Элементы.ФормаВыбратьФилиал.Заголовок = "Клиника: " + Филиал;
		КонецЕсли;
		УстановитьОтборПоФилиалу(Список, Филиал);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьФилиал(Команда)
	
	ОткрытьФорму("Справочник.Филиалы.Форма.ФормаВыбораУпр",,ЭтотОбъект,,,,Новый ОписаниеОповещения("ВыбратьФилиал_Завершение", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = ПредопределенноеЗначение("Справочник.Палаты.Хранение") Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, НСтр("ru='Элемент не доступен для выбора'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоФилиалу(ДинамическийСписок, Филиал)
	
	ДинамическийСписок.Отбор.Элементы.Очистить();
	ЭлементОтбора = ДинамическийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Подразделение.Филиал");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Филиал; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФилиал_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Филиал = Результат;
		Элементы.ФормаВыбратьФилиал.Заголовок = "Клиника: " + Филиал;
		УстановитьОтборПоФилиалу(Список, Филиал);
		Элементы.Список.Обновить();
		Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
			РаскрытьСписок();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаскрытьСписок()

	Палаты = ПолучитьПалатыФилиала(Филиал);
	
	РаскрытиеСтрокПриВыбореФилиала = Истина;
	Для Каждого Палата Из Палаты Цикл
		Элементы.Список.ТекущаяСтрока = Палата;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПалатыФилиала(Филиал)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Палаты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Палаты КАК Палаты
	               |ГДЕ
	               |	Палаты.Подразделение.Филиал = &Филиал";
	
	Запрос.УстановитьПараметр("Филиал", Филиал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивПалат = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивПалат.Добавить(Выборка.Ссылка);	
	КонецЦикла;
	
	Возврат МассивПалат;
	
КонецФункции

#КонецОбласти
