
Процедура ПередЗаписью(Отказ)
	
	Если Не ЭтоГруппа Тогда
		
		Если Не ИмяШаблона = "" Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	iga_ШаблоныСообщений.ИмяШаблона КАК ИмяШаблона,
			|	iga_ШаблоныСообщений.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.iga_ШаблоныСообщений КАК iga_ШаблоныСообщений
			|ГДЕ
			|	НЕ iga_ШаблоныСообщений.Ссылка = &Ссылка
			|	И iga_ШаблоныСообщений.ИмяШаблона = &ИмяШаблона
			|	И НЕ iga_ШаблоныСообщений.Статус = &СтатусСоздан";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("ИмяШаблона", ИмяШаблона);
			Запрос.УстановитьПараметр("СтатусСоздан", Перечисления.iga_СтатусыПодтвержденияШаблонов.Создан);
			ИмяШаблонаНеУникально = Не Запрос.Выполнить().Пустой();
			
			Если ИмяШаблонаНеУникально Тогда
				Отказ = Истина;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Под данным именем шаблона уже существует шаблон!";
				Сообщение.Сообщить();
			КонецЕсли;             
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = Перечисления.iga_СтатусыПодтвержденияШаблонов.Создан;
	Идентификатор = "";
	ИмяШаблона = "";
	ДоступенДляВыбора = Ложь;
	
КонецПроцедуры
