
Процедура ПередЗаписью(Отказ, Замещение)
	
	// У одного оборудования есть только один филиал, получим его и запишем
	// Поскольку оборудование ОБЯЗАНО иметь подразделение с филиалом, то отсутствие филиала является грубой ошибкой	
	Для Каждого Запись Из ЭтотОбъект Цикл
		ЗаписываемыйФилиал = Запись.Оборудование.ФилиалТекущегоРазмещения;
		Если ЗначениеЗаполнено(ЗаписываемыйФилиал) Тогда
		    Запись.Филиал = ЗаписываемыйФилиал;
		Иначе
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры
