
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    /////////////////////////////////////////////////////////
	// ОМГ +     
	
	Если Параметры.ДополнительныеПараметры.Свойство("Организация") Тогда	
		
		ОтборПоОрганизации = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоОрганизации.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
		ОтборПоОрганизации.ПравоеЗначение = Параметры.ДополнительныеПараметры.Организация;
		ОтборПоОрганизации.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
	Иначе
		омг_Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(
		Пользователи.ТекущийПользователь(),
		"омг_ОсновнаяОрганизация"); 
		
	Если ЗначениеЗаполнено(омг_Организация) Тогда
		ОтборПоОрганизации = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоОрганизации.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Организация");
		ОтборПоОрганизации.ПравоеЗначение = омг_Организация;
		ОтборПоОрганизации.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли; 
	
	КонецЕсли;  

    // ОМГ -
    /////////////////////////////////////////////////////////   
	
КонецПроцедуры                
