#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьКалендарьВакцин(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьКалендарьВакцинПродолжение", ЭтотОбъект);
	
	ТекстВопроса = НСтр("ru='Изменения в ранее загруженных вакцинациях календаря будут потеряны (кроме привязки к номенклатуре).'") + " " + НСтр("ru='Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, 60, КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьКалендарьВакцинПродолжение(Ответ, ДополнительныйПараметр) Экспорт
	
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		ЗагрузитьКалендарьВакцинНаСервере();
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьКалендарьВакцинНаСервере()
	ДвоичныеДанные = Справочники.Вакцинации.ПолучитьМакет("ДанныеВакцинаций");
	ОбщегоНазначенияСервер.ВыполнитьЗагрузкуУниверсальнымОбменомXML(Справочники.Вакцинации.ПолучитьМакет("ДанныеВакцинаций"), Истина);
КонецПроцедуры

#КонецОбласти
