#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВыполнитьСтандартноеПолучениеДанныхВыбора") Тогда
		Возврат;
	Иначе
		СтандартнаяОбработка = Ложь;

		Если Не Параметры.Отбор.Свойство("Архив") Тогда
			Параметры.Отбор.Вставить("Архив",Ложь);
		КонецЕсли;
		Параметры.Вставить("ВыполнитьСтандартноеПолучениеДанныхВыбора");
		ДанныеВыбора = Справочники.удалитьЦелиПроведенияВК.ПолучитьДанныеВыбора(Параметры);

		Если ДанныеВыбора.Количество() <> 0 Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Ссылка", ДанныеВыбора);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Наименование КАК Наименование,
			|	УИДЕГИСЗ КАК УИДЕГИСЗ,
			|	Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.удалитьЦелиПроведенияВК КАК ЦелиПроведенияВК
			|ГДЕ
			|	Ссылка В(&Ссылка)
			|
			|УПОРЯДОЧИТЬ ПО
			|	УИДЕГИСЗ"
			;
			Выборка = Запрос.Выполнить().Выбрать();
			
			ДанныеВыбора.Очистить();
			Пока Выборка.Следующий() Цикл
				
				Представление = Выборка.Наименование;
				Если ЗначениеЗаполнено(Выборка.УИДЕГИСЗ) Тогда
					Представление = "(" + Выборка.УИДЕГИСЗ + ")  " + Представление;
				КонецЕсли;
				
				ДанныеВыбора.Добавить(Выборка.Ссылка, Представление);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
