Процедура ЗагрузкаНастроек()
	ПроверкаИОбновлениеДанныхКлиента_ОбщиеДанные();
	ПроверкаИОбновлениеДанныхКлиента_ПерсональныеДанные();
	НаборПараметров = Неопределено;
	НаборПараметров = Константы.доп_сл_НаборПараметров.Получить().Получить();
	Если ТипЗнч(НаборПараметров) = Тип("Неопределено") Тогда
		НаборПараметров = Новый СписокЗначений;
		НаборПараметров.Добавить("", "общ_АдресСервераИПорт");
		НаборПараметров.Добавить(1, "общ_ВремяОжиданияДоАктивации");
		НаборПараметров.Добавить(10602, "общ_ПортАссистентаСервераЛицензий");
		НаборПараметров.Добавить(Ложь, "общ_ПубликацияНастроек");
		НаборПараметров.Добавить(Ложь, "общ_ИспользоватьProxyСервер");
		НаборПараметров.Добавить(ПолучитьВерсиюКлиента(), "гл_ВерсияДанныхКлиента");
		ХранилищеЗН = Новый ХранилищеЗначения(НаборПараметров);
		Константы.доп_сл_НаборПараметров.Установить(ХранилищеЗН);
	КонецЕсли;
	Для каждого Параметр Из НаборПараметров Цикл
		Если Параметр.Представление = "{33F7A39A-6078-4F98-AB74-05A2A2758C8C}" Или Параметр.Представление = "{FE9A8A93-FD2D-4368-AB97-8907F9500DEA}" Или Параметр.Представление = "гл_ВерсияДанныхКлиента" Или Параметр.Представление = "ВерсияДанныхКлиента" Тогда
			Продолжить;
		КонецЕсли;
		ОбъектОбработкиСтруктураУстановитьРеквизит(Параметр.Представление, Параметр.Значение);
	КонецЦикла;
	Попытка
		НаборПараметровЛокальный = ХранилищеОбщихНастроек.Загрузить("доп_СистемаЛицензирования_1_6", "ПерсональныеНастройки");
	Исключение
		НаборПараметровЛокальный = Неопределено;
	КонецПопытки;
	Если ТипЗнч(НаборПараметровЛокальный) <> Тип("СписокЗначений") Тогда
		НаборПараметровЛокальный = Новый СписокЗначений;
		НаборПараметровЛокальный.Добавить("", "АдресСервераИПорт");
		НаборПараметровЛокальный.Добавить(1, "ВремяОжиданияДоАктивации");
		НаборПараметровЛокальный.Добавить(10602, "ПортАссистентаСервераЛицензий");
		НаборПараметровЛокальный.Добавить(Ложь, "ИспользоватьProxyСервер");
		НаборПараметровЛокальный.Добавить(ПолучитьВерсиюКлиента(), "ВерсияДанныхКлиента");
	КонецЕсли;
	Для каждого Параметр Из НаборПараметровЛокальный Цикл
		Если Параметр.Представление = "ВерсияДанныхКлиента" Тогда
			Продолжить;
		КонецЕсли;
		ОбъектОбработкиСтруктураУстановитьРеквизит(Параметр.Представление, Параметр.Значение);
	КонецЦикла;
КонецПроцедуры
Процедура СохранениеНастроек()
	НаборПараметров = Новый СписокЗначений;
	НаборПараметров.Добавить(ОбъектОбработкиСтруктура().АдресСервераИПорт, "АдресСервераИПорт");
	НаборПараметров.Добавить(ОбъектОбработкиСтруктура().ВремяОжиданияДоАктивации, "ВремяОжиданияДоАктивации");
	НаборПараметров.Добавить(ОбъектОбработкиСтруктура().ПортАссистентаСервераЛицензий, "ПортАссистентаСервераЛицензий");
	НаборПараметров.Добавить(ОбъектОбработкиСтруктура().ИспользоватьProxyСервер, "ИспользоватьProxyСервер");
	НаборПараметров.Добавить(ПолучитьВерсиюКлиента(), "ВерсияДанныхКлиента");
	ХранилищеОбщихНастроек.Сохранить("доп_СистемаЛицензирования_1_6", "ПерсональныеНастройки", НаборПараметров);
	НаборПараметров = Новый СписокЗначений;
	НаборПараметров.Добавить(ОбъектОбработкиСтруктура().общ_АдресСервераИПорт, "общ_АдресСервераИПорт");
	НаборПараметров.Добавить(ОбъектОбработкиСтруктура().общ_ВремяОжиданияДоАктивации, "общ_ВремяОжиданияДоАктивации");
	НаборПараметров.Добавить(ОбъектОбработкиСтруктура().общ_ПортАссистентаСервераЛицензий, "общ_ПортАссистентаСервераЛицензий");
	НаборПараметров.Добавить(ОбъектОбработкиСтруктура().общ_ИспользоватьProxyСервер, "общ_ИспользоватьProxyСервер");
	НаборПараметров.Добавить(ОбъектОбработкиСтруктура().общ_ПубликацияНастроек, "общ_ПубликацияНастроек");
	НаборПараметров.Добавить(ОбъектОбработкиСтруктура().общ_СписокИсключения, "общ_СписокИсключения");
	НаборПараметров.Добавить(ПолучитьВерсиюКлиента(), "гл_ВерсияДанныхКлиента");
	СтарыйНаборПараметров = Константы.доп_сл_НаборПараметров.Получить().Получить();
	Если ТипЗнч(СтарыйНаборПараметров) = Тип("СписокЗначений") Тогда
		СлужебныйПараметр = СписокЗначенийНайтиПоПредставлению(СтарыйНаборПараметров, "{33F7A39A-6078-4F98-AB74-05A2A2758C8C}");
		Если ЗначениеОпределено(СлужебныйПараметр) Тогда
			НаборПараметров.Добавить(СлужебныйПараметр, "{33F7A39A-6078-4F98-AB74-05A2A2758C8C}");
		КонецЕсли;
	КонецЕсли;
	ХранилищеЗН = Новый ХранилищеЗначения(НаборПараметров);
	Константы.доп_сл_НаборПараметров.Установить(ХранилищеЗН);
КонецПроцедуры
Функция РезультатСоздать(Код = -1, Комментарий = "", ИнформацияДляТехПоддержки = "")
	Результат = Новый Структура;
	Результат.Вставить("ИмяКласса", "tОбъектРезультат");
	Результат.Вставить("Код", Код);
	КодСтрока = "ОписаниеКодаРезультата_" + Формат(Код, "ЧГ=0;ЧН=0");
	СтрокаОписания = доп_сл_общий.ПолучитьСтрокуСообщения(КодСтрока);
	Результат.Вставить("Описание", СтрокаОписания);
	Результат.Вставить("Комментарий", Комментарий);
	Результат.Вставить("ИнформацияДляТехПоддержки", ИнформацияДляТехПоддержки);
	Результат.Вставить("ВремяВызоваИз1с", - 1);
	Результат.Вставить("ВремяВызоваИз1сТолькоHttpВызов", - 1);
	Возврат Результат;
КонецФункции
Функция СписокЗначенийНайтиПоПредставлению(СписокЗначений, Представление)
	Результат = Неопределено;
	Для каждого Элемент Из СписокЗначений Цикл
		Если Элемент.Представление = Представление Тогда
			Результат = Элемент.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции
Функция СписокЗначенийУдалитьПоПредставлению(СписокЗначений, Представление)
	Результат = Ложь;
	Для каждого Элемент Из СписокЗначений Цикл
		Если Элемент.Представление = Представление Тогда
			СписокЗначений.Удалить(СписокЗначений.Индекс(Элемент));
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции
Функция ПлатформаНеНиже(В1, В2 = Неопределено, В3 = Неопределено, В4 = Неопределено, ТекущаяВерсияПлатформыСтруктура = Неопределено)
	Если ЗначениеОпределено(ТекущаяВерсияПлатформыСтруктура) Тогда
		ТекущаяВерсияПлатформы = ТекущаяВерсияПлатформыСтруктура;
	Иначе
		ТекущаяВерсияПлатформы = ПолучитьВерсиюПлатформыНаСервере();
	КонецЕсли;
	Если ТекущаяВерсияПлатформы.В1 < В1 Тогда
		Возврат Ложь;
	ИначеЕсли ТекущаяВерсияПлатформы.В1 > В1 Тогда
		Возврат Истина;
	КонецЕсли;
	Если ЗначениеОпределено(В2) Тогда
		Если ТекущаяВерсияПлатформы.В2 < В2 Тогда
			Возврат Ложь;
		ИначеЕсли ТекущаяВерсияПлатформы.В2 > В2 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеОпределено(В3) Тогда
		Если ТекущаяВерсияПлатформы.В3 < В3 Тогда
			Возврат Ложь;
		ИначеЕсли ТекущаяВерсияПлатформы.В3 > В3 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеОпределено(В4) Тогда
		Если ТекущаяВерсияПлатформы.В4 < В4 Тогда
			Возврат Ложь;
		ИначеЕсли ТекущаяВерсияПлатформы.В4 > В4 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
КонецФункции
Функция ЗначениеОпределено(Знач Значение)
	Возврат Значение <> Неопределено;
КонецФункции
Процедура ПроверкаИОбновлениеДанныхКлиента_ОбщиеДанные()
	НаборПараметров = Константы.доп_сл_НаборПараметров.Получить().Получить();
	Если ТипЗнч(НаборПараметров) = Тип("Неопределено") Тогда
		Возврат;
	Иначе
		ВерсияДанныхКлиента = СписокЗначенийНайтиПоПредставлению(НаборПараметров, "гл_ВерсияДанныхКлиента");
		ФизическаяВерсияКлиента = ПолучитьВерсиюКлиента();
		ОбновленнаяВерсияКлиента = ВерсияДанныхКлиента;
		ПроизведеноОбновление = Ложь;
	КонецЕсли;
	Если ВерсияДанныхКлиента = Неопределено Тогда
		СписокЗначенийУдалитьПоПредставлению(НаборПараметров, "общ_UDPПорт");
		СтрокаСоединения = СписокЗначенийНайтиПоПредставлению(НаборПараметров, "общ_АдресСервераИПорт");
		Если СтрокаСоединения <> Неопределено Тогда
			ПозицияДвоеточия = Найти(СтрокаСоединения, ":");
			Попытка
				Если ПозицияДвоеточия > 0 Тогда
					IP = Лев(СтрокаСоединения, ПозицияДвоеточия - 1);
					Port = Прав(СтрокаСоединения, СтрДлина(СтрокаСоединения) - ПозицияДвоеточия);
					Port = Формат(Число(Port) + 1, "ЧГ=0");
					СписокЗначенийУдалитьПоПредставлению(НаборПараметров, "общ_АдресСервераИПорт");
					НаборПараметров.Добавить(IP + ":" + Port, "общ_АдресСервераИПорт");
					ПараметрыСообщения = Новый Соответствие;
					ПараметрыСообщения.Вставить("##1##", СтрокаСоединения);
					ПараметрыСообщения.Вставить("##2##", IP);
					ПараметрыСообщения.Вставить("##3##", Port);
					Сообщить(доп_сл_общий.ПолучитьСтрокуСообщения("ОбщаяСтрокаСоединенияОбновлена", ПараметрыСообщения));
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
		ОбновленнаяВерсияКлиента = "1.6.3.2b";
		НаборПараметров.Добавить(ОбновленнаяВерсияКлиента, "гл_ВерсияДанныхКлиента");
		ПроизведеноОбновление = Истина;
	КонецЕсли;
	Если ВерсияДанныхКлиента <> ФизическаяВерсияКлиента И (ОбновленнаяВерсияКлиента = "1.6.3.2.b" Или ОбновленнаяВерсияКлиента = "1.6.3.3" Или ОбновленнаяВерсияКлиента = "1.6.3.4" Или ОбновленнаяВерсияКлиента = "1.6.3.5" Или ОбновленнаяВерсияКлиента = "1.6.4.10" Или ОбновленнаяВерсияКлиента = "1.6.4.12" Или ОбновленнаяВерсияКлиента = "1.6.5.1" Или ОбновленнаяВерсияКлиента = "1.6.5.2" Или ОбновленнаяВерсияКлиента = "1.6.5.3" Или ОбновленнаяВерсияКлиента = "1.6.5.4" Или ОбновленнаяВерсияКлиента = "1.6.5.5" Или ОбновленнаяВерсияКлиента = "1.6.5.6" Или ОбновленнаяВерсияКлиента = "1.6.5.7" Или ОбновленнаяВерсияКлиента = "1.6.5.8" Или ОбновленнаяВерсияКлиента = "1.6.5.9" Или ОбновленнаяВерсияКлиента = "1.6.5.10") Тогда
		СписокЗначенийУдалитьПоПредставлению(НаборПараметров, "общ_ВремяОжиданияДоАктивации");
		НаборПараметров.Добавить(2, "общ_ВремяОжиданияДоАктивации");
		НаборПараметров.Добавить(10602, "общ_ПортАссистентаСервераЛицензий");
		ОбновленнаяВерсияКлиента = "1.6.6.1.b";
		СписокЗначенийУдалитьПоПредставлению(НаборПараметров, "гл_ВерсияДанныхКлиента");
		НаборПараметров.Добавить(ОбновленнаяВерсияКлиента, "гл_ВерсияДанныхКлиента");
		ПроизведеноОбновление = Истина;
	КонецЕсли;
	Если ВерсияДанныхКлиента <> ФизическаяВерсияКлиента И (ОбновленнаяВерсияКлиента = "1.6.6.1.b" Или ОбновленнаяВерсияКлиента = "1.6.6.2.b" Или ОбновленнаяВерсияКлиента = "1.6.6.3" Или ОбновленнаяВерсияКлиента = "1.6.6.4" Или ОбновленнаяВерсияКлиента = "1.6.6.5.b" Или ОбновленнаяВерсияКлиента = "1.6.6.7.b") Тогда
		НаборПараметров.Добавить(Ложь, "общ_ИспользоватьProxyСервер");
		ОбновленнаяВерсияКлиента = "1.6.6.7";
		СписокЗначенийУдалитьПоПредставлению(НаборПараметров, "гл_ВерсияДанныхКлиента");
		НаборПараметров.Добавить(ОбновленнаяВерсияКлиента, "гл_ВерсияДанныхКлиента");
		ПроизведеноОбновление = Истина;
	КонецЕсли;
	Если ВерсияДанныхКлиента <> ФизическаяВерсияКлиента И (ОбновленнаяВерсияКлиента = "1.6.6.7" Или ОбновленнаяВерсияКлиента = "1.6.6.8" Или ОбновленнаяВерсияКлиента = "1.6.6.9" Или ОбновленнаяВерсияКлиента = "1.6.6.10" Или ОбновленнаяВерсияКлиента = "1.6.6.11") Тогда
		доп_сл_сервер_ассистент.НастроитьРегламентноеЗадание();
		ОбновленнаяВерсияКлиента = "1.6.6.12";
		СписокЗначенийУдалитьПоПредставлению(НаборПараметров, "гл_ВерсияДанныхКлиента");
		НаборПараметров.Добавить(ОбновленнаяВерсияКлиента, "гл_ВерсияДанныхКлиента");
		ПроизведеноОбновление = Истина;
	КонецЕсли;
	Если ОбновленнаяВерсияКлиента <> ФизическаяВерсияКлиента Тогда
		ОбновленнаяВерсияКлиента = ФизическаяВерсияКлиента;
		СписокЗначенийУдалитьПоПредставлению(НаборПараметров, "гл_ВерсияДанныхКлиента");
		НаборПараметров.Добавить(ОбновленнаяВерсияКлиента, "гл_ВерсияДанныхКлиента");
		ПроизведеноОбновление = Истина;
	КонецЕсли;
	Если ПроизведеноОбновление Тогда
		ХранилищеЗН = Новый ХранилищеЗначения(НаборПараметров);
		Константы.доп_сл_НаборПараметров.Установить(ХранилищеЗН);
		ПараметрыСообщения = Новый Соответствие;
		ПараметрыСообщения.Вставить("##1##", ?(ВерсияДанныхКлиента = Неопределено, "1.6.2.х", ВерсияДанныхКлиента));
		ПараметрыСообщения.Вставить("##2##", ОбновленнаяВерсияКлиента);
		Сообщить(доп_сл_общий.ПолучитьСтрокуСообщения("ПроизведеноОбновлениеКлиента", ПараметрыСообщения));
	КонецЕсли;
КонецПроцедуры
Процедура ПроверкаИОбновлениеДанныхКлиента_ПерсональныеДанные()
	Попытка
		НаборПараметров = ХранилищеОбщихНастроек.Загрузить("доп_СистемаЛицензирования_1_6", "ПерсональныеНастройки");
	Исключение
		НаборПараметров = Неопределено;
	КонецПопытки;
	Если ТипЗнч(НаборПараметров) = Тип("Неопределено") Тогда
		Возврат;
	Иначе
		ВерсияДанныхКлиента = СписокЗначенийНайтиПоПредставлению(НаборПараметров, "ВерсияДанныхКлиента");
		ФизическаяВерсияКлиента = ПолучитьВерсиюКлиента();
		ОбновленнаяВерсияКлиента = ВерсияДанныхКлиента;
		ПроизведеноОбновление = Ложь;
	КонецЕсли;
	Если Не ЗначениеОпределено(ВерсияДанныхКлиента) Тогда
		СписокЗначенийУдалитьПоПредставлению(НаборПараметров, "UDPПорт");
		СписокЗначенийУдалитьПоПредставлению(НаборПараметров, "ФильтроватьСписок");
		СтрокаСоединения = СписокЗначенийНайтиПоПредставлению(НаборПараметров, "АдресСервераИПорт");
		Если ЗначениеОпределено(СтрокаСоединения) Тогда
			ПозицияДвоеточия = Найти(СтрокаСоединения, ":");
			Попытка
				Если ПозицияДвоеточия > 0 Тогда
					IP = Лев(СтрокаСоединения, ПозицияДвоеточия - 1);
					Port = Прав(СтрокаСоединения, СтрДлина(СтрокаСоединения) - ПозицияДвоеточия);
					Port = Формат(Число(Port) + 1, "ЧН=0; ЧГ=0");
					СписокЗначенийУдалитьПоПредставлению(НаборПараметров, "АдресСервераИПорт");
					НаборПараметров.Добавить(IP + ":" + Port, "АдресСервераИПорт");
					ПараметрыСообщения = Новый Соответствие;
					ПараметрыСообщения.Вставить("##1##", СтрокаСоединения);
					ПараметрыСообщения.Вставить("##2##", IP);
					ПараметрыСообщения.Вставить("##3##", Port);
					Сообщить(доп_сл_общий.ПолучитьСтрокуСообщения("ПерсональнаяСтрокаСоединенияОбновлена", ПараметрыСообщения));
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЕсли;
		ОбновленнаяВерсияКлиента = "1.6.3.2b";
		НаборПараметров.Добавить(ОбновленнаяВерсияКлиента, "ВерсияДанныхКлиента");
		ПроизведеноОбновление = Истина;
	КонецЕсли;
	Если ВерсияДанныхКлиента <> ФизическаяВерсияКлиента И (ОбновленнаяВерсияКлиента = "1.6.3.2.b" Или ОбновленнаяВерсияКлиента = "1.6.3.3" Или ОбновленнаяВерсияКлиента = "1.6.3.4" Или ОбновленнаяВерсияКлиента = "1.6.3.5" Или ОбновленнаяВерсияКлиента = "1.6.4.10" Или ОбновленнаяВерсияКлиента = "1.6.4.12" Или ОбновленнаяВерсияКлиента = "1.6.5.1" Или ОбновленнаяВерсияКлиента = "1.6.5.2" Или ОбновленнаяВерсияКлиента = "1.6.5.3" Или ОбновленнаяВерсияКлиента = "1.6.5.4" Или ОбновленнаяВерсияКлиента = "1.6.5.5" Или ОбновленнаяВерсияКлиента = "1.6.5.6" Или ОбновленнаяВерсияКлиента = "1.6.5.7" Или ОбновленнаяВерсияКлиента = "1.6.5.8" Или ОбновленнаяВерсияКлиента = "1.6.5.9" Или ОбновленнаяВерсияКлиента = "1.6.5.10") Тогда
		СписокЗначенийУдалитьПоПредставлению(НаборПараметров, "ВремяОжиданияДоАктивации");
		НаборПараметров.Добавить(2, "ВремяОжиданияДоАктивации");
		НаборПараметров.Добавить(10602, "ПортАссистентаСервераЛицензий");
		ОбновленнаяВерсияКлиента = "1.6.6.1.b";
		СписокЗначенийУдалитьПоПредставлению(НаборПараметров, "ВерсияДанныхКлиента");
		НаборПараметров.Добавить(ОбновленнаяВерсияКлиента, "ВерсияДанныхКлиента");
		ПроизведеноОбновление = Истина;
	КонецЕсли;
	Если ВерсияДанныхКлиента <> ФизическаяВерсияКлиента И (ОбновленнаяВерсияКлиента = "1.6.6.1.b" Или ОбновленнаяВерсияКлиента = "1.6.6.2.b" Или ОбновленнаяВерсияКлиента = "1.6.6.3" Или ОбновленнаяВерсияКлиента = "1.6.6.4" Или ОбновленнаяВерсияКлиента = "1.6.6.5.b" Или ОбновленнаяВерсияКлиента = "1.6.6.7.b") Тогда
		НаборПараметров.Добавить(Ложь, "ИспользоватьProxyСервер");
		ОбновленнаяВерсияКлиента = "1.6.6.7";
		СписокЗначенийУдалитьПоПредставлению(НаборПараметров, "ВерсияДанныхКлиента");
		НаборПараметров.Добавить(ОбновленнаяВерсияКлиента, "ВерсияДанныхКлиента");
		ПроизведеноОбновление = Истина;
	КонецЕсли;
	Если ОбновленнаяВерсияКлиента <> ФизическаяВерсияКлиента Тогда
		ОбновленнаяВерсияКлиента = ФизическаяВерсияКлиента;
		СписокЗначенийУдалитьПоПредставлению(НаборПараметров, "ВерсияДанныхКлиента");
		НаборПараметров.Добавить(ОбновленнаяВерсияКлиента, "ВерсияДанныхКлиента");
		ПроизведеноОбновление = Истина;
	КонецЕсли;
	Если ПроизведеноОбновление Тогда
		ХранилищеОбщихНастроек.Сохранить("доп_СистемаЛицензирования_1_6", "ПерсональныеНастройки", НаборПараметров);
	КонецЕсли;
КонецПроцедуры
Процедура ИнициализироватьДанныеРеквизитовОбработки()
	Перем Адрес;
	ЗагрузкаНастроек();
	Адрес = ?(ОбъектОбработкиСтруктура().общ_ПубликацияНастроек И Не ПользовательЕстьВСпискеИсключения(), ОбъектОбработкиСтруктура().общ_АдресСервераИПорт, ОбъектОбработкиСтруктура().АдресСервераИПорт);
	Если Адрес = "" Тогда
		Если ОбъектОбработкиСтруктура().общ_ПубликацияНастроек И Не ПользовательЕстьВСпискеИсключения() Тогда
			ОбъектОбработкиСтруктураУстановитьРеквизит("общ_АдресСервераИПорт", "127.0.0.1:10601");
		Иначе
			ОбъектОбработкиСтруктураУстановитьРеквизит("АдресСервераИПорт", "127.0.0.1:10601");
		КонецЕсли;
		СохранениеНастроек();
	КонецЕсли;
	ОбъектОбработкиСтруктураУстановитьРеквизит("СостояниеАктивации", доп_сл_общий.ПолучитьСтрокуСообщения("НеАктивирован"));
	ОбъектОбработкиСтруктураУстановитьРеквизит("ВерсияКлиента", ПолучитьВерсиюКлиента());
	ВерсияОбработки = ОбъектОбработкиСтруктура().ls_версия_обработки;
	ОбъектОбработкиСтруктураУстановитьРеквизит("ВерсияКлиентаИСервера", доп_сл_общий.ПолучитьСтрокуСообщения("Клиент") + ": " + ВерсияОбработки + ".");
	Если Не МеханизмОтключен() Тогда
		ОбъектОбработкиСтруктураУстановитьРеквизит("ОсновнаяНадпись", доп_сл_общий.ПолучитьСтрокуСообщения("ЛицензияБудетПолученаПриПервомЗапросе"));
	Иначе
		ОбъектОбработкиСтруктураУстановитьРеквизит("ОсновнаяНадпись", доп_сл_общий.ПолучитьСтрокуСообщения("ВсеОбъектыДоступны"));
	КонецЕсли;
КонецПроцедуры
Функция ПолучитьКлючПоУмолчанию()
	Результат = "";
	КлючИзПараметра = доп_сл_сервер_ассистент.ЗагрузитьПараметрИзХранилищаПользователя("ПараметрыКлиентаЛицензирования.ИдентификаторОсновногоПродукта");
	Если ЗначениеОпределено(КлючИзПараметра) Тогда
		Возврат КлючИзПараметра;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция СоздатьСервернуюСтруктуруОбработкуЛицензирования()
	Если Не ОбъектОбработкиСоздан() Тогда
		ОбработкаСтруктура = Новый Структура;
		Для каждого ЭлементЗн Из Метаданные.Обработки.доп_сл_КлиентЛицензирования.Реквизиты Цикл
			ТипЗначенияРеквизита = ЭлементЗн.Тип;
			НачальноеЗначение = Неопределено;
			Если ТипЗначенияРеквизита.СодержитТип(Тип("Строка")) Тогда
				НачальноеЗначение = "";
			ИначеЕсли ТипЗначенияРеквизита.СодержитТип(Тип("Число")) Тогда
				НачальноеЗначение = 0;
			ИначеЕсли ТипЗначенияРеквизита.СодержитТип(Тип("Булево")) Тогда
				НачальноеЗначение = Ложь;
			Иначе
				Сообщить(доп_сл_общий.ПолучитьСтрокуСообщения("КонструкторСтруктурыБезВетки"));
			КонецЕсли;
			ОбработкаСтруктура.Вставить(ЭлементЗн.Имя, НачальноеЗначение);
		КонецЦикла;
		ВерсияОбработкиСтрока = Обработки.доп_сл_КлиентЛицензирования.ПолучитьМакет(Метаданные.Обработки.доп_сл_КлиентЛицензирования.Макеты.ls_версия_обработки).ПолучитьТекст();
		ОбработкаСтруктура.Вставить("ls_версия_обработки", ВерсияОбработкиСтрока);
		ПараметрыСеанса.доп_сл_ОбработкаЛицензирования = Новый ХранилищеЗначения(ОбработкаСтруктура);
		ИнициализироватьДанныеРеквизитовОбработки();
	КонецЕсли;
	Возврат Истина;
КонецФункции
Функция ОбъектОбработкиСтруктура()
	Если Не ОбъектОбработкиСоздан() Тогда
		СоздатьСервернуюСтруктуруОбработкуЛицензирования();
	КонецЕсли;
	ОбработкаСтруктура = ПараметрыСеанса.доп_сл_ОбработкаЛицензирования.Получить();
	Возврат ОбработкаСтруктура;
КонецФункции
Функция ОбъектОбработкиСтруктураУстановитьРеквизит(Реквизит, Значение)
	ОбъектОбработки = ОбъектОбработкиСтруктура();
	ОбъектОбработки[Реквизит] = Значение;
	ПараметрыСеанса.доп_сл_ОбработкаЛицензирования = Новый ХранилищеЗначения(ОбъектОбработки);
КонецФункции
Функция ПользовательЕстьВСпискеИсключения()
	ИДПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
	Возврат Найти(ОбъектОбработкиСтруктура().общ_СписокИсключения, ИДПользователя) > 0;
КонецФункции
Функция ПолучитьМассивСтрок()
	Данные = СформироватьМассивДанных();
	РезультатМассив = Новый Массив;
	ГР1 = Данные[0] * Данные[1] * Данные[2] * Данные[3];
	ГР2 = Данные[4] * Данные[5] * Данные[6] * Данные[7];
	ГР3 = Данные[8] * Данные[9] * Данные[10] * Данные[11];
	ГР4 = Данные[12] + ГР1 + ГР2 + ГР3;
	СтрДелитель = "4";
	Для инт = 1 По СтрДлина(Формат(ГР1, "ЧН=0; ЧГ=0")) - 4 Цикл
		СтрДелитель = СтрДелитель + "0";
	КонецЦикла;
	РезультатМассив.Добавить(Данные[0]);
	РезультатМассив.Добавить(Данные[1]);
	РезультатМассив.Добавить(Данные[2]);
	РезультатМассив.Добавить(Данные[3]);
	РезультатМассив.Добавить(Окр(ГР1 / СтрДелитель, 0));
	СтрДелитель = "4";
	Для инт = 1 По СтрДлина(Формат(ГР2, "ЧН=0; ЧГ=0")) - 4 Цикл
		СтрДелитель = СтрДелитель + "0";
	КонецЦикла;
	РезультатМассив.Добавить(Данные[4]);
	РезультатМассив.Добавить(Данные[5]);
	РезультатМассив.Добавить(Данные[6]);
	РезультатМассив.Добавить(Данные[7]);
	РезультатМассив.Добавить(Окр(ГР2 / СтрДелитель, 0));
	СтрДелитель = "4";
	Для инт = 1 По СтрДлина(Формат(ГР3, "ЧН=0; ЧГ=0")) - 4 Цикл
		СтрДелитель = СтрДелитель + "0";
	КонецЦикла;
	РезультатМассив.Добавить(Данные[8]);
	РезультатМассив.Добавить(Данные[9]);
	РезультатМассив.Добавить(Данные[10]);
	РезультатМассив.Добавить(Данные[11]);
	РезультатМассив.Добавить(Окр(ГР3 / СтрДелитель, 0));
	РезультатМассив.Добавить(ГР4);
	Возврат РезультатМассив;
КонецФункции
Функция ПроверитьДанные(К1, К2, К3, КС = Неопределено)
	МассивДанных = ПолучитьМассивСтрок();
	ВнК1 = (Число(МассивДанных[1]) + Число(МассивДанных[5]) + Число(МассивДанных[10])) * Число(МассивДанных[2]) + Число(МассивДанных[3]);
	ВнК2 = (Число(МассивДанных[5]) + Число(МассивДанных[3]) + Число(МассивДанных[7])) * Число(МассивДанных[9]) + Число(МассивДанных[11]);
	ВнК3 = (Число(МассивДанных[6]) + Число(МассивДанных[5]) + Число(МассивДанных[7])) * Число(МассивДанных[8]) + Число(МассивДанных[1]);
	Если ЗначениеОпределено(КС) Тогда
		Возврат КС = ВнК1 + ВнК2 + ВнК3;
	Иначе
		Возврат К1 + К2 + К3 = ВнК1 + ВнК2 + ВнК3;
	КонецЕсли;
КонецФункции
Функция СформироватьМассивДанных()
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	Пока СтрДлина(СтрокаСоединения) < 12 Цикл
		СтрокаСоединения = СтрокаСоединения + СтрокаСоединения;
	КонецЦикла;
	Множитель = Цел(СтрДлина(СтрокаСоединения) / 12);
	Массив = Новый Массив;
	Для Инт = 1 По 12 Цикл
		НомерСимвола = Инт * Множитель;
		КодСимвола = КодСимвола(СтрокаСоединения, НомерСимвола);
		КодСимвола = ?(КодСимвола > 0, КодСимвола, 100);
		Массив.Добавить(КодСимвола);
	КонецЦикла;
	Сумм = 0;
	Для Инт = 1 По СтрДлина(СтрокаСоединения) Цикл
		КодСимвола = КодСимвола(СтрокаСоединения, Инт);
		КодСимвола = ?(КодСимвола > 0, КодСимвола, 100);
		Сумм = Сумм + КодСимвола;
	КонецЦикла;
	Массив.Добавить(Сумм);
	Возврат Массив;
КонецФункции
Функция МеханизмОтключен()
	Результат = Ложь;
	СтрокаПараметраДеактивации = "";
	НаборПараметров = Константы.доп_сл_НаборПараметров.Получить().Получить();
	Если ТипЗнч(НаборПараметров) = Тип("СписокЗначений") Тогда
		Для каждого Параметр Из НаборПараметров Цикл
			Если Параметр.Представление = "{33F7A39A-6078-4F98-AB74-05A2A2758C8C}" Тогда
				СтрокаПараметраДеактивации = Параметр.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Результат = Ложь;
	Если СтрокаПараметраДеактивации <> "" Тогда
		Если ПроверитьДанные(, , , СтрокаПараметраДеактивации) Тогда
			СтрокаДеактивации = СтрокаПараметраДеактивации;
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция ПоместитьВКеш(Параметр, Значение, ВремяЖизни = Неопределено)
	ТекущийКеш = Неопределено;
	НеобходимоИнициализироватьКеш = Истина;
	СтрокаАдресаДанныхВХ = "e1cib/tempstorage/" + ПараметрыСеанса.доп_сл_БуферЛицензированияВторой;
	Если ЭтоАдресВременногоХранилища(СтрокаАдресаДанныхВХ) Тогда
		Попытка
			ТекущийКеш = ПолучитьИзВременногоХранилища(СтрокаАдресаДанныхВХ).Получить();
			Если ТипЗнч(ТекущийКеш) = Тип("Массив") Тогда
				НеобходимоИнициализироватьКеш = Ложь;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Если НеобходимоИнициализироватьКеш Тогда
		ТекущийКеш = Новый Массив;
	КонецЕсли;
	иПараметр = 0;
	иЗначение = 1;
	иВремяЖизни = 2;
	иВремяЗаписи = 3;
	ПараметрНайден = Неопределено;
	Для каждого ЭлементМассива Из ТекущийКеш Цикл
		Если ЭлементМассива[иПараметр] = Параметр Тогда
			ПараметрНайден = ЭлементМассива;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(ПараметрНайден) Тогда
		ПараметрНайден[иЗначение] = Значение;
		ПараметрНайден[иВремяЗаписи] = ТекущаяДата();
	Иначе
		ВременныйМассив = Новый Массив;
		ВременныйМассив.Добавить(Параметр);
		ВременныйМассив.Добавить(Значение);
		ВременныйМассив.Добавить(ВремяЖизни);
		ВременныйМассив.Добавить(ТекущаяДата());
		ТекущийКеш.Добавить(ВременныйМассив);
	КонецЕсли;
	СтрокаАдресаДанныхВХ = ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(ТекущийКеш), Новый УникальныйИдентификатор);
	ПараметрыСеанса.доп_сл_БуферЛицензированияВторой = Сред(СтрокаАдресаДанныхВХ, 19);
	Возврат Истина;
КонецФункции
Функция ПолучитьИзКеша(Параметр, Значение)
	ТекущийКеш = Неопределено;
	НеобходимоИнициализироватьКеш = Истина;
	СтрокаАдресаДанныхВХ = "e1cib/tempstorage/" + ПараметрыСеанса.доп_сл_БуферЛицензированияВторой;
	Если ЭтоАдресВременногоХранилища(СтрокаАдресаДанныхВХ) Тогда
		Попытка
			ТекущийКеш = ПолучитьИзВременногоХранилища(СтрокаАдресаДанныхВХ).Получить();
			Если ТипЗнч(ТекущийКеш) = Тип("Массив") Тогда
				НеобходимоИнициализироватьКеш = Ложь;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Если НеобходимоИнициализироватьКеш Тогда
		Значение = Неопределено;
		Возврат Ложь;
	КонецЕсли;
	иПараметр = 0;
	иЗначение = 1;
	иВремяЖизни = 2;
	иВремяЗаписи = 3;
	ПараметрНайден = Неопределено;
	Для каждого ЭлементМассива Из ТекущийКеш Цикл
		Если ЭлементМассива[иПараметр] = Параметр Тогда
			Если Не ЗначениеОпределено(ЭлементМассива[иВремяЖизни]) Или ЭлементМассива[иВремяЗаписи] + ЭлементМассива[иВремяЖизни] * 60 > ТекущаяДата() Тогда
				ПараметрНайден = ЭлементМассива;
			Иначе
				ТекущийКеш.Удалить(ТекущийКеш.Найти(ЭлементМассива));
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(ПараметрНайден) Тогда
		Значение = ПараметрНайден[иЗначение];
		Возврат Истина;
	Иначе
		Значение = Неопределено;
		Возврат Ложь;
	КонецЕсли;
КонецФункции
Функция ПротестироватьКэш() Экспорт
	ЗагруженноеЗначение = "";
	ПоместитьВКеш("Проверка", "ЗначениеПроверка");
	Результат = ПолучитьИзКеша("Проверка", ЗагруженноеЗначение);
	Если Результат Тогда
		Если ЗагруженноеЗначение = "ЗначениеПроверка" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
Функция DecToHex(DecNumber, Digits)
	stringHex = "";
	arrHex = Новый Array;
	arrHex.Add("0");
	arrHex.Add("1");
	arrHex.Add("2");
	arrHex.Add("3");
	arrHex.Add("4");
	arrHex.Add("5");
	arrHex.Add("6");
	arrHex.Add("7");
	arrHex.Add("8");
	arrHex.Add("9");
	arrHex.Add("A");
	arrHex.Add("B");
	arrHex.Add("C");
	arrHex.Add("D");
	arrHex.Add("E");
	arrHex.Add("F");
	Если DecNumber = 0 Тогда
		stringHex = stringHex + "0";
	Иначе
		i = 0;
		tempNumber = DecNumber;
		rem = tempNumber % 16;
		Если rem = 0 Тогда
			newStr = DecToHex(Цел(tempNumber / 16), 0);
			stringHex = newStr + "0" + stringHex;
			tempNumber = 0;
		Иначе
			stringHex = arrHex[rem] + stringHex;
			tempNumber = tempNumber - rem * Pow(16, i);
			Если tempNumber > 0 Тогда
				newStr = DecToHex(Цел(tempNumber / 16), 0);
				stringHex = newStr + stringHex;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Delta = Digits - СтрДлина(stringHex);
	Если Delta > 0 Тогда
		Для i = 1 По Delta Цикл
			stringHex = "0" + stringHex;
		КонецЦикла;
	КонецЕсли;
	Возврат stringHex;
КонецФункции
Функция CodeStringHttp(fStream)
	Час = Число(Формат(ТекущаяДата(), "ДФ=Ч"));
	Минута = Число(Формат(ТекущаяДата(), "ДФ=м"));
	Секунда = Число(Формат(ТекущаяДата(), "ДФ=с"));
	Час = ?(Час > 0, Час, 1);
	РандомноеЧисло = (Час * Минута + Час * Секунда) * ?(Час > 20, Час - 8, Час);
	Если РандомноеЧисло > 25000 Тогда
		РандомноеЧисло = РандомноеЧисло - 25000;
	КонецЕсли;
	КонтрольнаяСумма = 0;
	ShiftByte = 100 + РандомноеЧисло;
	fCodedStream = "";
	Для Итератор = 1 По СтрДлина(fStream) Цикл
		buffer = КодСимвола(Сред(fStream, Итератор, 1), 1);
		КонтрольнаяСумма = КонтрольнаяСумма + buffer * Итератор;
		Если КонтрольнаяСумма > 9000000000000000000 Тогда
			КонтрольнаяСумма = Цел(КонтрольнаяСумма / 2);
		КонецЕсли;
		b = buffer + ShiftByte;
		Если b > 55000 Тогда
			buffer = b - 55000;
		Иначе
			buffer = b;
		КонецЕсли;
		fCodedStream = fCodedStream + Символ(buffer);
	КонецЦикла;
	fCodedStream = fCodedStream + Символ(ShiftByte);
	Hash = DecToHex(КонтрольнаяСумма, 16);
	fCodedStream = fCodedStream + Hash;
	fStream = fCodedStream;
	Возврат РезультатСоздать(0);
КонецФункции
Функция DeCodeStringHttp(fCodedStream)
	Result = РезультатСоздать(0);
	КонтрольнаяСумма = 0;
	Если СтрДлина(fCodedStream) < 18 Тогда
		Result = РезультатСоздать(13, доп_сл_общий.ПолучитьСтрокуСообщения("РазмерПакетаНеСоотвТребованиям"));
	КонецЕсли;
	Если НетОшибок(Result) Тогда
		Hash = Прав(fCodedStream, 16);
		fCodedStream = Лев(fCodedStream, СтрДлина(fCodedStream) - 16);
		Если НетОшибок(Result) Тогда
			ShiftByte = КодСимвола(Прав(fCodedStream, 1), 1);
			fCodedStream = Лев(fCodedStream, СтрДлина(fCodedStream) - 1);
			fStream = "";
			Для н = 1 По СтрДлина(fCodedStream) Цикл
				buffer = КодСимвола(Сред(fCodedStream, н, 1), 1);
				b = buffer - ShiftByte;
				Если b < 0 Тогда
					buffer = b + 55000;
				Иначе
					buffer = b;
				КонецЕсли;
				КонтрольнаяСумма = КонтрольнаяСумма + buffer * н;
				Если КонтрольнаяСумма > 9000000000000000000 Тогда
					КонтрольнаяСумма = Цел(КонтрольнаяСумма / 2);
				КонецЕсли;
				fStream = fStream + Символ(buffer);
			КонецЦикла;
			HashReal = DecToHex(КонтрольнаяСумма, 16);
			Если Hash <> HashReal Тогда
				Result = РезультатСоздать(13, доп_сл_общий.ПолучитьСтрокуСообщения("ДанныеПакетаПовреждены") + " (SB:" + Формат(ShiftByte, "ЧН=0; ЧГ=0") + ")");
			Иначе
				fCodedStream = fStream;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Result;
КонецФункции
Функция GetClHttpSessionId()
	Возврат Формат(70000 + НомерСеансаИнформационнойБазы(), "ЧН=0; ЧГ=0");
КонецФункции
Процедура AddAuthData(Func, ClHttpSessionId = "")
	Version = ПолучитьВерсиюКлиента();
	UserName = ?(ИмяПользователя() <> "", ИмяПользователя() + " (1С)", "(1С)");
	Password = "";
	HttpSessionId = ?(ClHttpSessionId = "", GetClHttpSessionId(), ClHttpSessionId);
	ЗапрещенныеСимволы = "&";
	UserName_ = "";
	Для итератор = 1 По СтрДлина(UserName) Цикл
		ТекСимвол = Сред(UserName, итератор, 1);
		Если Найти(ЗапрещенныеСимволы, ТекСимвол) = 0 Тогда
			UserName_ = UserName_ + ТекСимвол;
		КонецЕсли;
	КонецЦикла;
	UserName = UserName_;
	AddFuncParam("@ClVersion", Version, Func.OutputParameters);
	AddFuncParam("@ClUserName", UserName, Func.OutputParameters);
	AddFuncParam("@ClPassword", Password, Func.OutputParameters);
	AddFuncParam("@ClHttpSessionId", HttpSessionId, Func.OutputParameters);
КонецПроцедуры
Функция tFunctionParametersCreate(Param, Value)
	Результат = Новый Структура;
	Результат.Вставить("ИмяКласса", "tFunctionParameters");
	Результат.Вставить("Parameter", Param);
	Результат.Вставить("Value", Value);
	Возврат Результат;
КонецФункции
Функция tFunctionCreate(ИмяФункции, ClHttpSessionId = "")
	Результат = Новый Структура;
	Результат.Вставить("ИмяКласса", "tFunction");
	Результат.Вставить("CommandName", ИмяФункции);
	Результат.Вставить("ResponseText", "");
	Результат.Вставить("InputCommandStr", "");
	Результат.Вставить("OutputCommandStr", "");
	Результат.Вставить("InputParameters", Новый Массив);
	Результат.Вставить("OutputParameters", Новый Массив);
	AddAuthData(Результат, ClHttpSessionId);
	Возврат Результат;
КонецФункции
Функция AddFuncParam(Param, Value, ParamList)
	Результат = РезультатСоздать(0);
	ЗначениеНайдено = Ложь;
	Для i = 0 По ParamList.Количество() - 1 Цикл
		Если ВРег(ParamList[i].Parameter) = ВРег(Param) Тогда
			ParamList[i].Value = Value;
			ЗначениеНайдено = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не ЗначениеНайдено Тогда
		ParamList.Добавить(tFunctionParametersCreate(Param, Value));
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция GetFuncParam(Param, Value, ParamList)
	Результат = Ложь;
	Для i = 0 По ParamList.Количество() - 1 Цикл
		Если ВРег(ParamList[i].Parameter) = ВРег(Param) Тогда
			Value = ParamList[i].Value;
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции
Функция MakeOutputCommandStrV2(Func)
	Заголовок = "<?xml version=""1.0"" encoding=""utf-8""?>" + Символы.ПС + "<CustomFile>";
	Подвал = Символы.ПС + "</CustomFile>";
	Тело = "<pv><p>@CommandName</p><v>" + Func.CommandName + "</v></pv>";
	Тело = Тело + Символы.ПС + "<pv><p>@ResponseText</p><v>" + Func.ResponseText + "</v></pv>";
	Для каждого Параметр Из Func.OutputParameters Цикл
		Тело = Тело + Символы.ПС + "<pv><p>" + Параметр.Parameter + "</p><v>" + Параметр.Value + "</v></pv>";
	КонецЦикла;
	Func.OutputCommandStr = Заголовок + Тело + Подвал;
	РезультатКодирования = CodeStringHttp(Func.OutputCommandStr);
	Возврат РезультатКодирования;
КонецФункции
Функция ParseInputCommandStrV2(Func)
	Func.InputParameters.Очистить();
	РезультатДекодирования = DeCodeStringHttp(Func.InputCommandStr);
	Если Не НетОшибок(РезультатДекодирования) Тогда
		Возврат РезультатДекодирования;
	КонецЕсли;
	хмл = Новый ЧтениеXML;
	хмл.УстановитьСтроку(Func.InputCommandStr);
	хмл.Прочитать();
	ТипСодержимого = хмл.Имя;
	Если ВРег(ТипСодержимого) <> ВРег("CustomFile") Тогда
		Возврат РезультатСоздать(7);
	КонецЕсли;
	БлокПараметраЗначения = Ложь;
	БлокПараметра = Ложь;
	БлокЗначения = Ложь;
	Параметр = "";
	Значение = "";
	ЗначениеДобавлено = Ложь;
	Пока хмл.Прочитать() Цикл
		Если хмл.Имя = "pv" Тогда
			Если хмл.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				БлокПараметраЗначения = Истина;
			ИначеЕсли хмл.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				БлокПараметраЗначения = Ложь;
			КонецЕсли;
			БлокПараметра = Ложь;
			БлокЗначения = Ложь;
			Параметр = "";
			Значение = "";
			Продолжить;
		ИначеЕсли хмл.Имя = "p" Тогда
			Если хмл.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				БлокПараметра = Истина;
			ИначеЕсли хмл.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				БлокПараметра = Ложь;
			КонецЕсли;
			БлокЗначения = Ложь;
			Продолжить;
		ИначеЕсли хмл.Имя = "v" Тогда
			Если хмл.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
				БлокЗначения = Истина;
				ЗначениеДобавлено = Ложь;
			ИначеЕсли хмл.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
				БлокЗначения = Ложь;
				Если Не ЗначениеДобавлено Тогда
					AddFuncParam(Параметр, "", Func.InputParameters);
				КонецЕсли;
				ЗначениеДобавлено = Ложь;
			КонецЕсли;
			БлокПараметра = Ложь;
			Продолжить;
		КонецЕсли;
		Если БлокПараметраЗначения Тогда
			Если БлокПараметра Тогда
				Параметр = хмл.Значение;
				Продолжить;
			ИначеЕсли БлокЗначения Тогда
				Значение = хмл.Значение;
				AddFuncParam(Параметр, Значение, Func.InputParameters);
				ЗначениеДобавлено = Истина;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	РезультатВыполненияФункции = "";
	Если Не GetFuncParam("Result", РезультатВыполненияФункции, Func.InputParameters) Тогда
		ОшибкаПротокола = "";
		Если GetFuncParam("ProtocolError", ОшибкаПротокола, Func.InputParameters) Тогда
			Возврат РезультатСоздать(12, ОшибкаПротокола);
		Иначе
			Возврат РезультатСоздать(9);
		КонецЕсли;
	Иначе
		Если РезультатВыполненияФункции = "1" Тогда
			Возврат РезультатСоздать(0);
		Иначе
			ОписаниеОшибки = "";
			Если GetFuncParam("Error", ОписаниеОшибки, Func.InputParameters) И ОписаниеОшибки <> "" Тогда
				Если Лев(ОписаниеОшибки, 46) = "На сервере лицензий не зарегистрирован продукт" Тогда
					ПараметрыСообщения = Новый Соответствие;
					ПараметрыСообщения.Вставить("##1##", Прав(ОписаниеОшибки, СтрДлина(ОписаниеОшибки) - 47));
					ОписаниеОшибки = доп_сл_общий.ПолучитьСтрокуСообщения("НаСервереЛицензийНеЗарегистрированПродукт", ПараметрыСообщения);
				КонецЕсли;
				Возврат РезультатСоздать(8, ОписаниеОшибки);
			Иначе
				Возврат РезультатСоздать(8);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецФункции
Функция FunctionExecuteViaAssistant(Func, PassThruVirtualConnectionID = Ложь, СохранитьLsaApiИдСеанса = Ложь, АктуализироватьLsaApiИдСеансаПередОтправкой = Ложь, ПараметрыСоединения = Неопределено)
	ВерсияМодуля = ПолучитьВерсиюКлиента();
	ВерсияОбработки = Обработки.доп_сл_КлиентЛицензирования.ПолучитьМакет(Метаданные.Обработки.доп_сл_КлиентЛицензирования.Макеты.ls_версия_обработки).ПолучитьТекст();
	Если ВерсияОбработки <> ВерсияМодуля Тогда
		Возврат РезультатСоздать(10);
	КонецЕсли;
	SID = "";
	КлючИсходящегоПакета = СоздатьGUID(Истина, Ложь, Истина);
	Func.ResponseText = КлючИсходящегоПакета;
	Результат = MakeOutputCommandStrV2(Func);
	Если Не НетОшибок(Результат) Тогда
		Возврат Результат;
	КонецЕсли;
	НастройкиСоединения = ?(ЗначениеОпределено(ПараметрыСоединения), ПараметрыСоединения, ПолучитьНастройкиСоединения());
	Попытка
		ClHttpSessionId = "";
		Если PassThruVirtualConnectionID Тогда
			ClHttpSessionId = GetClHttpSessionId();
		КонецЕсли;
		Если АктуализироватьLsaApiИдСеансаПередОтправкой Тогда
			SID = доп_сл_сервер_ассистент.ЗагрузитьПараметрИзХранилищаПользователя("SessionID");
			Если ЗначениеЗаполнено(SID) Тогда
				РезультатАктуализации = доп_сл_сервер_ассистент.lsaAPI_EchoString("echo", SID);
				Если Не доп_сл_сервер_ассистент.НетОшибок(РезультатАктуализации) Тогда
					SID = "";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если PassThruVirtualConnectionID И ЭтоСервернаяБаза() Тогда
			AutoReleaseLicense = Ложь;
		Иначе
			AutoReleaseLicense = Истина;
		КонецЕсли;
		РезультатАссистента = доп_сл_сервер_ассистент.lsaAPI_SlCallLicenseServerMethod(НастройкиСоединения.Port, Func.OutputCommandStr, ClHttpSessionId, SID, AutoReleaseLicense);
		Если доп_сл_сервер_ассистент.НетОшибок(РезультатАссистента) Тогда
			Func.InputCommandStr = РезультатАссистента.fields.MethodResult.fields.CodedString;
			Если СохранитьLsaApiИдСеанса Тогда
				доп_сл_сервер_ассистент.ЗаписатьПараметрВХранилищеПользователя("SessionID", РезультатАссистента.fields.MethodResult.fields.SessionID);
			КонецЕсли;
		Иначе
			Результат = РезультатСоздать(14);
			Результат.Комментарий = Результат.Описание + Символы.ПС + доп_сл_общий.ПолучитьСтрокуСообщения("ПоПричине") + РезультатАссистента.fields.Description + " (" + Формат(РезультатАссистента.fields.Code, "ЧН=0; ЧГ=0") + ")";
			Результат.ИнформацияДляТехПоддержки = РезультатАссистента.fields.Comment;
			Результат.ВремяВызоваИз1с = РезультатАссистента.fields.ExecutionTimeFrom1c;
			Результат.ВремяВызоваИз1сТолькоHttpВызов = РезультатАссистента.fields.ExecutionTimeFrom1cHttpOnly;
			Если Результат.ИнформацияДляТехПоддержки <> "" Тогда
				ПозицияОбщейЧасти = Найти(Результат.ИнформацияДляТехПоддержки, "}:");
				Если ПозицияОбщейЧасти <> 0 Тогда
					Результат.ИнформацияДляТехПоддержки = Прав(Результат.ИнформацияДляТехПоддержки, СтрДлина(Результат.ИнформацияДляТехПоддержки) - ПозицияОбщейЧасти - 2);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Исключение
		Результат = РезультатСоздать(5, ОписаниеОшибки());
	КонецПопытки;
	Если НетОшибок(Результат) Тогда
		Результат = ParseInputCommandStrV2(Func);
		Если НетОшибок(Результат) И КлючИсходящегоПакета <> Func.ResponseText Тогда
			Результат = РезультатСоздать(11);
		КонецЕсли;
		Результат.ВремяВызоваИз1с = РезультатАссистента.fields.ExecutionTimeFrom1c;
		Результат.ВремяВызоваИз1сТолькоHttpВызов = РезультатАссистента.fields.ExecutionTimeFrom1cHttpOnly;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция ПоддержкаКода(В1, В2 = Неопределено, В3 = Неопределено, В4 = Неопределено) Экспорт
	Если Не ПлатформаНеНиже(В1, В2, В3, В4) Тогда
		Возврат Ложь;
	Иначе
		Если ПлатформаНеНиже(8, 2, 14) И Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_2_13 Тогда
			Возврат ПлатформаНеНиже(В1, В2, В3, В4, Новый Структура("в1,в2,в3,в4", 8, 2, 13, 219));
		КонецЕсли;
		Если ПлатформаНеНиже(8, 3) И Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_2_16 Тогда
			Возврат ПлатформаНеНиже(В1, В2, В3, В4, Новый Структура("в1,в2,в3,в4", 8, 2, 16, 368));
		КонецЕсли;
		Если ПлатформаНеНиже(8, 3, 2) И Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_1 Тогда
			Возврат ПлатформаНеНиже(В1, В2, В3, В4, Новый Структура("в1,в2,в3,в4", 8, 3, 1, 1));
		КонецЕсли;
		Если ПлатформаНеНиже(8, 3, 3) И Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_2 Тогда
			Возврат ПлатформаНеНиже(В1, В2, В3, В4, Новый Структура("в1,в2,в3,в4", 8, 3, 2, 1));
		КонецЕсли;
		Если ПлатформаНеНиже(8, 3, 4) И Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_3 Тогда
			Возврат ПлатформаНеНиже(В1, В2, В3, В4, Новый Структура("в1,в2,в3,в4", 8, 3, 3, 721));
		КонецЕсли;
		Если ПлатформаНеНиже(8, 3, 5) И Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_4 Тогда
			Возврат ПлатформаНеНиже(В1, В2, В3, В4, Новый Структура("в1,в2,в3,в4", 8, 3, 4, 496));
		КонецЕсли;
		Если ПлатформаНеНиже(8, 3, 6) И Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_5 Тогда
			Возврат ПлатформаНеНиже(В1, В2, В3, В4, Новый Структура("в1,в2,в3,в4", 8, 3, 5, 1570));
		КонецЕсли;
		Если ПлатформаНеНиже(8, 3, 7) И Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_6 Тогда
			Возврат ПлатформаНеНиже(В1, В2, В3, В4, Новый Структура("в1,в2,в3,в4", 8, 3, 6, 2449));
		КонецЕсли;
		Если ПлатформаНеНиже(8, 3, 8) И Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_7 Тогда
			Возврат ПлатформаНеНиже(В1, В2, В3, В4, Новый Структура("в1,в2,в3,в4", 8, 3, 7, 2027));
		КонецЕсли;
		Если ПлатформаНеНиже(8, 3, 9) И Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_8 Тогда
			Возврат ПлатформаНеНиже(В1, В2, В3, В4, Новый Структура("в1,в2,в3,в4", 8, 3, 8, 2322));
		КонецЕсли;
		Если ПлатформаНеНиже(8, 3, 10) И Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_9 Тогда
			Возврат ПлатформаНеНиже(В1, В2, В3, В4, Новый Структура("в1,в2,в3,в4", 8, 3, 9, 2233));
		КонецЕсли;
		Если ПлатформаНеНиже(8, 3, 11) И Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_10 Тогда
			Возврат ПлатформаНеНиже(В1, В2, В3, В4, Новый Структура("в1,в2,в3,в4", 8, 3, 10, 2753));
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
КонецФункции
Процедура ИнициализацияПараметровСеанса(МассивТребуемыхПараметров) Экспорт
	Если ЗначениеОпределено(МассивТребуемыхПараметров) Тогда
		Если МассивТребуемыхПараметров.Найти("доп_сл_ОбработкаЛицензирования") <> Неопределено Тогда
			ПараметрыСеанса.доп_сл_ОбработкаЛицензирования = Новый ХранилищеЗначения(Неопределено);
		КонецЕсли;
		Если МассивТребуемыхПараметров.Найти("доп_сл_БуферЛицензирования") <> Неопределено Тогда
			ПараметрыСеанса.доп_сл_БуферЛицензирования = "";
		КонецЕсли;
		Если МассивТребуемыхПараметров.Найти("доп_сл_БуферЛицензированияВторой") <> Неопределено Тогда
			ПараметрыСеанса.доп_сл_БуферЛицензированияВторой = "";
		КонецЕсли;
		Если МассивТребуемыхПараметров.Найти("доп_сл_ИдНастроек") <> Неопределено Тогда
			ПараметрыСеанса.доп_сл_ИдНастроек = СоздатьGUID(Ложь, Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Функция ЭтоСервернаяБаза() Экспорт
	Возврат Найти(ВРег(СтрокаСоединенияИнформационнойБазы()), "FILE=") = 0;
КонецФункции
Функция СоздатьGUID(ЗаключитьВСкобки = Ложь, ИсключитьРазделители = Ложь, ВерхнийРегистр = Истина) Экспорт
	GUID = Новый УникальныйИдентификатор;
	Результат = Строка(GUID);
	Если ИсключитьРазделители Тогда
		Результат = СтрЗаменить(Результат, "-", "");
	КонецЕсли;
	Если ЗаключитьВСкобки Тогда
		Результат = "{" + Результат + "}";
	КонецЕсли;
	Если ВерхнийРегистр Тогда
		Результат = ВРег(Результат);
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция ПолучитьВерсиюКлиента() Экспорт
	Возврат "1.6.6.13";
КонецФункции
Функция ИспользоватьРежимСовместимостиСПлатформой_8_3_10() Экспорт
	ВерсияКонфигурации = ПолучитьВерсиюПлатформыНаСервере();
	Возврат ВерсияКонфигурации.в1 = 8 И ВерсияКонфигурации.в2 = 3 И ВерсияКонфигурации.в3 = 10 Или Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_10;
КонецФункции
Функция ИспользоватьРежимСовместимостиСПлатформой_8_3_9() Экспорт
	ВерсияКонфигурации = ПолучитьВерсиюПлатформыНаСервере();
	Возврат ВерсияКонфигурации.в1 = 8 И ВерсияКонфигурации.в2 = 3 И ВерсияКонфигурации.в3 = 9 Или Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_9;
КонецФункции
Функция ИспользоватьРежимСовместимостиСПлатформой_8_3_8() Экспорт
	ВерсияКонфигурации = ПолучитьВерсиюПлатформыНаСервере();
	Возврат ВерсияКонфигурации.в1 = 8 И ВерсияКонфигурации.в2 = 3 И ВерсияКонфигурации.в3 = 8 Или Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_8;
КонецФункции
Функция ИспользоватьРежимСовместимостиСПлатформой_8_3_7() Экспорт
	ВерсияКонфигурации = ПолучитьВерсиюПлатформыНаСервере();
	Возврат ВерсияКонфигурации.в1 = 8 И ВерсияКонфигурации.в2 = 3 И ВерсияКонфигурации.в3 = 7 Или Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_7;
КонецФункции
Функция ИспользоватьРежимСовместимостиСПлатформой_8_3_6() Экспорт
	ВерсияКонфигурации = ПолучитьВерсиюПлатформыНаСервере();
	Возврат ВерсияКонфигурации.в1 = 8 И ВерсияКонфигурации.в2 = 3 И ВерсияКонфигурации.в3 = 6 Или Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_6;
КонецФункции
Функция ИспользоватьРежимСовместимостиСПлатформой_8_3_5() Экспорт
	ВерсияКонфигурации = ПолучитьВерсиюПлатформыНаСервере();
	Возврат ВерсияКонфигурации.в1 = 8 И ВерсияКонфигурации.в2 = 3 И ВерсияКонфигурации.в3 = 5 Или Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_5;
КонецФункции
Функция ИспользоватьРежимСовместимостиСПлатформой_8_3_4() Экспорт
	ВерсияКонфигурации = ПолучитьВерсиюПлатформыНаСервере();
	Возврат ВерсияКонфигурации.в1 = 8 И ВерсияКонфигурации.в2 = 3 И ВерсияКонфигурации.в3 = 4 Или Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_4;
КонецФункции
Функция ИспользоватьРежимСовместимостиСПлатформой_8_3_3() Экспорт
	ВерсияКонфигурации = ПолучитьВерсиюПлатформыНаСервере();
	Возврат ВерсияКонфигурации.в1 = 8 И ВерсияКонфигурации.в2 = 3 И ВерсияКонфигурации.в3 = 3 Или Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_3;
КонецФункции
Функция ИспользоватьРежимСовместимостиСПлатформой_8_3_2() Экспорт
	ВерсияКонфигурации = ПолучитьВерсиюПлатформыНаСервере();
	Возврат ВерсияКонфигурации.в1 = 8 И ВерсияКонфигурации.в2 = 3 И ВерсияКонфигурации.в3 = 2 Или Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_2;
КонецФункции
Функция ИспользоватьРежимСовместимостиСПлатформой_8_3_1() Экспорт
	ВерсияКонфигурации = ПолучитьВерсиюПлатформыНаСервере();
	Возврат ВерсияКонфигурации.в1 = 8 И ВерсияКонфигурации.в2 = 3 И ВерсияКонфигурации.в3 = 1 Или Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_3_1;
КонецФункции
Функция ИспользоватьРежимСовместимостиСПлатформой_8_2_16() Экспорт
	ВерсияКонфигурации = ПолучитьВерсиюПлатформыНаСервере();
	Возврат ВерсияКонфигурации.в1 = 8 И ВерсияКонфигурации.в2 = 2 И ВерсияКонфигурации.в3 = 16 Или Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_2_16;
КонецФункции
Функция ИспользоватьРежимСовместимостиСПлатформой_8_2_13() Экспорт
	ВерсияКонфигурации = ПолучитьВерсиюПлатформыНаСервере();
	Возврат ВерсияКонфигурации.в1 = 8 И ВерсияКонфигурации.в2 = 2 И ВерсияКонфигурации.в3 = 13 Или Метаданные.РежимСовместимости = Метаданные.СвойстваОбъектов.РежимСовместимости.Версия8_2_13;
КонецФункции
Функция ИспользоватьРежимСовместимостиФормСПлатформой_8_3_6() Экспорт
	Возврат ИспользоватьРежимСовместимостиСПлатформой_8_3_1() Или ИспользоватьРежимСовместимостиСПлатформой_8_3_2() Или ИспользоватьРежимСовместимостиСПлатформой_8_3_3() Или ИспользоватьРежимСовместимостиСПлатформой_8_3_4() Или ИспользоватьРежимСовместимостиСПлатформой_8_3_5() Или ИспользоватьРежимСовместимостиСПлатформой_8_3_6();
КонецФункции
Функция ИспользоватьРежимСовместимостиФормСПлатформой_8_2_13() Экспорт
	Возврат ИспользоватьРежимСовместимостиСПлатформой_8_2_13() Или ИспользоватьРежимСовместимостиСПлатформой_8_2_16();
КонецФункции
Функция ПолучитьВерсиюПлатформыНаСервере() Экспорт
	СтруктураВерсии = Новый Структура;
	СисИнфо = Новый СистемнаяИнформация;
	ВерсияПлатформы = СисИнфо.ВерсияПриложения;
	МассивВерсий = Новый Массив;
	Курсор = 0;
	ДлинаСтроки = СтрДлина(ВерсияПлатформы);
	Для итератор = 1 По ДлинаСтроки Цикл
		Если Сред(ВерсияПлатформы, итератор, 1) = "." Или итератор = ДлинаСтроки Тогда
			КонецСтроки = итератор = ДлинаСтроки;
			МассивВерсий.Добавить(Сред(ВерсияПлатформы, Курсор + 1, итератор - Курсор - ?(КонецСтроки, 0, 1)));
			Курсор = итератор;
		КонецЕсли;
	КонецЦикла;
	СтруктураВерсии.Вставить("в1", Число(МассивВерсий[0]));
	СтруктураВерсии.Вставить("в2", Число(МассивВерсий[1]));
	СтруктураВерсии.Вставить("в3", Число(МассивВерсий[2]));
	СтруктураВерсии.Вставить("в4", Число(МассивВерсий[3]));
	Возврат СтруктураВерсии;
КонецФункции
Процедура СохранитьНастройкиВОбъект(Объект) Экспорт
	Для каждого Реквизит Из Метаданные.Обработки.доп_сл_КлиентЛицензирования.Реквизиты Цикл
		ОбъектОбработкиСтруктураУстановитьРеквизит(Реквизит.Имя, Объект[Реквизит.Имя]);
	КонецЦикла;
	СохранениеНастроек();
КонецПроцедуры
Функция ОбновитьЗначенияРеквизитов(Объект) Экспорт
	ЗагрузкаНастроек();
	Для каждого Реквизит Из Метаданные.Обработки.доп_сл_КлиентЛицензирования.Реквизиты Цикл
		Объект[Реквизит.Имя] = ОбъектОбработкиСтруктура()[Реквизит.Имя];
	КонецЦикла;
	СловоКлиент = доп_сл_общий.ПолучитьСтрокуСообщения("Клиент");
	СловоСервер = доп_сл_общий.ПолучитьСтрокуСообщения("Сервер");
	ВерсияОбработки = ОбъектОбработкиСтруктура().ls_версия_обработки;
	ОбъектОбработкиСтруктураУстановитьРеквизит("ВерсияКлиентаИСервера", ?(ОбъектОбработкиСтруктура().ВерсияСервера = "", СловоКлиент + ": " + ВерсияОбработки + ".", СловоКлиент + ": " + ВерсияОбработки + "; " + СловоСервер + ": " + ОбъектОбработкиСтруктура().ВерсияСервера + "."));
КонецФункции
Функция ОбъектОбработкиСоздан() Экспорт
	ОбъектОбработки = ПараметрыСеанса.доп_сл_ОбработкаЛицензирования.Получить();
	Возврат ЗначениеОпределено(ОбъектОбработки);
КонецФункции
Функция ПолучитьВремяЗадержки() Экспорт
	Если ОбъектОбработкиСтруктура().общ_ПубликацияНастроек И Не ПользовательЕстьВСпискеИсключения() Тогда
		Возврат ОбъектОбработкиСтруктура().общ_ВремяОжиданияДоАктивации;
	Иначе
		Возврат ОбъектОбработкиСтруктура().ВремяОжиданияДоАктивации;
	КонецЕсли;
КонецФункции
Функция ПолучитьСписокПользователей(РезультатМассив) Экспорт
	Попытка
		СписокПользователейИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
		ОперацияЗавершенаУспешно = Истина;
	Исключение
		ОперацияЗавершенаУспешно = Ложь;
	КонецПопытки;
	Если ОперацияЗавершенаУспешно Тогда
		Если ЗначениеОпределено(РезультатМассив) Тогда
			Для каждого ЭлементМассива Из СписокПользователейИБ Цикл
				РезультатСтруктура = Новый Структура("ПолноеИмя, УникальныйИдентификатор");
				РезультатСтруктура.Вставить("ПолноеИмя", ЭлементМассива.ПолноеИмя);
				РезультатСтруктура.Вставить("УникальныйИдентификатор", ЭлементМассива.УникальныйИдентификатор);
				РезультатМассив.Добавить(РезультатСтруктура);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Возврат ОперацияЗавершенаУспешно;
КонецФункции
Функция ПолучитьВерсиюСервера(ВерсияСервераСтрока = "") Экспорт
	ВерсияСервераСтрока = "";
	ОбъектОбработкиСтруктураУстановитьРеквизит("ВерсияСервера", ВерсияСервераСтрока);
	Если МеханизмОтключен() Тогда
		Возврат РезультатСоздать(2);
	КонецЕсли;
	Func = tFunctionCreate("svGetServerVer");
	РезультатВыполнения = FunctionExecuteViaAssistant(Func);
	Если Не НетОшибок(РезультатВыполнения) Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
	Если Не GetFuncParam("ServerVer", ВерсияСервераСтрока, Func.InputParameters) Тогда
		Возврат РезультатСоздать(6, "ServerVer");
	КонецЕсли;
	ОбъектОбработкиСтруктураУстановитьРеквизит("ВерсияСервера", ВерсияСервераСтрока);
	Возврат РезультатСоздать(0);
КонецФункции
Функция НетОшибок(ОбъектРезультат) Экспорт
	Если ТипЗнч(ОбъектРезультат) <> Тип("Структура") Тогда
		Сообщить(доп_сл_общий.ПолучитьСтрокуСообщения("НеПравильныйТипВходящегоОбъекта"));
		Возврат Ложь;
	КонецЕсли;
	Класс = ОбъектРезультат.ИмяКласса;
	Если Не ЗначениеОпределено(Класс) Или Класс <> "tОбъектРезультат" Тогда
		Сообщить(доп_сл_общий.ПолучитьСтрокуСообщения("ОшибкаПриВыводеСообщенияОбОшибке"));
		Возврат Ложь;
	КонецЕсли;
	Возврат ОбъектРезультат.Код = 0;
КонецФункции
Функция МодульОтключен() Экспорт
	Возврат МеханизмОтключен();
КонецФункции
Функция УстановитьБуфер(СтрЗначение, ПоддерживаетсяВыборВерсий = Ложь) Экспорт
	Попытка
		доп_сл_сервер_ассистент.ЗаписатьПараметрВХранилищеПользователя("ПараметрыКлиентаЛицензирования.ИдентификаторОсновногоПродукта", СтрЗначение);
		доп_сл_сервер_ассистент.ЗаписатьПараметрВХранилищеПользователя("ПараметрыКлиентаЛицензирования.ПоддерживаетсяВыборВерсий", ПоддерживаетсяВыборВерсий);
		Возврат РезультатСоздать(0);
	Исключение
		Возврат РезультатСоздать(3, ОписаниеОшибки());
	КонецПопытки;
КонецФункции
Процедура УстановитьЯзыкКлиентаЛицензирования(КодЯзыка = "ru") Экспорт
	доп_сл_сервер_ассистент.ЗаписатьПараметрВХранилищеПользователя("ПараметрыКлиентаЛицензирования.ЯзыкКлиентаЛицензирования", КодЯзыка);
КонецПроцедуры
Функция ПолучитьЛицензию(КлючПродукта) Экспорт
	ВремяКешированияУспешногоРезультата = 5;
	ОбъектОбработкиСтруктураУстановитьРеквизит("МожетТребоватьсяИзменениеВерсии", Ложь);
	Если МеханизмОтключен() Тогда
		ОбъектОбработкиСтруктураУстановитьРеквизит("СостояниеАктивации", доп_сл_общий.ПолучитьСтрокуСообщения("Активирован"));
		ОбъектОбработкиСтруктураУстановитьРеквизит("ОсновнаяНадпись", доп_сл_общий.ПолучитьСтрокуСообщения("ВсеОбъектыДоступны"));
		Возврат РезультатСоздать(0);
	КонецЕсли;
	ТребуетсяПереполучитьЛицензию = доп_сл_сервер_ассистент.ЗагрузитьПараметрИзХранилищаПользователя("ТребуетсяПереполучитьЛицензию");
	Если ТребуетсяПереполучитьЛицензию Тогда
		ПоместитьВКеш("LC:" + КлючПродукта, Ложь, ВремяКешированияУспешногоРезультата);
		доп_сл_сервер_ассистент.ЗаписатьПараметрВХранилищеПользователя("ТребуетсяПереполучитьЛицензию", Ложь);
	КонецЕсли;
	ЛицензияБылаУспешноПолученаРанее = Ложь;
	Если Не ТребуетсяПереполучитьЛицензию И ПолучитьИзКеша("LC:" + КлючПродукта, ЛицензияБылаУспешноПолученаРанее) И ЛицензияБылаУспешноПолученаРанее Тогда
		Возврат РезультатСоздать(0);
	КонецЕсли;
	Func = tFunctionCreate("svGetLicense");
	AddFuncParam("prod_guid", КлючПродукта, Func.OutputParameters);
	РезультатВыполнения = FunctionExecuteViaAssistant(Func, Истина, Истина, Истина);
	Если НетОшибок(РезультатВыполнения) Тогда
		Если ЭтоСервернаяБаза() Тогда
			СтруктураПараметровСоединения = ПолучитьНастройкиСоединения();
			доп_сл_сервер_ассистент.ЗарегистрироватьСеансВРегистре(GetClHttpSessionId(), СтруктураПараметровСоединения.IP, СтруктураПараметровСоединения.Port, СтруктураПараметровСоединения.ПортАссистентаСервераЛицензий, СтруктураПараметровСоединения.ИспользоватьProxy);
		КонецЕсли;
		ПоместитьВКеш("LC:" + КлючПродукта, Истина, ВремяКешированияУспешногоРезультата);
		ПолучитьВерсиюСервера();
		ОбъектОбработкиСтруктураУстановитьРеквизит("СостояниеАктивации", доп_сл_общий.ПолучитьСтрокуСообщения("Активирован"));
		ОбъектОбработкиСтруктураУстановитьРеквизит("ИнформацияДляТехПоддержки", "");
		ИмяРешения = "";
		Если НетОшибок(ПолучитьИмяРешения(КлючПродукта, ИмяРешения)) Тогда
			ПараметрыСообщения = Новый Соответствие;
			ПараметрыСообщения.Вставить("##1##", ИмяРешения);
			ОбъектОбработкиСтруктураУстановитьРеквизит("ОсновнаяНадпись", доп_сл_общий.ПолучитьСтрокуСообщения("ПолученаЛицензияДля", ПараметрыСообщения));
		Иначе
			ОбъектОбработкиСтруктураУстановитьРеквизит("ОсновнаяНадпись", доп_сл_общий.ПолучитьСтрокуСообщения("ПолученаЛицензияДляВашегоПродукта"));
		КонецЕсли;
	Иначе
		Если РезультатВыполнения.Код <> 1 И РезультатВыполнения.Код <> 14 Тогда
			ПолучитьВерсиюСервера();
		Иначе
			ОбъектОбработкиСтруктураУстановитьРеквизит("ВерсияСервера", "");
		КонецЕсли;
		Если РезультатВыполнения.Код = 8 Тогда
			КлючИзПараметра = доп_сл_сервер_ассистент.ЗагрузитьПараметрИзХранилищаПользователя("ПараметрыКлиентаЛицензирования.ПоддерживаетсяВыборВерсий");
			ОбъектОбработкиСтруктураУстановитьРеквизит("МожетТребоватьсяИзменениеВерсии", КлючИзПараметра = Истина);
		КонецЕсли;
		ОбъектОбработкиСтруктураУстановитьРеквизит("СостояниеАктивации", доп_сл_общий.ПолучитьСтрокуСообщения("НеАктивирован"));
		ОбъектОбработкиСтруктураУстановитьРеквизит("ОсновнаяНадпись", ?(РезультатВыполнения.Комментарий <> "", РезультатВыполнения.Комментарий, РезультатВыполнения.Описание));
		ОбъектОбработкиСтруктураУстановитьРеквизит("ИнформацияДляТехПоддержки", РезультатВыполнения.ИнформацияДляТехПоддержки);
	КонецЕсли;
	Если НетОшибок(РезультатВыполнения) Тогда
		доп_сл_сервер_ассистент.ЗаписатьПараметрВХранилищеПользователя("ВыполнятьПоддержкуКлиента", Истина);
		доп_сл_сервер_ассистент.ЗаписатьПараметрВХранилищеПользователя("ПоддержкаКлиентаПоследняяОшибка", Неопределено);
		доп_сл_сервер_ассистент.ЗаписатьПараметрВХранилищеПользователя("ЧислоОшибокПоддержкиРаботыКлиента", 0);
	КонецЕсли;
	Возврат РезультатВыполнения;
КонецФункции
Функция ПолучитьЛицензиюДляТекущегоПродукта() Экспорт
	КлючИзПараметра = ПолучитьКлючПоУмолчанию();
	Если КлючИзПараметра = "" Тогда
		Результат = РезультатСоздать(15);
		ОбъектОбработкиСтруктураУстановитьРеквизит("ОсновнаяНадпись", Результат.Описание);
		Возврат Результат;
	Иначе
		Возврат ПолучитьЛицензию(КлючИзПараметра);
	КонецЕсли;
КонецФункции
Функция ПолучитьИмяРешения(КлючПродукта, ИмяПродукта) Экспорт
	Если ПолучитьИзКеша(КлючПродукта, ИмяПродукта) Тогда
		Возврат РезультатСоздать(0);
	КонецЕсли;
	Если МеханизмОтключен() Тогда
		ИмяПродукта = "";
		Возврат РезультатСоздать(2);
	КонецЕсли;
	Func = tFunctionCreate("svGetProductNameByGuid");
	AddFuncParam("prod_guid", КлючПродукта, Func.OutputParameters);
	РезультатВыполнения = FunctionExecuteViaAssistant(Func);
	Если Не НетОшибок(РезультатВыполнения) Тогда
		ИмяПродукта = "";
		Возврат РезультатВыполнения;
	КонецЕсли;
	ИмяПродукта = "";
	Если Не GetFuncParam("ProdName", ИмяПродукта, Func.InputParameters) Тогда
		Возврат РезультатСоздать(6, "ProdName");
	КонецЕсли;
	ПоместитьВКеш(КлючПродукта, ИмяПродукта, Неопределено);
	Возврат РезультатСоздать(0);
КонецФункции
Функция ОпределитьДоступностьРешений(СписокКлючейСтрока) Экспорт
	ВремяКешированияУспешногоРезультата = 5;
	Если МеханизмОтключен() Тогда
		ВыходнаяСтрока = "";
		Для нСтр = 1 По СтрЧислоСтрок(СписокКлючейСтрока) Цикл
			ВыходнаяСтрока = ВыходнаяСтрока + СтрПолучитьСтроку(СписокКлючейСтрока, нСтр) + "=True";
			Если нСтр <> СтрЧислоСтрок(СписокКлючейСтрока) Тогда
				ВыходнаяСтрока = ВыходнаяСтрока + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
		СписокКлючейСтрока = ВыходнаяСтрока;
		Возврат РезультатСоздать(0, доп_сл_общий.ПолучитьСтрокуСообщения("ВсеОбъектыДоступны"));
	КонецЕсли;
	ПредыдущийЗапрос = "";
	Если ПолучитьИзКеша("PA:Request", ПредыдущийЗапрос) И ПредыдущийЗапрос = СписокКлючейСтрока Тогда
		ХранимоеЗначение = "";
		Если ПолучитьИзКеша("PA:Result", ХранимоеЗначение) Тогда
			СписокКлючейСтрока = ХранимоеЗначение;
			Возврат РезультатСоздать(0);
		КонецЕсли;
	КонецЕсли;
	Func = tFunctionCreate("svCheckProductsAvailabilyty");
	AddFuncParam("prod_guid_list", СписокКлючейСтрока, Func.OutputParameters);
	ПоместитьВКеш("PA:Request", СписокКлючейСтрока, ВремяКешированияУспешногоРезультата);
	РезультатВыполнения = FunctionExecuteViaAssistant(Func);
	Если Не НетОшибок(РезультатВыполнения) Тогда
		Возврат РезультатВыполнения;
	КонецЕсли;
	Если Не GetFuncParam("prod_guid_list_checked", СписокКлючейСтрока, Func.InputParameters) Тогда
		Возврат РезультатСоздать(6, "prod_guid_list_checked");
	КонецЕсли;
	ПоместитьВКеш("PA:Result", СписокКлючейСтрока, ВремяКешированияУспешногоРезультата);
	Возврат РезультатВыполнения;
КонецФункции
Функция ПолучитьПараметрЛицензии(КлючПродукта, ИмяПараметраЛицензии, ЗначениеПараметра) Экспорт
	Если МеханизмОтключен() Тогда
		ЗначениеПараметра = "";
		ПараметрНайден = Ложь;
		ЛокальныеПараметры = Новый СписокЗначений;
		НаборПараметров = Константы.доп_сл_НаборПараметров.Получить().Получить();
		Для каждого ЭлементЗн Из НаборПараметров Цикл
			Если ЭлементЗн.Представление = "{FE9A8A93-FD2D-4368-AB97-8907F9500DEA}" Тогда
				ЛокальныеПараметры = ЭлементЗн.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Для каждого ЭлементЗн Из ЛокальныеПараметры Цикл
			Если ЭлементЗн.Представление = ИмяПараметраЛицензии Тогда
				ЗначениеПараметра = ЭлементЗн.Значение;
				ПараметрНайден = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ПараметрНайден Тогда
			Возврат РезультатСоздать(0);
		Иначе
			Возврат РезультатСоздать(6);
		КонецЕсли;
	КонецЕсли;
	Func = tFunctionCreate("svGetLicenseParameter");
	AddFuncParam("prod_guid", КлючПродукта, Func.OutputParameters);
	AddFuncParam("license_parameter_name", ИмяПараметраЛицензии, Func.OutputParameters);
	РезультатВыполнения = FunctionExecuteViaAssistant(Func);
	Если Не НетОшибок(РезультатВыполнения) Тогда
		ЗначениеПараметра = "";
		Возврат РезультатВыполнения;
	КонецЕсли;
	Если Не GetFuncParam("res_parameter_value", ЗначениеПараметра, Func.InputParameters) Тогда
		ОписаниеОшибки = "";
		Если GetFuncParam("res_text", ОписаниеОшибки, Func.InputParameters) Тогда
			Возврат РезультатСоздать(8, ОписаниеОшибки);
		Иначе
			Возврат РезультатСоздать(6, "res_parameter_value");
		КонецЕсли;
	КонецЕсли;
	Возврат РезультатВыполнения;
КонецФункции
Функция ОжиданиеПереподключения() Экспорт
	ОбъектОбработкиСтруктураУстановитьРеквизит("СостояниеАктивации", доп_сл_общий.ПолучитьСтрокуСообщения("НеАктивирован"));
	ОбъектОбработкиСтруктураУстановитьРеквизит("ОсновнаяНадпись", доп_сл_общий.ПолучитьСтрокуСообщения("ПожалуйстаПодождите"));
КонецФункции
Функция ОтключитьсяОтСервера(ClHttpSessionId = "", ПараметрыСоединения = Неопределено) Экспорт
	Если МеханизмОтключен() Тогда
		Возврат РезультатСоздать(0);
	КонецЕсли;
	СтрокаАдресаДанныхВХ = "e1cib/tempstorage/" + ПараметрыСеанса.доп_сл_БуферЛицензированияВторой;
	Если ЭтоАдресВременногоХранилища(СтрокаАдресаДанныхВХ) Тогда
		УдалитьИзВременногоХранилища(СтрокаАдресаДанныхВХ);
		ПараметрыСеанса.доп_сл_БуферЛицензированияВторой = "";
	КонецЕсли;
	Если ЭтоСервернаяБаза() Тогда
		Func = tFunctionCreate("svHttpVirtualConnectionClose", ClHttpSessionId);
		РезультатВыполнения = FunctionExecuteViaAssistant(Func, , , , ПараметрыСоединения);
		Если ClHttpSessionId = "" Тогда
			ClHttpSessionId = GetClHttpSessionId();
		КонецЕсли;
		доп_сл_сервер_ассистент.УдалитьРегистрациюСеансаИзРегистра(ClHttpSessionId);
	Иначе
		SID = доп_сл_сервер_ассистент.ЗагрузитьПараметрИзХранилищаПользователя("SessionID");
		Если ЗначениеЗаполнено(SID) Тогда
			РезультатПроверкиАктульностиSID = доп_сл_сервер_ассистент.lsaAPI_EchoString("echo", SID);
			Если доп_сл_сервер_ассистент.НетОшибок(РезультатПроверкиАктульностиSID) Тогда
				доп_сл_сервер_ассистент.lsaAPI_DestroySession(SID);
			КонецЕсли;
		КонецЕсли;
		доп_сл_сервер_ассистент.ЗаписатьПараметрВХранилищеПользователя("SessionID", "");
		доп_сл_сервер_ассистент.ЗаписатьПараметрВХранилищеПользователя("ВыполнятьПоддержкуКлиента", Ложь);
		доп_сл_сервер_ассистент.ЗаписатьПараметрВХранилищеПользователя("ТребуетсяПереполучитьЛицензию", Истина);
		доп_сл_сервер_ассистент.ЗаписатьПараметрВХранилищеПользователя("ПоддержкаКлиентаПоследняяОшибка", Неопределено);
		РезультатВыполнения = РезультатСоздать(0);
	КонецЕсли;
	Возврат РезультатВыполнения;
КонецФункции
Функция ПолучитьСтруктуруНастроекСоединения(IP = Неопределено, Port = Неопределено, ПортАссистентаСервераЛицензий = Неопределено, ИспользоватьProxy = Неопределено) Экспорт
	СтруктураНастроекСоединения = Новый Структура;
	СтруктураНастроекСоединения.Вставить("IP", ?(ЗначениеОпределено(IP), IP, ""));
	СтруктураНастроекСоединения.Вставить("Port", ?(ЗначениеОпределено(Port), Port, 0));
	СтруктураНастроекСоединения.Вставить("ПортАссистентаСервераЛицензий", ?(ЗначениеОпределено(ПортАссистентаСервераЛицензий), ПортАссистентаСервераЛицензий, 0));
	СтруктураНастроекСоединения.Вставить("ИспользоватьProxy", ?(ЗначениеОпределено(ИспользоватьProxy), ИспользоватьProxy, Ложь));
	Возврат СтруктураНастроекСоединения;
КонецФункции
Функция ПолучитьНастройкиСоединения() Экспорт
	Результат = ПолучитьСтруктуруНастроекСоединения();
	СтрокаСоединения = "";
	Если ОбъектОбработкиСтруктура().общ_ПубликацияНастроек И Не ПользовательЕстьВСпискеИсключения() Тогда
		СтрокаСоединения = ОбъектОбработкиСтруктура().общ_АдресСервераИПорт;
	Иначе
		СтрокаСоединения = ОбъектОбработкиСтруктура().АдресСервераИПорт;
	КонецЕсли;
	Если ОбъектОбработкиСтруктура().общ_ПубликацияНастроек И Не ПользовательЕстьВСпискеИсключения() Тогда
		Результат.ПортАссистентаСервераЛицензий = ОбъектОбработкиСтруктура().общ_ПортАссистентаСервераЛицензий;
	Иначе
		Результат.ПортАссистентаСервераЛицензий = ОбъектОбработкиСтруктура().ПортАссистентаСервераЛицензий;
	КонецЕсли;
	Если ОбъектОбработкиСтруктура().общ_ПубликацияНастроек И Не ПользовательЕстьВСпискеИсключения() Тогда
		Результат.ИспользоватьProxy = ОбъектОбработкиСтруктура().общ_ИспользоватьProxyСервер;
	Иначе
		Результат.ИспользоватьProxy = ОбъектОбработкиСтруктура().ИспользоватьProxyСервер;
	КонецЕсли;
	ПозицияДвоеточия = Найти(СтрокаСоединения, ":");
	Если ПозицияДвоеточия > 0 Тогда
		Результат.IP = Лев(СтрокаСоединения, ПозицияДвоеточия - 1);
		Результат.Port = Прав(СтрокаСоединения, СтрДлина(СтрокаСоединения) - ПозицияДвоеточия);
		Если СтрДлина(Результат.Port) > 0 Тогда
			Попытка
				Результат.Port = Число(Результат.Port);
			Исключение
				Результат.Port = 10601;
			КонецПопытки;
		КонецЕсли;
	Иначе
		Результат.IP = СтрокаСоединения;
		Результат.Port = 10601;
	КонецЕсли;
	Возврат Результат;
КонецФункции
