&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаписьРегистра = РегистрыСведений.омг_НастройкиИнтеграции.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Прочитать();
	
	ЗаполнитьЗначенияСвойств(Запись, ЗаписьРегистра);
	
	Пароль = Новый УникальныйИдентификатор; 
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	
	ЗаписьРегистра = РегистрыСведений.омг_НастройкиИнтеграции.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьРегистра, Запись);
	ЗаписьРегистра.Записать();
	
	Если ПарольИзменен Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("омг_ИнтеграцияСMedreview", Новый ХранилищеЗначения(Пароль), "Пароль");
		УстановитьПривилегированныйРежим(Ложь);
		
		Пароль = Новый УникальныйИдентификатор;
		ПарольИзменен = Ложь;
		
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ОКНаСервере();
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаписьПарольВнешнегоДоступаПриИзменении(Элемент)
	
	ПарольИзменен = Истина;
	
КонецПроцедуры

