#Область СлужебныеПроцедурыИФункции

// аналог 3 веб-сервисов:
// - GetSchedule - Обычное получение расписания на конкретные даты
// - GetSchedule20 - получение расписания с параметрами  
// - GetEnlargementSchedule - Получить укрупненое расписание  
// Ожидаемые параметры запроса:
//	ИмяПеременной	- Полученное значение параметра	- Описание
//	StartDate	- Дата	- дата Начала
// 	FinishDate	- Дата	- дата Окончания 
// 	Key			- УИД	- Ключ достоверности
// 	Clinic		- Массив ссылок Филиала		- ожидается как Строка-перечисления УИД Филиалов Строкой
// 	Employees	- Массив ссылок Сотрудников	- ожидается как Строка-перечисления УИД Сотрудников Строкой
// 	Format		- Строка	- Формат возвращаемого Файла (по умолчанию JSON)
//	Method	- Строка	- Какой вид из 3 вариантов веб-сервиса интересует (GetSchedule, GetSchedule20, GetEnlargementSchedule)
//		Если не заполнен/нет ни одного из проверяемых вариантов, то это будет GetSchedule20
Функция SchedulePost(Запрос)	

	Ответ = Неопределено;
	ПараметрыЗапроса = Новый Структура();
	ОтносительныйURL = "/schedule";
	УстановитьПривилегированныйРежим(Истина);

	// Проверим запрос, при ошибках вернём 400 bad request и в тело поместим описание ошибки		
	HTTPСервисыВызовСервера.ПроверитьИЗаполнитьОжидаемыеПараметрыЗапроса(Запрос, ОтносительныйURL, ПараметрыЗапроса, Ответ);
	Если Ответ <> Неопределено Тогда Возврат Ответ КонецЕсли;
	
	// В зависимости от вида предоставляем расписание
	ОписаниеОшибки = ""; 
	ОписаниеОшибкиParams = ""; 
	
	// Получим XML представление календаря
	Если ПараметрыЗапроса.Method = "GetEnlargementSchedule" Тогда
		СообщениеXML = ВебИнтеграция.ПолучитьУкрупненыеГрафикиРаботыXML(ПараметрыЗапроса.StartDate, ПараметрыЗапроса.FinishDate, ОписаниеОшибки, ПараметрыЗапроса);
	ИначеЕсли ПараметрыЗапроса.Method = "GetSchedule" Тогда
		СообщениеXML = ВебИнтеграция.ПолучитьГрафикиРаботыXML(ПараметрыЗапроса.StartDate, ПараметрыЗапроса.FinishDate, ОписаниеОшибки, Истина, ПараметрыЗапроса);
	Иначе	
		// Все остальные варианты трактуются как GetSchedule20
		Если ПараметрыЗапроса.Clinic <> Неопределено Тогда	
			ПараметрыЗапроса.Вставить("Филиал",ПараметрыЗапроса.Clinic);	
		КонецЕсли;
		Если ПараметрыЗапроса.Employees <> Неопределено Тогда	
			ПараметрыЗапроса.Вставить("Сотрудники",ПараметрыЗапроса.Employees);	
		КонецЕсли;
		СообщениеXML = ВебИнтеграция.ПолучитьГрафикиРаботыXML(ПараметрыЗапроса.StartDate, ПараметрыЗапроса.FinishDate, ОписаниеОшибки, Истина, ПараметрыЗапроса, ОписаниеОшибкиParams);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ОписаниеОшибки,ОписаниеОшибкиParams,Символы.ПС);
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Возврат ВернутьОтветСОшибкой(ОписаниеОшибки, 500);	
	КонецЕсли;
	
	// Преобразуем XML под указанный формат или JSON
	Возврат ВернутьУспешныйОтветИзXML(СообщениеXML, ПараметрыЗапроса.Format);

КонецФункции

// аналог веб-сервиса GetAppointmentStatus 
// Получить статус конкретной заявки (по её УИД)
// Ожидаемые параметры запроса:
//	ИмяПеременной	- Полученное значение параметра	- Описание
//	Key	- УИД	- Ключ достоверности
//	GUID	- УИД	- УИД искомой заявки (документа Заявки)
Функция AppointmentStatusPost(Запрос)
	
	Ответ = Неопределено;
	ОтносительныйURL = "/appointmentStatus";
	ПараметрыЗапроса = Новый Структура();
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверим запрос, при ошибках вернём 400 bad request и в тело поместим описание ошибки		
	HTTPСервисыВызовСервера.ПроверитьИЗаполнитьОжидаемыеПараметрыЗапроса(Запрос, ОтносительныйURL, ПараметрыЗапроса, Ответ);
	Если Ответ <> Неопределено Тогда Возврат Ответ КонецЕсли;
	
	ОписаниеОшибки = "";
	ПараметрыЗапроса.GUID = ПараметрыЗапроса.GUID[0];
	СообщениеXML = ВебИнтеграция.ПолучитьСтатусЗаявкиДляСайта(ПараметрыЗапроса.GUID, ОписаниеОшибки, ПараметрыЗапроса); 
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Возврат ВернутьОтветСОшибкой(ОписаниеОшибки, 500);	
	КонецЕсли;
	
	// Преобразуем текст XML в JSON
	Возврат ВернутьУспешныйОтветИзXML(СообщениеXML);
	
КонецФункции

// аналог веб-сервиса CancelBookAnAppointment
// Отменить конкретную заявку (по её УИД) с указанием причины  
// Ожидаемые параметры запроса:
//	ИмяПеременной	- Полученное значение параметра	- Описание
//	Key	- УИД	- Ключ достоверности
//	GUID	- УИД		- УИД искомой заявки (документа Заявки)
//	Reason	- Строка	- Причина отмены заявки
//	AdditionalInformation	- Строка	- Дополнительная информация
Функция AppointmentCancelPost(Запрос)
	
	Ответ = Неопределено;
	ОтносительныйURL = "/appointmentCancel";
	ПараметрыЗапроса = Новый Структура();
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверим запрос, при ошибках вернём 400 bad request и в тело поместим описание ошибки		
	HTTPСервисыВызовСервера.ПроверитьИЗаполнитьОжидаемыеПараметрыЗапроса(Запрос, ОтносительныйURL, ПараметрыЗапроса, Ответ);
	Если Ответ <> Неопределено Тогда Возврат Ответ КонецЕсли; 
	
	ОписаниеОшибки = "";
	ПараметрыЗапроса.GUID = ПараметрыЗапроса.GUID[0];
	СообщениеXML = ВебИнтеграция.ОтменитьЗаявку(ПараметрыЗапроса.GUID, ПараметрыЗапроса.AdditionalInformation, ПараметрыЗапроса.Reason, ОписаниеОшибки, ПараметрыЗапроса); 
    Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Возврат ВернутьОтветСОшибкой(ОписаниеОшибки, 500);	
	КонецЕсли;
	
	// Преобразуем текст XML в JSON
	Возврат ВернутьУспешныйОтветИзXML(СообщениеXML);
	
КонецФункции

// аналог 5 веб-сервисов:
// - BookAnAppointment - Заявка
// - BookAnAppointmentWithParams - Заявка с доп. параметрами 
// - BookAnAppointmentWithClient - Заявка с клиентом 
// - FastBookAnAppointment - Лист ожидания 
// - FastBookAnAppointmentWithClient - Лист ожидания с клиентом 
// Ожидаемые параметры запроса:
//	ИмяПеременной	- Полученное значение параметра	- Описание
//	Key	- УИД	- Ключ достоверности 
//	EmployeeID	- Ссылка Сотрудник - УИД сотрудника
//	TimeBegin	- Время	- Время начала
//	Date	- Дата	- Желаемая Дата заявки 
//	GUID	- УИД	- УИД брони, если такова была
//	Phone	- Число	- Телефон 
//	PatientName, PatientSurname, PatientFatherName  - Строка - Имя, Фамилия и отчество клиента соответственно
//	Comment, Email, Address	- Строка	- Комментарий к заявке, адрес почты, адрес проживания соответственно
//  Clinic	- Ссылка Клиника	- УИД ссылки на клинику 
//  Client	- Ссылка Клиента	- УИД ссылки на клиента
//	Service	- Ссылка на Услугу	- УИД ссылки на услугу
//	Method	- Строка	- Какой вид из 3 вариантов веб-сервиса интересует (GetSchedule, GetSchedule20, GetEnlargementSchedule)
//		Если не заполнен/нет ни одного из проверяемых вариантов, то это будет GetSchedule20  
//	Specialization	- Строка	- Комментарий желаемой специализации. Используется в листе ожидания
//  DurationType	- Строка	- Неявный параметр 
//  Duration	- Время	- Неявный параметр планирующейся длительности заявки
//  Birthday	- Дата	- Неявный параметр даты рождения пациента
//	EquipmentCabinet	- Массив ссылок на оборудование	- Т.к. в EmployeeID это всегда сотрудник
//		То позволяем явно указать кабинет как сопутствующее значение.
//
Функция AppointmentCreatePost(Запрос)
	
	Ответ = Неопределено;
	ОтносительныйURL = "/appointmentCreate";
	ПараметрыЗапроса = Новый Структура();
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверим запрос, при ошибках вернём 400 bad request и в тело поместим описание ошибки		
	HTTPСервисыВызовСервера.ПроверитьИЗаполнитьОжидаемыеПараметрыЗапроса(Запрос, ОтносительныйURL, ПараметрыЗапроса, Ответ, Истина);
	Если Ответ <> Неопределено Тогда Возврат Ответ КонецЕсли; 

	// Подсчитаем время окончания у заявки
	ОписаниеОшибки = "";
	
	// Если значение заполнено, то оно всегда будет в виде массива ссылок, либо Неопределено
	Если ЗначениеЗаполнено(ПараметрыЗапроса.EmployeeID) Тогда
		ПараметрыЗапроса.EmployeeID = ПараметрыЗапроса.EmployeeID[0];
	КонецЕсли;
	// Переданный GUID является ссылкой на бронь, если она была
	Если ЗначениеЗаполнено(ПараметрыЗапроса.GUID) Тогда
		ПараметрыЗапроса.GUID = ПараметрыЗапроса.GUID[0];
	КонецЕсли;
	// Заявки и листы ожидания заполняются только для конкретного клиента
	Если ЗначениеЗаполнено(ПараметрыЗапроса.Client) Тогда
		ПараметрыЗапроса.Client = ПараметрыЗапроса.Client[0];
	КонецЕсли;
	// у Заявок позволяем дополнительно вписывать ещё и кабинет/оборудование
	Если ЗначениеЗаполнено(ПараметрыЗапроса.EquipmentCabinet) Тогда	
		ПараметрыЗапроса.EquipmentCabinet = ПараметрыЗапроса.EquipmentCabinet[0];	
	КонецЕсли;
	// Обязательный параметр
	ПараметрыЗапроса.Clinic = ПараметрыЗапроса.Clinic[0];	
	
	Если ЗначениеЗаполнено(ПараметрыЗапроса.Duration) Тогда
		ВремяОкончанияЗаписи = ПараметрыЗапроса.TimeBegin + (ПараметрыЗапроса.Duration - Дата(1,1,1));
	Иначе
		МассивУслуг = ?((ЗначениеЗаполнено(ПараметрыЗапроса.DurationType) И ПараметрыЗапроса.DurationType = "ServiceDuration"),ПараметрыЗапроса.Service,Неопределено);
		ВремяОкончанияЗаписи = HTTPСервисыВызовСервера.ВычислитьВремяОкончания(ПараметрыЗапроса.TimeBegin, ПараметрыЗапроса.EmployeeID, ОписаниеОшибки, МассивУслуг);
	КонецЕсли;							
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Возврат ВернутьОтветСОшибкой(ОписаниеОшибки, 500);	
	КонецЕсли;
		
	// Разделяем в зависимости от требуемого типа что делать
	Если ПараметрыЗапроса.Method = "BookAnAppointment" Тогда
		СообщениеXML = ВебИнтеграция.СоздатьЗаявку(ПараметрыЗапроса.EmployeeID, ПараметрыЗапроса.PatientSurname, ПараметрыЗапроса.PatientName, ПараметрыЗапроса.PatientFatherName,,
						ПараметрыЗапроса.Date, ПараметрыЗапроса.TimeBegin, ВремяОкончанияЗаписи, ПараметрыЗапроса.Comment, ПараметрыЗапроса.Phone, ПараметрыЗапроса.Email,
						ПараметрыЗапроса.Address, ПараметрыЗапроса.Clinic, ОписаниеОшибки, ПараметрыЗапроса.GUID,ПараметрыЗапроса.Client,,ПараметрыЗапроса);
		
	ИначеЕсли ПараметрыЗапроса.Method = "BookAnAppointmentWithClient" Тогда  
		СообщениеXML = ВебИнтеграция.СоздатьЗаявку(ПараметрыЗапроса.EmployeeID, "", "", "",, ПараметрыЗапроса.Date, ПараметрыЗапроса.TimeBegin, ВремяОкончанияЗаписи,
							ПараметрыЗапроса.Comment, "", "", "", ПараметрыЗапроса.Clinic, ОписаниеОшибки, ПараметрыЗапроса.GUID, ПараметрыЗапроса.Client, ПараметрыЗапроса.Service,ПараметрыЗапроса);
		
	ИначеЕсли ПараметрыЗапроса.Method = "FastBookAnAppointment" Тогда
		ПараметрыЗапроса.Specialization = СокрЛП(ПараметрыЗапроса.Specialization);
		СообщениеXML = ВебИнтеграция.СоздатьЛистОжидания(ПараметрыЗапроса.Specialization, ПараметрыЗапроса.PatientSurname, ПараметрыЗапроса.PatientName, ПараметрыЗапроса.PatientFatherName,
							ПараметрыЗапроса.Date, ПараметрыЗапроса.TimeBegin, ПараметрыЗапроса.Comment, ПараметрыЗапроса.Phone, ПараметрыЗапроса.Email, ПараметрыЗапроса.Address,
							ПараметрыЗапроса.Clinic, ОписаниеОшибки, ПараметрыЗапроса.Client,ПараметрыЗапроса);
		
	ИначеЕсли ПараметрыЗапроса.Method = "FastBookAnAppointmentWithClient" Тогда	
		ПараметрыЗапроса.Вставить("ВремяОкончанияЗаписи",ВремяОкончанияЗаписи);
		СообщениеXML = ВебИнтеграция.СоздатьЛистОжидания("", "", "", "", ПараметрыЗапроса.Date, ПараметрыЗапроса.TimeBegin, ПараметрыЗапроса.Comment, "", "", "",
							ПараметрыЗапроса.Clinic, ОписаниеОшибки, ПараметрыЗапроса.Client,ПараметрыЗапроса);
		
	ИначеЕсли ПараметрыЗапроса.Method = "BookAnAppointmentWithParams" Тогда
		СообщениеXML = ВебИнтеграция.СоздатьЗаявку(ПараметрыЗапроса.EmployeeID, ПараметрыЗапроса.PatientSurname, ПараметрыЗапроса.PatientName, ПараметрыЗапроса.PatientFatherName,
							ПараметрыЗапроса.Birthday, ПараметрыЗапроса.Date, ПараметрыЗапроса.TimeBegin, ВремяОкончанияЗаписи, ПараметрыЗапроса.Comment, ПараметрыЗапроса.Phone,
							ПараметрыЗапроса.Email, ПараметрыЗапроса.Address, ПараметрыЗапроса.Clinic, ОписаниеОшибки, ПараметрыЗапроса.GUID,ПараметрыЗапроса.Client,ПараметрыЗапроса.Service,ПараметрыЗапроса);
	Иначе
		Возврат ВернутьОтветСОшибкой(НСтр("ru = 'Ошибка: искомый метод не существует'"), 404);	
	КонецЕсли;
	
	// Проверяем ошибки
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Возврат ВернутьОтветСОшибкой(ОписаниеОшибки, 500);	
	КонецЕсли;
	
	// Преобразуем текст XML в JSON
	Возврат ВернутьУспешныйОтветИзXML(СообщениеXML); 
	
КонецФункции

// аналог 3 веб-сервисов:
// - GetNomenclatureAndPrices - Получить номенклатуру и цены 
// - GetListClinic - Получить список клиник   
// - GetListEmployees - Получить список сотрудников
// Ожидаемые параметры запроса:
//	ИмяПеременной	- Расшифрованное значение параметра	- Описание
//	Key		- УИД	- Ключ достоверности
//	Clinic	- Массив ссылок Филиалов	- ожидается как Строка с одним УИД Филиала Строкой
//  EmployeeID	- Массив ссылок сотрудников	- Ожидается как Строка с Уидами сотрудников
//  SearchName	- Строка	- Полное или часть названия, которые должны быть у искомых сотрудников и искомой номенклатуры
//	Method	- Строка	- Какой вид из 3 вариантов веб-сервиса интересует (GetNomenclatureAndPrices, GetListClinic, GetListEmployees)
//		Если не заполнен/нет ни одного из проверяемых вариантов, то будет выдана ошибка
Функция ClinicDataPost(Запрос)
	
	Ответ = Неопределено;
	ПараметрыЗапроса = Новый Структура();
	ОтносительныйURL = "/data";
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверим запрос, при ошибках вернём 400 bad request и в тело поместим описание ошибки		
	HTTPСервисыВызовСервера.ПроверитьИЗаполнитьОжидаемыеПараметрыЗапроса(Запрос, ОтносительныйURL, ПараметрыЗапроса, Ответ, Истина);
	Если Ответ <> Неопределено Тогда Возврат Ответ КонецЕсли; 
	
	Если ПараметрыЗапроса.Method = "GetListClinic" Тогда
		СообщениеXML = ВебИнтеграция.ПолучитьСписокКлиникXML(); 
		
	ИначеЕсли ПараметрыЗапроса.Method = "GetListEmployees" Тогда
	    СообщениеXML = ВебИнтеграция.ПолучитьСписокСотрудниковXML(ПараметрыЗапроса.НастройкиОбмена, ПараметрыЗапроса); 
		
	ИначеЕсли ПараметрыЗапроса.Method = "GetNomenclatureAndPrices" Тогда
		ОписаниеОшибки = "";
		ПараметрыЗапроса.Clinic = ПараметрыЗапроса.Clinic[0]; 
		СообщениеXML = ВебИнтеграция.ПолучитьСписокНоменклатурыИЦен(ПараметрыЗапроса.Clinic, ОписаниеОшибки, ПараметрыЗапроса);
		
		Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
			Возврат ВернутьОтветСОшибкой(ОписаниеОшибки, 500);	
		КонецЕсли;
	Иначе
		Возврат ВернутьОтветСОшибкой(НСтр("ru = 'Ошибка: искомый метод не существует'"), 404);	
	КонецЕсли;
	
	// Преобразуем текст XML в JSON
	Возврат ВернутьУспешныйОтветИзXML(СообщениеXML);
	
КонецФункции

// аналог веб-сервиса GetReserve
// Создание брони и возвращение информации о ней
// Ожидаемые параметры запроса:
//	ИмяПеременной	- Полученное значение параметра	- Описание
//	Key		- УИД	- Ключ достоверности
//	Date	- Дата	- Дата заявки
//	TimeBegin	- Дата	- Время начала процедуры 
//	Clinic		- Массив ссылок Филиалов	- ожидается как Строка с одним УИД Филиала Строкой
//	EmployeeID	- Массив ссылок Сотрудников/Оборудования	- ожидается как Строка с одним УИД Сотрудника Строкой
//	EquipmentCabinet	- Массив ссылок на оборудование	- Т.к. в EmployeeID имеет смысл оборудование ТОЛЬКО при настройке уч. политики
//		То позволяем явно указать кабинет как сопутствующее значение.
//
Функция ReservationPOST(Запрос)
	
	Ответ = Неопределено;
	ПараметрыЗапроса = Новый Структура();
	ОтносительныйURL = "/reservation";
	УстановитьПривилегированныйРежим(Истина);
	
	// Проверим запрос, при ошибках вернём 400 bad request и в тело поместим описание ошибки		
	HTTPСервисыВызовСервера.ПроверитьИЗаполнитьОжидаемыеПараметрыЗапроса(Запрос, ОтносительныйURL, ПараметрыЗапроса, Ответ);
	Если Ответ <> Неопределено Тогда Возврат Ответ КонецЕсли; 
	
	// При проверке данных, все ссылки будут передаваться как массив с элементами
	// Clinic и EmployeeID - обязательные параметры, они заполнены найденными в базе ссылками
	ПараметрыЗапроса.Clinic = ПараметрыЗапроса.Clinic[0]; 
	ПараметрыЗапроса.EmployeeID = ПараметрыЗапроса.EmployeeID[0]; 
	Если ЗначениеЗаполнено(ПараметрыЗапроса.EquipmentCabinet) Тогда	
		ПараметрыЗапроса.EquipmentCabinet = ПараметрыЗапроса.EquipmentCabinet[0];	
	КонецЕсли;
	
	// Расчет времени окончания  
	ОписаниеОшибки = "";
	Если ЗначениеЗаполнено(ПараметрыЗапроса.Duration) Тогда
		ВремяОкончанияЗаписи = ПараметрыЗапроса.TimeBegin + (ПараметрыЗапроса.Duration - Дата(1,1,1));
	Иначе
		ВремяОкончанияЗаписи = HTTPСервисыВызовСервера.ВычислитьВремяОкончания(ПараметрыЗапроса.TimeBegin, ПараметрыЗапроса.EmployeeID, ОписаниеОшибки);
	КонецЕсли;
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Возврат ВернутьОтветСОшибкой(ОписаниеОшибки, 500);	
	КонецЕсли;
	
	// Создаём бронь и возвращаем результат
	ОписаниеОшибки = "";
	СообщениеXML = ВебИнтеграция.СоздатьБронь(ПараметрыЗапроса.EmployeeID, ПараметрыЗапроса.Date, ПараметрыЗапроса.TimeBegin, ВремяОкончанияЗаписи, ПараметрыЗапроса.Clinic, ОписаниеОшибки, ПараметрыЗапроса);
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда 
		Возврат ВернутьОтветСОшибкой(ОписаниеОшибки, 500);
	КонецЕсли;
	
	// Преобразуем текст XML в JSON
	Возврат ВернутьУспешныйОтветИзXML(СообщениеXML);
	
КонецФункции

Функция ВернутьУспешныйОтветИзXML(СообщениеXML, ФорматФайла = Неопределено)
	
	Попытка
		ТелоОтвета = HTTPСервисыВызовСервера.ПреобразоватьXMLВФормат(СообщениеXML, ФорматФайла);
	Исключение
	    ТелоОтвета = СообщениеXML;
	КонецПопытки;
	Ответ = Новый HTTPСервисОтвет(200);                 
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Возврат Ответ;

КонецФункции

Функция ВернутьОтветСОшибкой(ОписаниеОшибки, КодОтвета = 400)
	
	Ответ = Новый HTTPСервисОтвет(500);
	Ответ.УстановитьТелоИзСтроки(ОписаниеОшибки);
	
	Возврат Ответ;	
	
КонецФункции

#КонецОбласти