
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолеВыбора = iga_HTMLВызовСервера.ПолучитьПолеВыбораЯзыка(Параметры.ТекущийЯзык);
	
КонецПроцедуры

&НаСервереБезКОнтекста
Функция ПолучитьСсылкуЯзыка(ВыбранныйУИД)
	
	Возврат Справочники.iga_ЯзыкиЧатов.ПолучитьСсылку(Новый УникальныйИдентификатор(ВыбранныйУИД));
	
КонецФункции

&НаКлиенте
Процедура ПолеВыбораПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
		
    // Ищем наш "фейковый" домен-маркер в href
    Если Найти(ДанныеСобытия.Href, "http://1c-event/SelectLang") > 0 Тогда
        
        // Блокируем реальный переход браузера по ссылке
        СтандартнаяОбработка = Ложь; 
        
        // Извлекаем УИД (разбиваем строку по знаку "=")
        МассивСтрок = СтрРазделить(ДанныеСобытия.Href, "=");
        Если МассивСтрок.Количество() > 1 Тогда
            ВыбранныйУИД = МассивСтрок[1];
            
            // Асинхронно закрываем форму и возвращаем УИД
            ЭтаФорма.Закрыть(ПолучитьСсылкуЯзыка(ВыбранныйУИД));
        КонецЕсли;
        
    КонецЕсли;

КонецПроцедуры
