
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстСообщенияHTML = iga_HTMLКлиент.ПолучитьИзначальныйТексСтраницы(Истина);
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстСообщенияДокументСформирован(Элемент)
	
	iga_HTMLКлиент.ПрименитьТекстКПолюHTML(Объект.ТекстСообщения, Элементы.ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПараметров(ТекстСообщения)
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	// 1. Используем регулярное выражение для поиска текста в фигурных скобках
	// Шаблон \{([^}]+)\} означает: найти "{", захватить всё, что не является "}", и найти "}"
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.IgnoreCase = Истина; // Игнорировать регистр
	RegExp.Global     = Истина; // Искать все вхождения
	RegExp.MultiLine  = Истина;
	RegExp.Pattern    = "\{([^}]+)\}";
	
	Попытка
		Matches = RegExp.Execute(ТекстСообщения);
	Исключение
		Сообщить("Ошибка при разборе текста алгоритма: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	СтарыеПараметры = Новый Соответствие;
	Для Каждого СтрокаПараметра Из Объект.ПараметрыПроизвольногоТекста Цикл
		СтруктураСтроки = Новый Структура("ЗначениеИсточник");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаПараметра);
		СтарыеПараметры.Вставить(СтрокаПараметра.ИмяПараметра, СтруктураСтроки);
	КонецЦикла;
	
	Объект.ПараметрыПроизвольногоТекста.Очистить();
	
	СтруктураПоиска = Новый Структура("ИмяПараметра");
	
	СчетчикПараметров = 0;
	Для Каждого Match Из Matches Цикл
	
		ИмяИзТекста = Match.SubMatches(0);
		
		СтруктураПоиска.ИмяПараметра = ИмяИзТекста;
		Если Объект.ПараметрыПроизвольногоТекста.НайтиСтроки(СтруктураПоиска).Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СчетчикПараметров = СчетчикПараметров + 1;
		
		СтрокаПараметра = Объект.ПараметрыПроизвольногоТекста.Добавить();
		СтрокаПараметра.ИмяПараметра = ИмяИзТекста;
		СтарыеЗначения = СтарыеПараметры.Получить(СтрокаПараметра.ИмяПараметра);
		Если Не СтарыеЗначения = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СтрокаПараметра, СтарыеЗначения);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Обработчик_ПослеВводаТекста(ТекстСообщения, ДопПараметры) Экспорт 
	
	Если ТекстСообщения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТекстСообщения = ТекстСообщения;
	
	iga_HTMLКлиент.ПрименитьТекстКПолюHTML(Объект.ТекстСообщения, Элементы.ТекстСообщения);
	
	ОбновитьСписокПараметров(ТекстСообщения);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВводаТекста", ЭтаФорма);
	
	ОткрытьФорму("Обработка.iga_РедакторТекстаHTML.Форма.Форма", Новый Структура("ТекстДляРедактирования", Объект.ТекстСообщения), ЭтаФорма,
		,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьАлгоритм(Команда)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПередОбработкойЭтапа Тогда
		Подсказка = "Доступные параметры:
		|ВходящиеПараметры - Структура(""Чат, ИдЧата, Этап, ТекстСообщения, ВыборКнопки"")
		|ПараметрыОбщения - Структура() - Произвольные параметры, которые передаются в течение всех этапов, сохраняются в регистре
		|Функция УстановитьПараметр([Имя парметра], [Значение параметра])";
		iga_УниверсальныеОбработчикиНаКлиенте.ОткрытьРедакторАлгоритма(ЭтаФорма, Объект, "ПередОбработкойЭтапа", Подсказка);
	Иначе
		Подсказка = "Доступные параметры:
		|ВходящиеПараметры - Структура(""Чат, ИдЧата, Этап, СледующийЭтап, ТекстСообщения, ВыборКнопки"") 
		|ПараметрыОбщения - Структура() - Произвольные параметры, которые передаются в течение всех этапов, сохраняются в регистре
		|Функция УстановитьПараметр([Имя парметра], [Значение параметра])";
		iga_УниверсальныеОбработчикиНаКлиенте.ОткрытьРедакторАлгоритма(ЭтаФорма, Объект, "ПослеОбработкиЭтапа", Подсказка, "ПроверочныйКодПосле");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	ПростойТекст = Не Объект.ТипСообщения = ПредопределенноеЗначение("Перечисление.iga_ТипыТекстаЭтапа.Шаблон");
	
	Элементы.ГруппТекстСообщения.Видимость = ПростойТекст;
	Элементы.ШаблонСообщения.Видимость = Не ПростойТекст;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСообщенияПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПроизвольногоТекстаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПроизвольногоТекстаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтветовПослеОбработкиКомандыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПередОбработкойЭтапа Тогда
		Подсказка = "Доступные параметры:
		|ВходящиеПараметры - Структура(""Чат, ИдЧата, Этап, ТекстСообщения, ВыборКнопки"")
		|ПараметрыОбщения - Структура() - Произвольные параметры, которые передаются в течение всех этапов, сохраняются в регистре
		|Функция УстановитьПараметр([Имя парметра], [Значение параметра])";
		iga_УниверсальныеОбработчикиНаКлиенте.ОткрытьРедакторАлгоритма(ЭтаФорма, Элементы.ВариантыОтветов.ТекущиеДанные, "ПослеОбработкиКоманды", Подсказка);
	Иначе
		Подсказка = "Доступные параметры:
		|ВходящиеПараметры - Структура(""Чат, ИдЧата, Этап, СледующийЭтап, ТекстСообщения, ВыборКнопки"") 
		|ПараметрыОбщения - Структура() - Произвольные параметры, которые передаются в течение всех этапов, сохраняются в регистре
		|Функция УстановитьПараметр([Имя парметра], [Значение параметра])";
		iga_УниверсальныеОбработчикиНаКлиенте.ОткрытьРедакторАлгоритма(ЭтаФорма, Элементы.ВариантыОтветов.ТекущиеДанные, "ПослеОбработкиКоманды", Подсказка, "ПроверочныйКодПосле");
	КонецЕсли;
КонецПроцедуры
