#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.СписокСкрытьПоказатьАрхивные, Список, Ложь);
	
КонецПроцедуры

// Добавлено Макеев (
&НаСервере
Процедура омг_ПриСозданииНаСервере(Отказ)
	
	// Подбор из классификатора
	КмПодборИзКлассификатора = Команды.Добавить("омг_ПодборИзКлассификатора");
	КмПодборИзКлассификатора.Заголовок = "Подбор из классификатора";
	КмПодборИзКлассификатора.Действие = "омг_ПодборИзКлассификатора";
	
	ЭлПодборИзКлассификатора = Элементы.Добавить("омг_ПодборИзКлассификатора", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
	ЭлПодборИзКлассификатора.ИмяКоманды = "омг_ПодборИзКлассификатора";
	
КонецПроцедуры

&НаСервере
Процедура омг_УстановитьДейстияФормы()
	
	УстановитьДействие("ПриСозданииНаСервере", "омг_ПриСозданииНаСервере");
	
КонецПроцедуры
// )
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкрытьПоказатьАрхивные(Команда)
	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.СписокСкрытьПоказатьАрхивные, Список);
КонецПроцедуры

// Добавлено Макеев (
&НаКлиенте
Процедура омг_ПодборИзКлассификатора(Команда)
	
	ОткрытьФорму("Справочник.НоменклатураМедицинскихУслуг.Форма.омг_КлассификаторМедУслуг");	
	
КонецПроцедуры
// )
#КонецОбласти

// Добавлено Макеев (
омг_УстановитьДейстияФормы();
// )