#Область ПрограммныйИнтерфейс

// Возвращает дополнительные параметры обработки
//
// Параметры:
//  ОбластьПрименения	 - ДокументСсылка, СправочникСсылка	 - Пустая ссылка на ужный документ/справочник
// 
// Возвращаемое значение:
//  ХранилищеЗначения, Неопределено - Параметры обработки
//
Функция ПолучитьДополнительныеПараметрыВнешнейОбработки(ИсточникМакета, ОбластьПрименения) Экспорт

	ВнешняяОбработкаСсылка = ИсточникМакета.СсылкаНаВнешнююОбработку;
	
	Если ИсточникМакета.Свойство("НомерСтроки") 
		И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ИсточникМакета.НомерСтроки)
	Тогда
		НомерСтроки = Число(ИсточникМакета.НомерСтроки);
	Иначе
		НомерСтроки = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ОбластьПрименения) = Тип("СправочникСсылка.ПакетыПечати")
		И Не ОбластьПрименения.Пустая()
	Тогда
		ОбластьПрименения = ОбластьПрименения.МестоВызоваСсылка;
	Иначе
		ОбластьПрименения = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ОбластьПрименения).ПустаяСсылка();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВнешниеОбработкиПринадлежность.ДополнительныеПараметрыОбработки КАК ДополнительныеПараметрыОбработки
	|ИЗ
	|	Справочник.ВнешниеОбработки.Принадлежность КАК ВнешниеОбработкиПринадлежность
	|ГДЕ
	|	ВнешниеОбработкиПринадлежность.Ссылка = &ВнешняяОбработка
	|	И ВнешниеОбработкиПринадлежность.СсылкаОбъекта = &ОбластьПрименения
	|	И (ВнешниеОбработкиПринадлежность.НомерСтроки = &НомерСтроки
	|		ИЛИ &НомерСтроки = НЕОПРЕДЕЛЕНО)";

	Запрос.УстановитьПараметр("ВнешняяОбработка", ВнешняяОбработкаСсылка);
	Запрос.УстановитьПараметр("ОбластьПрименения", ОбластьПрименения);
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДополнительныеПараметрыОбработки;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти