#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ссылка") Тогда
		Ссылка = Параметры.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь) Тогда
		СотрудникУстановившийПодпись = ОтраслевыеДополнения.СотрудникПользователяПоФилиалу(ПараметрыСеанса.ТекущийПользователь, РаботаСДокументамиСервер.ФилиалДокумента(Ссылка));
	КонецЕсли;
	
	Элементы.Проверить.Доступность = ЗначениеЗаполнено(СотрудникУстановившийПодпись);
	Элементы.ВалидацияПоСхематрону.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьДоступныеДолжностиМЗ();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Проверить(Команда)
	
	ИмеютсяКритичныеОшибки = ПроверитьНаСервере();
	
	РазвернутьСтроки(НезаполненныеОбязательныеПараметры, Элементы.НезаполненныеОбязательныеПараметры);
	РазвернутьСтроки(ПрочиеОшибки,						 Элементы.ПрочиеОшибки);
	РазвернутьСтроки(ОшибкиВалидацииПоСхематрону,		 Элементы.ОшибкиВалидацииПоСхематрону);
	
	Если ОшибкиВалидацииПоСхематрону.ПолучитьЭлементы().Количество() > 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Документ не проходит валидацию РЭМД.'"));
	ИначеЕсли Не ИмеютсяКритичныеОшибки Тогда
		ПоказатьПредупреждение(, НСтр("ru='Ошибок не обнаружено, документ может быть подписан.'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СотрудникУстановившийПодписьПриИзменении(Элемент)
	
	ОбновитьДоступныеДолжностиМЗ();
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьМЗПриИзменении(Элемент)
	
	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПроверитьНаСервере()
	
	НезаполненныеОбязательныеПараметры.ПолучитьЭлементы().Очистить();
	ПрочиеОшибки.ПолучитьЭлементы().Очистить();
	ОшибкиВалидацииПоСхематрону.ПолучитьЭлементы().Очистить();
	
	Строки = НезаполненныеОбязательныеПараметры.ПолучитьЭлементы();
	НезагруженныеКлассификаторы = Новый Массив;
	
	ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(Ссылка);
	
	НезаполненныеКлассификации = Новый Соответствие;
	НекритичныеПроблемы = Новый Соответствие;
	
	ДополнительныеПараметры = ИнтеграцияЕГИСЗ_СЭМД.ДополнительныеПараметрыДляРаботыССЭМД();
	
	Если ИмяТипаДокумента = "Документ.Прием" Тогда
		
		ВерсииШаблонов = Новый ТаблицаЗначений;
		ВерсииШаблонов.Колонки.Добавить("ВерсияШаблона");
		ВерсииШаблонов.Колонки.Добавить("ШаблонПриема");
		ДокументыПриемаКлиентСервер.ЗаполнитьТаблицуВерсийШаблонов(ВерсииШаблонов, Ссылка);
		
		Для Каждого СтрокаШаблона Из Ссылка.ШаблоныПриема Цикл
			
			СтрокаВерсии = ВерсииШаблонов.Найти(СтрокаШаблона.ШаблонПриема, "ШаблонПриема");
			Если СтрокаВерсии <> Неопределено Тогда
				ДополнительныеПараметры.ШаблонОсмотра = СтрокаВерсии.ВерсияШаблона;
			Иначе
				ДополнительныеПараметры.ШаблонОсмотра = СтрокаШаблона.ШаблонПриема;
			КонецЕсли;
			
			ДополнительныеПараметры.ИндексШаблона = Ссылка.ШаблоныПриема.Индекс(СтрокаШаблона);
			ДополнительныеПараметры.СтрокаШаблона = СтрокаШаблона;
			
			НаименованиеОбъектаЭМД = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьНаименованиеОбъектаЭМД(Ссылка, Новый Структура("ШаблонПриема", СтрокаШаблона.ШаблонПриема));
			НезаполненныеПараметры = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьНезаполненныеОбязательныеПараметры(Ссылка, СотрудникУстановившийПодпись, НезагруженныеКлассификаторы, НекритичныеПроблемы, ДолжностьМЗ, ДополнительныеПараметры);
			ЗаполнитьСтрокиПоПриему(НезаполненныеПараметры, Строки, СтрокаШаблона, НаименованиеОбъектаЭМД);
			ДополнитьНезаполненныеКлассификации(НезаполненныеПараметры.ПараметрыСекцийТела, НезаполненныеКлассификации, ДополнительныеПараметры, НаименованиеОбъектаЭМД);
			ЗаполнитьОшибкиСхематрона(НезаполненныеПараметры.ОшибкиСхематрона, ДополнительныеПараметры, НаименованиеОбъектаЭМД);
		КонецЦикла;
		
	ИначеЕсли ИмяТипаДокумента = "Документ.ПрохождениеМедосмотра" Тогда
		Если ЗначениеЗаполнено(Ссылка.Номенклатура.ВредныйФакторСправки.ШаблонОсмотраСправки) Тогда
			
			ДополнительныеПараметры.ШаблонОсмотра = Ссылка.Номенклатура.ВредныйФакторСправки.ШаблонОсмотраСправки;
			
			НаименованиеОбъектаЭМД = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьНаименованиеОбъектаЭМД(Ссылка, Новый Структура("ШаблонОсмотра", ДополнительныеПараметры.ШаблонОсмотра));
			НезаполненныеПараметры = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьНезаполненныеОбязательныеПараметры(Ссылка, СотрудникУстановившийПодпись, НезагруженныеКлассификаторы, НекритичныеПроблемы, ДолжностьМЗ, ДополнительныеПараметры);
			ЗаполнитьСтрокиПоПМО(НезаполненныеПараметры, Строки, ДополнительныеПараметры, НаименованиеОбъектаЭМД);
			ДополнитьНезаполненныеКлассификации(НезаполненныеПараметры.ПараметрыСекцийТела, НезаполненныеКлассификации, ДополнительныеПараметры, НаименованиеОбъектаЭМД);
			ЗаполнитьОшибкиСхематрона(НезаполненныеПараметры.ОшибкиСхематрона, ДополнительныеПараметры, НаименованиеОбъектаЭМД);
		Иначе
			МодульМедосмотрыСервер = ДопСерверныеФункции.ОбщийМодуль("МедосмотрыСервер");
			ПриказыВредныеФакторы = МодульМедосмотрыСервер.ПриказыВредныеФакторыМедосмотраСВидамиДокументов(Ссылка);
			
			Для Каждого СтрокаПриказаВредногоФактора Из ПриказыВредныеФакторы Цикл
				ПриказВредныйФактор = СтрокаПриказаВредногоФактора.ПриказВредныйФактор;
				
				ЭтоСтрокаФактора = ДопСерверныеФункции.ИмяСсылочногоТипа(ПриказВредныйФактор) = "Справочник.ПереченьВредныхФакторовИРабот";
				Приказ = ?(ЭтоСтрокаФактора, ПриказВредныйФактор.Приказ, ПриказВредныйФактор);
				
				СообщениеРЭМД = Неопределено;
				
				Если ЭтоСтрокаФактора
					И МодульМедосмотрыСервер.ЭтоПриказСправки(Приказ)
				Тогда
					ПриказВредныйФакторМО = Неопределено;
					ШаблонОсмотра = ПриказВредныйФактор.ШаблонОсмотраСправки;
					ВредныйФакторСправки = ПриказВредныйФактор;
					ЭтоПриказ = Ложь;
					НаименованиеОбъектаЭМД = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьНаименованиеОбъектаЭМД(Ссылка, Новый Структура("ШаблонОсмотра", ШаблонОсмотра));
				Иначе
					СтрокаЭМД = Ссылка.ЭМД.Найти(ИнтеграцияЕГИСЗВызовСервера.ПолучитьУИДПоПриказуВредномуФактору(Ссылка, Приказ), "УИД_Шаблона");
					Если СтрокаЭМД <> Неопределено Тогда
						СообщениеРЭМД = СтрокаЭМД.СообщениеРЭМД;
					КонецЕсли;
					ПриказВредныйФакторМО = ПриказВредныйФактор;
					ШаблонОсмотра = Неопределено;
					ВредныйФакторСправки = Неопределено;
					ЭтоПриказ = Истина;
					
					НаименованиеОбъектаЭМД = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьНаименованиеОбъектаЭМД(Ссылка, Новый Структура("ПриказВредныйФактор", ПриказВредныйФактор));
				КонецЕсли;
				
				ДополнительныеПараметры.ПриказВредныйФакторМО	= ПриказВредныйФакторМО;
				ДополнительныеПараметры.ШаблонОсмотра			= ШаблонОсмотра;
				ДополнительныеПараметры.ВредныйФакторСправки	= ВредныйФакторСправки;
				ДополнительныеПараметры.СообщениеРЭМД			= СообщениеРЭМД;
				
				НезаполненныеПараметры = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьНезаполненныеОбязательныеПараметры(Ссылка, СотрудникУстановившийПодпись, НезагруженныеКлассификаторы, НекритичныеПроблемы, ДолжностьМЗ, ДополнительныеПараметры);
				ЗаполнитьСтрокиПоПМО(НезаполненныеПараметры, Строки, ДополнительныеПараметры, НаименованиеОбъектаЭМД, ЭтоПриказ);
				ДополнитьНезаполненныеКлассификации(НезаполненныеПараметры.ПараметрыСекцийТела, НезаполненныеКлассификации, ДополнительныеПараметры, НаименованиеОбъектаЭМД);
				ЗаполнитьОшибкиСхематрона(НезаполненныеПараметры.ОшибкиСхематрона, ДополнительныеПараметры, НаименованиеОбъектаЭМД);
			КонецЦикла;
		КонецЕсли;
		
	//ИначеЕсли ИмяТипаДокумента = "Документ.ВрачебнаяКомиссия" Тогда // Версия КОРП
	//	НезаполненныеПараметры = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьНезаполненныеОбязательныеПараметры(Ссылка, СотрудникУстановившийПодпись, НезагруженныеКлассификаторы, НекритичныеПроблемы, ДолжностьМЗ);
	//	ЗаполнитьСтрокиПоВК(НезаполненныеПараметры, Строки, Ссылка);
	//	ДополнитьНезаполненныеКлассификации(НезаполненныеПараметры.ПараметрыСекцийТела, НезаполненныеКлассификации);
	//	ЗаполнитьОшибкиСхематрона(НезаполненныеПараметры.ОшибкиСхематрона);
	ИначеЕсли ИмяТипаДокумента = "Документ.Рецепт" Тогда
		НаименованиеОбъектаЭМД = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьНаименованиеОбъектаЭМД(Ссылка, Новый Структура("ФормаРецепта", Ссылка.ФормаРецепта));
		НезаполненныеПараметры = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьНезаполненныеОбязательныеПараметры(Ссылка, СотрудникУстановившийПодпись, НезагруженныеКлассификаторы, НекритичныеПроблемы, ДолжностьМЗ, ДополнительныеПараметры);
		ЗаполнитьСтрокиПоРецепту(НезаполненныеПараметры, Строки, ДополнительныеПараметры, НаименованиеОбъектаЭМД);
		ДополнитьНезаполненныеКлассификации(НезаполненныеПараметры.ПараметрыСекцийТела, НезаполненныеКлассификации, ДополнительныеПараметры);
		ЗаполнитьОшибкиСхематрона(НезаполненныеПараметры.ОшибкиСхематрона, ДополнительныеПараметры);
	КонецЕсли;
	
	Проблемы = ИнтеграцияЕГИСЗВызовСервера.ПолучитьПроблемыСЭМДПередПодписанием(Ссылка);
	Если НезагруженныеКлассификаторы.Количество() > 0 Тогда
		Проблемы.Вставить(НСтр("ru='Требуется загрузить классификаторы'"), НезагруженныеКлассификаторы);
	КонецЕсли;
	
	Если НезаполненныеКлассификации.Количество() > 0 Тогда
		Проблемы.Вставить(НСтр("ru='В шаблонах не заполнены классификации полей'"), НезаполненныеКлассификации);
	КонецЕсли;
	
	ИмеютсяКритичныеОшибки = НезаполненныеОбязательныеПараметры.ПолучитьЭлементы().Количество() > 0 Или Проблемы.Количество() > 0;
	
	Если НекритичныеПроблемы.Количество() > 0 Тогда
		Проблемы.Вставить(НСтр("ru='Некритичные проблемы'"), НекритичныеПроблемы);
	КонецЕсли;
	
	ЗаполнитьПрочиеОшибки(Проблемы, ПрочиеОшибки.ПолучитьЭлементы());
	
	Если ОшибкиВалидацииПоСхематрону.ПолучитьЭлементы().Количество() > 0 Тогда
		Элементы.ВалидацияПоСхематрону.Доступность = Истина;
		Элементы.Ошибки.ТекущаяСтраница = Элементы.ВалидацияПоСхематрону;
	Иначе
		Элементы.ВалидацияПоСхематрону.Доступность = Ложь;
		Элементы.Ошибки.ТекущаяСтраница = Элементы.Основные;
	КонецЕсли;
	
	Возврат ИмеютсяКритичныеОшибки;
	
КонецФункции

&НаСервере
Процедура ДополнитьНезаполненныеКлассификации(НезаполненныеПараметры, НезаполненныеКлассификации, ДополнительныеПараметры, НаименованиеОбъектаЭМД = Неопределено)
	
	НезаполненныеКлассификацииШаблона = Новый Массив;
	Для Каждого НезаполненныйПараметр Из НезаполненныеПараметры Цикл
		СвойстваУзла = НезаполненныйПараметр.СвойстваРодительскогоУзла.СвойстваУзла;
		Если СтрЗаканчиваетсяНа(НРег(СвойстваУзла.localid), ".классификацияполя") Тогда
			Если НезаполненныеКлассификацииШаблона.Найти(СвойстваУзла.Синоним) = Неопределено Тогда
				НезаполненныеКлассификацииШаблона.Добавить(СвойстваУзла.Синоним);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НезаполненныеКлассификацииШаблона.Количество() > 0 Тогда
		СвойстваЭМД = ИнтеграцияЕГИСЗ_РЭМД.СформироватьСвойстваЭМД(Ссылка, ДополнительныеПараметры);
		НаименованиеВидаДокумента = ИнтеграцияЕГИСЗ_СЭМД.НаименованиеВидаДокумента(СвойстваЭМД.ВидРЭМД);
		НезаполненныеКлассификации.Вставить(НаименованиеВидаДокумента, НезаполненныеКлассификацииШаблона);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОшибкиСхематрона(ОшибкиСхематрона, ДополнительныеПараметры, НаименованиеОбъектаЭМД = Неопределено)
	
	Если ОшибкиСхематрона.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваЭМД = ИнтеграцияЕГИСЗ_РЭМД.СформироватьСвойстваЭМД(Ссылка, ДополнительныеПараметры);
	НаименованиеВидаДокумента = ИнтеграцияЕГИСЗ_СЭМД.НаименованиеВидаДокумента(СвойстваЭМД.ВидРЭМД);
	
	СтрокаШаблона = ОшибкиВалидацииПоСхематрону.ПолучитьЭлементы().Добавить();
	СтрокаШаблона.Текст = НаименованиеВидаДокумента;
	Если ЗначениеЗаполнено(НаименованиеОбъектаЭМД) Тогда
		СтрокаШаблона.НаименованиеОбъектаЭМД = НаименованиеОбъектаЭМД;
	КонецЕсли;
	
	СтрокиОшибок = СтрокаШаблона.ПолучитьЭлементы();
	
	ПравилаОшибокСхематрона = ОшибкиСхематрона.Скопировать();
	ПравилаОшибокСхематрона.Свернуть("Правило");
	
	ЗаполнитьТаблицуОшибокСхематрона(ОшибкиСхематрона, ПравилаОшибокСхематрона, СтрокиОшибок);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОшибокСхематрона(ОшибкиСхематрона, ПравилаОшибокСхематрона, СтрокиТаблицы)
	
	Для Каждого ПравилоОшибокСхематрона Из ПравилаОшибокСхематрона Цикл
		ОшибкиПоПравилу = ОшибкиСхематрона.НайтиСтроки(Новый Структура("Правило", ПравилоОшибокСхематрона.Правило));
		Если ОшибкиПоПравилу.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПравила = СтрокиТаблицы.Добавить();
		СтрокаПравила.Текст = ПравилоОшибокСхематрона.Правило;
		СтрокиОшибокПоПравилу = СтрокаПравила.ПолучитьЭлементы();
		Для Каждого СтрокаОшибки Из ОшибкиПоПравилу Цикл
			НоваяСтрока = СтрокиОшибокПоПравилу.Добавить();
			НоваяСтрока.Текст = СтрокаОшибки.Текст;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиПоПриему(НезаполненныеПараметры, Строки, СтрокаШаблона, НаименованиеОбъектаЭМД)
	
	Если НезаполненныеПараметры.ПараметрыОбщихСекций.Количество() = 0
		И НезаполненныеПараметры.ПараметрыСекцийТела.Количество() = 0
	Тогда
		Возврат;
	КонецЕсли;
	
	LocalidЗаполняемыеПоДаннымДокумента = ИнтеграцияЕГИСЗ_СЭМД.LocalidЗаполняемыеПоДаннымДокумента(СтрокаШаблона.ШаблонПриема);
	
	НаименованиеВидаДокумента = ИнтеграцияЕГИСЗ_СЭМД.НаименованиеВидаДокумента(СтрокаШаблона.ШаблонПриема.ВидДокумента);
	
	СтрокаГруппировки = Строки.Добавить();
	СтрокаГруппировки.Текст = НаименованиеВидаДокумента;
	Если ЗначениеЗаполнено(НаименованиеОбъектаЭМД) Тогда
		СтрокаГруппировки.НаименованиеОбъектаЭМД = НаименованиеОбъектаЭМД;
	КонецЕсли;
	
	СтрокиГруппировки = СтрокаГруппировки.ПолучитьЭлементы();
	
	Для Каждого НезаполненныйПараметр Из НезаполненныеПараметры.ПараметрыОбщихСекций Цикл
		НоваяСтрока = СтрокиГруппировки.Добавить();
		НоваяСтрока.Текст = ПолучитьСтрокуНезаполненногоПараметра(НезаполненныйПараметр);
	КонецЦикла;
	
	Для Каждого НезаполненныйПараметр Из НезаполненныеПараметры.ПараметрыСекцийТела Цикл
		LocalidНезаполненногоПараметра = НезаполненныйПараметр.СвойстваРодительскогоУзла.СвойстваУзла.LocalId;
		// В эту таблицу только зарезервированные и заполняемые по данным документа
		Если ИнтеграцияЕГИСЗ_СЭМД.ЗарезервированныйLocalid(LocalidНезаполненногоПараметра)
			Или LocalidЗаполняемыеПоДаннымДокумента.Найти(LocalidНезаполненногоПараметра) <> Неопределено
		Тогда
			НоваяСтрока = СтрокиГруппировки.Добавить();
			НоваяСтрока.Текст = ПолучитьСтрокуНезаполненногоПараметра(НезаполненныйПараметр);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиПоПМО(НезаполненныеПараметры, Строки, ДополнительныеПараметры, НаименованиеОбъектаЭМД, ЭтоПриказ = Ложь)
	
	Если НезаполненныеПараметры.ПараметрыОбщихСекций.Количество() = 0
		И НезаполненныеПараметры.ПараметрыСекцийТела.Количество() = 0
	Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваЭМД = ИнтеграцияЕГИСЗ_РЭМД.СформироватьСвойстваЭМД(Ссылка, ДополнительныеПараметры);
	НаименованиеВидаДокумента = ИнтеграцияЕГИСЗ_СЭМД.НаименованиеВидаДокумента(СвойстваЭМД.ВидРЭМД);
	
	СтрокаГруппировки = Строки.Добавить();
	СтрокаГруппировки.Текст = НаименованиеВидаДокумента;
	Если ЗначениеЗаполнено(НаименованиеОбъектаЭМД) Тогда
		СтрокаГруппировки.НаименованиеОбъектаЭМД = НаименованиеОбъектаЭМД;
	КонецЕсли;
	
	СтрокиГруппировки = СтрокаГруппировки.ПолучитьЭлементы();
	
	Для Каждого НезаполненныйПараметр Из НезаполненныеПараметры.ПараметрыОбщихСекций Цикл
		НоваяСтрока = СтрокиГруппировки.Добавить();
		НоваяСтрока.Текст = ПолучитьСтрокуНезаполненногоПараметра(НезаполненныйПараметр);
	КонецЦикла;
	
	Если ЭтоПриказ Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого НезаполненныйПараметр Из НезаполненныеПараметры.ПараметрыСекцийТела Цикл
		// В эту таблицу только зарезервированные
		Если ИнтеграцияЕГИСЗ_СЭМД.ЗарезервированныйLocalid(НезаполненныйПараметр.СвойстваРодительскогоУзла.СвойстваУзла.LocalId) Тогда
			НоваяСтрока = СтрокиГруппировки.Добавить();
			НоваяСтрока.Текст = ПолучитьСтрокуНезаполненногоПараметра(НезаполненныйПараметр);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиПоРецепту(НезаполненныеПараметры, Строки, ДополнительныеПараметры, НаименованиеОбъектаЭМД)
	
	Если НезаполненныеПараметры.ПараметрыОбщихСекций.Количество() = 0
		И НезаполненныеПараметры.ПараметрыСекцийТела.Количество() = 0
	Тогда
		Возврат;
	КонецЕсли;
	
	ФиксированныйВидДокумента = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидРЭМДРецепта(Ссылка.ФормаРецепта);
	НаименованиеВидаДокумента = ИнтеграцияЕГИСЗ_СЭМД.НаименованиеВидаДокумента(ФиксированныйВидДокумента);
	
	СтрокаГруппировки = Строки.Добавить();
	СтрокаГруппировки.Текст = НаименованиеВидаДокумента;
	Если ЗначениеЗаполнено(НаименованиеОбъектаЭМД) Тогда
		СтрокаГруппировки.НаименованиеОбъектаЭМД = НаименованиеОбъектаЭМД;
	КонецЕсли;
	
	СтрокиГруппировки = СтрокаГруппировки.ПолучитьЭлементы();
	
	Для Каждого НезаполненныйПараметр Из НезаполненныеПараметры.ПараметрыОбщихСекций Цикл
		НоваяСтрока = СтрокиГруппировки.Добавить();
		НоваяСтрока.Текст = ПолучитьСтрокуНезаполненногоПараметра(НезаполненныйПараметр);
	КонецЦикла;
	
	Для Каждого НезаполненныйПараметр Из НезаполненныеПараметры.ПараметрыСекцийТела Цикл
		// В эту таблицу только зарезервированные
		Если ИнтеграцияЕГИСЗ_СЭМД.ЗарезервированныйLocalid(НезаполненныйПараметр.СвойстваРодительскогоУзла.СвойстваУзла.LocalId) Тогда
			НоваяСтрока = СтрокиГруппировки.Добавить();
			НоваяСтрока.Текст = ПолучитьСтрокуНезаполненногоПараметра(НезаполненныйПараметр);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьСтрокиПоВК(НезаполненныеПараметры, Строки, Ссылка)
//	
//	Для Каждого НезаполненныйПараметр Из НезаполненныеПараметры.ПараметрыОбщихСекций Цикл
//		НоваяСтрока = Строки.Добавить();
//		НоваяСтрока.НезаполненныйПараметр = ПолучитьСтрокуНезаполненногоПараметра(НезаполненныйПараметр);
//	КонецЦикла;
//	
//	Если ИнтеграцияЕГИСЗВызовСервера.ДокументЯвляетсяЗаключениемМедосмотра(Ссылка) Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Для Каждого НезаполненныйПараметр Из НезаполненныеПараметры.ПараметрыСекцийТела Цикл
//		// В эту таблицу только зарезервированные
//		Если ИнтеграцияЕГИСЗ_СЭМД.ЗарезервированныйLocalid(НезаполненныйПараметр.СвойстваРодительскогоУзла.СвойстваУзла.LocalId) Тогда
//			НоваяСтрока = Строки.Добавить();
//			НоваяСтрока.НезаполненныйПараметр = ПолучитьСтрокуНезаполненногоПараметра(НезаполненныйПараметр);
//		КонецЕсли;
//	КонецЦикла;
//	
//КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПрочиеОшибки(Проблемы, Строки)
	
	// TODO: переделать
	Если ТипЗнч(Проблемы) <> Тип("Массив")
		И ТипЗнч(Проблемы) <> Тип("Соответствие")
		И Не (ТипЗнч(Проблемы) = Тип("Структура")
			И Проблемы.Свойство("Заголовок")
			И Проблемы.Свойство("Проблемы"))
	Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Проблема Из Проблемы Цикл
		
		Если ТипЗнч(Проблема) = Тип("Соответствие") Тогда
			ЗаполнитьПрочиеОшибки(Проблема, Строки);
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Проблема) = Тип("Структура") Тогда
			НоваяСтрока = Строки.Добавить();
			НоваяСтрока.Текст = Проблема.Заголовок;
			Если Проблема.Свойство("НаименованиеОбъектаЭМД") Тогда
				НоваяСтрока.НаименованиеОбъектаЭМД = Проблема.НаименованиеОбъектаЭМД;
			КонецЕсли;
			ЗаполнитьПрочиеОшибки(Проблема.Проблемы, НоваяСтрока.ПолучитьЭлементы());
		ИначеЕсли ТипЗнч(Проблема) = Тип("КлючИЗначение") Тогда
			НоваяСтрока = Строки.Добавить();
			НоваяСтрока.Текст = Проблема.Ключ;
			ЗаполнитьПрочиеОшибки(Проблема.Значение, НоваяСтрока.ПолучитьЭлементы());
		ИначеЕсли ТипЗнч(Проблема) = Тип("Строка") Тогда
			НоваяСтрока = Строки.Добавить();
			НоваяСтрока.Текст = Проблема;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтрокуНезаполненногоПараметра(ДанныеНезаполненногоПараметра)
	
	Возврат ДанныеНезаполненногоПараметра.СвойстваРодительскогоУзла.СвойстваУзла.Синоним;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДоступныеДолжностиМЗ()
	
	ДолжностьМЗ = Неопределено;
	
	ДолжностиСотрудника = ИнтеграцияЕГИСЗВызовСервера.ДолжностиМЗ(СотрудникУстановившийПодпись);
	Если ДолжностиСотрудника.Количество() > 0 Тогда
		ДолжностьМЗ = ДолжностиСотрудника[0];
	КонецЕсли;
	
	ПараметрыВыбораПоля = Новый Массив;
	ПараметрыВыбораПоля.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", ДолжностиСотрудника));
	Элементы.ДолжностьМЗ.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПоля);
	Элементы.ДолжностьМЗ.СписокВыбора.ЗагрузитьЗначения(ДолжностиСотрудника);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	
	Элементы.Проверить.Доступность = ЗначениеЗаполнено(СотрудникУстановившийПодпись) И ЗначениеЗаполнено(ДолжностьМЗ);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьСтроки(Дерево, ЭлементДерева)
	
	Для Каждого СтрокаДерева Из Дерево.ПолучитьЭлементы() Цикл
		ЭлементДерева.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти