
Процедура омг_КорректировкаЖизниТокеновАвторизации() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.омг_ТокеныАвторизацииСервисов КАК омг_ТокеныАвторизацииСервисов";
	ВыборкаТокенов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаТокенов.Следующий() Цикл
		
		ВремяЖизниВСекундах = ВыборкаТокенов.ВремяЖизниВСекундах - 60;
		
		Если ВыборкаТокенов.ВремяЖизниВСекундах <= 0 Или КонецДня(ВыборкаТокенов.ДатаОкончания) < ТекущаяДата() Тогда
			Запись = РегистрыСведений.омг_ТокеныАвторизацииСервисов.СоздатьМенеджерЗаписи();
			Запись.Токен = ВыборкаТокенов.Токен;
			Запись.Удалить();
		Иначе
			Запись = РегистрыСведений.омг_ТокеныАвторизацииСервисов.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, ВыборкаТокенов);
			Запись.ВремяЖизниВСекундах = ВремяЖизниВСекундах;
			Запись.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
