#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Результат = Параметры.НачальноеЗначение;
	
	НастроитьЭлементыФормы();
	
	ЗаполнитьПоляПоНачальномуЗначению();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НетНетСведенийПриИзменении(Неопределено, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Принять(Команда)
	
	Если Результат <> Параметры.НачальноеЗначение Тогда
		Закрыть(Результат);
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИнфекцияПриИзменении(Элемент)
	ВычислитьРезультатПоПолям();
КонецПроцедуры

&НаКлиенте
Процедура ИнфекцияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		// Удаление мусора, введенного вручную
		ЧастиСтроки = СтрРазделить(ЭтотОбъект[Элемент.Имя], ",");
		мОбрИнд = ЧастиСтроки.Количество()-1;
		Для Сч = 0 По мОбрИнд Цикл
			
			ГодСтрокой = СокрЛП(ЧастиСтроки[мОбрИнд-Сч]);
			Если СтрДлина(ГодСтрокой) <> 4 Тогда
				ЧастиСтроки.Удалить(мОбрИнд-Сч);
			Иначе
				ЧастиСтроки[мОбрИнд-Сч] = ГодСтрокой;
			КонецЕсли;
		КонецЦикла;
		ЭтотОбъект[Элемент.Имя] = СтрСоединить(ЧастиСтроки, ", ");
		
		// Добавление выбранного значения
		Если СтрНайти(ЭтотОбъект[Элемент.Имя], ВыбранноеЗначение) = 0 Тогда
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ЭтотОбъект[Элемент.Имя], ВыбранноеЗначение, ", ");
		КонецЕсли;
		
		// Сортировка годов
		ЧастиСтроки = СтрРазделить(ЭтотОбъект[Элемент.Имя], ",");
		Для Сч = 0 По ЧастиСтроки.Количество()-1 Цикл
			ЧастиСтроки[Сч] = СокрЛП(ЧастиСтроки[Сч]);
		КонецЦикла;
		
		Сортер = Новый СписокЗначений;
		Сортер.ЗагрузитьЗначения(ЧастиСтроки);
		Сортер.СортироватьПоЗначению();
		ЭтотОбъект[Элемент.Имя] = СтрСоединить(Сортер.ВыгрузитьЗначения(), ", ");
	Иначе
		// Выбрали вариант "Нет"
		ЭтотОбъект[Элемент.Имя] = "";
	КонецЕсли;
	
	ВычислитьРезультатПоПолям();
	
КонецПроцедуры

&НаКлиенте
Процедура НетНетСведенийПриИзменении(Элемент, ПриОткрытии = Ложь)
	
	ПоляФормы = ПоляДанныхНаФорме(Элементы);
	Для Каждого Поле Из ПоляФормы Цикл
		Поле.ПодсказкаВвода = НетНетСведений;
	КонецЦикла;
	
	Если Не ПриОткрытии Тогда
		ВычислитьРезультатПоПолям();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// При создании на сервере
&НаСервере
Процедура НастроитьЭлементыФормы()
	
	// Определение "нет" или "нет сведений"
	ЗначениеНетСведений = Элементы.НетНетСведений.СписокВыбора.Получить(1).Значение;
	Если СтрНайти(Параметры.НачальноеЗначение, ЗначениеНетСведений) <> 0 Тогда
		НетНетСведений = ЗначениеНетСведений;
	Иначе
		НетНетСведений = Элементы.НетНетСведений.СписокВыбора.Получить(0).Значение;
	КонецЕсли;
	
	// Списки выбора года
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить("", "Нет");
	
	ТекущийГод = Год(ТекущаяДата());
	Для Сч = 1 По 20 Цикл
		СписокВыбора.Добавить(Формат(ТекущийГод, "ЧГ="));
		ТекущийГод = ТекущийГод - 1;
	КонецЦикла;
	
	ПоляФормы = ПоляДанныхНаФорме(Элементы);
	
	Для Каждого ПолеФормы Из ПоляФормы Цикл
		СписокПоля = ПолеФормы.СписокВыбора;
		Для Каждого ЭлементСписка Из СписокВыбора Цикл
			СписокПоля.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// При создании на сервере
&НаСервере
Процедура ЗаполнитьПоляПоНачальномуЗначению()
	
КонецПроцедуры

&НаКлиенте
Процедура ВычислитьРезультатПоПолям()
	
	ПоляФормы = ПоляДанныхНаФорме(Элементы);
	
	Результат = "";
	
	Для Каждого Поле Из ПоляФормы Цикл
		ТекстПоля = Поле.Подсказка + ": " + ?(ЗначениеЗаполнено(ЭтотОбъект[Поле.Имя]), ЭтотОбъект[Поле.Имя], НетНетСведений);
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Результат, ТекстПоля, ";  ");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПоляДанныхНаФорме(Знач ЭлементыФормы)
	
	Поля = Новый Массив;
	Поля.Добавить(ЭлементыФормы.Туберкулез);
	Поля.Добавить(ЭлементыФормы.ВИЧ);
	Поля.Добавить(ЭлементыФормы.ВирусныеГепатиты);
	Поля.Добавить(ЭлементыФормы.Сифилис);
	Поля.Добавить(ЭлементыФормы.COVID19);
	
	Возврат Поля;
	
КонецФункции

#КонецОбласти