
#Область ПрограммныйИнтерфейс

// Возвразает массив льгот клиента
//
// Параметры:
//  Клиент	 - СправочникСсылка.Клиенты	 - Клиент
// 
// Возвращаемое значение:
//  Массив - Массив льгот клиента
//
Функция ПолучитьЛьготыКлиента(Клиент) Экспорт

	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛьготыКлиентов.Льгота КАК Льгота
		|ИЗ
		|	РегистрСведений.ЛьготыКлиентов КАК ЛьготыКлиентов
		|ГДЕ
		|	ЛьготыКлиентов.Клиент = &Клиент";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Льгота");
	
КонецФункции

#КонецОбласти