#Область ОбщаяОбработкаКоманд

// В модуле DICOM выбирается какой модуль будет обрабатывать ИмяКоманды, ИмяКоманды совпадает с функцией в конкретном модуле,
// Результат работы должен быть один HTTPЗапрос, который полностью сформирован на основе ПараметрыКоманды
Функция ОбработатьКомандуПоИмени(ИмяКоманды,НастройкиDICOM, ПараметрыКоманды) Экспорт
	
	Если ИмяКоманды = "ПолучитьКоличествоФрагментовУченияDCM4CHEE" Тогда		
		Возврат ПолучитьКоличествоФрагментовУченияDCM4CHEE(НастройкиDICOM,ПараметрыКоманды);

	ИначеЕсли ИмяКоманды = "СкачатьStudy" Тогда
		Возврат СкачатьStudy(НастройкиDICOM, ПараметрыКоманды); 
		
	ИначеЕсли ИмяКоманды = "ОтправитьДанныеMWL" Тогда
		Возврат ОтправитьДанныеMWL(НастройкиDICOM,ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = "НайтиПациентаВPACS" Тогда
		Возврат НайтиПациентаВPACS(НастройкиDICOM, ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = "СоздатьПациента" Тогда		
		Возврат СоздатьПациента(НастройкиDICOM,ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = "НайтиДанныеMWL" Тогда
		Возврат НайтиДанныеMWL(НастройкиDICOM,ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = "НайтиДанныеStudy" Тогда
		Возврат НайтиДанныеStudy(НастройкиDICOM,ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = "НайтиДанныеMPPS" Тогда
		Возврат НайтиДанныеMPPS(НастройкиDICOM,ПараметрыКоманды);
		
	ИначеЕсли ИмяКоманды = "ОтменитьWorklist" Тогда
		Возврат ОтменитьWorklist(НастройкиDICOM,ПараметрыКоманды);
		
	КонецЕсли;
	
    Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область КомандыФормированияЗапросов

// функция, проверяющая наличие текущего пациента в программе
//
// Параметры:
//	НастройкиСистемыDICOM - СписокЗначений - Список настроек системы  
//	ПараметрыКоманды  - Структура - Содержит: PatientUID - Уид пациента (который Study, имеющий фрагменты),
//											чьи фрагменты мы хотим скачать
// Возвращаемое значение:
//   HTTPОтвет,Неопределено   - Если пациент был найден, то возвращается HTTPОтвет, иначе Неопредеделено, ЕСЛИ БЫЛ СОЗДАН ПАЦИЕНТ - он повторно ищется
//
Функция НайтиПациентаВPACS(НастройкиСистемыDICOM, ПараметрыКоманды)
		
	АдресРесурса = СтрШаблон("aets/%1/rs/patients", НастройкиСистемыDICOM.НайтиПоЗначению("AETLМенеджера").Представление);
	
	// Параметры задаются через Адрес Ресурса	
	МассивФильтровАтрибутов = Новый Массив;
    МассивФильтровАтрибутов.Добавить(СтрШаблон("%1=%2", "PatientID",ПараметрыКоманды.PatientUID));
	МассивФильтровАтрибутов.Добавить(СтрШаблон("%1=%2", "IssuerOfPatientID","1C"));
	//МассивФильтровАтрибутов.Добавить(СтрШаблон("%1=%2","includefield","IssuerOfPatientID"));
	
	Запрос = ПолучитьЗапросDCM4CHEE(,АдресРесурса,,МассивФильтровАтрибутов);	
	
	Возврат Запрос;

КонецФункции

// Функция, Создающая пациента в PACS-сервере dcm4chee
//
// Параметры:
//	НастройкиСистемыDICOM - СписокЗначений - Список настроек системы  
//	ПараметрыКоманды  - Структура - В данной ситуации сама структура является исходными параметрами для тела запроса
// Возвращаемое значение:
//   HTTPОтвет,Неопределено   - Если пациент был найден, то возвращается HTTPОтвет, иначе Неопредеделено, ЕСЛИ БЫЛ СОЗДАН ПАЦИЕНТ - он повторно ищется
//
Функция СоздатьПациента(НастройкиСистемыDICOM, ПараметрыКоманды)

	ТелоЗапроса = ПолучитьJSONТелоДляDCM4CHEE(ПараметрыКоманды);	
	
	// /aets/{aet}/rs/patients	
	АдресРесурса = СтрШаблон("aets/%1/rs/patients", НастройкиСистемыDICOM.НайтиПоЗначению("AETLМенеджера").Представление);	
	Запрос = ПолучитьЗапросDCM4CHEE(ТелоЗапроса,АдресРесурса);
	
	Возврат Запрос;
	
КонецФункции

// Функция, которая скачивает Study. Важно, что при скачивании получается единый файл, то он сразу будет записан, а HTTPОтвет будет без двоичных данных 
//
// Параметры:
//	НастройкиСистемыDICOM - СписокЗначений - Список настроек системы  
//	ПараметрыКоманды  - Структура - Содержит: ФорматВозвращаемых - ФорматВозвращаемых учений, приведённый для запроса accept 
//                                  StudyUID - Уид учения (который Study, имеющий фрагменты), чьи фрагменты мы хотим скачать
//                                  ЭтоРендер - Булево значение - получаем ли мы заведомо рендер или нет
//	
Функция СкачатьStudy(НастройкиСистемыDICOM,ПараметрыКоманды)

	МассивФильтровАтрибутов = Новый Массив;
	МассивФильтровАтрибутов.Добавить(СтрШаблон("%1=%2", "accept",ПараметрыКоманды.ФорматВозвращаемых));

	// Без этой кодировки данные вернутся побитыми, осторожно, сложная диагностика
	МассивПредстСтруктЗаголовковЗапроса = Новый Массив;    
	МассивПредстСтруктЗаголовковЗапроса.Добавить("Accept-Encoding"); 
	МассивПредстСтруктЗаголовковЗапроса.Добавить("identity");

	АдресРесурса = СтрШаблон("aets/%1/rs/studies/%2%3",НастройкиСистемыDICOM.НайтиПоЗначению("AETLМенеджера").Представление,
								ПараметрыКоманды.StudyUID,?(ПараметрыКоманды.ЭтоРендер,"/rendered",""));
	             
	Запрос = ПолучитьЗапросDCM4CHEE(,АдресРесурса,МассивПредстСтруктЗаголовковЗапроса,МассивФильтровАтрибутов);	
	
	Возврат Запрос;
	
КонецФункции

// Получаем количество (на текущий момент) Instances из конкретного Study в DCM4CHEE
//
// Параметры:
//	НастройкиСистемыDICOM - СписокЗначений - Список настроек системы  
//	ПараметрыКоманды  - Структура - Содержит: StudyUID - УИД учения, количество фрагментов которого мы ищем 
//	
Функция ПолучитьКоличествоФрагментовУченияDCM4CHEE(НастройкиСистемыDICOM,ПараметрыКоманды)
	                                                   
	//Параметры задаются через Адрес Ресурса	
	МассивФильтровАтрибутов = Новый Массив;
	МассивФильтровАтрибутов.Добавить(СтрШаблон("%1=%2","StudyInstanceUID",ПараметрыКоманды.StudyUID));
	//МассивФильтровАтрибутов.Добавить(СтрШаблон("%1=%2", "includefield","all")); 
	
	АдресРесурса = СтрШаблон("aets/%1/rs/instances/count", НастройкиСистемыDICOM.НайтиПоЗначению("AETLМенеджера").Представление);
	
	Запрос = ПолучитьЗапросDCM4CHEE(,АдресРесурса,,МассивФильтровАтрибутов);	
	
	Возврат Запрос;
КонецФункции

// Получаем Данные по Ворклистам (используется в основном для проверки наличия ворклистов как таковых)
//
// Параметры:
//	НастройкиСистемыDICOM - СписокЗначений - Список настроек системы  
//	ПараметрыКоманды  - Структура - Содержит: StudyUID - УИД учения, по которому мы проверяем ворклисты 
//
Функция НайтиДанныеMWL(НастройкиСистемыDICOM,ПараметрыКоманды)

	//Стандартные заголовки вызывают ошибку 406 - не тот тип, преобразуем на той стороне массив в структуру, нечётное - заголовок, чётное - значение
	СтруктураЗаголовковЗапроса = Новый Массив;
	СтруктураЗаголовковЗапроса.Добавить("Content-Type"); 
	СтруктураЗаголовковЗапроса.Добавить("application/dicom+json");
		
	МассивФильтровАтрибутов = Новый Массив;
	
	// ----Фильтр
	// filter, {attributeID}={value}; {attributeID} = {dicomTag} | {dicomKeyword} | {dicomTag}.{attributeID} | {dicomKeyword}.{attributeID}
	МассивФильтровАтрибутов.Добавить(СтрШаблон("%1=%2", "StudyInstanceUID",ПараметрыКоманды.StudyUID));
	
	// ---Лимит по количеству
	// limit={maximumResults}
	//МассивФильтровАтрибутов.Добавить(СтрШаблон("%1=%2", "limit","5"));	
	//-----Порядок
	//orderby=[-]{attributeID} (proprietary extension)
	//МассивФильтровАтрибутов.Добавить(СтрШаблон("%1=%2", "orderby","f"));	
	//-----Дополнительно Доступные поля
	//МассивФильтровАтрибутов.Добавить(СтрШаблон("%1=%2", "includefield","all")); 
	
	АдресРесурса = СтрШаблон("aets/%1/rs/mwlitems", НастройкиСистемыDICOM.НайтиПоЗначению("AETLЛистов").Представление); 
	
	Запрос = ПолучитьЗапросDCM4CHEE(,АдресРесурса,,МассивФильтровАтрибутов);	
	 
	Возврат Запрос;

КонецФункции

// Получаем Данные по Ворклистам (используется в основном для проверки наличия ворклистов как таковых)
//
// Параметры:
//	НастройкиСистемыDICOM - СписокЗначений - Список настроек системы  
//	ПараметрыКоманды  - Структура - Содержит: StudyUID - УИД учения, по которому мы проверяем ворклисты 
//
Функция НайтиДанныеStudy(НастройкиСистемыDICOM,ПараметрыКоманды)
	
	//Параметры задаются через Адрес Ресурса	
	МассивФильтровАтрибутов = Новый Массив;
	МассивФильтровАтрибутов.Добавить(СтрШаблон("%1=%2","StudyInstanceUID",ПараметрыКоманды.StudyUID));
	//МассивФильтровАтрибутов.Добавить(СтрШаблон("%1=%2", "includefield","all")); 
	
	АдресРесурса = СтрШаблон("aets/%1/rs/studies", НастройкиСистемыDICOM.НайтиПоЗначению("AETLМенеджера").Представление);
	
	Запрос = ПолучитьЗапросDCM4CHEE(,АдресРесурса,,МассивФильтровАтрибутов);	
	
	Возврат Запрос; 
КонецФункции

// Получаем Данные по Ворклистам (используется в основном для проверки наличия ворклистов как таковых)
//
// Параметры:
//	НастройкиСистемыDICOM - СписокЗначений - Список настроек системы  
//	ПараметрыКоманды  - Структура - Содержит: StudyUID - УИД учения, по которому мы проверяем ворклисты 
//
Функция НайтиДанныеMPPS(НастройкиСистемыDICOM,ПараметрыКоманды)
	
	//Параметры задаются через Адрес Ресурса	
	МассивФильтровАтрибутов = Новый Массив;
	МассивФильтровАтрибутов.Добавить(СтрШаблон("%1=%2","StudyInstanceUID",ПараметрыКоманды.StudyUID));
	
	АдресРесурса = СтрШаблон("aets/%1/rs/mpps", НастройкиСистемыDICOM.НайтиПоЗначению("AETLЛистов").Представление);
	
	Запрос = ПолучитьЗапросDCM4CHEE(,АдресРесурса,,МассивФильтровАтрибутов);	
	
	Возврат Запрос;
КонецФункции

// Помечаем Ворклисты на удаление
//
// Параметры:
//	НастройкиСистемыDICOM - СписокЗначений - Список настроек системы  
//	ПараметрыКоманды  - Структура - Содержит: ScheduledProcedureStepID - УИД шага учения, по которому мы находим на удаление,
//									          StudyUID - УИД учения, по которому мы проверяем ворклисты 
//
Функция ОтменитьWorklist(НастройкиСистемыDICOM,ПараметрыКоманды)
	
	АдресРесурса = СтрШаблон("aets/%1/rs/mwlitems/%2/%3", НастройкиСистемыDICOM.НайтиПоЗначению("AETLЛистов").Представление,
								ПараметрыКоманды.StudyUID,ПараметрыКоманды.ScheduledProcedureStepID); 
		
	Запрос = ПолучитьЗапросDCM4CHEE(,АдресРесурса);	
	
	Возврат Запрос;
	
КонецФункции

// Помечаем Ворклисты на удаление
//
// Параметры:
//	НастройкиСистемыDICOM - СписокЗначений - Список настроек системы  
//	ПараметрыКоманды  - Структура - В данной ситуации сама структура является исходными параметрами для тела запроса
//
Функция ОтправитьДанныеMWL(НастройкиСистемыDICOM,ПараметрыКоманды)
		
	ТелоЗапроса = ПолучитьJSONТелоДляDCM4CHEE(ПараметрыКоманды);

	//Стандартные заголовки вызывают ошибку 406 - не тот тип, преобразуем на той стороне массив в структуру, нечётное - заголовок, чётное - значение
	СтруктураЗаголовковЗапроса = Новый Массив;
	СтруктураЗаголовковЗапроса.Добавить("Content-Type"); 
	СтруктураЗаголовковЗапроса.Добавить("application/dicom+json");
	
	АдресРесурса = СтрШаблон("aets/%1/rs/mwlitems", НастройкиСистемыDICOM.НайтиПоЗначению("AETLЛистов").Представление); 
	
	Запрос = ПолучитьЗапросDCM4CHEE(ТелоЗапроса,АдресРесурса,СтруктураЗаголовковЗапроса);	
	
	Возврат Запрос;
	
КонецФункции 

#КонецОбласти

#Область АдминистрированиеСистемы

// Проверка, которая проверяет доступность получения данных с сервера DCM4CHEE
// Обычно используется, если нужно быть увереными в доступности сервера перед передачей данных с или на сервер
// Истина - доступно передача, Ложь - сервер недоступен. Всегда оповещаем пользователя о проблеме
Функция БыстраяПроверкаПодключенияDCM4CHEE(AETLPACSХост, AETLPACSПорт) Экспорт
	Возврат PingЭлементаDCM4CHEE(, AETLPACSХост, AETLPACSПорт);		
КонецФункции

Процедура ПроверитьПодключениеDCM4CHEE(AETLPACSХост, AETLPACSПорт) Экспорт
	
	Если PingЭлементаDCM4CHEE(Ложь, AETLPACSХост, AETLPACSПорт) Тогда
		СообщениеПользователю = НСтр("ru='DICOM-сервер запущен и успешно работает'");
		Картинка = БиблиотекаКартинок.ОформлениеФлагЗеленый;
	ИначеЕсли PingСоединенияDCM4CHEE(Ложь, AETLPACSХост, AETLPACSПорт) Тогда
		СообщениеПользователю = НСтр("ru='DICOM-сервер недоступен, необходимо перезапустить'");
		Картинка = БиблиотекаКартинок.ОформлениеФлагЖелтый;
	Иначе
		СообщениеПользователю = НСтр("ru='DICOM-сервер не запущен'");
		Картинка = БиблиотекаКартинок.ОформлениеФлагКрасный;	
	КонецЕсли;

	ПоказатьОповещениеПользователя(СообщениеПользователю,,,Картинка);

КонецПроцедуры

// Проверяем, что доступно получение данных с dcm4chee (что сервер работает)
Функция PingЭлементаDCM4CHEE(СообщатьОбОшибке = Истина, AETLХост, AETLПорт)
	// Вызываем любой запрос к AETL dcm4chee, важно, что результат прошёл
	// http://localhost:8080/dcm4chee-arc/aets/DCM4CHEE/rs/patients/count  - более тяжёлое альтернативное решение
	// http://localhost:8080/dcm4chee-arc/modalities 					   - постоянно одно и то же значение
	
	Соединение = DICOMОбщийКлиент.ПолучитьСоединениеDICOM(AETLХост,AETLПорт);
	Если Соединение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = ПолучитьЗапросDCM4CHEE(,"modalities");
	Ответ = DICOMОбщийКлиент.ПолучитьHTTPОтветDICOM(Соединение, Запрос, "GET",СообщатьОбОшибке);
	
	Если (Ответ = Неопределено) Тогда
		// Ошибка доступа, нет интернет-соединения или не развёрнут сервер
		Возврат Ложь;
	ИначеЕсли DICOMОбщийКлиент.КодВозвратаУспех(Ответ.КодСостояния) Тогда
		// УспешныйPing
		Возврат Истина;
	Иначе
		// Ошибка на стороне сервера (запрос дошёл, но возникли проблемы)
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Проверяем, что доступ к dcm4chee доступен как таковой
Функция PingСоединенияDCM4CHEE(СообщатьОбОшибке = Истина, AETLХост, AETLПорт)
		
	// Вызывается запрос host/{host}
	Соединение = DICOMОбщийКлиент.ПолучитьСоединениеDICOM(AETLХост,AETLПорт);
	
	Если Соединение = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = ПолучитьЗапросDCM4CHEE(,"host/localhost");
	Ответ = DICOMОбщийКлиент.ПолучитьHTTPОтветDICOM(Соединение, Запрос, "GET",СообщатьОбОшибке);
	
	Если (Ответ = Неопределено) Тогда
		// Ошибка доступа, нет интернет-соединения или не развёрнут сервер
		Возврат Ложь;
	ИначеЕсли DICOMОбщийКлиент.КодВозвратаУспех(Ответ.КодСостояния) Тогда
		// УспешныйPing
		Возврат Истина;      
	Иначе
		// Ошибка на стороне сервера (запрос дошёл, но возникли проблемы)
		Возврат Ложь;
	КонецЕсли;	

КонецФункции

// Процедура по запуску dcm4chee, Если не получилось с первого раза запустить dcm4chee (при ошибки сервера PSQL)
// мы пытаемся перезапустить сервер автоматически и снова запустить его. Если не получается, информируем пользователя
//
// Параметры:
//  Команда					 -  Команда,Неопределено	 -  Вызов запуска как отдельной команды
//  ИзДругойПроцедурыФункции - 	Булево - Если Истина, то запуск проходит "молча" без никаких проверок
//
Процедура ЗапуститьDCM4CHEE(БезПроверки = Ложь, КаталогПутиБатников, AETLХост, AETLSПорт) Экспорт
	
	// Запуск батника молча
	Если БезПроверки Тогда 
		ЗапуститьПриложение(DICOMОбщийКлиент.ПолучитьКоррекныйПоОСфайл("DCM4CHEEStartWork"),КаталогПутиБатников);
	    Возврат;
	КонецЕсли;	
	
	// Стандартный запуск с проверкой
	Если PingЭлементаDCM4CHEE(Ложь, AETLХост, AETLSПорт) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='DCM4CHEE уже запущен, повторный запуск не требуется'"));	
	Иначе		
		ЗапуститьПриложение(DICOMОбщийКлиент.ПолучитьКоррекныйПоОСфайл("DCM4CHEEStartWork"),КаталогПутиБатников);
	КонецЕсли;	
	 
КонецПроцедуры

// Корректное закрытие dcm4chee через специальный bat-файлы
// проверка вида контекста и также, возможно сделать проверку на доступ (в будущем)
Процедура ЗакрытьDCM4CHEE(КаталогПутиБатников) Экспорт
			
	ЗапуститьПриложение(DICOMОбщийКлиент.ПолучитьКоррекныйПоОСфайл("DCM4CHEEStopWork"),КаталогПутиБатников,Истина); 		
	
КонецПроцедуры

Процедура ПерезагрузитьDCM4CHEE(ИнформироватьПользователя = Истина, КаталогКорневогоПутиSQL, КаталогПутиБатников, AETLХост, AETLSПорт) Экспорт	
	
	// При перезагрузке dcm4chee необходимо насильно перезапустить PostgreSQL
	// Для этого нужно запустить базу с настройками из data, после чего принудительно закрыть кодом
	// Пример:
	// "C:\Program Files\PostgreSQL\16\bin\postgres.exe" -D "C:\Program Files\PostgreSQL\16\data"
	// и потом
	// "C:\Program Files\PostgreSQL\16\bin\pg_ctl.exe" stop -D "C:\Program Files\PostgreSQL\16\data" -m fast
	
	// На всякий случай закрываем нежелательное развертывание WildFly
	ЗакрытьDCM4CHEE(КаталогПутиБатников);
	
	            
	// Прописываем команду в соответствии с ОС. Возможна ошибка на Linux!
	СтрокаКоманды = СтрШаблон("""%1%2bin%2pg_ctl.exe"" stop -D ""%1%2data""",КаталогКорневогоПутиSQL,ПолучитьРазделительПути());
	КомандаСистемы(СтрокаКоманды,КаталогКорневогоПутиSQL);	
	
	СтрокаКоманды = СтрШаблон("""%1%2bin%2postgres.exe"" -D ""%1%2data"" -m fast",КаталогКорневогоПутиSQL,ПолучитьРазделительПути());
	КомандаСистемы(СтрокаКоманды,КаталогКорневогоПутиSQL);
		
	ЗапуститьDCM4CHEE(Истина, КаталогПутиБатников, AETLХост, AETLSПорт);
	Если ИнформироватьПользователя Тогда
		ПоказатьОповещениеПользователя(НСтр("ru='Перезапуск базы DICOM проведён, подождите 5-10 секунд перед проверкой подключения'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеЗапроса

// Получение подходящего для обработки dcm4chee PayLoad (или тела запроса)
//
// Параметры:
//  ДанныеНаЗаполнение  - Структура - Структура уже собранных данных для заполнения, двухуровневая.
//					Первый уровень содержит одну строку-заполняемый тег, внутри находятся структуры,
//					отражающее заполняемые данные. Первый уровень обязательно называется в честь своего тега, имея один лишний символ слева
//					на втором уровне обязательно должны быть ключи ValueN (где N - порядковый номер из всех передаваемых ключей)
//					содержащий заполняемое значение, VR - со значением  vr кода
//					К примеру, а00100010 имеет ЗначValue - "Lyagushka Krabik Krabushka" Визуализация - "PN" 
//
// Возвращаемое значение:
//  Строка - сформированный JSON тело строкой для запроса (PayLoad)
//
Функция ПолучитьJSONТелоДляDCM4CHEE(ДанныеНаЗаполнение)
	
	// стандартный пример: {""00100020"":{""Value"":[""d55c35cd-9277-11ee-950f-08979885f491""],""vr"":""LO""},...} 
	// MWL имеет несколько уровней {""00400011"":{""Value"":[{стандартный пример}],""vr"":""LO""},...}
	// Открытие самого тела
	СтрокаPayLoad = "{";
	
	Для Каждого ПервыйУровеньЗаполнения Из ДанныеНаЗаполнение Цикл
		
		ПромежуточныйКлюч = СокрЛП(Сред(ПервыйУровеньЗаполнения.Ключ,2));
		ЗначенияВторогоУровня = ПервыйУровеньЗаполнения.Значение;
		
		//Значений Value может быть много, Значение 
		СтрокаМассивЭлемValue = """Value"":["; // открытая строка
		ДанныеVar = """vr"":""%1"""; //
		//""<Тег>"":{
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаPayLoad,ПромежуточныйКлюч,"""");
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаPayLoad,""":{","");
		
		// Получение данных на заполнение, Визуализация и ЗначValue (либо строка, либо массив)
		// В качестве значения у SQ выступает отдельное тело, тогда любой элемент будет внутри структура
		
		// Даже если нет значения, то у всех тегов всегда есть Визуализация
		Если ПервыйУровеньЗаполнения.Значение.Свойство("Визуализация") Тогда	
			// Это стандартный тег. У стандартного тега нн-ое количество Value, и один vr
			Для Каждого ВторойУровень Из ЗначенияВторогоУровня Цикл
				
				ПромежуточныйКлюч = ВторойУровень.Ключ;
				// всё из массива Value имеет в ключе "Знач"
				Если СтрНайти(ПромежуточныйКлюч,"ЗначValue") > 0 Тогда
					ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаМассивЭлемValue,"""","");
					ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаМассивЭлемValue,""",",ВторойУровень.Значение);		
				ИначеЕсли ПромежуточныйКлюч = "Визуализация" Тогда	
					ДанныеVar = СтрШаблон(ДанныеVar, ВторойУровень.Значение);					
				КонецЕсли;				
			КонецЦикла;
			
			// У последнего элемента необходимо убрать запятую, после чего заолняем значение Value для PayLoad
			СтрокаМассивЭлемValue = Лев(СтрокаМассивЭлемValue,СтрДлина(СтрокаМассивЭлемValue) - 1);
		Иначе
			// Это тег с телом из тегов от 1 до н, его надо оформить, а тег всегда SQ
			
			//  tag:{ - входное Payload, надо по каждому элементу будет тег и его тело из значения и визуализации
			// "Value"[<вскрытие второго уровня>],"vr":"SQ"} - что должно быть внутри тега первого уровня
			
			// однозначное начало подтегов - всех 
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаМассивЭлемValue,"{","");
			
			// Проходимся по каждому тегу, который был указан как пасынок тега первого уровня				
			Для Каждого ВторойУровень Из ЗначенияВторогоУровня Цикл
				
				// Тег дочернего элемента, заодно открываем массив значений
				ПромежуточныйКлюч = СокрЛП(Сред(ВторойУровень.Ключ,2));
				ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаМассивЭлемValue,ПромежуточныйКлюч,"""");
				ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаМассивЭлемValue,""":{""Value"":[","");
				
				// Внутренности тега
				Для Каждого ДанныеВнутрТега Из ВторойУровень.Значение Цикл
					
					ПромежуточныйКлюч = ДанныеВнутрТега.Ключ;
					
					Если СтрНайти(ПромежуточныйКлюч,"ЗначValue") > 0 Тогда
						ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаМассивЭлемValue,"""","");
						ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаМассивЭлемValue,""",",ДанныеВнутрТега.Значение);		
					ИначеЕсли ПромежуточныйКлюч = "Визуализация" Тогда	
						ДопДанныеVar = СтрШаблон(ДанныеVar, ДанныеВнутрТега.Значение);					
					КонецЕсли;	
					
				КонецЦикла;
				
				// данные подстроки в СтрокаМассивЭлемValue имеют под конец лишнюю , 
				// Обрезаем, закрываем, добавляем тег, закрываем, добавляем запятую и продолжаем
				СтрокаМассивЭлемValue = Лев(СтрокаМассивЭлемValue,СтрДлина(СтрокаМассивЭлемValue) - 1);
				ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаМассивЭлемValue,"],","");
				ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаМассивЭлемValue,"},",ДопДанныеVar);
				
				// Один подтег сделан, готово к новому
			КонецЦикла;
			
			// В конце всех подтегов отрезаем хвост - запятую на конец тегов
			СтрокаМассивЭлемValue = Лев(СтрокаМассивЭлемValue,СтрДлина(СтрокаМассивЭлемValue) - 1);
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаМассивЭлемValue,"}","");
			ДанныеVar = СтрШаблон(ДанныеVar,"SQ");
			
		КонецЕсли; 
		
		// Закрываем тег  Value для тега первого уровня
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаPayLoad,"],",СтрокаМассивЭлемValue);			
		// Заполняем тег визуализации
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаPayLoad,"},",ДанныеVar);
		
	КонецЦикла;
	
	// Удаляем последнюю запятую из перечисления параметров заполнения
	СтрокаPayLoad = Лев(СтрокаPayLoad,СтрДлина(СтрокаPayLoad) - 1);
	// Закрытие самого тела
	ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаPayLoad,"}","");
	
	Возврат СтрокаPayLoad;
	
КонецФункции

// Функция - Получить запрос DCM4CHEE,
//
// Параметры:
//  ТелоЗапроса	 - JSON структура - тело запроса, приведённое из структуры в JSON формат при помощи  "СформироватьЗаписьJSON"
//  АдресЗапроса - Строка - Адрес. Значение на английском
//  ДопЗаголовки - Массив - Массив Ключей-значений заголовков запроса. Значение на английском, чётные - ключи, нечётные - значение 
//	ПараметрыЗапроса - Массив - массив элементов параметра запросов, к примеру, фильтров, изменяет АдресЗапроса
// 
// Возвращаемое значение: HTTPЗапрос
//
Функция ПолучитьЗапросDCM4CHEE(ТелоЗапроса = Неопределено, АдресЗапроса, ДопЗаголовки = Неопределено, ПараметрыЗапроса = Неопределено) Экспорт		
	
	Запрос = Новый HTTPЗапрос;
	
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	Запрос.Заголовки.Вставить("charset", "utf-8");	
	Если ДопЗаголовки <> Неопределено Тогда	
		
		// !Подумать об этом позже!  
		ИндексМассива = 1;
		Пока ИндексМассива < ДопЗаголовки.Количество() Цикл
			
			Запрос.Заголовки.Вставить(ДопЗаголовки[ИндексМассива - 1], ДопЗаголовки[ИндексМассива]);
			ИндексМассива = ИндексМассива + 2;
			
		КонецЦикла;
	КонецЕсли;
	
	// <адрес>?Param1=Value1&Param2=Value2
	Если ПараметрыЗапроса <> Неопределено Тогда 
		
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(АдресЗапроса,ПараметрыЗапроса[0],"?");
		
		Если ПараметрыЗапроса.Количество() > 1 Тогда
			ИндексТекЭлемМассива = 1;
			Пока ИндексТекЭлемМассива < (ПараметрыЗапроса.Количество()) Цикл
				ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(АдресЗапроса,ПараметрыЗапроса[ИндексТекЭлемМассива],"&");
				ИндексТекЭлемМассива = ИндексТекЭлемМассива + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Для Адреса Всегда прописывается dcm4chee-arc. !! При необходимости дополнить получение параметров для АдресЗапроса
	Запрос.АдресРесурса = СтрШаблон("/dcm4chee-arc/%1", АдресЗапроса);
	
	// Некоторые запросы не имеют тело
	Если ТелоЗапроса <> Неопределено Тогда		
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);		
	КонецЕсли;
	
	Возврат Запрос
КонецФункции

Функция ПолучитьДоступКРегиструУчений() Экспорт

	Возврат DICOMОбщий.РегистрDICOMДанныеУчений_Доступен(Истина);

КонецФункции
	
#КонецОбласти