#Область ПрограммныйИнтерфейс

// Получить текст макета справочника
//
// Параметры:
//  ВидДокумента - СправочникСсылка.ВидыМедицинскихДокументов - вид медицинского документа
// 
// Возвращаемое значение:
//  Строка - Текст макета
//
Функция ПолучитьМакетСправочникаПоВидуДокумента(ВидДокумента) Экспорт
	
	МакетСправочникаПоOid = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ПолучитьМакетСправочникаПоOid(ВидДокумента.OIDКлассификатораМинздрава);
	
	Если ЗначениеЗаполнено(МакетСправочникаПоOid) Тогда
		ВырезатьЛишниеЭлементы(МакетСправочникаПоOid);
	КонецЕсли;
	
	Возврат МакетСправочникаПоOid;
	
КонецФункции

Процедура ВырезатьЛишниеЭлементы(МакетСправочникаПоOid)
	
	Документ = ПолучитьXML(МакетСправочникаПоOid);
	ЛишниеЭлементы = РаботаСDOMКлиентСервер.ПолучитьЭлементыПоИмени(Документ, "bitOther", Истина);
	Для Каждого ЛишнийЭлемент Из ЛишниеЭлементы Цикл
		ЛишнийЭлемент.РодительскийУзел.УдалитьДочерний(ЛишнийЭлемент);
	КонецЦикла;
	
	МакетСправочникаПоOid = РаботаСDOMКлиентСервер.СтрокаXMLИзDOM(Документ);
	
КонецПроцедуры

Функция СписокLocalidМакета(МакетXML, ТаблицаПараметров = Неопределено, ИсключитьНеотображаемые = Ложь) Экспорт
	
	Документ = ПолучитьXML(МакетXML);
	СписокLocalid = Новый Соответствие();
	РекурсивныйОбходXMLДляLocalid(Документ, СписокLocalid, ТаблицаПараметров);
	
	СтруктурыLocalid = Новый Массив;
	ИндексыУдаленных = Новый СписокЗначений;
	
	Для Каждого СтрокаLocalid Из СписокLocalid Цикл
		СтрокаLocalid = СтрокаLocalid.Значение;
		
		Если ИсключитьНеотображаемые
			И (СтрокаLocalid.НеОтображатьВШаблоне
				Или Не (СтрокаLocalid.Свойство("ТипДанных")
					Или СтрокаLocalid.Свойство("Классификатор")))
		Тогда
			Если СтрокаLocalid.Свойство("Индекс")
				И ЗначениеЗаполнено(СтрокаLocalid.Индекс)
			Тогда
				ИндексыУдаленных.Добавить(СтрокаLocalid.Индекс);
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		СтрокаLocalid.Вставить("Обязательное", Не СтрокаLocalid.Свойство("Обязательное") Или СтрокаLocalid.Обязательное);
		СтрокаLocalid.Вставить("Множественное", СтрокаLocalid.Свойство("Множественное") И СтрокаLocalid.Множественное);
		СтруктурыLocalid.Добавить(СтрокаLocalid);
	КонецЦикла;
	
	ИндексыУдаленных.СортироватьПоЗначению(НаправлениеСортировки.Убыв);
	
	Для Каждого ИндексУдаленногоLocalid Из ИндексыУдаленных Цикл
		Для Каждого СтруктураLocalid Из СтруктурыLocalid Цикл
			Если СтруктураLocalid.Свойство("Индекс") И СтруктураLocalid.Индекс > ИндексУдаленногоLocalid.Значение Тогда
				СтруктураLocalid.Индекс = СтруктураLocalid.Индекс -1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	СписокРезультат = Новый Соответствие;
	Для Каждого СтруктураLocalid Из СтруктурыLocalid Цикл
		СписокРезультат.Вставить(СтруктураLocalid.localid, СтруктураLocalid);
	КонецЦикла;
	
	Возврат СписокРезультат;
	
КонецФункции

// Возвращает список localid с параметрами по виду документа
//
// Параметры:
//  ВидДокумента - СправочникСсылка.РегистрируемыеЭлектронныеМедДокументы - Вид РЭМДа
// 
// Возвращаемое значение:
//  Массив - массив структур localid
//
Функция МассивLocalidДокумента(ВидДокумента, ВернутьСоответствие = Ложь, ТаблицаПараметров = Неопределено) Экспорт
	
	СоответствиеLocalid = Новый Соответствие;
	
	МакетXML = ПолучитьМакетСправочникаПоВидуДокумента(ВидДокумента);
	Если ЗначениеЗаполнено(МакетXML) Тогда
		СоответствиеLocalid = СписокLocalidМакета(МакетXML, ТаблицаПараметров, Истина);
	КонецЕсли;
	
	Если ВернутьСоответствие Тогда
		Возврат СоответствиеLocalid;
	КонецЕсли;
	
	ЗначенияLocalid = Новый Массив;
	Для Каждого КлючЗначение Из СоответствиеLocalid Цикл
		ЗначенияLocalid.Добавить(КлючЗначение.Значение);
	КонецЦикла;
	
	Возврат ЗначенияLocalid;
	
КонецФункции

// Возвращает список сотрудников с результатами проверки выполнения условия для подписания сэмд документов.
// 
// Возвращаемое значение:
//  Массив Из Структура - Список из сотрудников и результат выполнения условия для подписания сэмд.
//
Функция СписокСотрудниковИКорректностиЗаполненияДляПодписанияСЭМД() Экспорт
	
	Результат = Новый Массив;
	ВыборкаСотрудников = Справочники.Сотрудники.Выбрать();
	КэшПользователиПоФизЛицу = Новый Соответствие;
	Пока ВыборкаСотрудников.Следующий() Цикл
		Если ВыборкаСотрудников.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		// Проверка должности
		ДолжностьУчаствуетВПодписании = Ложь;
		
		ДолжностиМЗ = ИнтеграцияЕГИСЗВызовСервера.ДолжностиМЗ(ВыборкаСотрудников.Ссылка);
		
		Для Каждого ДолжностьМЗ Из ДолжностиМЗ Цикл
			Если ДолжностьУчаствуетВПодписании(ДолжностьМЗ) Тогда
				ДолжностьУчаствуетВПодписании = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ДолжностьУчаствуетВПодписании Тогда
			Продолжить;
		КонецЕсли;
		
		// Общая проверка
		ЗаполненСНИЛС = ЗначениеЗаполнено(ВыборкаСотрудников.СНИЛС);
		ЗаполненоФИО = ЗначениеЗаполнено(ВыборкаСотрудников.Фамилия)
						И ЗначениеЗаполнено(ВыборкаСотрудников.Имя)
						И ЗначениеЗаполнено(ВыборкаСотрудников.Отчество);
		ЗаполненаДатаРождения = ЗначениеЗаполнено(ВыборкаСотрудников.ДатаРождения);
		ЗаполненоПодразделение = ЗначениеЗаполнено(ВыборкаСотрудников.Подразделение.ПодразделениеМинздрава);
		УказанаСпециализация = ВыборкаСотрудников.СпециализацииФРМР.Количество() > 0;
		
		// Проверка сертификата
		ВыборкаСертификатов = Справочники.СертификатыКлючейЭлектроннойПодписиИШифрования.Выбрать();
		ЕстьСертификат = Ложь;
		СертификатНеПросрочен = Ложь;
		
		Пока ВыборкаСертификатов.Следующий() Цикл
			Если Не ВыборкаСертификатов.ПометкаУдаления Тогда
				СотрудникиПользователя = КэшПользователиПоФизЛицу.Получить(ВыборкаСертификатов.Пользователь);
				Если СотрудникиПользователя = Неопределено Тогда
					СотрудникиПользователя = ОтраслевыеДополнения.СотрудникиПользователя(ВыборкаСертификатов.Пользователь);
					КэшПользователиПоФизЛицу.Вставить(ВыборкаСертификатов.Пользователь, СотрудникиПользователя);
				КонецЕсли;
				
				Если СотрудникиПользователя.Найти(ВыборкаСотрудников.Ссылка) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ЕстьСертификат = Истина;
				СертификатНеПросрочен = ЕстьСертификат И ВыборкаСертификатов.ДействителенДо > ТекущаяДата();
				Если СертификатНеПросрочен Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Заполнение структуры
		СтруктураКорректностиСотрудника = Новый Структура;
		СтруктураКорректностиСотрудника.Вставить("ЗаполненСНИЛС",			ЗаполненСНИЛС);
		СтруктураКорректностиСотрудника.Вставить("ЗаполненоФИО",			ЗаполненоФИО);
		СтруктураКорректностиСотрудника.Вставить("ЕстьСертификат",			ЕстьСертификат);
		СтруктураКорректностиСотрудника.Вставить("СертификатНеПросрочен",	СертификатНеПросрочен);
		СтруктураКорректностиСотрудника.Вставить("ЗаполненаДатаРождения",	ЗаполненаДатаРождения);
		СтруктураКорректностиСотрудника.Вставить("ЗаполненоПодразделение",	ЗаполненоПодразделение);
		СтруктураКорректностиСотрудника.Вставить("УказанаСпециализация",	УказанаСпециализация);
		
		ВсеКорректно = Истина;
		Для Каждого УсловиеКорректностиВыполнено Из СтруктураКорректностиСотрудника Цикл
			Если Не УсловиеКорректностиВыполнено.Значение Тогда
				ВсеКорректно = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		СтруктураКорректностиСотрудника.Вставить("Сотрудник",	 ВыборкаСотрудников.Ссылка);
		СтруктураКорректностиСотрудника.Вставить("ВсеКорректно", ВсеКорректно);
		Результат.Добавить(СтруктураКорректностиСотрудника);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьXMLПоСсылкеМД(Ссылка, СвойстваЭМД, СотрудникУстановившийПодпись, ДолжностьМЗ, НаименованиеШаблона, ТекстОшибки, ДополнительныеПараметры) Экспорт
	
	МакетXML = ПолучитьМакетСправочникаПоВидуДокумента(СвойстваЭМД.ВидРЭМД);
	
	Если Не ЗначениеЗаполнено(МакетXML) Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru='Для шаблона ""%1"" выбран вид регистрируемого электронного документа ""%2"", не поддерживаемый программой!'"), НаименованиеШаблона, СвойстваЭМД.ВидРЭМД.Наименование);
		Возврат Неопределено;
	КонецЕсли;
	
	НезагруженныеКлассификаторы = Новый Массив;
	
	ДанныеПоШаблону = ПолучитьДанныеПоШаблону(Ссылка, СвойстваЭМД, ДополнительныеПараметры);
	ДанныеМакета = ДанныеМакетаПоВидуДокумента(СвойстваЭМД.ИдентификаторРЭМД);
	
	Если ДанныеМакета = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru='Документ вида ""%1"" не поддерживается'"), СвойстваЭМД.ИдентификаторРЭМД);
		Возврат Неопределено;
	КонецЕсли;
	
	ДополнитьТаблицуПараметров(ДанныеПоШаблону.ТаблицаПараметров, СотрудникУстановившийПодпись, "СотрудникУстановившийПодпись");
	ДополнитьТаблицуПараметров(ДанныеПоШаблону.ТаблицаПараметров, ДолжностьМЗ, "ДолжностьМЗСотрудникаУстановившегоПодпись");
	ДополнитьТаблицуПараметровДляОбщихСекций(Ссылка, ДанныеПоШаблону.ТаблицаПараметров, СвойстваЭМД, ДанныеМакета.Формат);
	
	ДополнительныеДанные = ДополнительныеДанныеДляФормированияСЭМД(СвойстваЭМД.ИдентификаторРЭМД);
	ИндивидуальныеСекции = СформироватьИндивидуальныеСекции(ДанныеПоШаблону.ТаблицаПараметров, МакетXML, ДанныеПоШаблону.ДокументHTML, НезагруженныеКлассификаторы, ДополнительныеДанные);
	
	ОбщиеСекции = СформироватьОбщиеСекции(СвойстваЭМД, Ссылка, ДанныеПоШаблону.ТаблицаПараметров, ДанныеМакета.Макет, НезагруженныеКлассификаторы, ДополнительныеДанные);
	
	Если НезагруженныеКлассификаторы.Количество() > 0 Тогда
		ТекстОшибки = НСтр("ru='Требуется загрузить недостающие классификаторы'");
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбъединитьСекции(ОбщиеСекции, ИндивидуальныеСекции);
	
КонецФункции

Функция ПолучитьТаблицуПараметров(Ссылка, ИмяТипаДокумента, ДополнительныеПараметры) Экспорт
	
	// Параметры приема по шаблону
	ТаблицаПараметров = Новый ТаблицаЗначений;
	ТаблицаПараметров.Колонки.Добавить("Параметр");
	ТаблицаПараметров.Колонки.Добавить("Значение");
	ТаблицаПараметров.Колонки.Добавить("localid");
	ТаблицаПараметров.Колонки.Добавить("КлассификацияПоля");
	ТаблицаПараметров.Колонки.Добавить("ИдентификаторСтрокиШаблона");
	ТаблицаПараметров.Колонки.Добавить("ТаблицаШаблонов");
	ТаблицаПараметров.Колонки.Добавить("НомерСтрокиТаблицы");
	ТаблицаПараметров.Колонки.Добавить("ГруппирующееПоле");
	ТаблицаПараметров.Колонки.Добавить("ОбъединяющееПоле");
	ТаблицаПараметров.Колонки.Добавить("НаименованиеДляВрачаВОбъединяющемПоле");
	ТаблицаПараметров.Колонки.Добавить("ИдентификаторСтроки");
	ТаблицаПараметров.Колонки.Добавить("ИдентификаторРодительскойСтроки");
	ТаблицаПараметров.Колонки.Добавить("АвтозаполнениеИзДанныхДокумента", Новый ОписаниеТипов("Булево"));
	
	КонстантыCDAДокумента	= Новый ТаблицаЗначений;
	СоответствияПараметрам	= Новый ТаблицаЗначений;
	
	Если ИмяТипаДокумента = "Документ.Прием" Тогда
		ЗаполнитьТаблицуПараметровПоПриему(ТаблицаПараметров, Ссылка, КонстантыCDAДокумента, СоответствияПараметрам, ДополнительныеПараметры);
	ИначеЕсли ИмяТипаДокумента = "Документ.ПрохождениеМедосмотра" Тогда
		ЗаполнитьТаблицуПараметровПоПМО(ТаблицаПараметров, Ссылка, КонстантыCDAДокумента, СоответствияПараметрам, ДополнительныеПараметры);
	ИначеЕсли ИмяТипаДокумента = "Документ.ВрачебнаяКомиссия" Тогда // Версия КОРП
		ЗаполнитьТаблицуПараметровПоВК(ТаблицаПараметров, Ссылка, СоответствияПараметрам);
	ИначеЕсли ИмяТипаДокумента = "Документ.Рецепт" Тогда
		ЗаполнитьТаблицуПараметровПоРецепту(ТаблицаПараметров, Ссылка, СоответствияПараметрам);
	КонецЕсли;
	
	ПараметрыКлассификации = ТаблицаПараметров.СкопироватьКолонки();
	СтрокиКУдалению = Новый Массив;
	
	Если СоответствияПараметрам.Количество() > 0 Тогда
		// Добавление localid
		Для Каждого ПараметрШаблона Из СоответствияПараметрам Цикл
			Для Каждого Строка Из ТаблицаПараметров.НайтиСтроки(Новый Структура("Параметр", ПараметрШаблона.Параметр)) Цикл
				Строка.localid									= ПараметрШаблона.localid;
				Строка.КлассификацияПоля						= ПараметрШаблона.КлассификацияПоля;
				Строка.ГруппирующееПоле	 						= ПараметрШаблона.ГруппирующееПоле;
				Строка.ОбъединяющееПоле	 						= ПараметрШаблона.ОбъединяющееПоле;
				Строка.НаименованиеДляВрачаВОбъединяющемПоле	= ПараметрШаблона.НаименованиеДляВрачаВОбъединяющемПоле;
				
				ЧастиLocalid = СтрРазделить(ПараметрШаблона.localid, ".");
				Если ЧастиLocalid.Количество() > 1
					И ЧастиLocalid[1] = "КлассификацияПоля"
				Тогда
					ЗаполнитьЗначенияСвойств(ПараметрыКлассификации.Добавить(), Строка);
					СтрокиКУдалению.Добавить(Строка);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Если КонстантыCDAДокумента.Количество() > 0 Тогда
		// Константы
		ИндексыКонстант = Новый Соответствие;
		Для Каждого КонстантаШаблона Из КонстантыCDAДокумента Цикл
			НовыйПараметр = ТаблицаПараметров.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйПараметр, КонстантаШаблона);
			ИндексыКонстант.Вставить(КонстантыCDAДокумента.Индекс(КонстантаШаблона), ТаблицаПараметров.Индекс(НовыйПараметр));
		КонецЦикла;
		
		// Группирующие поля констант
		Для Каждого СтрокаПараметраКлассификации Из ТаблицаПараметров Цикл
			Если ТипЗнч(СтрокаПараметраКлассификации.ГруппирующееПоле) = Тип("Число")
				И Не СтрокаПараметраКлассификации.АвтозаполнениеИзДанныхДокумента
			Тогда
				СтрокаПараметраКлассификации.ГруппирующееПоле = ИндексыКонстант.Получить(СтрокаПараметраКлассификации.ГруппирующееПоле);
			КонецЕсли;
			
			Если ТипЗнч(СтрокаПараметраКлассификации.ОбъединяющееПоле) = Тип("Число")
				И Не СтрокаПараметраКлассификации.АвтозаполнениеИзДанныхДокумента
			Тогда
				СтрокаПараметраКлассификации.ОбъединяющееПоле = ИндексыКонстант.Получить(СтрокаПараметраКлассификации.ОбъединяющееПоле);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаПараметраКлассификации Из ПараметрыКлассификации Цикл
			Если ТипЗнч(СтрокаПараметраКлассификации.ГруппирующееПоле) = Тип("Число")
				И Не СтрокаПараметраКлассификации.АвтозаполнениеИзДанныхДокумента
			Тогда
				СтрокаПараметраКлассификации.ГруппирующееПоле = ИндексыКонстант.Получить(СтрокаПараметраКлассификации.ГруппирующееПоле);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если СтрокиКУдалению.Количество() > 0 Тогда
		// Удаление и сдвиг группирующих полей констант (↓) производить после заполнения констант (↑)
		
		СтрокиСИндексамиГруппировки = Новый Соответствие;
		Для Каждого СтрокаТаблицыПараметров Из ТаблицаПараметров Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицыПараметров.ГруппирующееПоле)
				И ТипЗнч(СтрокаТаблицыПараметров.ГруппирующееПоле) = Тип("Число")
			Тогда
				СтрокиСИндексамиГруппировки.Вставить(СтрокаТаблицыПараметров, ТаблицаПараметров[СтрокаТаблицыПараметров.ГруппирующееПоле]);
			КонецЕсли;
		КонецЦикла;
			
		Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			ТаблицаПараметров.Удалить(СтрокаКУдалению);
		КонецЦикла;
		
		Для Каждого КлючЗначение Из СтрокиСИндексамиГруппировки Цикл
			
			Если ТаблицаПараметров.Индекс(КлючЗначение.Ключ) = -1 Тогда
				Продолжить;
			КонецЕсли;
			
			НовыйИндекс = ТаблицаПараметров.Индекс(КлючЗначение.Значение);
			Если НовыйИндекс = -1 Тогда
				КлючЗначение.Ключ.ГруппирующееПоле = Неопределено;
			Иначе
				КлючЗначение.Ключ.ГруппирующееПоле = НовыйИндекс;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого СтрокаПараметраКлассификации Из ПараметрыКлассификации Цикл
		Если ТипЗнч(СтрокаПараметраКлассификации.ГруппирующееПоле) = Тип("Число") Тогда
			СтрокаПараметра = ТаблицаПараметров[СтрокаПараметраКлассификации.ГруппирующееПоле];
			СтрокаПараметра.КлассификацияПоля = СтрокаПараметраКлассификации.Значение;
		Иначе
			
			СтруктураСтрокиПараметра = Новый Структура("Параметр, ИдентификаторСтрокиШаблона, ТаблицаШаблонов, НомерСтрокиТаблицы");
			ЗаполнитьЗначенияСвойств(СтруктураСтрокиПараметра, СтрокаПараметраКлассификации, "ИдентификаторСтрокиШаблона, ТаблицаШаблонов, НомерСтрокиТаблицы");
			СтруктураСтрокиПараметра.Параметр = СтрокаПараметраКлассификации.ГруппирующееПоле;
			СтрокиПараметра = ТаблицаПараметров.НайтиСтроки(СтруктураСтрокиПараметра);
			Если СтрокиПараметра.Количество() > 0 Тогда
				СтрокиПараметра[0].КлассификацияПоля = СтрокаПараметраКлассификации.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ПредставлениеДатыДокумента = ИнтеграцияЕГИСЗСервер.ПредставлениеЛокальнойДатыСоСмещением(Ссылка.Дата, "ДФ=ггггММддЧЧмм");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Дата, "ДатаДокументаБезСмещения");
	
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ПредставлениеДатыДокумента, "ДатаДокумента");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ПредставлениеДатыДокумента, "ДатаДокументаДляОбщихСекций");
	
	Возврат ТаблицаПараметров;
	
КонецФункции

Функция ПолучитьНезаполненныеОбязательныеПараметры(Ссылка, СотрудникУстановившийПодпись, НезагруженныеКлассификаторы, НекритичныеПроблемы, ДолжностьМЗ, ДополнительныеПараметры) Экспорт
	
	ОшибкиВалидации = Новый ТаблицаЗначений;
	ОшибкиВалидации.Колонки.Добавить("Текст");
	ОшибкиВалидации.Колонки.Добавить("Правило");
	ОшибкиВалидации.Колонки.Добавить("Расположение");
	
	СтруктураНезаполненныхОбязательныхПараметров = Новый Структура("ПараметрыОбщихСекций, ПараметрыСекцийТела, ОшибкиСхематрона", Новый Массив, Новый Массив, ОшибкиВалидации);
	
	СвойстваЭМД = ИнтеграцияЕГИСЗ_РЭМД.СформироватьСвойстваЭМД(Ссылка, ДополнительныеПараметры);
	
	Если Не ЗначениеЗаполнено(СвойстваЭМД.ВидРЭМД) // Не РЭМДовский шаблон
		Или ИнтеграцияЕГИСЗСервер.ПолучитьЗначениеАтрибутаЭлементаКлассификатора(СвойстваЭМД.ВидРЭМД, "FORMAT") = "1" // pdf
	Тогда
		Возврат СтруктураНезаполненныхОбязательныхПараметров;
	КонецЕсли;
	
	ДополнительныеДанные = ДополнительныеДанныеДляФормированияСЭМД(СвойстваЭМД.ИдентификаторРЭМД);
	
	ДанныеПоШаблону = ПолучитьДанныеПоШаблону(Ссылка, СвойстваЭМД, ДополнительныеПараметры);
	ДополнитьТаблицуПараметров(ДанныеПоШаблону.ТаблицаПараметров, СотрудникУстановившийПодпись, "СотрудникУстановившийПодпись");
	ДополнитьТаблицуПараметров(ДанныеПоШаблону.ТаблицаПараметров, ДолжностьМЗ, "ДолжностьМЗСотрудникаУстановившегоПодпись");
	
	// Общие секции
	ДанныеМакета = ДанныеМакетаПоВидуДокумента(СвойстваЭМД.ИдентификаторРЭМД);
	
	Если ДанныеМакета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru='Документ вида ""%1"" не поддерживается'"), СвойстваЭМД.ИдентификаторРЭМД));
		Возврат СтруктураНезаполненныхОбязательныхПараметров;
	КонецЕсли;
	
	Документ = ПолучитьXML(ДанныеМакета.Макет);
	
	ДополнитьТаблицуПараметровДляОбщихСекций(Ссылка, ДанныеПоШаблону.ТаблицаПараметров, СвойстваЭМД, ДанныеМакета.Формат);
	РекурсивныйОбходXMLОбщихСекций(Документ.ЭлементДокумента, ДанныеПоШаблону.ТаблицаПараметров, Новый Массив, Новый Соответствие,
									НезагруженныеКлассификаторы, ДополнительныеДанные, СтруктураНезаполненныхОбязательныхПараметров.ПараметрыОбщихСекций);
	
	// Секции тела
	МакетСправочника = ПолучитьМакетСправочникаПоВидуДокумента(СвойстваЭМД.ВидРЭМД);
	Документ = ПолучитьXML(МакетСправочника);
	НезаполненныеТекстовыеСекции = Новый Массив;
	
	СписокLocalid = СписокLocalidМакета(МакетСправочника);
	СписокLocalid.Вставить("Сотрудник", Новый Структура("localid", "Сотрудник"));
	
	УзлыДляУдаления = Новый Массив;
	РекурсивныйОбходXML(Документ.ЭлементДокумента, ДанныеПоШаблону.ТаблицаПараметров, УзлыДляУдаления, Новый Соответствие, ДанныеПоШаблону.ДокументHTML, СписокLocalid, Новый Массив,
						НезагруженныеКлассификаторы, ДополнительныеДанные, СтруктураНезаполненныхОбязательныхПараметров.ПараметрыСекцийТела, , НезаполненныеТекстовыеСекции);
	
	Для Индекс = -НезаполненныеТекстовыеСекции.ВГраница() По 0 Цикл
		УзлыСекции = РаботаСDOMКлиентСервер.ПолучитьЭлементыПоИмениУзлаИАтрибуту(Документ, "code", "code", НезаполненныеТекстовыеСекции[-Индекс]);
		
		ЕстьУзел = Ложь;
		Для Каждого УзелСекции Из УзлыСекции Цикл
			УзелУдалён = Ложь;
			ПроверяемыйУзел = УзелСекции;
			Пока ПроверяемыйУзел <> ПроверяемыйУзел.ДокументВладелец Цикл
				Если УзлыДляУдаления.Найти(ПроверяемыйУзел) <> Неопределено Тогда
					УзелУдалён = Истина;
					Прервать;
				КонецЕсли;
				ПроверяемыйУзел = ПроверяемыйУзел.РодительскийУзел;
			КонецЦикла;
			Если Не УзелУдалён Тогда
				ЕстьУзел = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не ЕстьУзел Тогда
			НезаполненныеТекстовыеСекции.Удалить(-Индекс);
		КонецЕсли;
	КонецЦикла;
	
	// Для проверки в отладке
	//СформироватьИндивидуальныеСекции(ДанныеПоШаблону.ТаблицаПараметров, МакетСправочника, Неопределено, НезагруженныеКлассификаторы, ДополнительныеДанные);
	//ПолучитьXMLПоСсылкеМД(Ссылка, СвойстваЭМД, СотрудникУстановившийПодпись, ДолжностьМЗ, СвойстваЭМД.ЗаголовокЭМД, "", ДополнительныеПараметры);
	
	ТребуетсяПроверкаСхематроном = Истина;
	Для Каждого НезаполненныеОбязательныеПараметры Из СтруктураНезаполненныхОбязательныхПараметров Цикл
		Если НезаполненныеОбязательныеПараметры.Значение.Количество() > 0 Тогда
			ТребуетсяПроверкаСхематроном = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если ТребуетсяПроверкаСхематроном И ЗначениеЗаполнено(СвойстваЭМД.ВидРЭМД.Схематрон) Тогда
		ЗаполнитьОшибкиВалидацииПоСхематрону(СвойстваЭМД.ВидРЭМД.Схематрон, СтруктураНезаполненныхОбязательныхПараметров.ОшибкиСхематрона,
											 Ссылка, СотрудникУстановившийПодпись, ДолжностьМЗ, СвойстваЭМД.ВидРЭМД, ДополнительныеПараметры);
	КонецЕсли;
	
	Если НезаполненныеТекстовыеСекции.Количество() > 0 Тогда
		НекритичныеПроблемы.Вставить(НСтр("ru='Отсутствуют текстовые наполнения секций'"), НезаполненныеТекстовыеСекции);
	КонецЕсли;
	
	Возврат СтруктураНезаполненныхОбязательныхПараметров;
	
КонецФункции

Процедура ЗаполнитьОшибкиВалидацииПоСхематрону(ТекстСхематрона, ОшибкиВалидации, Документ, СотрудникУстановившийПодпись, ДолжностьМЗ, ВидДокумента, ДополнительныеПараметры) Экспорт
	
	Если Не ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ДопустимоРедактированиеЭлементовЕГИСЗ() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстXML = СформироватьТекстXMLЭМДПоШаблонуДляСхематрона(Документ, СотрудникУстановившийПодпись, ДолжностьМЗ, ДополнительныеПараметры);
	Если Не ЗначениеЗаполнено(ТекстXML) Тогда
		Возврат;
	КонецЕсли;
	
	ФайлУтилиты		= ПолучитьИмяВременногоФайла("jar");
	ФайлXML			= ПолучитьИмяВременногоФайла("xml");
	ФайлСхематрона	= ПолучитьИмяВременногоФайла("sch");
	ФайлРезультата	= ПолучитьИмяВременногоФайла("xml");
	
	Компонента = ПолучитьОбщийМакет("СхематронПроцессор");
	Компонента.Записать(ФайлУтилиты);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ФайлXML, "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки(ТекстXML);
	ЗаписьXML.Закрыть();
	
	ЗаписьXMLСхематрона = Новый ЗаписьXML;
	ЗаписьXMLСхематрона.ОткрытьФайл(ФайлСхематрона, "UTF-8");
	ЗаписьXMLСхематрона.ЗаписатьБезОбработки(ТекстСхематрона);
	ЗаписьXMLСхематрона.Закрыть();
	
	СтрокаКоманды = СтрШаблон("java -jar %1 -d %2 -s %3 -o %4", ФайлУтилиты, ФайлXML, ФайлСхематрона, ФайлРезультата);
	
	ПараметрыЗапускаПрограммы = ОбщегоНазначенияКлиентСервер.ПараметрыЗапускаПрограммы();
	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
	ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;
	
	Результат = ОбщегоНазначенияКлиентСервер.ЗапуститьПрограмму(СтрокаКоманды, ПараметрыЗапускаПрограммы);
	
	ПостроительDOM = Новый ПостроительDOM;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ФайлРезультата);
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	
	УзлыОшибок = РаботаСDOMКлиентСервер.ПолучитьЭлементыПоИмени(ДокументDOM, "svrl:failed-assert", Истина);
	Для Каждого УзелОшибки Из УзлыОшибок Цикл
		ТекстПравила = УзелОшибки.ПолучитьАтрибут("test");
		Попытка
			Расположение = УзелОшибки.ПолучитьАтрибут("location");
		Исключение
			Расположение = "";
		КонецПопытки;
		
		УзлыТекстовОшибки = РаботаСDOMКлиентСервер.ПолучитьЭлементыПоИмени(УзелОшибки, "svrl:text", Истина);
		Для Каждого УзелТекстаОшибки Из УзлыТекстовОшибки Цикл
			Для Каждого ТекстОшибки Из УзелТекстаОшибки.ДочерниеУзлы Цикл
				НоваяСтрокаОшибки = ОшибкиВалидации.Добавить();
				НоваяСтрокаОшибки.Текст = ТекстОшибки.ЗначениеУзла;
				НоваяСтрокаОшибки.Правило = ТекстПравила;
				НоваяСтрокаОшибки.Расположение = Расположение;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьТекстXMLЭМДПоШаблонуДляСхематрона(Документ, СотрудникУстановившийПодпись, ДолжностьМЗ, ДополнительныеПараметры) Экспорт
	
	СвойстваЭМД = ИнтеграцияЕГИСЗ_РЭМД.СформироватьСвойстваЭМД(Документ, ДополнительныеПараметры);
	ВидДокумента = СвойстваЭМД.ВидРЭМД;
	
	Если ЗначениеЗаполнено(ВидДокумента) Тогда
		
		ШаблонОсмотра = ДополнительныеПараметры.ШаблонОсмотра;
		НаименованиеШаблона = "";
		Если ЗначениеЗаполнено(ШаблонОсмотра) Тогда
			НаименованиеШаблона = ?(ТипЗнч(ШаблонОсмотра) = Тип("СправочникСсылка.ШаблоныHTML"), ШаблонОсмотра.Наименование, ШаблонОсмотра.Владелец.Наименование);
		КонецЕсли;
		
		Если ИнтеграцияЕГИСЗСервер.ПолучитьЗначениеАтрибутаЭлементаКлассификатора(ВидДокумента, "FORMAT") = "2" Тогда
			Попытка
				ТекстXML = ИнтеграцияЕГИСЗВызовСервера.ПолучитьXMLПоСсылкеМД(Документ, СвойстваЭМД, СотрудникУстановившийПодпись, ДолжностьМЗ, НаименованиеШаблона, "", ДополнительныеПараметры);
				УбратьПространствоИменДляВалидации(ТекстXML);
				Возврат ТекстXML;
			Исключение КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ПересчитатьОбязательныеПоляLocalid(мСтрокиLocalid, мСтрокиКонстант, ТаблицаПараметров = Неопределено) Экспорт
	
	Если ТаблицаПараметров = Неопределено Тогда
		тзПараметрыДляПроверкиОбязательности = Новый ТаблицаЗначений;
		тзПараметрыДляПроверкиОбязательности.Колонки.Добавить("localid");
		тзПараметрыДляПроверкиОбязательности.Колонки.Добавить("Значение");
		
		Для Каждого СтрокаКонстанты Из мСтрокиКонстант Цикл
			ЗаполнитьЗначенияСвойств(тзПараметрыДляПроверкиОбязательности.Добавить(), СтрокаКонстанты);
		КонецЦикла;
	Иначе
		тзПараметрыДляПроверкиОбязательности = ТаблицаПараметров;
	КонецЕсли;
	
	Для Каждого СтрокаLocalid Из мСтрокиLocalid Цикл
		Если Не ЗначениеЗаполнено(СтрокаLocalid.УсловиеОбязательное) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаLocalid.Обязательное = Истина;
		Попытка
			СтрокаLocalid.Обязательное = Булево(ВычислитьФункцию(СтрокаLocalid.УсловиеОбязательное, тзПараметрыДляПроверкиОбязательности));
		Исключение КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьТекстПредупрежденияПоПроблемнымПараметрам(Документ) Экспорт
	
	ПроблемныеПараметры = ПолучитьПроблемныеLocalid(Документ);
	Если ПроблемныеПараметры.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстПредупреждения = НСтр("ru = 'Имеются проблемы с параметрами:'");
	
	Для Каждого ПараметрыПоШаблону Из ПроблемныеПараметры Цикл
		
		ИндексШаблона = ПараметрыПоШаблону.Ключ;
		ИмяШаблона = ПараметрыПоШаблону.Значение.НаименованиеВидаДокумента;
		
		ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + СтрШаблон(НСтр("ru = 'Шаблон ""%1"":'"), ИмяШаблона);
		
		Если ПараметрыПоШаблону.Значение.Свойство("НезаполненныеПараметры") Тогда
			Для Каждого ИмяНезаполненногоПараметра Из ПараметрыПоШаблону.Значение.НезаполненныеПараметры Цикл
				ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + СтрШаблон(НСтр("ru = 'Не заполнен параметр ""%1"".'"), ИмяНезаполненногоПараметра);
			КонецЦикла;
		КонецЕсли;
		
		Если ПараметрыПоШаблону.Значение.Свойство("НесопоставленныеLocalid") Тогда
			Для Каждого НесопоставленныйLocalid Из ПараметрыПоШаблону.Значение.НесопоставленныеLocalid Цикл
				ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + СтрШаблон(НСтр("ru = 'Поле ЭМД ""%1"" не сопоставлен с параметром.'"), НесопоставленныйLocalid);
			КонецЦикла;
		КонецЕсли;
		
		Если ПараметрыПоШаблону.Значение.Свойство("НезаполненныеКонстанты") Тогда
			Для Каждого НесопоставленныйLocalid Из ПараметрыПоШаблону.Значение.НезаполненныеКонстанты Цикл
				ТекстПредупреждения = ТекстПредупреждения + Символы.ПС + СтрШаблон(НСтр("ru = 'Не заполнена константа ""%1"".'"), НесопоставленныйLocalid);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекстПредупреждения;
	
КонецФункции

Функция ПолучитьПроблемныеLocalid(Документ)
	
	ПроблемныеLocalid = Новый Соответствие;
	ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(Документ);
	ДополнительныеПараметры = ДополнительныеПараметрыДляРаботыССЭМД();
	
	Если ИмяТипаДокумента = "Документ.Прием" Тогда
		
		ВерсииШаблонов = Новый ТаблицаЗначений;
		ВерсииШаблонов.Колонки.Добавить("ВерсияШаблона");
		ВерсииШаблонов.Колонки.Добавить("ШаблонПриема");
		ДокументыПриемаКлиентСервер.ЗаполнитьТаблицуВерсийШаблонов(ВерсииШаблонов, Документ);
		
		Для Каждого СтрокаШаблона Из Документ.ШаблоныПриема Цикл
			
			СтрокаВерсии = ВерсииШаблонов.Найти(СтрокаШаблона.ШаблонПриема, "ШаблонПриема");
			Если СтрокаВерсии <> Неопределено Тогда
				ДополнительныеПараметры.ШаблонОсмотра = СтрокаВерсии.ВерсияШаблона;
			Иначе
				ДополнительныеПараметры.ШаблонОсмотра = СтрокаШаблона.ШаблонПриема;
			КонецЕсли;
			
			ДополнительныеПараметры.ИндексШаблона = Документ.ШаблоныПриема.Индекс(СтрокаШаблона);
			ДополнительныеПараметры.СтрокаШаблона = СтрокаШаблона;
			
			ТаблицаПараметров = ПолучитьТаблицуПараметров(Документ, ИмяТипаДокумента, ДополнительныеПараметры);
			
			НаименованиеОбъектаЭМД = ПолучитьНаименованиеОбъектаЭМД(Документ, Новый Структура("ШаблонПриема", СтрокаШаблона.ШаблонПриема));
			ПроверитьПараметрыШаблонов(Документ, ДополнительныеПараметры.ИндексШаблона, ПроблемныеLocalid, ТаблицаПараметров, ДополнительныеПараметры.ШаблонОсмотра, , НаименованиеОбъектаЭМД);
		КонецЦикла;
		
	ИначеЕсли ИмяТипаДокумента = "Документ.ПрохождениеМедосмотра" Тогда
		
		Если ЗначениеЗаполнено(Документ.Номенклатура.ВредныйФакторСправки.ШаблонОсмотраСправки) Тогда
			ДополнительныеПараметры.ШаблонОсмотра = Документ.Номенклатура.ВредныйФакторСправки.ШаблонОсмотраСправки;
			ТаблицаПараметров = ПолучитьТаблицуПараметров(Документ, ИмяТипаДокумента, ДополнительныеПараметры);
			НаименованиеОбъектаЭМД = ПолучитьНаименованиеОбъектаЭМД(Документ, Новый Структура("ШаблонОсмотра", ДополнительныеПараметры.ШаблонОсмотра));
			ПроверитьПараметрыШаблонов(Документ, 0, ПроблемныеLocalid, ТаблицаПараметров, ДополнительныеПараметры.ШаблонОсмотра, , НаименованиеОбъектаЭМД);
		Иначе
			МодульМедосмотрыСервер = ДопСерверныеФункции.ОбщийМодуль("МедосмотрыСервер");
			ПриказыВредныеФакторы = МодульМедосмотрыСервер.ПриказыВредныеФакторыМедосмотраСВидамиДокументов(Документ);
			
			Для Каждого СтрокаПриказаВредногоФактора Из ПриказыВредныеФакторы Цикл
				ПриказВредныйФактор = СтрокаПриказаВредногоФактора.ПриказВредныйФактор;
				
				ЭтоСтрокаФактора = ДопСерверныеФункции.ИмяСсылочногоТипа(ПриказВредныйФактор) = "Справочник.ПереченьВредныхФакторовИРабот";
				Приказ = ?(ЭтоСтрокаФактора, ПриказВредныйФактор.Приказ, ПриказВредныйФактор);
				
				СообщениеРЭМД = Неопределено;
				
				Если ЭтоСтрокаФактора
					И МодульМедосмотрыСервер.ЭтоПриказСправки(Приказ)
				Тогда
					ВидДокумента = Неопределено;
					ШаблонОсмотра = ПриказВредныйФактор.ШаблонОсмотраСправки;
					ПриказВредныйФакторМО = Неопределено;
					ВредныйФакторСправки = ПриказВредныйФактор;
					НаименованиеОбъектаЭМД = ПолучитьНаименованиеОбъектаЭМД(Документ, Новый Структура("ШаблонОсмотра", ШаблонОсмотра));
				Иначе
					СтрокаЭМД = Документ.ЭМД.Найти(ИнтеграцияЕГИСЗВызовСервера.ПолучитьУИДПоПриказуВредномуФактору(Документ, ПриказВредныйФактор), "УИД_Шаблона");
					Если СтрокаЭМД <> Неопределено Тогда
						СообщениеРЭМД = СтрокаЭМД.СообщениеРЭМД;
					КонецЕсли;
					ВидДокумента = МодульМедосмотрыСервер.ВидДокументаПоПриказуВредномуФактору(ПриказВредныйФактор, Документ);
					ШаблонОсмотра = Неопределено;
					ПриказВредныйФакторМО = ПриказВредныйФактор;
					ВредныйФакторСправки = Неопределено;
					
					НаименованиеОбъектаЭМД = ПолучитьНаименованиеОбъектаЭМД(Документ, Новый Структура("ПриказВредныйФактор", ПриказВредныйФактор));
				КонецЕсли;
				
				ДополнительныеПараметры.ШаблонОсмотра = ШаблонОсмотра;
				ДополнительныеПараметры.ПриказВредныйФакторМО = ПриказВредныйФакторМО;
				ДополнительныеПараметры.ВредныйФакторСправки = ВредныйФакторСправки;
				ДополнительныеПараметры.СообщениеРЭМД = СообщениеРЭМД;
				
				ТаблицаПараметров = ПолучитьТаблицуПараметров(Документ, ИмяТипаДокумента, ДополнительныеПараметры);
				ПроверитьПараметрыШаблонов(Документ, ПриказВредныйФактор, ПроблемныеLocalid, ТаблицаПараметров, ДополнительныеПараметры.ШаблонОсмотра, ВидДокумента, НаименованиеОбъектаЭМД);
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ИмяТипаДокумента = "Документ.ВрачебнаяКомиссия" Тогда // Версия КОРП
		ТаблицаПараметров = ПолучитьТаблицуПараметров(Документ, ИмяТипаДокумента, ДополнительныеПараметры);
		ФиксированныйВидДокумента = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидРЭМДВрачебнойКомиссии();
		ПроверитьПараметрыШаблонов(Документ, 0, ПроблемныеLocalid, ТаблицаПараметров, , ФиксированныйВидДокумента);
	ИначеЕсли ИмяТипаДокумента = "Документ.Рецепт" Тогда
		ТаблицаПараметров = ПолучитьТаблицуПараметров(Документ, ИмяТипаДокумента, ДополнительныеПараметры);
		ФиксированныйВидДокумента = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидРЭМДРецепта(Документ.ФормаРецепта);
		НаименованиеОбъектаЭМД = ПолучитьНаименованиеОбъектаЭМД(Документ, Новый Структура("ФормаРецепта", Документ.ФормаРецепта));
		ПроверитьПараметрыШаблонов(Документ, 0, ПроблемныеLocalid, ТаблицаПараметров, , ФиксированныйВидДокумента, НаименованиеОбъектаЭМД);
	КонецЕсли;
	
	Возврат ПроблемныеLocalid;
	
КонецФункции

Процедура ПроверитьПараметрыШаблонов(Документ, ИндексШаблона, ПроблемныеLocalid, ТаблицаПараметров, Шаблон = Неопределено, ФиксированныйВидДокумента = Неопределено, НаименованиеОбъектаЭМД = Неопределено)
	
	ВидДокумента = ?(Шаблон = Неопределено, ФиксированныйВидДокумента, Шаблон.ВидДокумента);
	
	Если Не ЗначениеЗаполнено(ВидДокумента)
		Или ИнтеграцияЕГИСЗСервер.ПолучитьЗначениеАтрибутаЭлементаКлассификатора(ВидДокумента, "FORMAT") <> "2"
	Тогда
		Возврат;
	КонецЕсли;
	
	// Дополнение параметрами по РЭМД
	ДополнитьПараметрамиПоРЭМД(ВидДокумента.УИДЕГИСЗ, ТаблицаПараметров, Документ);
	
	СписокLocalid = МассивLocalidДокумента(ВидДокумента, , ТаблицаПараметров);
	
	МассивНезаполненныхПараметровПоШаблонам	= Новый Массив;
	МассивНесопоставленныхLocalidПоШаблонам	= Новый Массив;
	МассивНезаполненныхКонстант				= Новый Массив;
	МассивНезаполненныхДанных				= Новый Массив;
	
	Если Шаблон <> Неопределено
		И (Шаблон.КонстантыCDAДокумента.Количество() > 0
			Или ТаблицаПараметров <> Неопределено)
	Тогда
		ПересчитатьОбязательныеПоляLocalid(СписокLocalid, Шаблон.КонстантыCDAДокумента, ТаблицаПараметров);
	КонецЕсли;
	
	Для Каждого СтрокаLocalid Из СписокLocalid Цикл
		СтрокиПараметров = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", СтрокаLocalid.localid));
		
		Если Не СтрокаLocalid.Обязательное Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокиПараметров.Количество() = 0 Тогда
			Если ФиксированныйВидДокумента <> Неопределено Тогда
				ПредставлениеLocalid = ?(ЗначениеЗаполнено(СтрокаLocalid.Представление), СтрокаLocalid.Представление, СтрокаLocalid.localid);
				МассивНезаполненныхДанных.Добавить(ПредставлениеLocalid);
				Продолжить;
			ИначеЕсли Шаблон = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не (СтрокаLocalid.Свойство("Родитель")
					И СуществуетНезаполненныйНеобязательныйРодительСтрокиLocalid(СтрокаLocalid, СписокLocalid, ТаблицаПараметров)
					Или ЗаполняетсяПоДаннымДокумента(СтрокаLocalid, Шаблон))
			Тогда
				ПараметрПоLocalid = Шаблон.СоответствияПараметрам.НайтиСтроки(Новый Структура("localid", СтрокаLocalid.localid));
				Если ПараметрПоLocalid.Количество() = 0 Тогда
					ПредставлениеLocalid = ?(ЗначениеЗаполнено(СтрокаLocalid.Представление), СтрокаLocalid.Представление, СтрокаLocalid.localid);
					МассивНесопоставленныхLocalidПоШаблонам.Добавить(ПредставлениеLocalid);
				Иначе
					МассивНезаполненныхПараметровПоШаблонам.Добавить(РаботаСШаблонамиHTML.ПредставлениеПараметраШаблона(ПараметрПоLocalid[0].Параметр));
				КонецЕсли;
			КонецЕсли;
		Иначе
			ИмеютсяНезаполненныеДанные = Ложь;
			ИмеетсяНезаполненныйПараметр = Ложь;
			ИмеетсяНезаполненнаяКонстанта = Ложь;
			
			Для Каждого СтрокаПараметра Из СтрокиПараметров Цикл
				Если Не (ТипЗнч(СтрокаПараметра.Значение) = Тип("Число")
					Или ЗначениеЗаполнено(СтрокаПараметра.Значение))
				Тогда
					Если ФиксированныйВидДокумента <> Неопределено Тогда
						ИмеютсяНезаполненныеДанные = Истина;
					ИначеЕсли СтрокаПараметра.Параметр = Неопределено Тогда
						ИмеетсяНезаполненнаяКонстанта = Истина;
					Иначе
						ИмеетсяНезаполненныйПараметр = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			ПредставлениеLocalid = ?(ЗначениеЗаполнено(СтрокаLocalid.Представление), СтрокаLocalid.Представление, СтрокаLocalid.localid);
			
			Если Шаблон <> Неопределено
				И ИмеетсяНезаполненныйПараметр
			Тогда
				ПараметрПоLocalid = Шаблон.СоответствияПараметрам.НайтиСтроки(Новый Структура("localid", СтрокаLocalid.localid));
				Если ПараметрПоLocalid.Количество() = 0 Тогда
					МассивНесопоставленныхLocalidПоШаблонам.Добавить(ПредставлениеLocalid);
				Иначе
					МассивНезаполненныхПараметровПоШаблонам.Добавить(РаботаСШаблонамиHTML.ПредставлениеПараметраШаблона(ПараметрПоLocalid[0].Параметр));
				КонецЕсли;
			КонецЕсли;
			
			Если ИмеетсяНезаполненнаяКонстанта Тогда
				МассивНезаполненныхКонстант.Добавить(ПредставлениеLocalid);
			КонецЕсли;
			
			Если ИмеютсяНезаполненныеДанные Тогда
				Если ЗначениеЗаполнено(СтрокиПараметров[0].ТекстНезаполненногоПараметра) Тогда
					МассивНезаполненныхДанных.Добавить(СтрокиПараметров[0].ТекстНезаполненногоПараметра);
				Иначе
					МассивНезаполненныхДанных.Добавить(ПредставлениеLocalid);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ИмеютсяПроблемыПоШаблону = Ложь;
	
	СтруктураПроблемныхПараметровПоШаблону = Новый Структура;
	
	НаименованиеВидаДокумента = НаименованиеВидаДокумента(ВидДокумента);
	
	Если ЗначениеЗаполнено(НаименованиеВидаДокумента) Тогда
		СтруктураПроблемныхПараметровПоШаблону.Вставить("НаименованиеВидаДокумента", НаименованиеВидаДокумента);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НаименованиеОбъектаЭМД) Тогда
		СтруктураПроблемныхПараметровПоШаблону.Вставить("НаименованиеОбъектаЭМД", НаименованиеОбъектаЭМД);
	КонецЕсли;
	
	Если МассивНезаполненныхПараметровПоШаблонам.Количество() > 0 Тогда
		СтруктураПроблемныхПараметровПоШаблону.Вставить("НезаполненныеПараметры", МассивНезаполненныхПараметровПоШаблонам);
		ИмеютсяПроблемыПоШаблону = Истина;
	КонецЕсли;
	
	Если МассивНесопоставленныхLocalidПоШаблонам.Количество() > 0 Тогда
		СтруктураПроблемныхПараметровПоШаблону.Вставить("НесопоставленныеLocalid", МассивНесопоставленныхLocalidПоШаблонам);
		ИмеютсяПроблемыПоШаблону = Истина;
	КонецЕсли;
	
	Если МассивНезаполненныхКонстант.Количество() > 0 Тогда
		СтруктураПроблемныхПараметровПоШаблону.Вставить("НезаполненныеКонстанты", МассивНезаполненныхКонстант);
		ИмеютсяПроблемыПоШаблону = Истина;
	КонецЕсли;
	
	Если МассивНезаполненныхДанных.Количество() > 0 Тогда
		СтруктураПроблемныхПараметровПоШаблону.Вставить("НезаполненныеДанные", МассивНезаполненныхДанных);
		ИмеютсяПроблемыПоШаблону = Истина;
	КонецЕсли;
	
	Если ИмеютсяПроблемыПоШаблону Тогда
		ПроблемныеLocalid.Вставить(ИндексШаблона, СтруктураПроблемныхПараметровПоШаблону);
	КонецЕсли;
	
КонецПроцедуры

Функция СуществуетНезаполненныйНеобязательныйРодительСтрокиLocalid(ТекущаяСтрокаLocalid, СписокLocalid, ТаблицаПараметров)
	
	Если Не ТекущаяСтрокаLocalid.Свойство("Родитель")
		Или ТекущаяСтрокаLocalid.Родитель[0].localid = ТекущаяСтрокаLocalid.localid
	Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РодительТекущейСтроки = ТекущаяСтрокаLocalid.Родитель[0];
	
	Если РодительТекущейСтроки.Обязательное = Ложь
		И ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", РодительТекущейСтроки.localid)).Количество() = 0
	Тогда
		Возврат Истина;
	Иначе
		Для Каждого СтрокаLocalid Из СписокLocalid Цикл
			Если СтрокаLocalid.localid = РодительТекущейСтроки.localid Тогда
				Возврат СуществуетНезаполненныйНеобязательныйРодительСтрокиLocalid(СтрокаLocalid, СписокLocalid, ТаблицаПараметров);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьНаличиеПроблемныхПараметров(Документ, Проблемы) Экспорт
	
	ПроблемныеПараметрыЭМДДокумента = ПолучитьПроблемныеLocalid(Документ);
	ЗаполнитьПроблемыПараметровЭМД(Проблемы, ПроблемныеПараметрыЭМДДокумента);
	
КонецПроцедуры

Процедура ЗаполнитьПроблемыПараметровЭМД(Проблемы, ПроблемныеПараметрыЭМДДокумента)
	
	Если ПроблемныеПараметрыЭМДДокумента.Количество() > 0 Тогда
		
		ТипыПроблем = Новый Соответствие;
		ТипыПроблем.Вставить("НезаполненныеПараметры",	НСтр("ru='Не заполнены параметры документа'"));
		ТипыПроблем.Вставить("НесопоставленныеLocalid",	НСтр("ru='Не сопоставлены поля ЭМД в шаблоне'"));
		ТипыПроблем.Вставить("НезаполненныеКонстанты",	НСтр("ru='Не заполнены константы шаблона'"));
		ТипыПроблем.Вставить("НезаполненныеДанные",		НСтр("ru='Имеются проблемы с данными'"));
		
		мПроблемныеПараметры = Новый Массив;
		Для Каждого ПроблемныеПараметрыЭМД Из ПроблемныеПараметрыЭМДДокумента Цикл
			Попытка
				НаименованиеВидаДокумента = ПроблемныеПараметрыЭМД.Значение.НаименованиеВидаДокумента;
			
				ПроблемыЭМД = Новый Массив;
			
				ПроблемныеПараметрыПоТипуПроблемы = Новый Соответствие;
				Для Каждого ПроблемаЭМД Из ПроблемныеПараметрыЭМД.Значение Цикл
					ТипПроблемы = ТипыПроблем.Получить(ПроблемаЭМД.Ключ);
					Если ТипПроблемы = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					ПроблемныеПараметрыПоТипуПроблемы.Вставить(ТипПроблемы, ПроблемаЭМД.Значение);
				КонецЦикла;
				ПроблемыЭМД.Добавить(ПроблемныеПараметрыПоТипуПроблемы);
				
				СтруктураПроблемЭМД = Новый Структура;
				СтруктураПроблемЭМД.Вставить("Заголовок", НаименованиеВидаДокумента);
				СтруктураПроблемЭМД.Вставить("Проблемы", ПроблемыЭМД);
				Если ПроблемныеПараметрыЭМД.Значение.Свойство("НаименованиеОбъектаЭМД")
					И ЗначениеЗаполнено(ПроблемныеПараметрыЭМД.Значение.НаименованиеОбъектаЭМД)
				Тогда
					СтруктураПроблемЭМД.Вставить("НаименованиеОбъектаЭМД", ПроблемныеПараметрыЭМД.Значение.НаименованиеОбъектаЭМД);
				КонецЕсли;
					
				мПроблемныеПараметры.Добавить(СтруктураПроблемЭМД);
			Исключение
				мПроблемныеПараметры = Новый Массив;
				Проблемы.Вставить(НСтр("ru='Имеются проблемы с данными'"), ПроблемныеПараметрыЭМД.Значение.НезаполненныеДанные);
			КонецПопытки;
		КонецЦикла;
		Если мПроблемныеПараметры.Количество() > 0 Тогда
			Проблемы.Вставить(НСтр("ru='Имеются проблемы с параметрами документа'"), мПроблемныеПараметры);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПроблемыСЭМДПередПодписанием(Документ) Экспорт
	
	Проблемы = Новый Соответствие;
	
	ЗаполненыНастройкиРЭМД(Документ.Филиал.Организация.МедицинскаяОрганизация, Проблемы);
	ПользовательИмеетЭЦП(Проблемы);
	ПроверитьНаличиеПроблемныхПараметров(Документ, Проблемы);
	ПроверитьДоступностьКаталоговИзНастроекИнтеграцииСЕГИСЗНаСервере(Документ.Филиал,, Проблемы);
	ПроблемыПоВидамЭМД(Документ, Проблемы);
	ПроверитьЗагруженностьКлассификатораТиповМедкарт(Проблемы);
	ПроверитьСтруктурноеПодразделениеВрача(Документ, Проблемы);
	
	Возврат Проблемы;
	
КонецФункции

Процедура ЗаполненыНастройкиРЭМД(МедицинскаяОрганизация, Проблемы)
	
	МЗ = РегистрыСведений.ЕГИСЗНастройкиИнтеграции.СоздатьМенеджерЗаписи();
	МЗ.МедицинскаяОрганизация = МедицинскаяОрганизация;
	МЗ.Прочитать();
	Если Не МЗ.Выбран() Тогда
		Проблемы.Вставить(НСтр("ru = 'Не заполнены настройки РЭМД'"));
		Возврат;
	КонецЕсли;
	
	Ресурсы = Метаданные.РегистрыСведений.ЕГИСЗНастройкиИнтеграции.Ресурсы;
	МассивПараметровРЭМД = Новый Массив;
	МассивПараметровРЭМД.Добавить("ИдентификаторМИСвРЭМД");
	МассивПараметровРЭМД.Добавить("ПутьКАрхивуРЭМД");
	МассивПараметровРЭМД.Добавить("АдресЛокальногоСервисаРЭМД");
	МассивПараметровРЭМД.Добавить("ДатаНачалаОбменаИнформациейСРЭМД");
	
	НезаполненныеНастройкиРЭМД = Новый Массив;
	
	Для Каждого ПараметрРЭМД Из МассивПараметровРЭМД Цикл
		ЗначениеПараметра = ОбщегоНазначенияКлиентСервер.СвойствоОбъекта(МЗ, ПараметрРЭМД);
		Если Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			НезаполненныеНастройкиРЭМД.Добавить(Ресурсы.Найти(ПараметрРЭМД).Синоним);
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьАдресВебСервисаДляЗапросовВРЭМД()) Тогда
		ИмяНастройки = Метаданные.РегистрыСведений.НастройкиМедицинскогоУчета.Ресурсы.АдресФедеральногоСервисаРЭМД.Синоним;
		НезаполненныеНастройкиРЭМД.Добавить(ИмяНастройки);
	КонецЕсли;
	
	Если НезаполненныеНастройкиРЭМД.Количество() > 0 Тогда
		Проблемы.Вставить(НСтр("ru='Не все настройки РЭМД заполнены'"), НезаполненныеНастройкиРЭМД);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПользовательИмеетЭЦП(Проблемы)
	
	ТекущийПользователь = ОбщегоНазначения.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СертификатыКлючейЭлектроннойПодписиИШифрования.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования КАК СертификатыКлючейЭлектроннойПодписиИШифрования
		|ГДЕ
		|	СертификатыКлючейЭлектроннойПодписиИШифрования.Пользователь = &Пользователь
		|	И НЕ СертификатыКлючейЭлектроннойПодписиИШифрования.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	
	Если Запрос.Выполнить().Выбрать().Количество() = 0 Тогда
		Проблемы.Вставить(НСтр("ru='У пользователя отсутствует настроенная ЭЦП в базе'"));
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьСоответствиеТиповКлассификацийВитальныхПараметров(ВитальныеПараметры) Экспорт
	
	НекорректныеТипы = Новый Массив;
	Для Каждого ВитальныйПараметр Из ВитальныеПараметры Цикл
		СтрокаАтрибутаТипа = ВитальныйПараметр.КлассификацияПоля.Атрибуты.Найти("DATA_TYPE", "Ключ");
		Если СтрокаАтрибутаТипа = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ТипКлассификации = ТипДанныхИзXML(СтрокаАтрибутаТипа.Значение);
		
		Если ВитальныйПараметр.Свойство("Параметр") Тогда
			
			Если ВитальныйПараметр.Параметр.ТипЗначения.Типы().Найти(ТипКлассификации) = Неопределено Тогда
				ТекстОшибки = СтрШаблон("Параметр ""%1"". Для классификации ""%2"" требуется параметр типа ""%3""", ВитальныйПараметр.Параметр, ВитальныйПараметр.КлассификацияПоля, ТипКлассификации);
				НекорректныеТипы.Добавить(Новый Структура("Представление", ТекстОшибки));
			ИначеЕсли ТипКлассификации = Тип("СправочникСсылка.КлассификаторыМинЗдрава") Тогда
				СтрокаАтрибутаКлассификатора = ВитальныйПараметр.КлассификацияПоля.Атрибуты.Найти("OID", "Ключ");
				Если СтрокаАтрибутаКлассификатора = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ПараметрыСправочника = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьПараметрыСправочникаЕГИСЗ(СтрокаАтрибутаКлассификатора.Значение);
				Если ПараметрыСправочника <> Неопределено
					И ПараметрыСправочника.ВидКлассификатора <> ВитальныйПараметр.Параметр.ВидКлассификатора
				Тогда
					ТекстОшибки = СтрШаблон("Параметр ""%1"". Для классификации ""%2"" требуется вид классификатора параметра ""%3""", ВитальныйПараметр.Параметр, ВитальныйПараметр.КлассификацияПоля, ПараметрыСправочника.ВидКлассификатора);
					НекорректныеТипы.Добавить(Новый Структура("Представление", ТекстОшибки));
				КонецЕсли;
			КонецЕсли;
		Иначе
			
			Если ТипЗнч(ВитальныйПараметр.Значение) <> ТипКлассификации Тогда
				ТекстОшибки = СтрШаблон("Константа №%1. Для классификации ""%2"" требуется значение типа ""%3""", ВитальныйПараметр.НомерСтроки, ВитальныйПараметр.КлассификацияПоля, ТипКлассификации);
				НекорректныеТипы.Добавить(Новый Структура("Представление", ТекстОшибки));
			ИначеЕсли ТипКлассификации = Тип("СправочникСсылка.КлассификаторыМинЗдрава") Тогда
				СтрокаАтрибутаКлассификатора = ВитальныйПараметр.КлассификацияПоля.Атрибуты.Найти("OID", "Ключ");
				Если СтрокаАтрибутаКлассификатора = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ПараметрыСправочника = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьПараметрыСправочникаЕГИСЗ(СтрокаАтрибутаКлассификатора.Значение);
				Если ПараметрыСправочника <> Неопределено
					И ПараметрыСправочника.ВидКлассификатора <> ВитальныйПараметр.Значение.ВидКлассификатора
				Тогда
					ТекстОшибки = СтрШаблон("Константа №%1. Для классификации ""%2"" требуется вид классификатора значения ""%3""", ВитальныйПараметр.НомерСтроки, ВитальныйПараметр.КлассификацияПоля, ПараметрыСправочника.ВидКлассификатора);
					НекорректныеТипы.Добавить(Новый Структура("Представление", ТекстОшибки));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НекорректныеТипы;
	
КонецФункции

Функция ТипыЗначенийВитальныхПараметров() Экспорт
	
	ТипыЗначенийВитальныхПараметров = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	КлассификаторыМинЗдраваАтрибуты.Ключ КАК Ключ,
		|	ВЫРАЗИТЬ(КлассификаторыМинЗдраваАтрибуты.Значение КАК СТРОКА(100)) КАК Значение
		|ИЗ
		|	Справочник.КлассификаторыМинЗдрава.Атрибуты КАК КлассификаторыМинЗдраваАтрибуты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторыМинЗдрава КАК КлассификаторыМинЗдрава
		|		ПО КлассификаторыМинЗдраваАтрибуты.Ссылка = КлассификаторыМинЗдрава.Ссылка
		|			И (КлассификаторыМинЗдрава.ВидКлассификатора = ЗНАЧЕНИЕ(Перечисление.ВидыКлассификаторовМинЗдрава.ВитальныеПараметры))
		|			И (КлассификаторыМинЗдраваАтрибуты.Ключ = ""DATA_TYPE""
		|				ИЛИ КлассификаторыМинЗдраваАтрибуты.Ключ = ""OID"")";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТипДанных = Неопределено;
		Если Выборка.Ключ = "DATA_TYPE" Тогда
			ТипДанных = ТипДанныхИзXML(Выборка.Значение);
		Иначе
			ТипДанных = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьПараметрыСправочникаЕГИСЗ(Выборка.Значение).Тип;
		КонецЕсли;
		Если ЗначениеЗаполнено(ТипДанных)
			И ТипыЗначенийВитальныхПараметров.Найти(ТипДанных) = Неопределено
		Тогда
			ТипыЗначенийВитальныхПараметров.Добавить(ТипДанных);
		КонецЕсли;
	КонецЦикла;
	
	Если ТипыЗначенийВитальныхПараметров.Количество() = 0 Тогда
		// Для случая, если в базу не загружен классификатор витальных параметров
		ТипыЗначенийВитальныхПараметров.Добавить(Тип("Строка"));
		ТипыЗначенийВитальныхПараметров.Добавить(Тип("Число"));
		ТипыЗначенийВитальныхПараметров.Добавить(Тип("Булево"));
	КонецЕсли;
	
	Возврат Новый ОписаниеТипов(ТипыЗначенийВитальныхПараметров);
	
КонецФункции

Функция ДополнительныеПараметрыДляРаботыССЭМД() Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("СтрокаШаблона");
	ДополнительныеПараметры.Вставить("УИДШаблона");
	ДополнительныеПараметры.Вставить("ШаблонОсмотра");
	ДополнительныеПараметры.Вставить("ИндексШаблона");
	ДополнительныеПараметры.Вставить("ПриказВредныйФакторМО");
	ДополнительныеПараметры.Вставить("ВредныйФакторСправки");
	ДополнительныеПараметры.Вставить("ПараметрыШаблона");
	ДополнительныеПараметры.Вставить("СообщениеРЭМД");
	ДополнительныеПараметры.Вставить("СтрокаШаблона");
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

Функция ОпределитьВидДокументаПоПриказуВредномуФакторуМО(ПриказВредныйФактор, СообщениеРЭМД, ПрохождениеМедосмотра) Экспорт
	
	Если ЗначениеЗаполнено(СообщениеРЭМД) Тогда
		Возврат СообщениеРЭМД.ВидДокумента;
	КонецЕсли;
	
	МодульМедосмотрыСервер = ДопСерверныеФункции.ОбщийМодуль("МедосмотрыСервер");
	Возврат МодульМедосмотрыСервер.ВидДокументаПоПриказуВредномуФактору(ПриказВредныйФактор, ПрохождениеМедосмотра);
	
КонецФункции

Процедура ПроверитьДоступностьКаталоговИзНастроекИнтеграцииСЕГИСЗНаСервере(Филиал = Неопределено, МедицинскаяОрганизация = Неопределено, Проблемы = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если МедицинскаяОрганизация = Неопределено Тогда
		Если Филиал = Неопределено Тогда
			Филиал = УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Филиал) Тогда
			МедицинскаяОрганизация = Филиал.Организация.МедицинскаяОрганизация;
		Иначе
			МедицинскаяОрганизация = Справочники.РеестрМедицинскихОрганизаций.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	мзНастройки = РегистрыСведений.ЕГИСЗНастройкиИнтеграции.СоздатьМенеджерЗаписи();
	мзНастройки.МедицинскаяОрганизация = МедицинскаяОрганизация;
	мзНастройки.Прочитать();
	
	Если Не мзНастройки.Выбран() Тогда
		Возврат;
	КонецЕсли;
	
	МассивПроблем = Новый Массив;
	Если ЗначениеЗаполнено(мзНастройки.ПутьКАрхивуЛогов) Тогда
		Если Не доп_РаботаСФайлами.ФайлСуществует(мзНастройки.ПутьКАрхивуЛогов) Тогда
			МассивПроблем.Добавить("Не удалось получить доступ к каталогу с архивом логов, указанному в настройках интеграции с ЕГИСЗ.");
		ИначеЕсли Не доп_РаботаСФайлами.ЕстьПраваНаИзмененияВКаталоге(мзНастройки.ПутьКАрхивуЛогов) Тогда
			МассивПроблем.Добавить("Нет прав на изменение в каталоге с архивом логов, указанному в настройках интеграции с ЕГИСЗ.");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(мзНастройки.ПутьКАрхивуРЭМД) Тогда
		Если Не доп_РаботаСФайлами.ФайлСуществует(мзНастройки.ПутьКАрхивуРЭМД) Тогда
			МассивПроблем.Добавить("Не удалось получить доступ к каталогу с архивом РЭМД, указанному в настройках интеграции с ЕГИСЗ.");
		ИначеЕсли Не доп_РаботаСФайлами.ЕстьПраваНаИзмененияВКаталоге(мзНастройки.ПутьКАрхивуРЭМД) Тогда
			МассивПроблем.Добавить("Нет прав на изменение в каталоге с архивом РЭМД, указанному в настройках интеграции с ЕГИСЗ.");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(мзНастройки.ПутьКАрхивуРезервныхКопий) Тогда
		Если Не доп_РаботаСФайлами.ФайлСуществует(мзНастройки.ПутьКАрхивуРезервныхКопий) Тогда
			МассивПроблем.Добавить("Не удалось получить доступ к каталогу с архивом резервных копий, указанному в настройках интеграции с ЕГИСЗ.");
		ИначеЕсли Не доп_РаботаСФайлами.ЕстьПраваНаИзмененияВКаталоге(мзНастройки.ПутьКАрхивуРезервныхКопий) Тогда
			МассивПроблем.Добавить("Нет прав на изменение в каталоге с архивом резервных копий, указанному в настройках интеграции с ЕГИСЗ.");
		КонецЕсли
	КонецЕсли;
	
	Для Каждого Проблема Из МассивПроблем Цикл 
		Если Типзнч(Проблемы) = Тип("Соответствие") Тогда
			Проблемы.Вставить(Проблема);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Проблема);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроблемыПоВидамЭМД(Документ, Проблемы)
	
	ВидыЭМДДокумента = ВидыЭМДДокумента(Документ);
	
	Для Каждого ВидЭМД Из ВидыЭМДДокумента Цикл
		Если ВидЭМД = 230 Тогда
			ЗаполнитьПроблемыПоВидуЭМД_230(Документ, Проблемы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ВидыЭМДДокумента(Документ)
	
	ВидыЭМДДокумента = Новый Массив;
	
	ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(Документ);
	ДополнительныеПараметры = ИнтеграцияЕГИСЗ_СЭМД.ДополнительныеПараметрыДляРаботыССЭМД();
	
	Если ИмяТипаДокумента = "Документ.Прием" Тогда
		
		ВерсииШаблонов = Новый ТаблицаЗначений;
		ВерсииШаблонов.Колонки.Добавить("ВерсияШаблона");
		ВерсииШаблонов.Колонки.Добавить("ШаблонПриема");
		ДокументыПриемаКлиентСервер.ЗаполнитьТаблицуВерсийШаблонов(ВерсииШаблонов, Документ);
		
		Для Каждого СтрокаШаблона Из Документ.ШаблоныПриема Цикл
			СтрокаВерсии = ВерсииШаблонов.Найти(СтрокаШаблона.ШаблонПриема, "ШаблонПриема");
			ДополнительныеПараметры.ШаблонОсмотра = ?(СтрокаВерсии <> Неопределено, СтрокаВерсии.ВерсияШаблона, СтрокаШаблона.ШаблонПриема);
			ДополнительныеПараметры.ИндексШаблона = Документ.ШаблоныПриема.Индекс(СтрокаШаблона);
			ДополнительныеПараметры.СтрокаШаблона = СтрокаШаблона;
			
			СвойстваЭМД = ИнтеграцияЕГИСЗ_РЭМД.СформироватьСвойстваЭМД(Документ, ДополнительныеПараметры);
			Если ЗначениеЗаполнено(СвойстваЭМД.ВидРЭМД) Тогда
				ВидыЭМДДокумента.Добавить(СвойстваЭМД.ВидРЭМД);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ИмяТипаДокумента = "Документ.ПрохождениеМедосмотра" Тогда
		Если ЗначениеЗаполнено(Документ.Номенклатура.ВредныйФакторСправки.ШаблонОсмотраСправки) Тогда
			ДополнительныеПараметры.ШаблонОсмотра = Документ.Номенклатура.ВредныйФакторСправки.ШаблонОсмотраСправки;
			
			СвойстваЭМД = ИнтеграцияЕГИСЗ_РЭМД.СформироватьСвойстваЭМД(Документ, ДополнительныеПараметры);
			Если ЗначениеЗаполнено(СвойстваЭМД.ВидРЭМД) Тогда
				ВидыЭМДДокумента.Добавить(СвойстваЭМД.ВидРЭМД);
			КонецЕсли;
		Иначе
			МодульМедосмотрыСервер = ДопСерверныеФункции.ОбщийМодуль("МедосмотрыСервер");
			ПриказыВредныеФакторы = МодульМедосмотрыСервер.ПриказыВредныеФакторыМедосмотраСВидамиДокументов(Документ);
			
			Для Каждого СтрокаПриказаВредногоФактора Из ПриказыВредныеФакторы Цикл
				ПриказВредныйФактор = СтрокаПриказаВредногоФактора.ПриказВредныйФактор;
				
				ЭтоСтрокаФактора = ДопСерверныеФункции.ИмяСсылочногоТипа(ПриказВредныйФактор) = "Справочник.ПереченьВредныхФакторовИРабот";
				Приказ = ?(ЭтоСтрокаФактора, ПриказВредныйФактор.Приказ, ПриказВредныйФактор);
				
				СообщениеРЭМД = Неопределено;
				
				Если ЭтоСтрокаФактора
					И МодульМедосмотрыСервер.ЭтоПриказСправки(Приказ)
				Тогда
					ПриказВредныйФакторМО = Неопределено;
					ШаблонОсмотра = ПриказВредныйФактор.ШаблонОсмотраСправки;
					ВредныйФакторСправки = ПриказВредныйФактор;
					ЭтоПриказ = Ложь;
					НаименованиеОбъектаЭМД = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьНаименованиеОбъектаЭМД(Документ, Новый Структура("ШаблонОсмотра", ШаблонОсмотра));
				Иначе
					СтрокаЭМД = Документ.ЭМД.Найти(ИнтеграцияЕГИСЗВызовСервера.ПолучитьУИДПоПриказуВредномуФактору(Документ, Приказ), "УИД_Шаблона");
					Если СтрокаЭМД <> Неопределено Тогда
						СообщениеРЭМД = СтрокаЭМД.СообщениеРЭМД;
					КонецЕсли;
					ПриказВредныйФакторМО = ПриказВредныйФактор;
					ШаблонОсмотра = Неопределено;
					ВредныйФакторСправки = Неопределено;
					ЭтоПриказ = Истина;
					
					НаименованиеОбъектаЭМД = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьНаименованиеОбъектаЭМД(Документ, Новый Структура("ПриказВредныйФактор", ПриказВредныйФактор));
				КонецЕсли;
				
				ДополнительныеПараметры.ПриказВредныйФакторМО	= ПриказВредныйФакторМО;
				ДополнительныеПараметры.ШаблонОсмотра			= ШаблонОсмотра;
				ДополнительныеПараметры.ВредныйФакторСправки	= ВредныйФакторСправки;
				ДополнительныеПараметры.СообщениеРЭМД			= СообщениеРЭМД;
				
				СвойстваЭМД = ИнтеграцияЕГИСЗ_РЭМД.СформироватьСвойстваЭМД(Документ, ДополнительныеПараметры);
				Если ЗначениеЗаполнено(СвойстваЭМД.ВидРЭМД) Тогда
					ВидыЭМДДокумента.Добавить(СвойстваЭМД.ВидРЭМД);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	//ИначеЕсли ИмяТипаДокумента = "Документ.ВрачебнаяКомиссия" Тогда // Версия КОРП
	//	
	ИначеЕсли ИмяТипаДокумента = "Документ.Рецепт" Тогда
		СвойстваЭМД = ИнтеграцияЕГИСЗ_РЭМД.СформироватьСвойстваЭМД(Документ, ДополнительныеПараметры);
		Если ЗначениеЗаполнено(СвойстваЭМД.ВидРЭМД) Тогда
			ВидыЭМДДокумента.Добавить(СвойстваЭМД.ВидРЭМД);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиентСервер.СвернутьМассив(ВидыЭМДДокумента);
	
КонецФункции

Процедура ЗаполнитьПроблемыПоВидуЭМД_230(Документ, Проблемы)
	
	Если ДопСерверныеФункции.ИмяСсылочногоТипа(Документ) <> "Документ.ПрохождениеМедосмотра"
		Или ЗначениеЗаполнено(Документ.Номенклатура.ВредныйФакторСправки.ШаблонОсмотраСправки)
	Тогда
		Возврат;
	КонецЕсли;
	
	МодульМедосмотрыСервер = ДопСерверныеФункции.ОбщийМодуль("МедосмотрыСервер");
	ПриказыВредныеФакторы = МодульМедосмотрыСервер.ПриказыВредныеФакторыМедосмотраСВидамиДокументов(Документ);
	
	Для Каждого СтрокаПриказаВредногоФактора Из ПриказыВредныеФакторы Цикл
		Если ЗначениеЗаполнено(СтрокаПриказаВредногоФактора.ВидДокумента)
			И СтрокаПриказаВредногоФактора.ВидДокумента.УИДЕГИСЗ = 230
			И ЕстьКритичныеОшибкиПоФактору230(Документ, СтрокаПриказаВредногоФактора.ПриказВредныйФактор)
		Тогда
			ШаблонПроблемы = НСтр("ru='Форма проверки корректности заполнения выявила критичные проблемы для фактора: %1'");
			Проблемы.Вставить(СтрШаблон(ШаблонПроблемы, СтрокаПриказаВредногоФактора.ПриказВредныйФактор.НомерПП));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗагруженностьКлассификатораТиповМедкарт(Проблемы)
	
	Если ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипМедицинскойКарты(1) = Неопределено
		Или ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипМедицинскойКарты(2) = Неопределено
		Или ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипМедицинскойКарты(3) = Неопределено
	Тогда
		Проблемы.Вставить(НСтр("ru='Не загружен классификатор ""Типы медицинских карт"" (1.2.643.5.1.13.13.99.2.723)'"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьСтруктурноеПодразделениеВрача(Документ, Проблемы)
	
	ВрачДокумента = ВрачДокумента(Документ);
	СтруктурноеПодразделениеВрачаМинЗдрав = ВрачДокумента.Подразделение.ПодразделениеМинздрава;
	Если ЗначениеЗаполнено(СтруктурноеПодразделениеВрачаМинЗдрав) Тогда
		
		OIDМОПодразделения = СтруктурноеПодразделениеВрачаМинЗдрав.Атрибуты.Найти("mo_oid");
		Если ЗначениеЗаполнено(OIDМОПодразделения)
			И OIDМОПодразделения.Значение <> Документ.Филиал.Организация.МедицинскаяОрганизация.OIDОрганизации
		Тогда
			Проблемы.Вставить(НСтр("ru = 'Структурное подразделение по классификатору Минздрава у врача документа отличается от структурного подразделения филиала документа. Подразделения врача и филиала должны совпадать.'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ИсточникЗаполненияПоДиагнозам() Экспорт
	
	Возврат Метаданные.Документы.Прием.ТабличныеЧасти.Диагнозы.ПолноеИмя();
	
КонецФункции

Функция LocalidЗаполняемыеПоДаннымДокумента(Шаблон) Экспорт
	
	ЗаполняемыеLocalid = Новый Массив;
	
	Попытка
		ДокументXML = ПолучитьXML(ПолучитьМакетСправочникаПоВидуДокумента(Шаблон.ВидДокумента));
		УзлыОписанияДиагнозов = ДокументXML.ПолучитьЭлементыПоИмени("bitDiagnosis");
	Исключение
		Возврат ЗаполняемыеLocalid;
	КонецПопытки;
	
	Если УзлыОписанияДиагнозов.Количество() > 0
		И Шаблон.ЗаполнятьДиагнозыИзТабличнойЧасти
	Тогда
		Для Каждого УзелСтруктурыДиагноза Из УзлыОписанияДиагнозов[0].ДочерниеУзлы Цикл
			Для Каждого ДочернийУзел Из УзелСтруктурыДиагноза.ДочерниеУзлы Цикл
				localid = ДочернийУзел.ПолучитьАтрибут("localid");
				Если ЗначениеЗаполнено(localid)
					И ЗаполняемыеLocalid.Найти(localid) = Неопределено
				Тогда
					ЗаполняемыеLocalid.Добавить(localid);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЗаполняемыеLocalid;
	
КонецФункции

// Вызывается только из внешней обработки (либо для обновления макета "НаименованияФиксированныхВерсий", либо при возникновении проблем у клиентов)
//
Процедура ЗаполнитьНаименованияЭлементовФиксированныхВерсийКлассификаторов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТабДокФиксированныеВерсии = Справочники.РегистрируемыеЭлектронныеМедДокументы.ПолучитьМакет("ФиксированныеВерсииКлассификаторов");
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.Вывести(ТабДокФиксированныеВерсии.ПолучитьОбласть("Шапка"));
	
	ДоступныеРЭМД = Справочники.РегистрируемыеЭлектронныеМедДокументы.ПолучитьИдентификаторыДоступныеРЭМД(, Ложь);
	
	Для Каждого Область Из ТабДокФиксированныеВерсии.Области Цикл
		Если Не СтрНачинаетсяС(Область.Имя, "ВидРЭМД_") Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ВидРЭМД = Число(СтрЗаменить(Область.Имя, "ВидРЭМД_", ""));
		Исключение
			Продолжить;
		КонецПопытки;
		
		Если ДоступныеРЭМД.Найти(ВидРЭМД) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТабДокумент.Вывести(ТабДокФиксированныеВерсии.ПолучитьОбласть(Область.Имя));
	КонецЦикла;
	
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДокумент.Область(1, 1, ТабДокумент.ВысотаТаблицы, ТабДокумент.ШиринаТаблицы));
	ПостроительОтчета.Выполнить();
	
	ФиксированныеВерсииПоВидамРЭМД = ПостроительОтчета.Результат.Выгрузить();
	
	ФиксированныеВерсии = ФиксированныеВерсииПоВидамРЭМД.СкопироватьКолонки("Классификатор,Версия");
	ФиксированныеВерсии.Колонки.Добавить("Идентификаторы", Новый ОписаниеТипов("Массив"));
	
	Для Каждого СтрокаПоВидуРЭМД Из ФиксированныеВерсииПоВидамРЭМД Цикл
		
		Идентификаторы = Новый Массив;
		Для Каждого Идентификатор Из СтрРазделить(СтрокаПоВидуРЭМД.ИдентификаторыСтрокой, ",", Ложь) Цикл
			Попытка
				ИдентификаторЧислом = Число(СокрЛП(Идентификатор));
			Исключение
				Продолжить;
			КонецПопытки;
			Если Идентификаторы.Найти(ИдентификаторЧислом) = Неопределено Тогда
				Идентификаторы.Добавить(ИдентификаторЧислом);
			КонецЕсли;
		КонецЦикла;
		
		СтрокиФиксированныхВерсий = ФиксированныеВерсии.НайтиСтроки(Новый Структура("Классификатор, Версия", СтрокаПоВидуРЭМД.Классификатор, СтрокаПоВидуРЭМД.Версия));
		
		Если СтрокиФиксированныхВерсий.Количество() = 0 Тогда
			СтрокаФиксированнойВерсии = ФиксированныеВерсии.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаФиксированнойВерсии, СтрокаПоВидуРЭМД);
			СтрокаФиксированнойВерсии.Идентификаторы = Идентификаторы;
			Продолжить;
		КонецЕсли;
		
		СтрокаФиксированнойВерсии = СтрокиФиксированныхВерсий[0];
		
		Если СтрокаФиксированнойВерсии.Идентификаторы.Количество() = 0 Тогда
			Продолжить;
		ИначеЕсли Идентификаторы.Количество() = 0 Тогда
			СтрокаФиксированнойВерсии.Идентификаторы = Новый Массив;
		Иначе
			Для Каждого ДобавляемыйИдентификатор Из Идентификаторы Цикл
				Если СтрокаФиксированнойВерсии.Идентификаторы.Найти(ДобавляемыйИдентификатор) = Неопределено Тогда
					СтрокаФиксированнойВерсии.Идентификаторы.Добавить(ДобавляемыйИдентификатор);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	ФиксированныеВерсии.Сортировать("Классификатор, Версия");
	
	КлассификаторыФиксированныхВерсий = ФиксированныеВерсии.Скопировать();
	КлассификаторыФиксированныхВерсий.Свернуть("Классификатор");
	
	мРеквизитыНаименованияПоУмолчанию = Новый Массив;
	мРеквизитыНаименованияПоУмолчанию.Добавить("НаименованиеПолное");
	мРеквизитыНаименованияПоУмолчанию.Добавить("ПолноеНаименование");
	мРеквизитыНаименованияПоУмолчанию.Добавить("Наименование");
	
	Для Каждого Классификатор Из КлассификаторыФиксированныхВерсий.ВыгрузитьКолонку("Классификатор") Цикл
		
		ПараметрыСправочника = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьПараметрыСправочникаЕГИСЗ(Классификатор);
		МенеджерСправочника = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПараметрыСправочника.ПолноеНаименование);
		
		Если ПараметрыСправочника.Свойство("ВидКлассификатора") Тогда
			ВидКлассификатора = ПараметрыСправочника.ВидКлассификатора;
		Иначе
			ВидКлассификатора = Неопределено;
		КонецЕсли;
		
		Для Каждого СтрокаВерсииКлассификатора Из ФиксированныеВерсии.НайтиСтроки(Новый Структура("Классификатор", Классификатор)) Цикл
			
			Версия = СтрокаВерсииКлассификатора.Версия;
			
			Если ПараметрыСправочника.Свойство("ВидКлассификатора") Тогда
				ИменаРеквизитовДляDisplayNameИCode = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьИменаРеквизитовКлассификатораПоВидуКлассификатора(ВидКлассификатора, Версия);
			Иначе
				ИменаРеквизитовДляDisplayNameИCode = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьИменаРеквизитовКлассификатора(Классификатор, Версия);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ВидКлассификатора) Тогда
				ТаблицаКлассификатора = ЗагрузкаКлассификаторовНСИЕГИСЗ.ЗапроситьКлассификатор(Классификатор, Версия, МенеджерСправочника, ВидКлассификатора);
			Иначе
				ТаблицаКлассификатора = ЗагрузкаКлассификаторовНСИЕГИСЗ.ЗапроситьКлассификатор(Классификатор, Версия, МенеджерСправочника);
			КонецЕсли;
			
			ИмяСвойства = Неопределено;
			ПоАтрибуту = Ложь;
			Если ИменаРеквизитовДляDisplayNameИCode.Свойство("Name") Тогда
				ИмяСвойства = ИменаРеквизитовДляDisplayNameИCode.Name;
				ПоАтрибуту = ИменаРеквизитовДляDisplayNameИCode.Свойство("ЭтоКлючАтрибута_Name") И ИменаРеквизитовДляDisplayNameИCode.ЭтоКлючАтрибута_Name;
			КонецЕсли;
			
			НачатьТранзакцию();
			КоличествоДобавленных = 0;
			
			Для Каждого СтрокаКлассификатора Из ТаблицаКлассификатора Цикл
				
				Если СтрокаВерсииКлассификатора.Идентификаторы.Количество() > 0
					И СтрокаВерсииКлассификатора.Идентификаторы.Найти(СтрокаКлассификатора.УИДЕГИСЗ) = Неопределено
				Тогда
					Продолжить;
				КонецЕсли;
				
				НаименованиеЭлемента = Неопределено;
				Если ИмяСвойства = Неопределено Тогда
					Для Каждого РеквизитПоУмолчанию Из мРеквизитыНаименованияПоУмолчанию Цикл
						Попытка
							НаименованиеЭлемента = СтрокаКлассификатора[РеквизитПоУмолчанию];
						Исключение КонецПопытки;
						Если ЗначениеЗаполнено(НаименованиеЭлемента) Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
				ИначеЕсли ПоАтрибуту Тогда
					СтрокаАтрибута = СтрокаКлассификатора.Атрибуты.Найти(ИмяСвойства, "Ключ");
					Если СтрокаАтрибута <> Неопределено
						И ЗначениеЗаполнено(СтрокаАтрибута.Значение)
					Тогда
						НаименованиеЭлемента = СтрокаАтрибута.Значение;
					КонецЕсли;
				Иначе
					Попытка
						НаименованиеЭлемента = СтрокаКлассификатора[ИмяСвойства];
					Исключение КонецПопытки;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(НаименованиеЭлемента) Тогда
					Продолжить;
				КонецЕсли;
				
				МЗ = РегистрыСведений.НаименованияЭлементовФиксированныхВерсийКлассификаторовЕГИСЗ.СоздатьМенеджерЗаписи();
				МЗ.УИДЕГИСЗ = СтрокаКлассификатора.УИДЕГИСЗ;
				МЗ.OIDКлассификатора = Классификатор;
				МЗ.ВерсияКлассификатора = Версия;
				МЗ.Наименование = НаименованиеЭлемента;
				МЗ.Записать();
				
				КоличествоДобавленных = КоличествоДобавленных + 1;
				Если КоличествоДобавленных = 500 Тогда
					КоличествоДобавленных = 0;
					ЗафиксироватьТранзакцию();
					НачатьТранзакцию();
				КонецЕсли;
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция НаименованиеВидаДокумента(ВидДокумента) Экспорт
	
	НаименованиеВидаДокумента = "";
	
	Если ЗначениеЗаполнено(ВидДокумента) Тогда
		Если ЗначениеЗаполнено(ВидДокумента.НаименованиеПолное) Тогда
			НаименованиеВидаДокумента = ВидДокумента.НаименованиеПолное;
		Иначе
			НаименованиеВидаДокумента = Строка(ВидДокумента);
		КонецЕсли;
	КонецЕсли;
	
	Возврат НаименованиеВидаДокумента;
	
КонецФункции

Функция ПолучитьНаименованиеОбъектаЭМД(Документ, ДополнительныеПараметры) Экспорт
	
	ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(Документ);
	
	Если ИмяТипаДокумента = "Документ.Прием" Тогда
		
		Если ДополнительныеПараметры.Свойство("ШаблонПриема")
			И ЗначениеЗаполнено(ДополнительныеПараметры.ШаблонПриема)
			И ДопСерверныеФункции.ИмяСсылочногоТипа(ДополнительныеПараметры.ШаблонПриема) = "Справочник.ШаблоныHTML"
		Тогда
			Возврат ДополнительныеПараметры.ШаблонПриема.Наименование;
		КонецЕсли;
		
	ИначеЕсли ИмяТипаДокумента = "Документ.ПрохождениеМедосмотра" Тогда
		
		Если ДополнительныеПараметры.Свойство("ШаблонОсмотра") Тогда
			Если ЗначениеЗаполнено(ДополнительныеПараметры.ШаблонОсмотра)
				И ДопСерверныеФункции.ИмяСсылочногоТипа(ДополнительныеПараметры.ШаблонОсмотра) = "Справочник.ШаблоныHTML"
			Тогда
				Возврат ДополнительныеПараметры.ШаблонОсмотра.Наименование;
			КонецЕсли;
		ИначеЕсли ДополнительныеПараметры.Свойство("ПриказВредныйФактор") Тогда
			Если ЗначениеЗаполнено(ДополнительныеПараметры.ПриказВредныйФактор) Тогда
				НаименованиеОбъектаЭМД = ОбщегоНазначенияБИТКлиентСервер.СвойствоОбъекта(ДополнительныеПараметры.ПриказВредныйФактор, "НаименованиеПолное");
				Если Не ЗначениеЗаполнено(НаименованиеОбъектаЭМД) Тогда
					НаименованиеОбъектаЭМД = ОбщегоНазначенияБИТКлиентСервер.СвойствоОбъекта(ДополнительныеПараметры.ПриказВредныйФактор, "Наименование");
				КонецЕсли;
				Если Не ЗначениеЗаполнено(НаименованиеОбъектаЭМД) Тогда
					НаименованиеОбъектаЭМД = Строка(ДополнительныеПараметры.ПриказВредныйФактор);
				КонецЕсли;
				Возврат НаименованиеОбъектаЭМД;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИмяТипаДокумента = "Документ.Рецепт" Тогда
		Если ДополнительныеПараметры.Свойство("ФормаРецепта") Тогда
			Возврат Строка(ДополнительныеПараметры.ФормаРецепта);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РекурсивныйОбходXMLДляLocalid(XML, СписокLocalid, ТаблицаПараметров, Индекс = 0, РодительскийУзел = Неопределено)
	
	СписокУзлов = XML.ДочерниеУзлы;
	Для Каждого Узел Из СписокУзлов Цикл
		
		Если ТипЗнч(Узел) <> Тип("ЭлементDOM")
			Или Узел.РодительскийУзел.ИмяУзла = "bitDiagnosis"
		Тогда
			Продолжить;
		КонецЕсли;
		
		ТекущийLocalId = Узел.ПолучитьАтрибут("localid");
		СвойстваУзла = ПолучитьСвойстваУзлаТела(Узел, ТекущийLocalId, ТаблицаПараметров);
		СтруктураТекущегоУзла = ПолучитьСтруктуруТекущегоУзла(Узел, РодительскийУзел, СвойстваУзла);
		
		ДобавитьLocalid(СписокLocalid, ТекущийLocalId, СтруктураТекущегоУзла, Индекс);
		РекурсивныйОбходXMLДляLocalid(Узел, СписокLocalid, ТаблицаПараметров, Индекс, СтруктураТекущегоУзла);
	КонецЦикла;
	
КонецФункции

Процедура ДобавитьLocalid(СписокLocalid, ТекущийLocalId, СтруктураТекущегоУзла, Индекс)
	
	ТекущийУзел = СтруктураТекущегоУзла.Узел;
	
	// Классификация
	Если ЗначениеЗаполнено(ТекущийLocalId) И СтрНайти(ТекущийLocalId, ".КлассификацияПоля") <> 0 Тогда
		ОбработатьКлассификациюПоля(СписокLocalid, СтруктураТекущегоУзла, ТекущийLocalId);
		Возврат;
	КонецЕсли;
	
	LocalidУзла = ПолучитьLocalidУзла(ТекущийLocalId, ТекущийУзел, СписокLocalid);
	Если LocalidУзла = Неопределено
		Или ЗарезервированныйLocalid(LocalidУзла) // TODO: Возможно стоит исключать в СписокLocalidМакета по условию "ИсключитьНеотображаемые"
	Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеLocalid = СписокLocalid.Получить(LocalidУзла);
	Если ДанныеLocalid = Неопределено Тогда
		// Новый Localid
		ОбработатьДанныеНовогоLocalid(ДанныеLocalid, СписокLocalid, LocalidУзла, СтруктураТекущегоУзла);
	Иначе
		Попытка
			СинонимИзАтрибута = СтруктураТекущегоУзла.Узел.ПолучитьАтрибут("localidСиноним");
			Если ЗначениеЗаполнено(СинонимИзАтрибута) Тогда
				ДанныеLocalid.Представление = СинонимИзАтрибута;
			КонецЕсли;
		Исключение КонецПопытки;
		ДанныеLocalid.НеОтображатьВШаблоне = ДанныеLocalid.НеОтображатьВШаблоне Или СтруктураТекущегоУзла.СвойстваУзла.НеОтображатьВШаблоне;
	КонецЕсли;
	
	// Группирующее поле. Если localid является дочерним у множественного - надо запомнить родителя.
	ОбновитьРодителейУзла(ДанныеLocalid, СписокLocalid, LocalidУзла, СтруктураТекущегоУзла);
	
	// Секция
	Секция = ПолучитьСекциюУзла(СтруктураТекущегоУзла);
	Если ЗначениеЗаполнено(Секция) Тогда
		ДобавитьМассивВСтруктуруLocalid(ДанныеLocalid, "Секция", Секция);
	КонецЕсли;
	
	// Классификатор и тип
	ЗначениеКлассификатора = ПолучитьЗначениеАтрибутаУзла(ТекущийУзел, "codesystem");
	Если Не ЗначениеЗаполнено(ЗначениеКлассификатора)
		Или ЗначениеКлассификатора = "#codesystem"
	Тогда
		ЗначениеКлассификатора = ПолучитьЗначениеАтрибутаУзла(ТекущийУзел, "классификация");
		Если Лев(ЗначениеКлассификатора, 1) = "*" Тогда
			ЗначениеКлассификатора = ВычислитьФункцию(ЗначениеКлассификатора);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначениеКлассификатора) Тогда
		Если НРег(ЗначениеКлассификатора) = "#codesystem" Тогда
			// Если атрибут Классификация="#codesystem"
			ДобавитьМассивВСтруктуруLocalid(ДанныеLocalid, "ТипДанных", ТипДанныхИзXML("CD"));
			ДобавитьИндексВСтруктуруLocalid(ДанныеLocalid, Индекс);
		ИначеЕсли ТекущийУзел.ИмяУзла <> "translation" Или ПолучитьЗначениеАтрибутаУзла(ТекущийУзел, "ТипДанных") = Неопределено Тогда // TODO: сделать понадёжней
			// Это узел поля ссылки на классификатор минздрава - фиксируем его тип.
			ДанныеLocalid.Вставить("Классификатор", ЗначениеКлассификатора);
			ДобавитьИндексВСтруктуруLocalid(ДанныеLocalid, Индекс);
		КонецЕсли;
	КонецЕсли;
	
	// Множественное
	Если СтруктураТекущегоУзла.СвойстваУзла.Множественное Тогда
		ДанныеLocalid.Вставить("Множественное", Истина);
	КонецЕсли;
	
	// TODO: Пока такого не встречалось, номожет вознкнуть такая ситуация:
	//	localid имеет 2 родителей в разных секциях (напр. Штрихкод в лаб. иссл)
	//		В первом он обязательный, во втором - нет. Нужно, чтобы в ДанныеLocalid попало Истина
	//	При этом как и сейчас нужно в случае, когда, например, в ДанныеLocalid уже есть обязательный localid
	//		(узел описывает наличие внутри localid, но не указывает, обязательный ли он), а внутри
	//		оказывается, что он не обязателен - нужно, чтобы в ДанныеLocalid Истина заменился на Ложь
	
	// Обязательное
	Если СтруктураТекущегоУзла.СвойстваУзла.Обязательное
		И (Не ЗначениеЗаполнено(СтруктураТекущегоУзла.СвойстваУзла.ЗначениеПустогоЗначения)
			Или ТекущийУзел.ПолучитьАтрибут("СохранятьДочерниеУзлы") <> Неопределено)
		И Не УзелИмеетНеобязательногоПредка(СтруктураТекущегоУзла)
	Тогда
		ДанныеLocalid.Вставить("Обязательное", Истина);
	Иначе
		ДанныеLocalid.Вставить("Обязательное", Ложь);
	КонецЕсли;
	
	// Тип
	ЗначенияТипов = ПолучитьЗначениеАтрибутаУзла(ТекущийУзел, "типданных");
	Если Не ЗначениеЗаполнено(ЗначенияТипов) Тогда
		ЗначенияТипов = ПолучитьЗначениеАтрибутаУзла(ТекущийУзел, "xsi:type");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначенияТипов) И ЗначенияТипов <> "CD" Тогда
		Для Каждого ЗначениеТипа Из СтрРазделить(ЗначенияТипов, ",", Ложь) Цикл
			ДобавитьМассивВСтруктуруLocalid(ДанныеLocalid, "ТипДанных", ТипДанныхИзXML(СокрЛП(ЗначениеТипа)));
		КонецЦикла;
		ДобавитьИндексВСтруктуруLocalid(ДанныеLocalid, Индекс);
	КонецЕсли;
	
	// ДопустимыеЗначения
	Если ЗначениеЗаполнено(СтруктураТекущегоУзла.СвойстваУзла.ДопустимыеЗначения) Тогда
		ДопустимыеЗначения = Новый Массив;
		Для Каждого стрДопустимоеЗначение Из СтрРазделить(СтруктураТекущегоУзла.СвойстваУзла.ДопустимыеЗначения, ";") Цикл
			ДопустимыеЗначения.Добавить(Число(стрДопустимоеЗначение));
		КонецЦикла;
	Иначе
		ДопустимыеЗначения = Неопределено;
	КонецЕсли;
	
	ДанныеLocalid.Вставить("ДопустимыеЗначения", ДопустимыеЗначения);
	
	Если ДанныеLocalid.Обязательное Тогда
		ДанныеLocalid.Вставить("УсловиеОбязательное", ПолучитьУсловиеОбязательного(ТекущийУзел));
	Иначе
		ДанныеLocalid.Вставить("УсловиеОбязательное", Неопределено);
	КонецЕсли;
	
	АтрибутыИсточниковЗаполнений = Новый Соответствие;
	АтрибутыИсточниковЗаполнений.Вставить("ВозможноЗаполнениеИзТаблицыДиагнозов", ИсточникЗаполненияПоДиагнозам());
	
	ИсточникЗаполнения = Неопределено;
	Узел = ТекущийУзел;
	Пока Узел <> Узел.ДокументВладелец Цикл
		Для Каждого КлючЗначение Из АтрибутыИсточниковЗаполнений Цикл
			Если Узел.ПолучитьАтрибут(КлючЗначение.Ключ) <> Неопределено Тогда
				ИсточникЗаполнения = КлючЗначение.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗначениеЗаполнено(ИсточникЗаполнения) Тогда
			Прервать;
		КонецЕсли;
		Узел = Узел.РодительскийУзел;
	КонецЦикла;
	
	ДанныеLocalid.Вставить("ИсточникЗаполнения", ИсточникЗаполнения);
	
КонецПроцедуры

Функция ПолучитьУсловиеОбязательного(Узел)
	
	Если ТипЗнч(Узел) = Тип("ЭлементDOM")
		И Узел.ЕстьАтрибут("УсловиеОбязательное")
	Тогда
		Возврат Узел.ПолучитьАтрибут("УсловиеОбязательное");
	КонецЕсли;
	
	Если Узел.РодительскийУзел <> Неопределено Тогда
		Возврат ПолучитьУсловиеОбязательного(Узел.РодительскийУзел);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОбновитьРодителейУзла(ДанныеLocalid, СписокLocalid, LocalidУзла, СтруктураТекущегоУзла)
	
	РодительУзла = СтруктураТекущегоУзла.РодительскийУзел;
	Пока РодительУзла <> Неопределено Цикл
		Если РодительУзла.СвойстваУзла.Множественное Тогда
			
			LocalidРодителя = СписокLocalid.Получить(РодительУзла.СвойстваУзла.localid);
			Если LocalidРодителя <> Неопределено И LocalidУзла <> LocalidРодителя.localid Тогда
				ДобавитьМассивВСтруктуруLocalid(ДанныеLocalid, "Родитель", LocalidРодителя);
			КонецЕсли;
			Возврат;
		КонецЕсли;
		РодительУзла = РодительУзла.РодительскийУзел;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСекциюУзла(СтруктураТекущегоУзла)
	
	УзелСекции = Неопределено;
	РодительУзла = СтруктураТекущегоУзла.РодительскийУзел;
	Пока РодительУзла <> Неопределено Цикл
		Если НРег(РодительУзла.Узел.ИмяУзла) = "section" Тогда
			УзелСекции = РодительУзла.Узел;
			Прервать;
		КонецЕсли;
		
		РодительУзла = РодительУзла.РодительскийУзел;
	КонецЦикла;
	
	ИмяСекцииУзла = Неопределено;
	ПустойУзелНаполненияОтсутствует = Истина;
	
	Если УзелСекции <> Неопределено Тогда
		Для Каждого ДочернийУзелСекции Из УзелСекции.ДочерниеУзлы Цикл
			Если ИмяСекцииУзла = Неопределено
				И Нрег(ДочернийУзелСекции.ИмяУзла) = "code"
				И ЭтоOIDСправочникаСекций(ПолучитьЗначениеАтрибутаУзла(ДочернийУзелСекции, "codeSystem"))
			Тогда
				ИмяСекцииУзла = ПолучитьЗначениеАтрибутаУзла(ДочернийУзелСекции, "code");
			КонецЕсли;
			Если Нрег(ДочернийУзелСекции.ИмяУзла) = "text"
				И Не ЗначениеЗаполнено(ДочернийУзелСекции.ТекстовоеСодержимое)
			Тогда
				ПустойУзелНаполненияОтсутствует = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ПустойУзелНаполненияОтсутствует Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ИмяСекцииУзла;
	
КонецФункции

Процедура ОбработатьДанныеНовогоLocalid(ДанныеLocalid, СписокLocalid, LocalidУзла, СтруктураТекущегоУзла)
	
	Синоним = ПолучитьЗначениеАтрибутаУзла(СтруктураТекущегоУзла.Узел, "localidСиноним");
	Если Не ЗначениеЗаполнено(Синоним) Тогда
		Синоним = РазбитьСоставноеСлово(LocalidУзла);
	КонецЕсли;
	
	ДанныеLocalid = Новый Структура("localid, Представление, НеОтображатьВШаблоне", LocalidУзла, Синоним, СтруктураТекущегоУзла.СвойстваУзла.НеОтображатьВШаблоне);
	СписокLocalid.Вставить(LocalidУзла, ДанныеLocalid);
	
КонецПроцедуры

Процедура ОбработатьКлассификациюПоля(СписокLocalid, СтруктураТекущегоУзла, ТекущийLocalId)
	
	LocalidУзла = СтрРазделить(ТекущийLocalId, ".")[0];
	ДанныеLocalid = СписокLocalid.Получить(LocalidУзла);
	Если ДанныеLocalid = Неопределено Тогда
		СвойстваУзла = ПолучитьСвойстваУзлаТела(СтруктураТекущегоУзла.Узел, LocalidУзла);
		СтруктураТекущегоУзла = ПолучитьСтруктуруТекущегоУзла(СтруктураТекущегоУзла.Узел, СтруктураТекущегоУзла, СвойстваУзла);
		ОбработатьДанныеНовогоLocalid(ДанныеLocalid, СписокLocalid, LocalidУзла, СтруктураТекущегоУзла);
	КонецЕсли;
	Если ДанныеLocalid = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДанныеLocalid.Вставить("КлассификацияПоля", ПолучитьЗначениеАтрибутаУзла(СтруктураТекущегоУзла.Узел, "codesystem"));
	
	ДопустимыеКлассификации = Новый Массив;
	ДопустимыеЗначения = ПолучитьЗначениеАтрибутаУзла(СтруктураТекущегоУзла.Узел, "ДопустимыеЗначения");
	
	Если ДопустимыеЗначения <> Неопределено Тогда
		Для Каждого стрДопустимоеЗначение Из СтрРазделить(СтруктураТекущегоУзла.СвойстваУзла.ДопустимыеЗначения, ";") Цикл
			ДопустимыеКлассификации.Добавить(Число(стрДопустимоеЗначение));
		КонецЦикла;
		ДанныеLocalid.Вставить("ДопустимыеКлассификации", ДопустимыеКлассификации);
	КонецЕсли;
	
КонецПроцедуры

Функция УзелИмеетНеобязательногоПредка(СтруктураТекущегоУзла)
	
	РодительУзла = СтруктураТекущегоУзла.РодительскийУзел;
	Пока РодительУзла <> Неопределено Цикл
		Если Не РодительУзла.СвойстваУзла.Обязательное Тогда
			Возврат Истина;
		КонецЕсли;
		РодительУзла = РодительУзла.РодительскийУзел;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьLocalidУзла(ТекущийLocalId, ТекущийУзел, СписокLocalid)
	
	LocalidУзла = Неопределено;
	
	Если ЗначениеЗаполнено(ТекущийLocalId) Тогда
		LocalidУзла = СтрРазделить(ТекущийLocalId, ".")[0];
	Иначе
		ЗначениеValue = ПолучитьЗначениеАтрибутаУзла(ТекущийУзел, "value");
		Если ЗначениеЗаполнено(ЗначениеValue)
			И СтрРазделить(ЗначениеValue, ".").Количество() = 1
		Тогда
			Если Лев(ЗначениеValue, 1) = "%" Тогда
				LocalidУзла = СтрРазделить(ЗначениеValue, "%")[1];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат LocalidУзла;
	
КонецФункции

Функция ПолучитьЗначениеАтрибутаУзла(Узел, ИмяАтрибута)
	
	Для Каждого Атрибут Из Узел.Атрибуты Цикл
		Если НРег(Атрибут.ИмяУзла) = НРег(ИмяАтрибута) Тогда
			Возврат Атрибут.ЗначениеУзла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьКорректныеCodeSystem(ВидРЭМД)
	
	ТабДокумент = Справочники.РегистрируемыеЭлектронныеМедДокументы.ПолучитьМакет("КорректныеCodeSystem");
	
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДокумент.Область(1, 1, ТабДокумент.ВысотаТаблицы, ТабДокумент.ШиринаТаблицы));
	ПостроительОтчета.Выполнить();
	
	ВсеКорректныеCodeSystem = ПостроительОтчета.Результат.Выгрузить();
	КорректныеCodeSystem = ВсеКорректныеCodeSystem.СкопироватьКолонки();
	
	Для Каждого СтрокаКорректногоCodeSystem Из ВсеКорректныеCodeSystem.НайтиСтроки(Новый Структура("ВидРЭМД", ВидРЭМД)) Цикл
		ЗаполнитьЗначенияСвойств(КорректныеCodeSystem.Добавить(), СтрокаКорректногоCodeSystem);
	КонецЦикла;
	
	Возврат КорректныеCodeSystem;
	
КонецФункции

Процедура УбратьПространствоИменДляВалидации(ТекстXML)
	
	// TODO: заменить на что-то более надёжное
	ТекстXML = СтрЗаменить(ТекстXML, "xmlns=""urn:hl7-org:v3""", "");
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПараметровПоПриему(ТаблицаПараметров, Ссылка, КонстантыCDAДокумента, СоответствияПараметрам, ДополнительныеПараметры)
	
	СоответствияПараметрам = ДополнительныеПараметры.ШаблонОсмотра.СоответствияПараметрам.Выгрузить();
	
	Если ДополнительныеПараметры.ПараметрыШаблона = Неопределено Тогда
		ДополнительныеПараметры.ПараметрыШаблона = ПолучитьСтруктуруТаблицПараметровШаблона();
	КонецЕсли;
	
	ПараметрыЭталонныхСтрок = РаботаСШаблонамиHTML.ПараметрыЭталонныхСтрокВсехТаблицШаблона(ДополнительныеПараметры.ШаблонОсмотра.ТекстHTML);
	ПараметрыТаблицИнтерфейсов = РаботаСИнтерфейсамиЗаполненияПараметров.ПараметрыТаблицВсехИнтерфейсовШаблона(ДополнительныеПараметры.ШаблонОсмотра.ТекстHTML);
	
	НаборЗаписей = РегистрыСведений.ЗначенияПараметровHTML.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	НаборЗаписей.Отбор.ИндексШаблона.Установить(ДополнительныеПараметры.ИндексШаблона);
	НаборЗаписей.Прочитать();
	
	ОтсортированнаяТаблицаЗаписей = СортировкаНабораЗаписейЗначенияПараметровHTML(НаборЗаписей.Выгрузить(), СоответствияПараметрам);
	
	Для Каждого Запись Из ОтсортированнаяТаблицаЗаписей Цикл
		
		Если ПараметрыЭталонныхСтрок.Найти(Запись.Параметр) <> Неопределено
			Или ПараметрыТаблицИнтерфейсов.Найти(Запись.Параметр) <> Неопределено
		Тогда
			Продолжить;
		КонецЕсли;
		
		//ВидШаблона = Ссылка.ШаблоныПриема[Запись.ИндексШаблона].ШаблонПриема;
		ФорматнаяСтрока = Запись.Параметр.ФорматнаяСтрока;
		
		НоваяСтрока = ТаблицаПараметров.Добавить();
		НоваяСтрока.Параметр					= Запись.Параметр;
		НоваяСтрока.ИдентификаторСтрокиШаблона	= Запись.ИндексШаблона;
		
		Если ТипЗнч(Запись.Значение) = Тип("СправочникСсылка.СтрокиЭМКНеограниченнойДлины") Тогда
			НоваяСтрока.Значение = Запись.Значение.Значение;
		Иначе
			НоваяСтрока.Значение = Запись.Значение;
		КонецЕсли;
		
		СтрокаПараметра = ДополнительныеПараметры.ПараметрыШаблона.ЗначенияПараметровHTML.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПараметра, Запись);
		
		СтрокаПараметра.ИдентификаторСтрокиШаблона	= Запись.ИндексШаблона;
		СтрокаПараметра.Значение					= НоваяСтрока.Значение;
		СтрокаПараметра.Представление				= РаботаСШаблонамиHTMLКлиентСервер.ПолучитьПредставлениеПараметра(СтрокаПараметра, ФорматнаяСтрока);
		СтрокаПараметра.СтрокаУидПараметра			= Строка(СтрокаПараметра.Параметр.УникальныйИдентификатор());
		
	КонецЦикла;
	
	НаборЗаписей = РегистрыСведений.ДанныеТаблицШаблоновПриема.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Ссылка);
	НаборЗаписей.Отбор.ИндексШаблона.Установить(ДополнительныеПараметры.ИндексШаблона);
	НаборЗаписей.Прочитать();
	
	ОтсортированнаяСтрокиДанныхТаблиц = СортировкаНабораЗаписейДанныеТаблицШаблоновПриема(НаборЗаписей.Выгрузить(), СоответствияПараметрам);
	
	Для Каждого Запись Из ОтсортированнаяСтрокиДанныхТаблиц Цикл
		
		ФорматнаяСтрока = Запись.Параметр.ФорматнаяСтрока;
		
		НоваяСтрока = ТаблицаПараметров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись, "Параметр,ТаблицаШаблонов,НомерСтрокиТаблицы,ИдентификаторСтроки,ИдентификаторРодительскойСтроки");
		НоваяСтрока.ИдентификаторСтрокиШаблона = Запись.ИндексШаблона;
		
		Если ТипЗнч(Запись.Значение) = Тип("СправочникСсылка.СтрокиЭМКНеограниченнойДлины") Тогда
			НоваяСтрока.Значение = Запись.Значение.Значение;
		Иначе
			НоваяСтрока.Значение = Запись.Значение;
		КонецЕсли;
		
		СтрокаПараметраТаблицШаблонов = ДополнительныеПараметры.ПараметрыШаблона.ДанныеТаблицШаблоновПриема.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаПараметраТаблицШаблонов, Запись);
		
		СтрокаПараметраТаблицШаблонов.ИдентификаторСтрокиШаблона	= Запись.ИндексШаблона;
		СтрокаПараметраТаблицШаблонов.ИдентификаторТаблицы			= Строка(Запись.ТаблицаШаблонов.УникальныйИдентификатор());
		СтрокаПараметраТаблицШаблонов.Значение						= НоваяСтрока.Значение;
		СтрокаПараметраТаблицШаблонов.Представление					= РаботаСШаблонамиHTMLКлиентСервер.ПолучитьПредставлениеПараметра(СтрокаПараметраТаблицШаблонов, ФорматнаяСтрока);
		
	КонецЦикла;
	
	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Врач, "Сотрудник");
	
	КонстантыCDAДокумента = ПолучитьКонстантыПоШаблону(ДополнительныеПараметры.ШаблонОсмотра, ТаблицаПараметров, Ссылка, ДополнительныеПараметры.ИндексШаблона);
	
	Если ДополнительныеПараметры.ШаблонОсмотра.ЗаполнятьДиагнозыИзТабличнойЧасти Тогда
		ЗаполнитьПараметрыДиагнозовПоТабличнойЧастиПриема(Ссылка, ТаблицаПараметров, ДополнительныеПараметры.ШаблонОсмотра.ВидДокумента, СоответствияПараметрам, КонстантыCDAДокумента);
	КонецЕсли;
	
КонецПроцедуры

Функция СортировкаНабораЗаписейДанныеТаблицШаблоновПриема(ТаблицаНаборЗаписей, СоответствияПараметрам)
	
	ТаблицаРезультат = ТаблицаНаборЗаписей.СкопироватьКолонки();
	
	УникальныеСтроки = Новый Массив;
	Для Каждого НЗ Из ТаблицаНаборЗаписей Цикл
		Если УникальныеСтроки.Найти(НЗ.ИдентификаторСтроки) = Неопределено Тогда
			УникальныеСтроки.Добавить(НЗ.ИдентификаторСтроки);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УникальнаяСтрока Из УникальныеСтроки Цикл
		Для Каждого СоответствиеПараметров Из СоответствияПараметрам Цикл
			Для Каждого НЗ Из ТаблицаНаборЗаписей.НайтиСтроки(Новый Структура("Параметр, ИдентификаторСтроки", СоответствиеПараметров.Параметр, УникальнаяСтрока)) Цикл
				СтрокаРезультат = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРезультат, НЗ);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаРезультат; 
	
КонецФункции

Функция СортировкаНабораЗаписейЗначенияПараметровHTML(ТаблицаНаборЗаписей, СоответствияПараметрам)
	
	ТаблицаРезультат = ТаблицаНаборЗаписей.СкопироватьКолонки();
	Для Каждого СоответствиеПараметров Из СоответствияПараметрам Цикл
		Для Каждого НЗ Из ТаблицаНаборЗаписей.НайтиСтроки(Новый Структура("Параметр", СоответствиеПараметров.Параметр)) Цикл
			СтрокаРезультат = ТаблицаРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезультат, НЗ);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ТаблицаРезультат; 
	
КонецФункции

Процедура ЗаполнитьПараметрыДиагнозовПоТабличнойЧастиПриема(Ссылка, ТаблицаПараметров, ВидДокумента, СоответствияПараметрам, КонстантыCDAДокумента)
	
	Попытка
		ДокументXML = ПолучитьXML(ПолучитьМакетСправочникаПоВидуДокумента(ВидДокумента));
		УзлыОписанияДиагнозов = ДокументXML.ПолучитьЭлементыПоИмени("bitDiagnosis");
	Исключение
		Возврат;
	КонецПопытки;
	
	Если УзлыОписанияДиагнозов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаДиагнозовПриема = ПолучитьТаблицуДиагнозовПоТабличнойЧасти(Ссылка);
	СгруппированныеСтроки = Новый Соответствие;
	
	Для Каждого УзелСтруктурыДиагноза Из УзлыОписанияДиагнозов[0].ДочерниеУзлы Цикл
		ЗаполнитьПараметрыДиагнозовПоУзлуСтруктурыДиагноза(УзелСтруктурыДиагноза, ТаблицаДиагнозовПриема, СгруппированныеСтроки, ТаблицаПараметров, СоответствияПараметрам, КонстантыCDAДокумента);
	КонецЦикла;
	
	Для Каждого КлючЗначение Из СгруппированныеСтроки Цикл
		ГруппирующаяСтрока = КлючЗначение.Ключ;
		Для Каждого СгруппированнаяСтрока Из КлючЗначение.Значение Цикл
			СгруппированнаяСтрока.ГруппирующееПоле = ТаблицаПараметров.Индекс(ГруппирующаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуДиагнозовПоТабличнойЧасти(Ссылка)
	
	тзДиагнозы = Новый ТаблицаЗначений;
	тзДиагнозы.Колонки.Добавить("СтепеньОбоснованности",	Новый ОписаниеТипов("СправочникСсылка.КлассификаторыМинЗдрава"));
	тзДиагнозы.Колонки.Добавить("УточнениеХарактера",		Новый ОписаниеТипов("СправочникСсылка.КлассификаторыМинЗдрава"));
	тзДиагнозы.Колонки.Добавить("ВидНозологическойЕдиницы",	Новый ОписаниеТипов("СправочникСсылка.КлассификаторыМинЗдрава"));
	тзДиагнозы.Колонки.Добавить("Описание",					Новый ОписаниеТипов("Строка"));
	тзДиагнозы.Колонки.Добавить("Диагноз",					Новый ОписаниеТипов("СправочникСсылка.Диагнозы"));
	
	ОсновнойДиагноз = МедицинскаяДеятельность.ОсновнойДиагнозПриема(Ссылка,, Новый Структура("Классификация3", ОбщегоНазначенияБИТКлиентСервер.НовыйМассив(Перечисления.КлассификацииДиагнозов.ОсновноеЗаболевание)));
	Если Не ЗначениеЗаполнено(ОсновнойДиагноз) Тогда
		Возврат тзДиагнозы;
	КонецЕсли;
	
	ДиагнозыМКБС = Новый Массив;
	Если ОсновнойДиагноз.OIDСправочникаИсточника = Справочники.Диагнозы.OIDСправочникаМКБС() Тогда
		ДиагнозыМКБС.Добавить(ОсновнойДиагноз);
	КонецЕсли;
	
	ОстальныеДиагнозы = Новый Массив;
	Для Каждого СтрокаДиагнозаПриема Из Ссылка.Диагнозы Цикл
		Если ЗначениеЗаполнено(СтрокаДиагнозаПриема.Диагноз)
			И СтрокаДиагнозаПриема.Диагноз <> ОсновнойДиагноз
			И СтрокаДиагнозаПриема.Классификация3 <> Перечисления.КлассификацииДиагнозов.ОсновноеЗаболевание
		Тогда
			ОстальныеДиагнозы.Добавить(СтрокаДиагнозаПриема.Диагноз);
			Если СтрокаДиагнозаПриема.Диагноз.OIDСправочникаИсточника = Справочники.Диагнозы.OIDСправочникаМКБС() Тогда
				ДиагнозыМКБС.Добавить(СтрокаДиагнозаПриема.Диагноз);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ДиагнозыМКБ10 = Новый Соответствие;
	Если ДиагнозыМКБС.Количество() > 0 Тогда
		РодителиДиагнозовМКБС = Новый Массив;
		Для Каждого ДиагнозМКБС Из ДиагнозыМКБС Цикл
			РодительДиагноза = ДиагнозМКБС.Родитель;
			Пока ЗначениеЗаполнено(РодительДиагноза) Цикл
				Если РодителиДиагнозовМКБС.Найти(РодительДиагноза) = Неопределено Тогда
					РодителиДиагнозовМКБС.Добавить(РодительДиагноза);
				КонецЕсли;
				РодительДиагноза = РодительДиагноза.Родитель;
			КонецЦикла;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Диагнозы.Ссылка КАК Ссылка,
			|	СОКРЛП(Диагнозы.КодДиагноза) КАК КодДиагноза
			|ИЗ
			|	Справочник.Диагнозы КАК Диагнозы
			|ГДЕ
			|	Диагнозы.Родитель В(&РодителиДиагнозовМКБС)
			|	И Диагнозы.OIDСправочникаИсточника = &OIDСправочникаМКБ10";
		
		Запрос.УстановитьПараметр("РодителиДиагнозовМКБС", РодителиДиагнозовМКБС);
		Запрос.УстановитьПараметр("OIDСправочникаМКБ10", Справочники.Диагнозы.ПолучитьOIDСправочника());
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДиагнозыМКБ10.Вставить(Выборка.КодДиагноза, Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Если ОсновнойДиагноз.OIDСправочникаИсточника = Справочники.Диагнозы.OIDСправочникаМКБС() Тогда
		ОсновнойДиагнозМКБ10 = ПолучитьДиагнозМКБ10(ОсновнойДиагноз, ДиагнозыМКБ10);
	Иначе
		ОсновнойДиагнозМКБ10 = ОсновнойДиагноз;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОсновнойДиагнозМКБ10) Тогда
		// Вероятно некорректно загружены диагнозы из МКБ-10
		Возврат тзДиагнозы;
	КонецЕсли;
	
	СтепениОбоснованности					 = СтепениОбоснованностиДиагнозаПоКлассификатору();
	УточненияХарактера						 = УточненияХарактераДиагнозаПоКлассификатору();
	ВидыНозологическихЕдиницПоКлассификатору = ВидыНозологическихЕдиницПоКлассификатору();
	
	Для Каждого СтрокаДиагнозаПриема Из Ссылка.Диагнозы Цикл
		
		Если СтрокаДиагнозаПриема.Диагноз.OIDСправочникаИсточника = Справочники.Диагнозы.OIDСправочникаМКБС() Тогда
			Диагноз = ПолучитьДиагнозМКБ10(СтрокаДиагнозаПриема.Диагноз, ДиагнозыМКБ10);
		Иначе
			Диагноз = СтрокаДиагнозаПриема.Диагноз;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Диагноз) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДиагнозаПриема.Классификация3 = Перечисления.КлассификацииДиагнозов.ОсновноеЗаболевание
			И СтрокаДиагнозаПриема.Диагноз <> ОсновнойДиагноз
		Тогда
			Продолжить;
		КонецЕсли;
		
		СтепеньОбоснованности = ?(ЗначениеЗаполнено(СтрокаДиагнозаПриема.Классификация1), СтрокаДиагнозаПриема.Классификация1, Перечисления.КлассификацииДиагнозов.Предварительный);
		
		СтрокаДиагноза = тзДиагнозы.Добавить();
		СтрокаДиагноза.Диагноз					= Диагноз;
		СтрокаДиагноза.СтепеньОбоснованности	= СтепениОбоснованности.Получить(СтепеньОбоснованности);
		СтрокаДиагноза.УточнениеХарактера		= УточненияХарактера.Получить(СтрокаДиагнозаПриема.Классификация2);
		СтрокаДиагноза.ВидНозологическойЕдиницы	= ВидыНозологическихЕдиницПоКлассификатору.Получить(СтрокаДиагнозаПриема.Классификация3);
		СтрокаДиагноза.Описание					= СтрокаДиагнозаПриема.Детализация;
	КонецЦикла;
	
	Возврат тзДиагнозы;
	
КонецФункции

Процедура ЗаполнитьПараметрыДиагнозовПоУзлуСтруктурыДиагноза(УзелСтруктурыДиагноза, ТаблицаДиагнозовПриема, СгруппированныеСтроки, ТаблицаПараметров, СоответствияПараметрам, КонстантыCDAДокумента)
	
	АтрибутОбщейСтепениОбоснованности	= УзелСтруктурыДиагноза.ПолучитьАтрибут("ОбщаяСтепеньОбоснованности");
	АтрибутМножественностиДиагнозов		= УзелСтруктурыДиагноза.ПолучитьАтрибут("Множественное");
	АтрибутОтбора						= УзелСтруктурыДиагноза.ПолучитьАтрибут("Отбор");
	
	ОбщаяСтепеньОбоснованности	= АтрибутОбщейСтепениОбоснованности <> Неопределено И ВычислитьФункцию(АтрибутОбщейСтепениОбоснованности) = Истина;
	МножественныеДиагнозы		= АтрибутМножественностиДиагнозов <> Неопределено И ВычислитьФункцию(АтрибутМножественностиДиагнозов) = Истина;
	ГруппирующееПоле			= УзелСтруктурыДиагноза.ПолучитьАтрибут("ГруппирующееПоле");
	
	СтруктурыУзловДиагноза = СформироватьСтруктурыУзловДиагноза(УзелСтруктурыДиагноза);
	УдалитьСуществующиеСтрокиПараметровДиагнозов(СтруктурыУзловДиагноза, ТаблицаПараметров, СоответствияПараметрам, КонстантыCDAДокумента);
	ТаблицаНеобходимыхДиагнозов = ПолучитьТаблицуНеобходимыхДиагнозовПоОтбору(ТаблицаДиагнозовПриема.Скопировать(), АтрибутОтбора);
	
	// Отбираем те, у которых заполнены все обязательные реквизиты
	ТаблицаДиагнозов = ТаблицаНеобходимыхДиагнозов.СкопироватьКолонки();
	Для Каждого СтрокаДиагноза Из ТаблицаНеобходимыхДиагнозов Цикл
		ЗаполненыВсеОбязательные = Истина;
		Для Каждого СтруктураУзлаДиагноза Из СтруктурыУзловДиагноза Цикл
			Если СтруктураУзлаДиагноза.Значение.Обязательное
				И Не ЗначениеЗаполнено(СтрокаДиагноза[СтруктураУзлаДиагноза.Ключ])
			Тогда
				ЗаполненыВсеОбязательные = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ЗаполненыВсеОбязательные Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаДиагнозов.Добавить(), СтрокаДиагноза);
		КонецЕсли;
	КонецЦикла;
	
	// Если подходящих диагнозов несколько, но для СЭМДа требуется только один
	Если Не МножественныеДиагнозы
		И ТаблицаДиагнозов.Количество() > 1
	Тогда
		
		ОтобраннаяСтрокаДиагноза = Неопределено;
		// Основной в приоритете, если его нет среди отобранных - используется любой
		Для Каждого СтрокаДиагноза Из ТаблицаДиагнозов Цикл
			Если СтрокаДиагноза.ВидНозологическойЕдиницы = НозологическаяЕдиницаОсновногоДиагноза() Тогда
				ОтобраннаяСтрокаДиагноза = СтрокаДиагноза;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ОтобраннаяСтрокаДиагноза = Неопределено Тогда
			ОтобраннаяСтрокаДиагноза = ТаблицаДиагнозов[0];
		КонецЕсли;
		
		СтрокиКУдалению = Новый Массив;
		Для Каждого СтрокаТаблицы Из ТаблицаДиагнозов Цикл
			Если СтрокаТаблицы <> ОтобраннаяСтрокаДиагноза Тогда
				СтрокиКУдалению.Добавить(СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
			ТаблицаДиагнозов.Удалить(СтрокаКУдалению);
		КонецЦикла;
	КонецЕсли;
	
	Если ОбщаяСтепеньОбоснованности
		И СтруктурыУзловДиагноза.Получить("СтепеньОбоснованности") <> Неопределено
	Тогда
		// Оставляем строки только по одной степени
		СтепеньПредварительногоДиагноза = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(1, Перечисления.ВидыКлассификаторовМинЗдрава.СтепеньОбоснованностиДиагноза);
		СтрокиПредварительныхДиагнозов = ТаблицаДиагнозов.НайтиСтроки(Новый Структура("СтепеньОбоснованности", СтепеньПредварительногоДиагноза));
		Если ТаблицаДиагнозов.Количество() > СтрокиПредварительныхДиагнозов.Количество() Тогда
			// В приоритете заключительные
			Для Каждого СтрокаПредварительного Из СтрокиПредварительныхДиагнозов Цикл
				ТаблицаДиагнозов.Удалить(СтрокаПредварительного);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	УказанаОбщаяСтепеньОбоснованности = Ложь;
	
	// Добавление строк диагноза в таблицу параметров
	Для Каждого СтрокаДиагноза Из ТаблицаДиагнозов Цикл
		
		СтрокаГруппирующегоПоля = Неопределено;
		СтрокиПараметровДиагнозаДляГруппирующегоПоля = Новый Массив;
		Для Каждого СтруктураУзлаДиагноза Из СтруктурыУзловДиагноза Цикл
			
			Если СтруктураУзлаДиагноза.Ключ = "СтепеньОбоснованности"
				И ОбщаяСтепеньОбоснованности
			Тогда
				Если Не УказанаОбщаяСтепеньОбоснованности Тогда
					СтрокаПараметраДиагноза = ТаблицаПараметров.Добавить();
					СтрокаПараметраДиагноза.Значение = СтрокаДиагноза[СтруктураУзлаДиагноза.Ключ];
					СтрокаПараметраДиагноза.localid = СтруктураУзлаДиагноза.Значение.localid;
					СтрокаПараметраДиагноза.АвтозаполнениеИзДанныхДокумента = Истина;
					УказанаОбщаяСтепеньОбоснованности = Истина;
				КонецЕсли;
				
				Продолжить;
			КонецЕсли;
			
			СтрокаПараметраДиагноза = ТаблицаПараметров.Добавить();
			СтрокаПараметраДиагноза.Значение = СтрокаДиагноза[СтруктураУзлаДиагноза.Ключ];
			СтрокаПараметраДиагноза.localid = СтруктураУзлаДиагноза.Значение.localid;
			СтрокаПараметраДиагноза.АвтозаполнениеИзДанныхДокумента = Истина;
			Если СтруктураУзлаДиагноза.Ключ = ГруппирующееПоле Тогда
				СтрокаГруппирующегоПоля = СтрокаПараметраДиагноза;
			Иначе
				СтрокиПараметровДиагнозаДляГруппирующегоПоля.Добавить(СтрокаПараметраДиагноза);
			КонецЕсли;
		КонецЦикла;
		
		Если СтрокаГруппирующегоПоля <> Неопределено Тогда
			СгруппированныеСтроки.Вставить(СтрокаГруппирующегоПоля, СтрокиПараметровДиагнозаДляГруппирующегоПоля);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьСтруктурыУзловДиагноза(УзелСтруктурыДиагноза)
	
	СтруктурыУзловДиагноза = Новый Соответствие;
	Для Каждого ДочернийУзел Из УзелСтруктурыДиагноза.ДочерниеУзлы Цикл
		АтрибутОбязательности = ДочернийУзел.ПолучитьАтрибут("Обязательное");
		Обязательное = АтрибутОбязательности = Неопределено Или ВычислитьФункцию(АтрибутОбязательности);
		
		СтруктураУзлаДиагноза = Новый Структура;
		СтруктураУзлаДиагноза.Вставить("localid", ДочернийУзел.ПолучитьАтрибут("localid"));
		СтруктураУзлаДиагноза.Вставить("Обязательное", Обязательное);
		СтруктурыУзловДиагноза.Вставить(ДочернийУзел.ПолучитьАтрибут("type"), СтруктураУзлаДиагноза);
	КонецЦикла;
	
	Возврат СтруктурыУзловДиагноза;
	
КонецФункции

Процедура УдалитьСуществующиеСтрокиПараметровДиагнозов(СтруктурыУзловДиагноза, ТаблицаПараметров, СоответствияПараметрам, КонстантыCDAДокумента)
	
	СтрокиПараметровКУдалению = Новый Массив;
	Для Каждого СтруктураУзлаДиагноза Из СтруктурыУзловДиагноза Цикл
		Для Каждого СтрокаПараметраПоСоответствию Из СоответствияПараметрам.НайтиСтроки(Новый Структура("localid", СтруктураУзлаДиагноза.Значение.localid)) Цикл
			Для Каждого СтрокаТаблицы Из ТаблицаПараметров.НайтиСтроки(Новый Структура("Параметр", СтрокаПараметраПоСоответствию.Параметр)) Цикл
				СтрокиПараметровКУдалению.Добавить(СтрокаТаблицы);
			КонецЦикла;
		КонецЦикла;
		Для Каждого СтрокаКонстанты Из КонстантыCDAДокумента.НайтиСтроки(Новый Структура("localid", СтруктураУзлаДиагноза.Значение.localid)) Цикл
			КонстантыCDAДокумента.Удалить(СтрокаКонстанты);
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого СтрокаПараметраКУдалению Из СтрокиПараметровКУдалению Цикл
		ТаблицаПараметров.Удалить(СтрокаПараметраКУдалению);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуНеобходимыхДиагнозовПоОтбору(ТаблицаДиагнозовПриема, АтрибутОтбора);
	
	Если Не ЗначениеЗаполнено(АтрибутОтбора) Тогда
		Возврат ТаблицаДиагнозовПриема;
	КонецЕсли;
	
	Если СтрНачинаетсяС(АтрибутОтбора, "*") Тогда
		Попытка
			ТаблицаНеобходимыхДиагнозов = Вычислить(Прав(АтрибутОтбора, СтрДлина(АтрибутОтбора)-1));
		Исключение
			ТаблицаНеобходимыхДиагнозов = ТаблицаДиагнозовПриема.Очистить();
		КонецПопытки;
		
		Возврат ТаблицаНеобходимыхДиагнозов;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Для Каждого ПараметрОтбора Из СтрРазделить(АтрибутОтбора, ";", Ложь) Цикл
		КлючЗначение = СтрРазделить(ПараметрОтбора, ":", Ложь);
		Если КлючЗначение.Количество() = 2 Тогда
			
			КлючОтбора = КлючЗначение[0];
			ЗначениеОтбора = КлючЗначение[1];
			Если СтрНачинаетсяС(ЗначениеОтбора, "*") Тогда
				СтрокаВычисления = Прав(ЗначениеОтбора, СтрДлина(ЗначениеОтбора)-1);
				ЗначениеОтбора = Вычислить(СтрокаВычисления);
			КонецЕсли;
			Отбор.Вставить(КлючОтбора, ЗначениеОтбора);
		КонецЕсли;
	КонецЦикла;
	
	Если Отбор.Количество() = 0 Тогда
		Возврат ТаблицаДиагнозовПриема;
	КонецЕсли;
	
	ТаблицаНеобходимыхДиагнозов = ТаблицаДиагнозовПриема.СкопироватьКолонки();
	Для Каждого СтрокаДиагнозаПоОтбору Из ТаблицаДиагнозовПриема.НайтиСтроки(Отбор) Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаНеобходимыхДиагнозов.Добавить(), СтрокаДиагнозаПоОтбору);
	КонецЦикла;
	
	Возврат ТаблицаНеобходимыхДиагнозов;
	
КонецФункции

Функция ПолучитьДиагнозМКБ10(Диагноз, ДиагнозыМКБ10)
	
	ДиагнозМКБ10 = ДиагнозыМКБ10.Получить(СокрЛП(Диагноз.КодДиагноза));
	
	Если ДиагнозМКБ10 <> Неопределено Тогда
		Возврат ДиагнозМКБ10;
	ИначеЕсли ЗначениеЗаполнено(Диагноз.Родитель) Тогда
		Возврат ПолучитьДиагнозМКБ10(Диагноз.Родитель, ДиагнозыМКБ10);
	Иначе
		Возврат Справочники.Диагнозы.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьТаблицуПараметровПоПМО(ТаблицаПараметров, Ссылка, КонстантыCDAДокумента, СоответствияПараметрам, ДополнительныеПараметры)
	
	ШаблонМО = ДополнительныеПараметры.ШаблонОсмотра;
	ВредныйФакторСправки = ДополнительныеПараметры.ВредныйФакторСправки;
	ПриказВредныйФакторМО = ДополнительныеПараметры.ПриказВредныйФакторМО;
	СообщениеРЭМД = ДополнительныеПараметры.СообщениеРЭМД;
	
	Если ПриказВредныйФакторМО <> Неопределено Тогда
		ЗаполнитьТаблицуПараметровПоПриказуВредномуФактору(Ссылка, ТаблицаПараметров, ПриказВредныйФакторМО, СообщениеРЭМД);
	Иначе
		КонстантыCDAДокумента	= ШаблонМО.КонстантыCDAДокумента.Выгрузить();
		СоответствияПараметрам	= ШаблонМО.СоответствияПараметрам;
		
		Если ЗначениеЗаполнено(ВредныйФакторСправки)
			И Не ЗначениеЗаполнено(Ссылка.Номенклатура)
		Тогда
			ПараметрыПриема = Ссылка.ПараметрыПриема.НайтиСтроки(Новый Структура("ВредныйФактор", ВредныйФакторСправки));
		Иначе
			ПараметрыПриема = Ссылка.ПараметрыПриема;
		КонецЕсли;
		
		Для Каждого ПараметрПриема Из ПараметрыПриема Цикл
			Если ТипЗнч(ПараметрПриема.Значение) = Тип("СправочникСсылка.СтрокиЭМКНеограниченнойДлины") Тогда
				Значение = ПараметрПриема.Значение.Значение;
			Иначе
				Значение = ПараметрПриема.Значение;
			КонецЕсли;
			Если ЗначениеЗаполнено(Значение) Тогда
				НоваяСтрока = ТаблицаПараметров.Добавить();
				НоваяСтрока.Параметр = ПараметрПриема.Параметр;
				НоваяСтрока.Значение = Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.ПредседательМедКомиссии, "Сотрудник");
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПараметровПоПриказуВредномуФактору(ПМО, ТаблицаПараметров, ПриказВредныйФактор, СообщениеРЭМД)
	
	Если ДопСерверныеФункции.ИмяСсылочногоТипа(ПриказВредныйФактор) = "Справочник.ПереченьВредныхФакторовИРабот" Тогда
		Приказ = ПриказВредныйФактор.Приказ;
	Иначе
		Приказ = ПриказВредныйФактор;
	КонецЕсли;
	
	Если Приказ = Справочники.ПриказыМедосмотров.Приказ29н Тогда
		
		ВидДокумента = ОпределитьВидДокументаПоПриказуВредномуФакторуМО(ПриказВредныйФактор, СообщениеРЭМД, ПМО);
		Если ВидДокумента.УИДЕГИСЗ = 103 Тогда
			ЗаполнитьТаблицуПараметровЗаключенияМедосмотра_103(ПМО, ТаблицаПараметров);
		ИначеЕсли ВидДокумента.УИДЕГИСЗ = 194 Тогда
			// Не используется. Оставлено для упрощения разработки следующей редацкции
			ЗаполнитьТаблицуПараметровЗаключенияМедосмотра_194(ПМО, ТаблицаПараметров);
		ИначеЕсли ВидДокумента.УИДЕГИСЗ = 230 Тогда
			ЗаполнитьТаблицуПараметровЗаключенияМедосмотра_230(ПМО, ТаблицаПараметров, ПриказВредныйФактор);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПараметровЗаключенияМедосмотра_103(ПМО, ТаблицаПараметров)
	
	ТаблицаПараметров.Колонки.Добавить("ТекстНезаполненногоПараметра");
	
	Если ЗначениеЗаполнено(ПМО.СписокНаПрохождениеМедосмотра) Тогда
		ИсточникДанныхКлиента = ПолучитьДанныеКлиентаИзСписка(ПМО);
		Договор = МедицинскоеСтрахование.ДоговорСоСтраховойПолиса(ПМО.СписокНаПрохождениеМедосмотра.ВидПолиса, ПМО.СписокНаПрохождениеМедосмотра.Филиал, ПМО.ДатаЗавершения);
		Контрагент = ПМО.СписокНаПрохождениеМедосмотра.Контрагент;
		НаименованиеРаботодателя = ПМО.СписокНаПрохождениеМедосмотра.МестоРаботы;
		ДоговорПолеЭМД = "ДоговорСКонтрагентом";
	Иначе
		ИсточникДанныхКлиента = ПМО;
		НаименованиеРаботодателя = ПМО.МестоРаботы;
		Если ИсточникОплатыПМОПоДоговоруСКлиентом(ПМО) Тогда
			Договор = ПМО.ВидПолиса;
			Контрагент = Неопределено;
			ДоговорПолеЭМД = "ДокументОплаты";
		Иначе
			Договор = МедицинскоеСтрахование.ДоговорСоСтраховойПолиса(ПМО.ВидПолиса, ПМО.Филиал, ПМО.ДатаЗавершения);
			Контрагент = ПМО.ВидПолиса.Контрагент;
			ДоговорПолеЭМД = "ДоговорСКонтрагентом";
		КонецЕсли;
	КонецЕсли;
	
	СтруктурноеПодразделение = ИсточникДанныхКлиента.ЦехУчасток;
	Должность = ДолжностьИзСтрокиПоКлассификатору(ИсточникДанныхКлиента.Профессия);
	Если Не ЗначениеЗаполнено(Должность) Тогда
		Если ЗначениеЗаполнено(ИсточникДанныхКлиента.Профессия) Тогда
			ТекстНезаполненнойДолжности = СтрШаблон(НСтр("ru='Должность (в классификаторе профессий не найден элемент с наименованием ""%1"")'"), ИсточникДанныхКлиента.Профессия);
		Иначе
			ТекстНезаполненнойДолжности = НСтр("ru='Должность не заполнена'");
		КонецЕсли;
	Иначе
		ТекстНезаполненнойДолжности = "";
	КонецЕсли;
	
	ГруппаЗдоровья = ГруппаЗдоровьяПоДиспансернойГруппеМедосмотра(ПМО);
	
	ДополнитьТаблицуПараметров(ТаблицаПараметров, НаименованиеРаботодателя,	"НаименованиеРаботодателя");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, Договор,					ДоговорПолеЭМД);
	ДополнитьТаблицуПараметров(ТаблицаПараметров, Контрагент,				"Контрагент");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, СтруктурноеПодразделение,	"СтруктурноеПодразделение");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, Должность,				"Должность", Новый Структура("ТекстНезаполненногоПараметра", ТекстНезаполненнойДолжности));
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ГруппаЗдоровья,			"ГруппаЗдоровья");
	
	Для Каждого ВредныйФактор Из ВредныеФакторыДокумента(ПМО) Цикл
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ВредныйФактор, "ПрофессиональнаяВредность");
	КонецЦикла;
	
	ЕстьНезаполненныеЗаключения = Ложь;
	ЕстьОтрицательноеЗаключениеПоФактору = Ложь;
	
	ПриказыВредныеФакторы = МедосмотрыСервер.ПриказыВредныеФакторыМедосмотраСВидамиДокументов(ПМО);
	Для Каждого ЗаключениеПоФактору Из ПМО.ЗаключенияМедосмотровПоФакторам Цикл
		
		Если ЗначениеЗаполнено(ЗаключениеПоФактору.Заключение) Тогда
			Если ЗаключениеПоФактору.Заключение.УИДЕГИСЗ = 71 Тогда
				ЕстьОтрицательноеЗаключениеПоФактору = Истина;
				Прервать;
			КонецЕсли;
		Иначе
			ЕстьНезаполненныеЗаключения = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// Если есть незаполненные заключения, то не заполняем заключение в СЭМДе
	Если Не ЕстьНезаполненныеЗаключения Тогда
		Если ЕстьОтрицательноеЗаключениеПоФактору Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(31), "Заключение");
		Иначе
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(32), "Заключение");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПараметровЗаключенияМедосмотра_194(ПМО, ТаблицаПараметров)
	
	ТаблицаПараметров.Колонки.Добавить("ТекстНезаполненногоПараметра");
	
	Если ЗначениеЗаполнено(ПМО.СписокНаПрохождениеМедосмотра) Тогда
		ИсточникДанныхКлиента = ПолучитьДанныеКлиентаИзСписка(ПМО);
		НаименованиеРаботодателя = ПМО.СписокНаПрохождениеМедосмотра.МестоРаботы;
		ИННРаботодателя = ПМО.СписокНаПрохождениеМедосмотра.Контрагент.ИНН;
	Иначе
		ИсточникДанныхКлиента = ПМО;
		НаименованиеРаботодателя = ПМО.МестоРаботы;
		ИННРаботодателя = ПМО.ИННРаботодателя;
	КонецЕсли;
	
	СтруктурноеПодразделение = ИсточникДанныхКлиента.ЦехУчасток;
	//Должность = ДолжностьИзСтрокиПоКлассификатору(ИсточникДанныхКлиента.Профессия);
	//Если ЗначениеЗаполнено(Должность) Тогда
	//	ДополнитьТаблицуПараметров(ТаблицаПараметров, Должность, "Должность");
	//Иначе
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ИсточникДанныхКлиента.Профессия, "ДолжностьСтрокой");
	//КонецЕсли;
	
	ГруппаЗдоровья = ГруппаЗдоровьяПоДиспансернойГруппеМедосмотра(ПМО);
	ДатаОчередногоПМО = ДобавитьМесяц(ПМО.ДатаЗавершения, 12);
	
	ДополнитьТаблицуПараметров(ТаблицаПараметров, НаименованиеРаботодателя,	"НаименованиеРаботодателя");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, СтруктурноеПодразделение,	"СтруктурноеПодразделение");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ГруппаЗдоровья,			"ГруппаЗдоровья");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ДатаОчередногоПМО,		"ДатаПроведенияОчередногоПериодическогоМедицинскогоОсмотра");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ИННРаботодателя,			"ИННРаботодателя");
	
	Для Каждого ВредныйФактор Из ВредныеФакторыДокумента(ПМО) Цикл
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ВредныйФактор, "ВредныйПроизводственныйФактор");
	КонецЦикла;
	
	Если ПМО.КритичныеПротивопоказания.Количество() > 0 Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(31), "Заключение");
	Иначе
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(32), "Заключение");
	КонецЕсли;
	
	ЧастиКомментария = Новый Массив;
	Если ЗначениеЗаполнено(ПМО.Осмотр) Тогда
		ЧастиКомментария.Добавить(СтрШаблон("Осмотр:%1%2", Символы.ПС, ПМО.Осмотр));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПМО.Жалобы) Тогда
		ЧастиКомментария.Добавить(СтрШаблон("Жалобы:%1%2", Символы.ПС, ПМО.Жалобы));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПМО.Исследования) Тогда
		ЧастиКомментария.Добавить(СтрШаблон("Исследования:%1%2", Символы.ПС, ПМО.Исследования));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПМО.Рекомендации) Тогда
		ЧастиКомментария.Добавить(СтрШаблон("Рекомендации:%1%2", Символы.ПС, ПМО.Рекомендации));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПМО.Заключение) Тогда
		ЧастиКомментария.Добавить(СтрШаблон("Заключение:%1%2", Символы.ПС, ПМО.Заключение));
	КонецЕсли;
	
	ДополнитьТаблицуПараметров(ТаблицаПараметров, СокрЛП(СтрСоединить(ЧастиКомментария, Символы.ПС)), "Комментарий");
	
	ПриемыЛабораторноеИсследование = ПолучитьПриемыСВидомЛабораторноеИсследование(ПМО);
	Для Каждого ЛабораторноеИсследование Из ПриемыЛабораторноеИсследование Цикл
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ЛабораторноеИсследование, "СвязанныйДокументЛабИсследования");
	КонецЦикла;
	
	ПриемыИнструментальноеИсследование = ПолучитьПриемыСВидомИнструментальноеИсследование(ПМО);
	Для Каждого ИнструментальноеИсследование Из ПриемыИнструментальноеИсследование Цикл
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ИнструментальноеИсследование, "СвязанныйДокументИнстрИсследования");
	КонецЦикла;
	
	ПриемыКонсультации = ПолучитьПриемыСВидомКонсультация(ПМО);
	Для Каждого Консультация Из ПриемыКонсультации Цикл
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Консультация, "СвязанныйДокументКонсультации");
	КонецЦикла;
	
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ПолучитьДанныеОПрофилактическихПрививках(ПМО), "ПрофилактическиеПрививки");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ПолучитьДанныеОПеренесенныхИнфекциях(ПМО),	 "ПеренесенныеИнфекционныеЗаболевания");
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПараметровЗаключенияМедосмотра_230(ПМО, ТаблицаПараметров, ПриказВредныйФактор)
	
	ВредныйФактор = ПолучитьВредныйФакторПоКлассификатору(ПриказВредныйФактор);
	
	Если ВредныйФактор = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПараметров.Колонки.Добавить("ТекстНезаполненногоПараметра");
	
	Если ЗначениеЗаполнено(ПМО.СписокНаПрохождениеМедосмотра) Тогда
		ИсточникДанныхКлиента = ПолучитьДанныеКлиентаИзСписка(ПМО);
		НаименованиеРаботодателя = ПМО.СписокНаПрохождениеМедосмотра.МестоРаботы;
		ИННРаботодателя = ПМО.СписокНаПрохождениеМедосмотра.Контрагент.ИНН;
	Иначе
		ИсточникДанныхКлиента = ПМО;
		НаименованиеРаботодателя = ПМО.МестоРаботы;
		ИННРаботодателя = ПМО.ИННРаботодателя;
	КонецЕсли;
	
	// Номер личной мед книжки
	Если ЗначениеЗаполнено(ПМО.НомерЛичнойМедКнижки) Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ПМО.НомерЛичнойМедКнижки, "НомерЛичнойМедицинскойКнижки");
	КонецЕсли;
	
	// Вид медосмотра предварительный/периодический
	Если ПМО.ТипМедосмотра = Перечисления.ТипыМедосмотров.Предварительный Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Истина, "МедосмотрПредварительный");
	Иначе
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Ложь, "МедосмотрПредварительный");
	КонецЕсли;
	
	// Сведения о виде работы
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ВредныйФактор, "ВредныйПроизводственныйФактор");
	
	// Профиль работы для пищевки
	Если ВредныйФактор.УИДЕГИСЗ = 211 Тогда
		Если ПМО.ПрофильРаботы = 1 Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Истина, "ПрофильРаботы");
		ИначеЕсли ПМО.ПрофильРаботы = 2 Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ложь, "ПрофильРаботы");
			
		// если ПрофильРаботы = 3 то значение отсутствует
		КонецЕсли;
	КонецЕсли;
	
	// Перенесенные инфекции
	ЕстьИнфекции = ДополнитьДаннымиПеренесенныхИнфекций230(ТаблицаПараметров, ПМО, ВредныйФактор);
	Если Не ЕстьИнфекции Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(69), "ЗаключениеПеренесенныеЗаболевания");
	КонецЕсли;
	
	// Профилактические прививки
	ЕстьПрививкаОтКори = Ложь;
	ЕстьВакцинации = ДополнитьДаннымиВакцинаций230(ТаблицаПараметров, ПМО, ВредныйФактор, ЕстьПрививкаОтКори);
	Если Не ЕстьВакцинации Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(70), "ЗаключениеОтсутствиеВакцинаций");
	КонецЕсли;
	
	// Общее заключение по фактору
	ЗаключениеПоФактору = ЗаключениеПоФакторуПМО(ВредныйФактор, ПМО);
	Если ЗаключениеПоФактору <> Неопределено Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеПоФактору, "Заключение");
	КонецЕсли;
	
	// Дата очередного ПМО
	ДатаОчередногоПМО = ДобавитьМесяц(НачалоДня(ПМО.Дата), 12);
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ДатаОчередногоПМО, "ДатаПроведенияОчередногоПериодическогоМедицинскогоОсмотра");
	
	// Комментарий
	ЧастиКомментария = Новый Массив;
	Если ЗначениеЗаполнено(ПМО.Осмотр) Тогда
		ЧастиКомментария.Добавить(СтрШаблон("Осмотр:%1%2", Символы.ПС, ПМО.Осмотр));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПМО.Жалобы) Тогда
		ЧастиКомментария.Добавить(СтрШаблон("Жалобы:%1%2", Символы.ПС, ПМО.Жалобы));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПМО.Исследования) Тогда
		ЧастиКомментария.Добавить(СтрШаблон("Исследования:%1%2", Символы.ПС, ПМО.Исследования));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПМО.Рекомендации) Тогда
		ЧастиКомментария.Добавить(СтрШаблон("Рекомендации:%1%2", Символы.ПС, ПМО.Рекомендации));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПМО.Заключение) Тогда
		ЧастиКомментария.Добавить(СтрШаблон("Заключение:%1%2", Символы.ПС, ПМО.Заключение));
	КонецЕсли;
	
	ДополнитьТаблицуПараметров(ТаблицаПараметров, СокрЛП(СтрСоединить(ЧастиКомментария, Символы.ПС)), "Комментарий");
	
	// informationRecipient Роспотребнадзор
	ДополнитьТаблицуПараметров(ТаблицаПараметров, "Федеральная служба по надзору в сфере защиты прав потребителей и благополучия человека (Роспотребнадзор)", "ОрганизацияПолучательДокумента");
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("ГруппирующееПоле",ТаблицаПараметров.Количество() - 1);
	ДополнитьТаблицуПараметров(ТаблицаПараметров, "1.2.643.5.1.13.13.18.1", "ИдентификаторОрганизацииПолучателяДокумента", СтруктураЗаполнения);
	
	// Осмотры врачей специалистов
	ДанныеОсмотров = ПолучитьДанныеСвязанныхОсмотровВрачейСпециалистов230(ПМО);
	ДополнитьТаблицуДаннымиОсмотров230(ТаблицаПараметров, ДанныеОсмотров, ПМО);
	
	ДанныеЛабораторныхИсследований = ПолучитьДанныеЛабораторныхИсследований230(ПМО, ВредныйФактор, ЕстьПрививкаОтКори); 
	ДополнитьТаблицуДаннымиЛабИсследований(ТаблицаПараметров, ДанныеЛабораторныхИсследований, ПМО);
	
	ДанныеИнструментальногоИсследования = ПолучитьДанныеИнструментальногоИсследования230(ПМО, ВредныйФактор);
	ДополнитьТаблицуДаннымиИнстрИсследования(ТаблицаПараметров, ДанныеИнструментальногоИсследования, ПМО);
	
КонецПроцедуры

Функция ЗаключениеПоФакторуПМО(ВредныйФактор, ПМО) Экспорт
	
	НомерФактораВПМО = "";
	Если ВредныйФактор.УИДЕГИСЗ = 211 Тогда
		НомерФактораВПМО = "23";
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 212 Тогда
		НомерФактораВПМО = "24";
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 213 Тогда
		НомерФактораВПМО = "25";
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 214 Тогда
		НомерФактораВПМО = "26";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НомерФактораВПМО) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого ЗаключениеПоФактору Из ПМО.ЗаключенияМедосмотровПоФакторам Цикл
		Если ЗаключениеПоФактору.Фактор.НомерПП = НомерФактораВПМО Тогда
			Возврат ЗаключениеПоФактору.Заключение; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДополнитьДаннымиПеренесенныхИнфекций230(ТаблицаПараметров, ПМО, ВредныйФактор)
	
	ЕстьЗаполненнаяСтрока = Ложь;
	
	Если ВредныйФактор.УИДЕГИСЗ = 211 Тогда
		МассивОграниченийФактора = МассивОграниченийДиагнозовФактор23_230(ПМО.ПрофильРаботы);
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 212 Тогда
		МассивОграниченийФактора = МассивОграниченийДиагнозовФактор24_230();
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 213 Тогда
		МассивОграниченийФактора = МассивОграниченийДиагнозовФактор25_230();
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 214 Тогда
		МассивОграниченийФактора = МассивОграниченийДиагнозовФактор26_230();
	КонецЕсли;
	
	Для Каждого ИнфекционноеЗаболевание Из ПМО.ИнфекционныеЗаболевания Цикл
		
		Если Не ЗначениеЗаполнено(ИнфекционноеЗаболевание.Диагноз) 
			Или МассивОграниченийФактора.Найти(ИнфекционноеЗаболевание.Диагноз.КодДиагноза) = Неопределено 
		Тогда
			Продолжить;
		КонецЕсли;
		
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ИнфекционноеЗаболевание.Диагноз, "ПеренесенноеИнфекционноеЗаболевание");
		Если ЗначениеЗаполнено(ИнфекционноеЗаболевание.Дата) Тогда
			// Дату группируем с диагнозом
			СтруктураЗаполнения = Новый Структура();
			СтруктураЗаполнения.Вставить("ГруппирующееПоле",ТаблицаПараметров.Количество() - 1);
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ИнфекционноеЗаболевание.Дата, "ДатаПеренесенногоЗаболевания", СтруктураЗаполнения);
			ЕстьЗаполненнаяСтрока = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьЗаполненнаяСтрока;
	
КонецФункции

Функция ДополнитьДаннымиВакцинаций230(ТаблицаПараметров, ПМО, ВредныйФактор, ЕстьПрививкаОтКори)
	
	ЕстьЗаполненнаяСтрока = Ложь;
	
	Если ВредныйФактор.УИДЕГИСЗ = 211 Тогда
		СтрокаОграничений = СтрокаОграниченийВакцинацииФактор23_230(ПМО.ПрофильРаботы);
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 212 Тогда
		СтрокаОграничений = СтрокаОграниченийВакцинацииФактор24_230();
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 213 Тогда
		СтрокаОграничений = СтрокаОграниченийВакцинацииФактор25_230();
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 214 Тогда
		СтрокаОграничений = СтрокаОграниченийВакцинацииФактор26_230();
	КонецЕсли;
	
	СтрокаОграничений = СтрЗаменить(СтрокаОграничений, " ", "");
	СтрокаОграничений = СтрЗаменить(СтрокаОграничений, Символы.ПС, "");
	МассивОграничений = СтрРазделить(СтрокаОграничений, ",", Ложь);
	ОграниченияВакцинацииУИДЕГИСЗ = Новый Массив;
	Для Каждого Ограничение Из МассивОграничений Цикл
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Ограничение) Тогда
			ОграниченияВакцинацииУИДЕГИСЗ.Добавить(Число(Ограничение));
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ПрофПрививка Из ПМО.ПрофилактическиеПрививки Цикл
		
		Если Не ЗначениеЗаполнено(ПрофПрививка.ГруппаЗаболеваний) 
			Или ОграниченияВакцинацииУИДЕГИСЗ.Найти(ПрофПрививка.ГруппаЗаболеваний.УИДЕГИСЗ) = Неопределено 
		Тогда
			Продолжить;
		КонецЕсли;
		
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ПрофПрививка.ГруппаЗаболеваний, "ГруппаЗаболеванияДляКоторойИспользуетсяИммунобиологическийПрепарат");
		
		Если ПрофПрививка.ГруппаЗаболеваний.УИДЕГИСЗ = 18 Тогда
			ЕстьПрививкаОтКори = Истина;
		КонецЕсли;
		
		// Структура для группировки с группой заболевания
		СтруктураЗаполнения = Новый Структура();
		СтруктураЗаполнения.Вставить("ГруппирующееПоле",ТаблицаПараметров.Количество() - 1);
		
		Если ЗначениеЗаполнено(ПрофПрививка.ДатаВакцинации) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ПрофПрививка.ДатаВакцинации, "ДатаВакцинации", СтруктураЗаполнения);
		КонецЕсли;
		Если ЗначениеЗаполнено(ПрофПрививка.НаименованиеПрививки) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ПрофПрививка.НаименованиеПрививки, "НаименованиеПрофилактическойПрививки", СтруктураЗаполнения);
		КонецЕсли;
		
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ПрофПрививка.Повторная, "ВакцинацияЯвляетсяПовторной", СтруктураЗаполнения);
		
		Если ЗначениеЗаполнено(ПрофПрививка.ПорядковыйНомер) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ПрофПрививка.ПорядковыйНомер, "ПорядковыйНомерВакцинации", СтруктураЗаполнения);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПрофПрививка.ДатаВакцинации) Тогда
			Если ПрофПрививка.ГруппаЗаболеваний.УИДЕГИСЗ <> 14 
				Или ЗначениеЗаполнено(ПрофПрививка.ПорядковыйНомер)
			Тогда
				ЕстьЗаполненнаяСтрока = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьЗаполненнаяСтрока;
	
КонецФункции

Функция МассивОграниченийДиагнозовФактор23_230(ПрофильРаботы) Экспорт
	
	Если ПрофильРаботы = 2 Тогда
		СтрокаОграничений = "A01.0, A15.0,
				|A15.1, A15.2, A15.3, A15.4, A15.5, A15.6, A15.7, A15.8,
				|A15.9, A16.0, A16.1, A16.2, A16.3, A16.4, A16.5, A16.7,
				|A16.8, A16.9, A17.0, A17.1, A17.8, A17.9, A18.0, A18.1,
				|A18.2, A18.3, A18.4, A18.5, A18.6, A18.7, A18.8, A19.0,
				|A19.1, A19.2, A19.8, A19.9, A23.0, A23.1, A23.2, A23.3,
				|A23.8, A23.9, B05.0, B05.1, B05.2, B05.3, B05.4, B05.8,
				|B05.9, B15.0, B15.9";
	Иначе
		СтрокаОграничений = "A01.0, A15.0, A15.1, A15.2, A15.3, A15.4, A15.5, A15.6,
				|A15.7, A15.8, A15.9, A16.0, A16.1, A16.2, A16.3, A16.4,
				|A16.5, A16.7, A16.8, A16.9, A17.0, A17.1, A17.8, A17.9,
				|A18.0, A18.1, A18.2, A18.3, A18.4, A18.5, A18.6, A18.7,
				|A18.8, A19.0, A19.1, A19.2, A19.8, A19.9, B05.0, B05.1,
				|B05.2, B05.3, B05.4, B05.8, B05.9, B15.0, B15.9";
	КонецЕсли;
	
	СтрокаОграничений = СтрЗаменить(СтрокаОграничений, " ", "");
	СтрокаОграничений = СтрЗаменить(СтрокаОграничений, Символы.ПС, "");
	Возврат СтрРазделить(СтрокаОграничений, ",", Ложь);
КонецФункции

Функция МассивОграниченийДиагнозовФактор24_230() Экспорт
	
	СтрокаОграничений = "A01.0, A15.0, A15.1, A15.2, A15.3, A15.4, A15.5,
			|A15.6, A15.7, A15.8, A15.9, A16.0, A16.1, A16.2, A16.3,
			|A16.4, A16.5, A16.7, A16.8, A16.9, A17.0, A17.1, A17.8,
			|A17.9, A18.0, A18.1, A18.2, A18.3, A18.4, A18.5, A18.6,
			|A18.7, A18.8, A19.0, A19.1, A19.2, A19.8, A19.9, B05.0,
			|B05.1, B05.2, B05.3, B05.4, B05.8, B05.9, B15.0,
			|B15.9";
	
	СтрокаОграничений = СтрЗаменить(СтрокаОграничений, " ", "");
	СтрокаОграничений = СтрЗаменить(СтрокаОграничений, Символы.ПС, "");
	Возврат СтрРазделить(СтрокаОграничений, ",", Ложь);
	
КонецФункции

Функция МассивОграниченийДиагнозовФактор25_230() Экспорт
	
	СтрокаОграничений = "A15.0, A15.1, A15.2, A15.3, A15.4, A15.5, A15.6,
			|A15.7, A15.8, A15.9, A16.0, A16.1, A16.2, A16.3, A16.4,
			|A16.5, A16.7, A16.8, A16.9, A17.0, A17.1, A17.8, A17.9,
			|A18.0, A18.1, A18.2, A18.3, A18.4, A18.5, A18.6, A18.7,
			|A18.8, A19.0, A19.1, A19.2, A19.8, A19.9, B01.0, B01.1,
			|B01.2, B01.8, B01.9, B05.0, B05.1, B05.2, B05.3, B05.4,
			|B05.8, B05.9, B15.0, B15.9, B26.0, B26.1, B26.2, B26.3,
			|B26.8, B26.9";
	
	СтрокаОграничений = СтрЗаменить(СтрокаОграничений, " ", "");
	СтрокаОграничений = СтрЗаменить(СтрокаОграничений, Символы.ПС, "");
	Возврат СтрРазделить(СтрокаОграничений, ",", Ложь);
	
КонецФункции

Функция МассивОграниченийДиагнозовФактор26_230() Экспорт
	
	СтрокаОграничений = "A15.0, A15.1, A15.2, A15.3, A15.4, A15.5, A15.6,
			|A15.7, A15.8, A15.9, A16.0, A16.1, A16.2, A16.3, A16.4,
			|A16.5, A16.7, A16.8, A16.9, A17.0, A17.1, A17.8, A17.9,
			|A18.0, A18.1, A18.2, A18.3, A18.4, A18.5, A18.6, A18.7,
			|A18.8, A19.0, A19.1, A19.2, A19.8, A19.9, B05.0, B05.1,
			|B05.2, B05.3, B05.4, B05.8, B05.9";
	
	СтрокаОграничений = СтрЗаменить(СтрокаОграничений, " ", "");
	СтрокаОграничений = СтрЗаменить(СтрокаОграничений, Символы.ПС, "");
	Возврат СтрРазделить(СтрокаОграничений, ",", Ложь);
	
КонецФункции

Функция СтрокаОграниченийВакцинацииФактор23_230(ПрофильРаботы) Экспорт
	
	Если ПрофильРаботы = 1 Тогда
		Возврат "4, 9, 12, 13, 14, 18, 29 ,33";
	ИначеЕсли ПрофильРаботы = 2 Тогда
		Возврат "9, 12, 13, 14, 18, 20, 33";
	ИначеЕсли ПрофильРаботы = 3 Тогда
		Возврат "9, 12, 13, 14, 18";
	КонецЕсли;
	
КонецФункции

Функция СтрокаОграниченийВакцинацииФактор24_230() Экспорт
	
	Возврат "9, 12, 14, 18";
	
КонецФункции

Функция СтрокаОграниченийВакцинацииФактор25_230() Экспорт
	
	Возврат "12, 14, 18, 25";
	
КонецФункции

Функция СтрокаОграниченийВакцинацииФактор26_230() Экспорт
	
	Возврат "10, 12, 14, 18";
	
КонецФункции

Функция ПолучитьДанныеОПрофилактическихПрививках(ПМО)
	
	Если ЗначениеЗаполнено(ПМО.СведенияОПрививках) Тогда
		Возврат ПМО.СведенияОПрививках;
	ИначеЕсли ЗначениеЗаполнено(ПланыВидовХарактеристик.ПараметрыHTML.ПрофпатологСведенияОПрививках.ЗначениеПоУмолчанию) Тогда
		Возврат ПланыВидовХарактеристик.ПараметрыHTML.ПрофпатологСведенияОПрививках.ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат "-";
	
КонецФункции

Функция ПолучитьДанныеОПеренесенныхИнфекциях(ПМО)
	
	Если ЗначениеЗаполнено(ПМО.ИнфекционныйАнамнез) Тогда
		Возврат ПМО.ИнфекционныйАнамнез;
	ИначеЕсли ЗначениеЗаполнено(ПланыВидовХарактеристик.ПараметрыHTML.ПрофпатологИнфекционныйАнамнез.ЗначениеПоУмолчанию) Тогда
		Возврат ПланыВидовХарактеристик.ПараметрыHTML.ПрофпатологИнфекционныйАнамнез.ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат "-";
	
КонецФункции

Функция ПолучитьДанныеСвязанныхОсмотровВрачейСпециалистов230(ПМО) Экспорт
	
	МодульМедосмотрыСервер = ДопСерверныеФункции.ОбщийМодуль("МедосмотрыСервер");
	
	ТаблицаКонсультаций = Новый ТаблицаЗначений;
	ТаблицаКонсультаций.Колонки.Добавить("ДействиеМедосмотра");
	ТаблицаКонсультаций.Колонки.Добавить("ПриемСсылка");
	ТаблицаКонсультаций.Колонки.Добавить("ДатаВыполненияДействияМедосмотра");
	ТаблицаКонсультаций.Колонки.Добавить("ВыявленыПротивопоказания");
	ТаблицаКонсультаций.Колонки.Добавить("Сотрудник");
	ТаблицаКонсультаций.Колонки.Добавить("СвязьСКлассификатором");
	ТаблицаКонсультаций.Колонки.Добавить("Заключение");
	ТаблицаКонсультаций.Колонки.Добавить("ТитрСерологическогоОбследования");
	
	ДопустимыеУИДЕГИСЗДолжностей = ДопустимыеУИДЕГИСЗДолжностей230();
	
	// Опеределим консультации с врачами с должностями из перечня должностей для СЭМД 
	СписокДействий = Новый Массив;
	Для Каждого СтрокаДействия Из ПМО.ДействияМедосмотра Цикл
		Если ТипЗнч(СтрокаДействия.Действие.СвязьСКлассификатором) = Тип("СправочникСсылка.КлассификаторыМинЗдрава")
			И СтрокаДействия.Действие.СвязьСКлассификатором.ВидКлассификатора = Перечисления.ВидыКлассификаторовМинЗдрава.ДолжностиРаботниковМедОрганизаций
			И ДопустимыеУИДЕГИСЗДолжностей.Найти(СтрокаДействия.Действие.СвязьСКлассификатором.УИДЕГИСЗ) <> Неопределено 
		Тогда
			СписокДействий.Добавить(СтрокаДействия.Действие);
		КонецЕсли;
	КонецЦикла;
	
	ПриемыПоДействиямМедосмотров = МодульМедосмотрыСервер.ПриемыПоДействиямМедосмотров(ПМО, СписокДействий);
	
	ТаблицаПараметровИЗначений	 = МедосмотрыСервер.ПолучитьТаблицуДействийМедосмотраИЗначений(ПМО, СписокДействий);
	СписокПротивопоказаний = Документы.ПрохождениеМедосмотра.ПротивопоказанияМедОсмотра(ПМО);
	
	Для Каждого Действие Из СписокДействий Цикл
		ПриемПоДействию = ПриемыПоДействиямМедосмотров.Получить(Действие);
		
		// Проверка наличия приема и сотрудника приема. Если у сотрудника есть должность для 230, то добавляем строку
		Если ПриемПоДействию = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаКонсультации = ТаблицаКонсультаций.Добавить();
		СтрокаКонсультации.ДействиеМедосмотра = Действие;
		СтрокаКонсультации.ПриемСсылка = ПриемПоДействию;
		СтрокаКонсультации.Сотрудник = ПриемПоДействию.Врач;
		СтрокаКонсультации.СвязьСКлассификатором = Действие.СвязьСКлассификатором;
		СтрокаКонсультации.ДатаВыполненияДействияМедосмотра = ПриемПоДействию.Дата;
		
		// Профнепригодность устанавливается по приему однозначно, если он не выполнял других действий медосмотров
		СтрокаКонсультации.ВыявленыПротивопоказания = НаличиеПротивопоказанийПоДействию230(ПриемПоДействию, Действие, ПМО);
		
		// Рассчитываем автозаключение
		ОтборДействиеМедосмотра = Новый Структура("ДействиеМедосмотра");
		ОтборДействиеМедосмотра.ДействиеМедосмотра = Действие;
		
		ТаблицаПараметровДействия = ТаблицаПараметровИЗначений.Скопировать(ТаблицаПараметровИЗначений.НайтиСтроки(ОтборДействиеМедосмотра));
		СтрокиВредныхФакторов = СписокПротивопоказаний.НайтиСтроки(Новый Структура("Действие", Действие));
		СписокВредныхФакторов = СписокПротивопоказаний.Скопировать(СтрокиВредныхФакторов, "ВредныйФактор").ВыгрузитьКолонку("ВредныйФактор");
		
		АвтоматическоеЗаключение = МедосмотрыСервер.ЗаключениеДляДействияМедОсмотра(СписокВредныхФакторов, "", ТаблицаПараметровДействия, Действие.Вид);
		Если ЗначениеЗаполнено(АвтоматическоеЗаключение) Тогда
			СтрокаКонсультации.Заключение = АвтоматическоеЗаключение;
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнитьСведениямиИзОтметокДляВыписки230(ПМО, ТаблицаКонсультаций, СписокДействий);
	
	// При наличии подходящего сотрудника подставляем из актуального на дату прохождения ПМО состава
	ДополнитьСотрудникамиИзСоставаКомиссии230(ПМО, ТаблицаКонсультаций, СписокДействий);
	
	Возврат СформироватьОбъединеннуюТаблицуРезультатовДействий230(ТаблицаКонсультаций, ПМО, Истина);
КонецФункции

Процедура ДополнитьТаблицуДаннымиОсмотров230(ТаблицаПараметров, ДанныеОсмотров, ПМО)
	
	// Дополнение одновременно в секцию тела и общие секции
	Для Каждого Осмотр Из ДанныеОсмотров Цикл
		
		Если Не ЗначениеЗаполнено(Осмотр.Сотрудник) Тогда
			Продолжить;
		КонецЕсли;
		
		// Секции тела
		Если Осмотр.СвязьСКлассификатором.УИДЕГИСЗ = 24 Тогда
			
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.СвязьСКлассификатором, "ДолжностьДерматовенеролога");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Сотрудник, "Дерматовенеролог");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.ДатаВыполненияДействияМедосмотра, "ДатаОсмотраДерматовенеролога");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Заключение, "ПримечаниеДерматовенеролога");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Сотрудник.Подразделение.ПодразделениеМинздрава, "ПодразделениеДерматовенеролога");
			
			// Проверка на случай если попадет неопределено
			Если Осмотр.ВыявленыПротивопоказания = Истина Тогда
				ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(73), "ЗаключениеДерматовенеролога");
			Иначе
				ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(74), "ЗаключениеДерматовенеролога");
			КонецЕсли;
			
			ФилиалСотрудника = Осмотр.Сотрудник.Подразделение.Филиал;
			ОрганизацияСотрудника = ФилиалСотрудника.Организация;
			
			Если ЗначениеЗаполнено(ОрганизацияСотрудника) Тогда
				
				ДополнитьТаблицуПараметров(ТаблицаПараметров, ОрганизацияСотрудника.МедицинскаяОрганизация.ПолноеНаименование, "ОрганизацияДерматовенеролога");
				КонтактыОрганизации = КонтактыОрганизацииФилиала(ФилиалСотрудника);
				Если КонтактыОрганизации <> Неопределено Тогда
					ДополнитьТаблицуПараметров(ТаблицаПараметров, КонтактыОрганизации, "КонтактыОрганизацииДерматовенеролога");
				КонецЕсли;
				
				АдресОрганизации = АдресОрганизацииФилиала(ФилиалСотрудника);
				Если ЗначениеЗаполнено(АдресОрганизации) Тогда
					ДополнитьТаблицуПараметров(ТаблицаПараметров, АдресОрганизации, "АдресОрганизацииДерматовенеролога");
				КонецЕсли;
			// Если заполнено подразделение минздрава но нет связи с организацией, то тянем наименование МО из классификатора МО
			ИначеЕсли ЗначениеЗаполнено(Осмотр.Сотрудник.Подразделение.ПодразделениеМинздрава) Тогда
				МОПодразделения = ПолучитьМОПоПодразделениюСотрудника(Осмотр.Сотрудник);
				Если ЗначениеЗаполнено(МОПодразделения) Тогда
					ДополнитьТаблицуПараметров(ТаблицаПараметров, МОПодразделения.ПолноеНаименование, "ОрганизацияДерматовенеролога");
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Осмотр.ПриемСсылка) Тогда
				ДополнитьТаблицуПараметров(ТаблицаПараметров, Строка(Осмотр.ПриемСсылка.УникальныйИдентификатор()), "ИдентификаторМИСОсмотраДерматовенеролога");
				// ДополнитьТаблицуПараметров(ТаблицаПараметров, , "ИдентификаторРЭМДОсмотраДерматовенеролога"); 
			Иначе
				ДополнитьТаблицуПараметров(ТаблицаПараметров, Строка(ПМО.УникальныйИдентификатор()), "ИдентификаторМИСОсмотраДерматовенеролога");
			КонецЕсли;
			
		ИначеЕсли Осмотр.СвязьСКлассификатором.УИДЕГИСЗ = 53 Тогда
			
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.СвязьСКлассификатором, "ДолжностьОториноларинголога");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Сотрудник, "Оториноларинголог");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.ДатаВыполненияДействияМедосмотра, "ДатаОсмотраОториноларинголога");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Заключение, "ПримечаниеОториноларинголога");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Сотрудник.Подразделение.ПодразделениеМинздрава, "ПодразделениеОториноларинголога");
			
			// Проверка на случай если попадет неопределено
			Если Осмотр.ВыявленыПротивопоказания = Истина Тогда
				ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(73), "ЗаключениеОториноларинголога");
			Иначе
				ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(74), "ЗаключениеОториноларинголога");
			КонецЕсли;
			
			ФилиалСотрудника = Осмотр.Сотрудник.Подразделение.Филиал;
			ОрганизацияСотрудника = ФилиалСотрудника.Организация;
			
			Если ЗначениеЗаполнено(ОрганизацияСотрудника) Тогда
				
				ДополнитьТаблицуПараметров(ТаблицаПараметров, ОрганизацияСотрудника.МедицинскаяОрганизация.ПолноеНаименование, "ОрганизацияОториноларинголога");
				КонтактыОрганизации = КонтактыОрганизацииФилиала(ФилиалСотрудника);
				Если КонтактыОрганизации <> Неопределено Тогда
					ДополнитьТаблицуПараметров(ТаблицаПараметров, КонтактыОрганизации, "КонтактыОрганизацииОториноларинголога");
				КонецЕсли;
				
				АдресОрганизации = АдресОрганизацииФилиала(ФилиалСотрудника);
				Если ЗначениеЗаполнено(АдресОрганизации) Тогда
					ДополнитьТаблицуПараметров(ТаблицаПараметров, АдресОрганизации, "АдресОрганизацииОториноларинголога");
				КонецЕсли;
			// Если заполнено подразделение минздрава но нет связи с организацией, то тянем наименование МО из классификатора МО
			ИначеЕсли ЗначениеЗаполнено(Осмотр.Сотрудник.Подразделение.ПодразделениеМинздрава) Тогда
				МОПодразделения = ПолучитьМОПоПодразделениюСотрудника(Осмотр.Сотрудник);
				Если ЗначениеЗаполнено(МОПодразделения) Тогда
					ДополнитьТаблицуПараметров(ТаблицаПараметров, МОПодразделения.ПолноеНаименование, "ОрганизацияОториноларинголога");
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Осмотр.ПриемСсылка) Тогда
				ДополнитьТаблицуПараметров(ТаблицаПараметров, Строка(Осмотр.ПриемСсылка.УникальныйИдентификатор()), "ИдентификаторМИСОсмотраОториноларинголога");
				// ДополнитьТаблицуПараметров(ТаблицаПараметров, , "ИдентификаторРЭМДОсмотраОториноларинголога"); 
			Иначе
				ДополнитьТаблицуПараметров(ТаблицаПараметров, Строка(ПМО.УникальныйИдентификатор()), "ИдентификаторМИСОсмотраОториноларинголога");
			КонецЕсли;
			
		ИначеЕсли Осмотр.СвязьСКлассификатором.УИДЕГИСЗ = 100 Тогда
			
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.СвязьСКлассификатором, "ДолжностьСтоматолога");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Сотрудник, "Стоматолог");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.ДатаВыполненияДействияМедосмотра, "ДатаОсмотраСтоматолога");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Заключение, "ПримечаниеСтоматолога");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Сотрудник.Подразделение.ПодразделениеМинздрава, "ПодразделениеСтоматолога");
			
			// Проверка на случай если попадет неопределено
			Если Осмотр.ВыявленыПротивопоказания = Истина Тогда
				ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(73), "ЗаключениеСтоматолога");
			Иначе
				ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(74), "ЗаключениеСтоматолога");
			КонецЕсли;
			
			ФилиалСотрудника = Осмотр.Сотрудник.Подразделение.Филиал;
			ОрганизацияСотрудника = ФилиалСотрудника.Организация;
			
			Если ЗначениеЗаполнено(ОрганизацияСотрудника) Тогда
				
				ДополнитьТаблицуПараметров(ТаблицаПараметров, ОрганизацияСотрудника.МедицинскаяОрганизация.ПолноеНаименование, "ОрганизацияСтоматолога");
				КонтактыОрганизации = КонтактыОрганизацииФилиала(ФилиалСотрудника);
				Если КонтактыОрганизации <> Неопределено Тогда
					ДополнитьТаблицуПараметров(ТаблицаПараметров, КонтактыОрганизации, "КонтактыОрганизацииСтоматолога");
				КонецЕсли;
				
				АдресОрганизации = АдресОрганизацииФилиала(ФилиалСотрудника);
				Если ЗначениеЗаполнено(АдресОрганизации) Тогда
					ДополнитьТаблицуПараметров(ТаблицаПараметров, АдресОрганизации, "АдресОрганизацииСтоматолога");
				КонецЕсли;
			// Если заполнено подразделение минздрава но нет связи с организацией, то тянем наименование МО из классификатора МО
			ИначеЕсли ЗначениеЗаполнено(Осмотр.Сотрудник.Подразделение.ПодразделениеМинздрава) Тогда
				МОПодразделения = ПолучитьМОПоПодразделениюСотрудника(Осмотр.Сотрудник);
				Если ЗначениеЗаполнено(МОПодразделения) Тогда
					ДополнитьТаблицуПараметров(ТаблицаПараметров, МОПодразделения.ПолноеНаименование, "ОрганизацияСтоматолога");
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Осмотр.ПриемСсылка) Тогда
				ДополнитьТаблицуПараметров(ТаблицаПараметров, Строка(Осмотр.ПриемСсылка.УникальныйИдентификатор()), "ИдентификаторМИСОсмотраСтоматолога");
				// ДополнитьТаблицуПараметров(ТаблицаПараметров, , "ИдентификаторРЭМДОсмотраСтоматолога"); 
			Иначе
				ДополнитьТаблицуПараметров(ТаблицаПараметров, Строка(ПМО.УникальныйИдентификатор()), "ИдентификаторМИСОсмотраСтоматолога");
			КонецЕсли;
			
		ИначеЕсли Осмотр.СвязьСКлассификатором.УИДЕГИСЗ = 109 Тогда
			
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.СвязьСКлассификатором, "ДолжностьТерапевта");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Сотрудник, "Терапевт");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.ДатаВыполненияДействияМедосмотра, "ДатаОсмотраТерапевта");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Заключение, "ПримечаниеТерапевта");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Сотрудник.Подразделение.ПодразделениеМинздрава, "ПодразделениеТерапевта");
			
			// Проверка на случай если попадет неопределено
			Если Осмотр.ВыявленыПротивопоказания = Истина Тогда
				ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(73), "ЗаключениеТерапевта");
			Иначе
				ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(74), "ЗаключениеТерапевта");
			КонецЕсли;
			
			ФилиалСотрудника = Осмотр.Сотрудник.Подразделение.Филиал;
			ОрганизацияСотрудника = ФилиалСотрудника.Организация;
			
			Если ЗначениеЗаполнено(ОрганизацияСотрудника) Тогда
				
				ДополнитьТаблицуПараметров(ТаблицаПараметров, ОрганизацияСотрудника.МедицинскаяОрганизация.ПолноеНаименование, "ОрганизацияТерапевта");
				КонтактыОрганизации = КонтактыОрганизацииФилиала(ФилиалСотрудника);
				Если КонтактыОрганизации <> Неопределено Тогда
					ДополнитьТаблицуПараметров(ТаблицаПараметров, КонтактыОрганизации, "КонтактыОрганизацииТерапевта");
				КонецЕсли;
				
				АдресОрганизации = АдресОрганизацииФилиала(ФилиалСотрудника);
				Если ЗначениеЗаполнено(АдресОрганизации) Тогда
					ДополнитьТаблицуПараметров(ТаблицаПараметров, АдресОрганизации, "АдресОрганизацииТерапевта");
				КонецЕсли;
			// Если заполнено подразделение минздрава но нет связи с организацией, то тянем наименование МО из классификатора МО
			ИначеЕсли ЗначениеЗаполнено(Осмотр.Сотрудник.Подразделение.ПодразделениеМинздрава) Тогда
				МОПодразделения = ПолучитьМОПоПодразделениюСотрудника(Осмотр.Сотрудник);
				Если ЗначениеЗаполнено(МОПодразделения) Тогда
					ДополнитьТаблицуПараметров(ТаблицаПараметров, МОПодразделения.ПолноеНаименование, "ОрганизацияТерапевта");
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Осмотр.ПриемСсылка) Тогда
				ДополнитьТаблицуПараметров(ТаблицаПараметров, Строка(Осмотр.ПриемСсылка.УникальныйИдентификатор()), "ИдентификаторМИСОсмотраТерапевта");
				// ДополнитьТаблицуПараметров(ТаблицаПараметров, , "ИдентификаторРЭМДОсмотраТерапевта");
			Иначе
				ДополнитьТаблицуПараметров(ТаблицаПараметров, Строка(ПМО.УникальныйИдентификатор()), "ИдентификаторМИСОсмотраТерапевта");
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Осмотр.Сотрудник, Осмотр.ДействиеМедосмотра) Тогда
			// Общие секции: данные исполнителя
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Сотрудник, "ЧленКомиссии");
			
			СтруктураЗаполнения = Новый Структура();
			СтруктураЗаполнения.Вставить("ГруппирующееПоле", ТаблицаПараметров.Количество() - 1);
			
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ПолучитьРольЧленаКомиссии(),												"РольСотрудникаЧленаМедкомиссииПриПодписанииМД", СтруктураЗаполнения);
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Строка(Осмотр.Сотрудник.УникальныйИдентификатор()),						"УИДЧленаМедкомиссии",							 СтруктураЗаполнения);
			ДополнитьТаблицуПараметров(ТаблицаПараметров, СтроковыеФункцииКлиентСервер.ПолучитьЦифрыСтроки(Осмотр.Сотрудник.СНИЛС),	"СНИЛСЧленаМедкомиссии",						 СтруктураЗаполнения);
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.СвязьСКлассификатором,												"ДолжностьЧленаМедкомиссии",					 СтруктураЗаполнения);
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ПолучитьРабочуюПочту(Осмотр.Сотрудник),									"КонтактыЧленаМедкомиссии",						 СтруктураЗаполнения);
			
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Сотрудник.Фамилия,	 "ФамилияЧленаМедкомиссии",	 СтруктураЗаполнения);
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Сотрудник.Имя,		 "ИмяЧленаМедкомиссии",		 СтруктураЗаполнения);
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Осмотр.Сотрудник.Отчество, "ОтчествоЧленаМедкомиссии", СтруктураЗаполнения);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМОПоПодразделениюСотрудника(Сотрудник)
	
	ПодразделениеМЗ = Сотрудник.Подразделение.ПодразделениеМинздрава;
	OIDМОПодразделения = ПодразделениеМЗ.Атрибуты.Найти("mo_oid");
	Если OIDМОПодразделения = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеестрМедицинскихОрганизаций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РеестрМедицинскихОрганизаций КАК РеестрМедицинскихОрганизаций
		|ГДЕ
		|	РеестрМедицинскихОрганизаций.OIDОрганизации = &OIDОрганизации
		|	И РеестрМедицинскихОрганизаций.ТестовыйКонтур = &ТестовыйКонтур
		|	И НЕ РеестрМедицинскихОрганизаций.Архив
		|	И НЕ РеестрМедицинскихОрганизаций.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("OIDОрганизации", OIDМОПодразделения.Значение);
	Запрос.УстановитьПараметр("ТестовыйКонтур", ПодразделениеМЗ.ТестовыйКонтур);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьДанныеЛабораторныхИсследований230(ПМО, ВредныйФактор, ЕстьПрививкаОтКори, ТаблицаДляПроверкиКорректностиЗаполнения = Неопределено) Экспорт
	
	МодульМедосмотрыСервер = ДопСерверныеФункции.ОбщийМодуль("МедосмотрыСервер");
	
	ПМОПредварительный = ПМО.ТипМедосмотра = Перечисления.ТипыМедосмотров.Предварительный;
	
	ДопустимыеИсследования = ПереченьДопустимыхЛабораторныхИсследований(ВредныйФактор, ПМОПредварительный, ЕстьПрививкаОтКори);
	
	// Используется для проверки того, что все обязательные действия выполнены
	ТаблицаДляПроверкиКорректностиЗаполнения = ДопустимыеИсследования;
	
	// Удаляем необязательные действия
	Для Каждого СтрокаНеобязательногоДействия Из ТаблицаДляПроверкиКорректностиЗаполнения.НайтиСтроки(Новый Структура("Обязательное", Ложь)) Цикл
		ТаблицаДляПроверкиКорректностиЗаполнения.Удалить(СтрокаНеобязательногоДействия);
	КонецЦикла;
	
	ТаблицаЛабИсследований = Новый ТаблицаЗначений;
	ТаблицаЛабИсследований.Колонки.Добавить("ДействиеМедосмотра");
	ТаблицаЛабИсследований.Колонки.Добавить("ПриемСсылка");
	ТаблицаЛабИсследований.Колонки.Добавить("ДатаВыполненияДействияМедосмотра");
	ТаблицаЛабИсследований.Колонки.Добавить("ВыявленыПротивопоказания");
	ТаблицаЛабИсследований.Колонки.Добавить("Сотрудник");
	ТаблицаЛабИсследований.Колонки.Добавить("СвязьСКлассификатором");
	ТаблицаЛабИсследований.Колонки.Добавить("Заключение");
	ТаблицаЛабИсследований.Колонки.Добавить("ТитрСерологическогоОбследования");
	
	// Опеределим исследования передаваемые для текущего фактора 
	СписокДействий = Новый Массив;
	Для Каждого СтрокаДействия Из ПМО.ДействияМедосмотра Цикл
		Если ТипЗнч(СтрокаДействия.Действие.СвязьСКлассификатором) = Тип("СправочникСсылка.КлассификаторыМинЗдрава")
			И СтрокаДействия.Действие.СвязьСКлассификатором.ВидКлассификатора = Перечисления.ВидыКлассификаторовМинЗдрава.ПрофилиЛабораторныхИсследований
			И ДопустимыеИсследования.Найти(СтрокаДействия.Действие.СвязьСКлассификатором.УИДЕГИСЗ, "ИсследованиеУИДЕГИСЗ") <> Неопределено 
		Тогда
			СписокДействий.Добавить(СтрокаДействия.Действие);
		КонецЕсли;
	КонецЦикла;
	
	ПриемыПоДействиямМедосмотров = МодульМедосмотрыСервер.ПриемыПоДействиямМедосмотров(ПМО, СписокДействий);
	
	ТаблицаПараметровИЗначений = МедосмотрыСервер.ПолучитьТаблицуДействийМедосмотраИЗначений(ПМО, СписокДействий);
	СписокПротивопоказаний = Документы.ПрохождениеМедосмотра.ПротивопоказанияМедОсмотра(ПМО);
	
	Для Каждого Действие Из СписокДействий Цикл
		
		ПриемПоДействию = ПриемыПоДействиямМедосмотров.Получить(Действие);
		
		// Проверка наличия приема
		Если ПриемПоДействию = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаЛабИсследования = ТаблицаЛабИсследований.Добавить();
		СтрокаЛабИсследования.ДействиеМедосмотра = Действие;
		СтрокаЛабИсследования.ПриемСсылка = ПриемПоДействию;
		СтрокаЛабИсследования.СвязьСКлассификатором = Действие.СвязьСКлассификатором;
		СтрокаЛабИсследования.ДатаВыполненияДействияМедосмотра = ПриемПоДействию.Дата;
		
		// Профнепригодность устанавливается по приему однозначно, если он не выполнял других действий медосмотров
		СтрокаЛабИсследования.ВыявленыПротивопоказания = НаличиеПротивопоказанийПоДействию230(ПриемПоДействию, Действие, ПМО);
		
		// Рассчитываем автозаключение
		ОтборДействиеМедосмотра = Новый Структура("ДействиеМедосмотра");
		ОтборДействиеМедосмотра.ДействиеМедосмотра = Действие;
		
		ТаблицаПараметровДействия = ТаблицаПараметровИЗначений.Скопировать(ТаблицаПараметровИЗначений.НайтиСтроки(ОтборДействиеМедосмотра));
		СтрокиВредныхФакторов = СписокПротивопоказаний.НайтиСтроки(Новый Структура("Действие", Действие));
		СписокВредныхФакторов = СписокПротивопоказаний.Скопировать(СтрокиВредныхФакторов, "ВредныйФактор").ВыгрузитьКолонку("ВредныйФактор");
		
		АвтоматическоеЗаключение = МедосмотрыСервер.ЗаключениеДляДействияМедОсмотра(СписокВредныхФакторов, "", ТаблицаПараметровДействия, Действие.Вид);
		Если ЗначениеЗаполнено(АвтоматическоеЗаключение) Тогда
			СтрокаЛабИсследования.Заключение = АвтоматическоеЗаключение;
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнитьСведениямиИзОтметокДляВыписки230(ПМО, ТаблицаЛабИсследований, СписокДействий);
	
	Для Каждого ЛабораторноеИсследование Из ТаблицаЛабИсследований Цикл
		Если ЗначениеЗаполнено(ЛабораторноеИсследование.СвязьСКлассификатором) Тогда
			// Удаляем все заполненные строки, оставляем только невыполненные обязательные действия
			СтрокаДляУдаления = ТаблицаДляПроверкиКорректностиЗаполнения.Найти(ЛабораторноеИсследование.СвязьСКлассификатором.УИДЕГИСЗ, "ИсследованиеУИДЕГИСЗ");
			Если СтрокаДляУдаления <> Неопределено Тогда
				ТаблицаДляПроверкиКорректностиЗаполнения.Удалить(СтрокаДляУдаления);
			КонецЕсли
		КонецЕсли;
	КонецЦикла;
	
	Возврат СформироватьОбъединеннуюТаблицуРезультатовДействий230(ТаблицаЛабИсследований, ПМО);
	
КонецФункции

Процедура ДополнитьТаблицуДаннымиЛабИсследований(ТаблицаПараметров, ДанныеЛабораторныхИсследований, ПМО)
	
	Для Каждого Исследование Из ДанныеЛабораторныхИсследований Цикл
		
		Если Не ЗначениеЗаполнено(Исследование.СвязьСКлассификатором) Тогда
			Продолжить;
		КонецЕсли;
		
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Исследование.СвязьСКлассификатором, "ПрофильЛабораторногоИсследования");
		
		СтруктураЗаполнения = Новый Структура();
		СтруктураЗаполнения.Вставить("ГруппирующееПоле",ТаблицаПараметров.Количество() - 1);
		
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Исследование.ДатаВыполненияДействияМедосмотра, "ДатаОбследования", СтруктураЗаполнения);
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Исследование.Заключение, "ПримечаниеИсследования", СтруктураЗаполнения);
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Исследование.ТитрСерологическогоОбследования, "ТитрПоРезультатамСерологическихОбследований", СтруктураЗаполнения);
		
		// Проверка на случай если попадет неопределено
		Если Исследование.ВыявленыПротивопоказания = Истина Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(55), "ЗаключениеЛабораторногоИсследования", СтруктураЗаполнения);
		Иначе
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(54), "ЗаключениеЛабораторногоИсследования", СтруктураЗаполнения);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Исследование.ПриемСсылка) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Строка(Исследование.ПриемСсылка.УникальныйИдентификатор()), "ИдентификаторМИСЛабораторногоИсследования", СтруктураЗаполнения);
			// ДополнитьТаблицуПараметров(ТаблицаПараметров, , "ИдентификаторРЭМДЛабораторногоИсследования", СтруктураЗаполнения); 
		Иначе
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Строка(ПМО.УникальныйИдентификатор()), "ИдентификаторМИСЛабораторногоИсследования", СтруктураЗаполнения);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеИнструментальногоИсследования230(ПМО, ВредныйФактор) Экспорт
	
	МодульМедосмотрыСервер = ДопСерверныеФункции.ОбщийМодуль("МедосмотрыСервер");
	
	ДопустимыеИсследования = ПереченьДопустимыхИнструментальныхИсследований(ВредныйФактор);
	
	ТаблицаИнстрИсследований = Новый ТаблицаЗначений;
	ТаблицаИнстрИсследований.Колонки.Добавить("ДействиеМедосмотра");
	ТаблицаИнстрИсследований.Колонки.Добавить("ПриемСсылка");
	ТаблицаИнстрИсследований.Колонки.Добавить("ДатаВыполненияДействияМедосмотра");
	ТаблицаИнстрИсследований.Колонки.Добавить("ВыявленыПротивопоказания");
	ТаблицаИнстрИсследований.Колонки.Добавить("Сотрудник");
	ТаблицаИнстрИсследований.Колонки.Добавить("СвязьСКлассификатором");
	ТаблицаИнстрИсследований.Колонки.Добавить("Заключение");
	ТаблицаИнстрИсследований.Колонки.Добавить("ТитрСерологическогоОбследования");
	 
	СписокДействий = Новый Массив;
	Для Каждого СтрокаДействия Из ПМО.ДействияМедосмотра Цикл
		Если ТипЗнч(СтрокаДействия.Действие.СвязьСКлассификатором) = Тип("СправочникСсылка.ИнструментальныеИсследования")
			И ДопустимыеИсследования.Найти(СтрокаДействия.Действие.СвязьСКлассификатором.УИДЕГИСЗ) <> Неопределено 
		Тогда
			СписокДействий.Добавить(СтрокаДействия.Действие);
		КонецЕсли;
	КонецЦикла;
	
	ПриемыПоДействиямМедосмотров = МодульМедосмотрыСервер.ПриемыПоДействиямМедосмотров(ПМО, СписокДействий);
	
	ТаблицаПараметровИЗначений	 = МедосмотрыСервер.ПолучитьТаблицуДействийМедосмотраИЗначений(ПМО, СписокДействий);
	СписокПротивопоказаний = Документы.ПрохождениеМедосмотра.ПротивопоказанияМедОсмотра(ПМО);
	
	Для Каждого Действие Из СписокДействий Цикл
		
		ПриемПоДействию = ПриемыПоДействиямМедосмотров.Получить(Действие);
		
		// Проверка наличия приема
		Если ПриемПоДействию = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаИнстрИсследования = ТаблицаИнстрИсследований.Добавить();
		СтрокаИнстрИсследования.ДействиеМедосмотра = Действие;
		СтрокаИнстрИсследования.ПриемСсылка = ПриемПоДействию;
		СтрокаИнстрИсследования.СвязьСКлассификатором = Действие.СвязьСКлассификатором;
		СтрокаИнстрИсследования.ДатаВыполненияДействияМедосмотра = ПриемПоДействию.Дата;
		
		// Профнепригодность устанавливается по приему однозначно, если он не выполнял других действий медосмотров
		СтрокаИнстрИсследования.ВыявленыПротивопоказания = НаличиеПротивопоказанийПоДействию230(ПриемПоДействию, Действие, ПМО);
		
		// Рассчитываем автозаключение
		ОтборДействиеМедосмотра = Новый Структура("ДействиеМедосмотра");
		ОтборДействиеМедосмотра.ДействиеМедосмотра = Действие;
		
		ТаблицаПараметровДействия = ТаблицаПараметровИЗначений.Скопировать(ТаблицаПараметровИЗначений.НайтиСтроки(ОтборДействиеМедосмотра));
		СтрокиВредныхФакторов = СписокПротивопоказаний.НайтиСтроки(Новый Структура("Действие", Действие));
		СписокВредныхФакторов = СписокПротивопоказаний.Скопировать(СтрокиВредныхФакторов, "ВредныйФактор").ВыгрузитьКолонку("ВредныйФактор");
		
		АвтоматическоеЗаключение = МедосмотрыСервер.ЗаключениеДляДействияМедОсмотра(СписокВредныхФакторов, "", ТаблицаПараметровДействия, Действие.Вид);
		Если ЗначениеЗаполнено(АвтоматическоеЗаключение) Тогда
			СтрокаИнстрИсследования.Заключение = АвтоматическоеЗаключение;
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнитьСведениямиИзОтметокДляВыписки230(ПМО, ТаблицаИнстрИсследований, СписокДействий);
	
	Возврат СформироватьОбъединеннуюТаблицуРезультатовДействий230(ТаблицаИнстрИсследований, ПМО, , Истина);
	
КонецФункции

Процедура ДополнитьТаблицуДаннымиИнстрИсследования(ТаблицаПараметров, ДанныеИнструментальногоИсследования, ПМО)
	
	Если ДанныеИнструментальногоИсследования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИнструментальноеИсследование = ДанныеИнструментальногоИсследования[0];
	
	Если Не ЗначениеЗаполнено(ИнструментальноеИсследование.СвязьСКлассификатором) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ИнструментальноеИсследование.СвязьСКлассификатором, "ИнструментальноеОбследование");
	
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ИнструментальноеИсследование.ДатаВыполненияДействияМедосмотра, "ДатаИнструментальногоОбследования");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ИнструментальноеИсследование.Заключение, "ПримечаниеИнструментальногоОбследования");
	
	// Проверка на случай если попадет неопределено
	Если ИнструментальноеИсследование.ВыявленыПротивопоказания = Истина Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(57), "ЗаключениеИнструментальногоОбследования");
	Иначе
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ЗаключениеМедосмотра(56), "ЗаключениеИнструментальногоОбследования");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнструментальноеИсследование.ПриемСсылка) Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Строка(ИнструментальноеИсследование.ПриемСсылка.УникальныйИдентификатор()), "ИдентификаторМИСИнструментальногоОбследования");
		// ДополнитьТаблицуПараметров(ТаблицаПараметров, , "ИдентификаторРЭМДИнструментальногоОбследования", СтруктураЗаполнения); 
	Иначе
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Строка(ПМО.УникальныйИдентификатор()), "ИдентификаторМИСИнструментальногоОбследования");
	КонецЕсли;
	
КонецПроцедуры

Функция ПереченьДопустимыхЛабораторныхИсследований(ВредныйФактор, ПМОПредварительный, ЕстьПрививкаОтКори) Экспорт
	
	ЛабораторныеИсследования = Новый ТаблицаЗначений;
	ЛабораторныеИсследования.Колонки.Добавить("ИсследованиеУИДЕГИСЗ");
	ЛабораторныеИсследования.Колонки.Добавить("Обязательное", Новый ОписаниеТипов("Булево"));
	
	Если ЕстьПрививкаОтКори Тогда
		ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10510, Ложь);
	Иначе
		ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10510, Истина);
	КонецЕсли;
	
	Если ВредныйФактор.УИДЕГИСЗ = 211 Тогда
		Если ПМОПредварительный Тогда
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10268, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10479, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10506, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10507, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10508, Истина);
		Иначе
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10268, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10506, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10479, Ложь);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10507, Ложь);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10508, Ложь);
		КонецЕсли;
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 212 Тогда
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10268, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10506, Истина);
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 213 Тогда
		Если ПМОПредварительный Тогда
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10268, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10479, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10506, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10507, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10509, Истина);
		Иначе
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10268, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10506, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10479, Ложь);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10507, Ложь);
		КонецЕсли;
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 214 Тогда
		Если ПМОПредварительный Тогда
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10479, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10506, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10507, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10509, Истина);
		Иначе
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10506, Истина);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10479, Ложь);
			ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, 10507, Ложь);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЛабораторныеИсследования;
	
КонецФункции

Функция ПереченьДопустимыхИнструментальныхИсследований(ВредныйФактор) Экспорт
	
	ИнструментальныеИсследования = Новый Массив;
	
	// Рентгенография флюорография легких
	ИнструментальныеИсследования.Добавить(7003320);
	
	// Рентгенография грудной клетки
	ИнструментальныеИсследования.Добавить(7002892);
	
	// Компьютерная томография груди
	ИнструментальныеИсследования.Добавить(7001894);
	
	// Рентгеноскопия грудной клетки
	ИнструментальныеИсследования.Добавить(7003288);
	
	Возврат ИнструментальныеИсследования;
	
КонецФункции

Процедура ДобавитьСтрокуВТЧЛабИсследований230(ЛабораторныеИсследования, ИсследованиеУИДЕГИСЗ, Обязательное)
	
	НоваяСтрока = ЛабораторныеИсследования.Добавить();
	НоваяСтрока.ИсследованиеУИДЕГИСЗ = ИсследованиеУИДЕГИСЗ;
	НоваяСтрока.Обязательное = Обязательное;
	
КонецПроцедуры

Функция ПолучитьПриемыСВидомЛабораторноеИсследование(ПМО) Экспорт
	
	МодульМедосмотрыСервер = ДопСерверныеФункции.ОбщийМодуль("МедосмотрыСервер");
	
	ТаблицаЛабораторныхИсследований = Новый ТаблицаЗначений;
	ТаблицаЛабораторныхИсследований.Колонки.Добавить("ДействиеМедосмотра");
	ТаблицаЛабораторныхИсследований.Колонки.Добавить("ПриемСсылка");
	ТаблицаЛабораторныхИсследований.Колонки.Добавить("ДатаВыполненияДействияМедосмотра");
	ТаблицаЛабораторныхИсследований.Колонки.Добавить("Заключение");
	
	// Из отметок для выписки
	
	// Сначала получаем для тех, которые были сопоставлены с приемами
	СписокДействий = Новый Массив;
	Для Каждого СтрокаДействия Из ПМО.ДействияМедосмотра Цикл
		Если СтрокаДействия.Действие.Вид = Перечисления.ВидыДействийМедицинскогоОсмотра.Исследование Тогда
			// Либо проверяем по виду исследования, либо по галочке "Анализ" в номенклатуре
			Если ЗначениеЗаполнено(СтрокаДействия.Действие.ВидИсследования) 
					И СтрокаДействия.Действие.ВидИсследования = Перечисления.ВидыИсследованийДействийМедосмотра.ЛабораторноеИсследование
				Или ЗначениеЗаполнено(СтрокаДействия.Действие.Номенклатура)
					И СтрокаДействия.Действие.Номенклатура.Анализ
			Тогда
				СписокДействий.Добавить(СтрокаДействия.Действие);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ПриемСоответствие Из МодульМедосмотрыСервер.ПриемыПоДействиямМедосмотров(ПМО, СписокДействий) Цикл
		СтрокаИсследования = ТаблицаЛабораторныхИсследований.Добавить();
		СтрокаИсследования.ДействиеМедосмотра = ПриемСоответствие.Ключ;
		СтрокаИсследования.ПриемСсылка = ПриемСоответствие.Значение;
		СтрокаИсследования.ДатаВыполненияДействияМедосмотра = ПриемСоответствие.Значение.Дата;
	КонецЦикла;
	
	// Затем добавляем отметки введенные вручную
	ДополнитьСведениямиИзОтметокДляВыписки(ПМО, ТаблицаЛабораторныхИсследований, Перечисления.ВидыДействийМедицинскогоОсмотра.Исследование, Перечисления.ВидыИсследованийДействийМедосмотра.ЛабораторноеИсследование);
	
	// Убираем дубли. Формируем массив структур. Если таблица пустая, добавляем значение по ПМО
	ВидДокумента = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(7, ,"Справочник.ВидыМедицинскихДокументов");
	
	Возврат СформироватьМассивСтруктурРезультатов(ТаблицаЛабораторныхИсследований, ПМО, ВидДокумента);
	
КонецФункции

Функция ПолучитьПриемыСВидомИнструментальноеИсследование(ПМО) Экспорт
	
	ТаблицаИнструментальныхИсследований = Новый ТаблицаЗначений;
	ТаблицаИнструментальныхИсследований.Колонки.Добавить("ДействиеМедосмотра");
	ТаблицаИнструментальныхИсследований.Колонки.Добавить("ПриемСсылка");
	ТаблицаИнструментальныхИсследований.Колонки.Добавить("ДатаВыполненияДействияМедосмотра");
	ТаблицаИнструментальныхИсследований.Колонки.Добавить("Заключение");
	
	// Из отметок для выписки
	
	// Сначала получаем для тех, которые были сопоставлены с приемами
	СписокДействий = Новый Массив;
	Для Каждого СтрокаДействия Из ПМО.ДействияМедосмотра Цикл
		Если СтрокаДействия.Действие.Вид = Перечисления.ВидыДействийМедицинскогоОсмотра.Исследование Тогда
			// Либо проверяем по виду исследования, либо по галочке "Анализ" в номенклатуре
			Если ЗначениеЗаполнено(СтрокаДействия.Действие.ВидИсследования) 
					И СтрокаДействия.Действие.ВидИсследования = Перечисления.ВидыИсследованийДействийМедосмотра.ИнструментальноеИсследование
				Или ЗначениеЗаполнено(СтрокаДействия.Действие.Номенклатура)
					И Не СтрокаДействия.Действие.Номенклатура.Анализ
					И Не ЗначениеЗаполнено(СтрокаДействия.Действие.ВидИсследования)
			Тогда
				СписокДействий.Добавить(СтрокаДействия.Действие);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ПриемСоответствие Из МедосмотрыСервер.ПриемыПоДействиямМедосмотров(ПМО, СписокДействий) Цикл
		СтрокаИсследования = ТаблицаИнструментальныхИсследований.Добавить();
		СтрокаИсследования.ДействиеМедосмотра = ПриемСоответствие.Ключ;
		СтрокаИсследования.ПриемСсылка = ПриемСоответствие.Значение;
		СтрокаИсследования.ДатаВыполненияДействияМедосмотра = ПриемСоответствие.Значение.Дата;
	КонецЦикла;
	
	// Затем добавляем отметки введенные вручную
	ДополнитьСведениямиИзОтметокДляВыписки(ПМО, ТаблицаИнструментальныхИсследований, Перечисления.ВидыДействийМедицинскогоОсмотра.Исследование, Перечисления.ВидыИсследованийДействийМедосмотра.ИнструментальноеИсследование);
	
	// Убираем дубли. Формируем массив структур. Если таблица пустая, оставляем пустой
	ВидДокумента = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(6, ,"Справочник.ВидыМедицинскихДокументов");
	
	Возврат СформироватьМассивСтруктурРезультатов(ТаблицаИнструментальныхИсследований, ПМО, ВидДокумента, Ложь);
	
КонецФункции

Функция ПолучитьПриемыСВидомКонсультация(ПМО) Экспорт
	
	МодульМедосмотрыСервер = ДопСерверныеФункции.ОбщийМодуль("МедосмотрыСервер");
	
	ТаблицаКонсультаций = Новый ТаблицаЗначений;
	ТаблицаКонсультаций.Колонки.Добавить("ДействиеМедосмотра");
	ТаблицаКонсультаций.Колонки.Добавить("ПриемСсылка");
	ТаблицаКонсультаций.Колонки.Добавить("ДатаВыполненияДействияМедосмотра");
	ТаблицаКонсультаций.Колонки.Добавить("Заключение");
	
	// Приёмы с отметкой действия Врача
	СписокДействий = Новый Массив;
	Для Каждого СтрокаДействия Из ПМО.ДействияМедосмотра Цикл
		Если СтрокаДействия.Действие.Вид = Перечисления.ВидыДействийМедицинскогоОсмотра.Врач Тогда
			СписокДействий.Добавить(СтрокаДействия.Действие);
		КонецЕсли;
	КонецЦикла;
	
	ПриемыПоДействиямМедосмотров = МодульМедосмотрыСервер.ПриемыПоДействиямМедосмотров(ПМО, СписокДействий);
	Для Каждого ПриемСоответствие Из ПриемыПоДействиямМедосмотров Цикл
		СтрокаКонсультации = ТаблицаКонсультаций.Добавить();
		СтрокаКонсультации.ДействиеМедосмотра = ПриемСоответствие.Ключ;
		СтрокаКонсультации.ПриемСсылка = ПриемСоответствие.Значение;
		СтрокаКонсультации.ДатаВыполненияДействияМедосмотра = ПриемСоответствие.Значение.Дата;
	КонецЦикла;
	
	// Из отметок для выписки
	ДополнитьСведениямиИзОтметокДляВыписки(ПМО, ТаблицаКонсультаций, Перечисления.ВидыДействийМедицинскогоОсмотра.Врач);
	
	ВидДокумента = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(5, ,"Справочник.ВидыМедицинскихДокументов");
	
	Возврат СформироватьМассивСтруктурРезультатов(ТаблицаКонсультаций, ПМО, ВидДокумента);
	
КонецФункции

Процедура ДополнитьСведениямиИзОтметокДляВыписки230(ПМО, ТаблицаПоВидуДействийМедосмотров, ДействияМедосмотра)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаключенияПоДействиямМедосмотра.Действие КАК Действие,
		|	ЗаключенияПоДействиямМедосмотра.ДатаВыполнения КАК ДатаВыполнения,
		|	ЗаключенияПоДействиямМедосмотра.Заключение КАК Заключение,
		|	ЗаключенияПоДействиямМедосмотра.Сотрудник КАК Сотрудник,
		|	ЗаключенияПоДействиямМедосмотра.ВыявленыПротивопоказания КАК ВыявленыПротивопоказания,
		|	ЗаключенияПоДействиямМедосмотра.ТитрСерологическогоОбследования КАК ТитрСерологическогоОбследования
		|ИЗ
		|	РегистрСведений.ЗаключенияПоДействиямМедосмотра КАК ЗаключенияПоДействиямМедосмотра
		|ГДЕ
		|	ЗаключенияПоДействиямМедосмотра.ПрохождениеМедОсмотра = &ПрохождениеМедОсмотра
		|	И ЗаключенияПоДействиямМедосмотра.Действие.Ссылка В(&ДействияМедосмотра)";
	
	Запрос.УстановитьПараметр("ПрохождениеМедОсмотра", ПМО);
	Запрос.УстановитьПараметр("ДействияМедосмотра", ДействияМедосмотра);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ТаблицаПоВидуДействийМедосмотров.Добавить();
		СтрокаТаблицы.ДействиеМедосмотра = Выборка.Действие;
		СтрокаТаблицы.ДатаВыполненияДействияМедосмотра = Выборка.ДатаВыполнения;
		СтрокаТаблицы.Заключение = Выборка.Заключение;
		СтрокаТаблицы.ВыявленыПротивопоказания = Выборка.ВыявленыПротивопоказания;
		СтрокаТаблицы.Сотрудник = Выборка.Сотрудник;
		СтрокаТаблицы.СвязьСКлассификатором = Выборка.Действие.СвязьСКлассификатором;
		СтрокаТаблицы.ТитрСерологическогоОбследования = Выборка.ТитрСерологическогоОбследования;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьСотрудникамиИзСоставаКомиссии230(ПМО, ТаблицаКонсультаций, СписокДействий)
	
	АктуальныйНаДатуЗавершенияСостав = МедосмотрыСерверПовтИсп.ПолучитьСоставМедкомиссии(ПМО.ДатаЗавершения, Истина, ПМО.Филиал);
	
	Для Каждого Действие Из СписокДействий Цикл
		Для Каждого ЧленМедкомиссии Из АктуальныйНаДатуЗавершенияСостав Цикл
			Если Не ЗначениеЗаполнено(ЧленМедкомиссии.Должность) Тогда
				Продолжить;
			КонецЕсли;
			Если ЧленМедкомиссии.Должность.УИДЕГИСЗ = Действие.СвязьСКлассификатором.УИДЕГИСЗ Тогда
				СтрокаТаблицы = ТаблицаКонсультаций.Добавить();
				СтрокаТаблицы.ДействиеМедосмотра = Действие;
				СтрокаТаблицы.Сотрудник = ЧленМедкомиссии.Сотрудник;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьСведениямиИзОтметокДляВыписки(ПМО, ТаблицаПоВидуДействийМедосмотров, ВидДействияМедосмотра, ВидИсследования = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаключенияПоДействиямМедосмотра.Действие КАК Действие,
		|	ЗаключенияПоДействиямМедосмотра.ДатаВыполнения КАК ДатаВыполнения,
		|	ЗаключенияПоДействиямМедосмотра.Заключение КАК Заключение
		|ИЗ
		|	РегистрСведений.ЗаключенияПоДействиямМедосмотра КАК ЗаключенияПоДействиямМедосмотра
		|ГДЕ
		|	ЗаключенияПоДействиямМедосмотра.ПрохождениеМедОсмотра = &ПрохождениеМедОсмотра
		|	И ЗаключенияПоДействиямМедосмотра.Действие.Вид = &ВидДействияМедосмотра
		|	И &УсловиеВидаИсследования
		|	И ЗаключенияПоДействиямМедосмотра.ДатаВыполнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	
	Запрос.УстановитьПараметр("ПрохождениеМедОсмотра", ПМО);
	Запрос.УстановитьПараметр("ВидДействияМедосмотра", ВидДействияМедосмотра);
	
	Если ЗначениеЗаполнено(ВидИсследования) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеВидаИсследования", "ЗаключенияПоДействиямМедосмотра.Действие.ВидИсследования = &ВидИсследования");
		Запрос.УстановитьПараметр("ВидИсследования", ВидИсследования);
	Иначе
		Запрос.УстановитьПараметр("УсловиеВидаИсследования", Истина);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаТаблицы = ТаблицаПоВидуДействийМедосмотров.Добавить();
		СтрокаТаблицы.ДействиеМедосмотра = Выборка.Действие;
		СтрокаТаблицы.ДатаВыполненияДействияМедосмотра = Выборка.ДатаВыполнения;
		СтрокаТаблицы.Заключение = Выборка.Заключение;
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьОбъединеннуюТаблицуРезультатовДействий230(ТаблицаПоВидуДействийМедосмотров, ПМО, ЭтоДействияВрача = Ложь, ЭтоИнструментальноеИсследование = Ложь)
	
	ТекстЗаключенияПоУмолчанию = МедосмотрыКлиентСервер.ТекстЗаключенияПоУмолчанию();
	
	ТаблицаУникальныеДействия = ТаблицаПоВидуДействийМедосмотров.Скопировать(, "ДействиеМедосмотра");
	ТаблицаУникальныеДействия.Свернуть("ДействиеМедосмотра");
	МассивДействий = ТаблицаУникальныеДействия.ВыгрузитьКолонку("ДействиеМедосмотра");
	
	// Объединяем строки оставляя максимальное количество данных
	ТаблицаПоВидуДействийМедосмотровОбъединенная = ТаблицаПоВидуДействийМедосмотров.СкопироватьКолонки();
	Для Каждого ДействиеПМО Из МассивДействий Цикл
		ДействиеМедосмотра = ДействиеПМО;
		ПриемСсылка = Неопределено;
		ДатаВыполненияДействияМедосмотра = Неопределено;
		Заключение = "";
		ВыявленыПротивопоказания = Ложь;
		Сотрудник = Неопределено;
		СвязьСКлассификатором = ДействиеПМО.СвязьСКлассификатором;
		ТитрСерологическогоОбследования = "";
		
		СтрокиДляОбъединения = ТаблицаПоВидуДействийМедосмотров.НайтиСтроки(Новый Структура("ДействиеМедосмотра", ДействиеПМО));
		
		Для Каждого СтрокаДляОбъединения Из СтрокиДляОбъединения Цикл
			Если Не ЗначениеЗаполнено(ПриемСсылка) Тогда
				ПриемСсылка = СтрокаДляОбъединения.ПриемСсылка;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ДатаВыполненияДействияМедосмотра) Тогда
				ДатаВыполненияДействияМедосмотра = СтрокаДляОбъединения.ДатаВыполненияДействияМедосмотра;
			КонецЕсли;
			Если Не ВыявленыПротивопоказания 
				И СтрокаДляОбъединения.ВыявленыПротивопоказания <> Неопределено 
			Тогда
				ВыявленыПротивопоказания = СтрокаДляОбъединения.ВыявленыПротивопоказания;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Сотрудник) Тогда
				Сотрудник = СтрокаДляОбъединения.Сотрудник;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ТитрСерологическогоОбследования) Тогда
				ТитрСерологическогоОбследования = СтрокаДляОбъединения.ТитрСерологическогоОбследования;
			КонецЕсли;
			// Запоминаем первый отличный от стандартного текст заключения
			Если ЗначениеЗаполнено(СтрокаДляОбъединения.Заключение)
				И (ЗначениеЗаполнено(ДействиеПМО.ТекстЗаключенияПоУмолчанию) 
				И СтрокаДляОбъединения.Заключение <> ДействиеПМО.ТекстЗаключенияПоУмолчанию
				Или Не ЗначениеЗаполнено(ДействиеПМО.ТекстЗаключенияПоУмолчанию)
				И СтрокаДляОбъединения.Заключение <> ТекстЗаключенияПоУмолчанию)
			Тогда
				Заключение = СтрокаДляОбъединения.Заключение;
			КонецЕсли;
		КонецЦикла;
		
		СтрокаОбъединеннойТаблицы = ТаблицаПоВидуДействийМедосмотровОбъединенная.Добавить();
		
		СтрокаОбъединеннойТаблицы.ДействиеМедосмотра				= ДействиеМедосмотра;
		СтрокаОбъединеннойТаблицы.ПриемСсылка						= ПриемСсылка;
		СтрокаОбъединеннойТаблицы.ДатаВыполненияДействияМедосмотра	= ДатаВыполненияДействияМедосмотра;
		СтрокаОбъединеннойТаблицы.ВыявленыПротивопоказания			= ВыявленыПротивопоказания;
		СтрокаОбъединеннойТаблицы.Сотрудник							= Сотрудник;
		СтрокаОбъединеннойТаблицы.СвязьСКлассификатором				= СвязьСКлассификатором;
		СтрокаОбъединеннойТаблицы.ТитрСерологическогоОбследования	= ТитрСерологическогоОбследования;
		
		Если Не ЗначениеЗаполнено(Заключение) Тогда
			Если ЗначениеЗаполнено(ДействиеМедосмотра.ТекстЗаключенияПоУмолчанию) Тогда
				СтрокаОбъединеннойТаблицы.Заключение = ДействиеМедосмотра.ТекстЗаключенияПоУмолчанию;
			Иначе
				СтрокаОбъединеннойТаблицы.Заключение = ТекстЗаключенияПоУмолчанию;
			КонецЕсли;
		Иначе
			СтрокаОбъединеннойТаблицы.Заключение = Заключение;
		КонецЕсли;
		
	КонецЦикла;
	
	УдалитьНаименееЗаполненныеДублиДействий230(ТаблицаПоВидуДействийМедосмотровОбъединенная, МассивДействий, ЭтоДействияВрача, ЭтоИнструментальноеИсследование);
	
	Возврат ТаблицаПоВидуДействийМедосмотровОбъединенная;
	
КонецФункции

Функция СформироватьМассивСтруктурРезультатов(ТаблицаПоВидуДействийМедосмотров, ПМО, ВидДокумента, ДополнитьПМО = Истина)
	
	ОписаниеСвязанногоДокументаПоУмолчанию = ОписаниеСвязанногоДокументаПоУмолчанию_194(ВидДокумента);
	ТекстЗаключенияПоУмолчанию = МедосмотрыКлиентСервер.ТекстЗаключенияПоУмолчанию();
	МассивСтруктурПоВидуДействийМедосмотра = Новый Массив;
	
	Если ТаблицаПоВидуДействийМедосмотров.Количество() = 0
		И ДополнитьПМО 
	Тогда
		СтруктураПоВидуДействийМедосмотра = Новый Структура;
		СтруктураПоВидуДействийМедосмотра.Вставить("Дата",				ПМО.Дата);
		СтруктураПоВидуДействийМедосмотра.Вставить("Документ",			ПМО);
		СтруктураПоВидуДействийМедосмотра.Вставить("Описание",			ОписаниеСвязанногоДокументаПоУмолчанию);
		СтруктураПоВидуДействийМедосмотра.Вставить("ВидДокумента",		ВидДокумента);
		СтруктураПоВидуДействийМедосмотра.Вставить("ИдентификаторМИС",	Строка(ПМО.УникальныйИдентификатор()));
		СтруктураПоВидуДействийМедосмотра.Вставить("ИдентификаторРЭМД",	Неопределено);
		МассивСтруктурПоВидуДействийМедосмотра.Добавить(СтруктураПоВидуДействийМедосмотра);
		Возврат МассивСтруктурПоВидуДействийМедосмотра;
	КонецЕсли;
	
	ТаблицаУникальныеДействия = ТаблицаПоВидуДействийМедосмотров.Скопировать(, "ДействиеМедосмотра");
	ТаблицаУникальныеДействия.Свернуть("ДействиеМедосмотра");
	МассивДействий = ТаблицаУникальныеДействия.ВыгрузитьКолонку("ДействиеМедосмотра");
	
	ЗаключенияДействий = ПолучитьЗаключенияПриемов(МассивДействий, ПМО);
	ТаблицаПараметровИЗначений = МедосмотрыСервер.ПолучитьТаблицуДействийМедосмотраИЗначений(ПМО, МассивДействий);
	СписокПротивопоказаний = Документы.ПрохождениеМедосмотра.ПротивопоказанияМедОсмотра(ПМО);
	
	// Объединяем строки оставляя максимальное количество данных
	ТаблицаПоВидуДействийМедосмотровОбъединенная = ТаблицаПоВидуДействийМедосмотров.СкопироватьКолонки();
	Для Каждого ДействиеПМО Из МассивДействий Цикл
		ДействиеМедосмотра = ДействиеПМО;
		ПриемСсылка = Неопределено;
		ДатаВыполненияДействияМедосмотра = Неопределено;
		Заключение = Неопределено;
		
		СтрокиДляОбъединения = ТаблицаПоВидуДействийМедосмотров.НайтиСтроки(Новый Структура("ДействиеМедосмотра", ДействиеПМО));
		
		Для Каждого СтрокаДляОбъединения Из СтрокиДляОбъединения Цикл
			Если Не ЗначениеЗаполнено(ПриемСсылка) Тогда
				ПриемСсылка = СтрокаДляОбъединения.ПриемСсылка;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ДатаВыполненияДействияМедосмотра) Тогда
				ДатаВыполненияДействияМедосмотра = СтрокаДляОбъединения.ДатаВыполненияДействияМедосмотра;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(Заключение) Тогда
				Если ЗначениеЗаполнено(СтрокаДляОбъединения.Заключение) Тогда
					Заключение = СтрокаДляОбъединения.Заключение;
				Иначе
					Заключения = ЗаключенияДействий.НайтиСтроки(Новый Структура("Действие", ДействиеПМО));
					Если Заключения.Количество() <> 0 Тогда
						Заключение = Заключения[0].Заключение;
					Иначе
						ОтборДействиеМедосмотра = Новый Структура("ДействиеМедосмотра");
						ОтборДействиеМедосмотра.ДействиеМедосмотра = ДействиеПМО;
						ТаблицаПараметровДействия = ТаблицаПараметровИЗначений.Скопировать(ТаблицаПараметровИЗначений.НайтиСтроки(ОтборДействиеМедосмотра));
						СтрокиВредныхФакторов = СписокПротивопоказаний.НайтиСтроки(Новый Структура("Действие", ДействиеПМО));
						СписокВредныхФакторов = СписокПротивопоказаний.Скопировать(СтрокиВредныхФакторов, "ВредныйФактор").ВыгрузитьКолонку("ВредныйФактор");
						АвтоматическоеЗаключение = МедосмотрыСервер.ЗаключениеДляДействияМедОсмотра(СписокВредныхФакторов, "", ТаблицаПараметровДействия, ДействиеПМО.Вид);
						Если ЗначениеЗаполнено(АвтоматическоеЗаключение) Тогда
							Заключение = АвтоматическоеЗаключение;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		СтрокаОбъединеннойТаблицы = ТаблицаПоВидуДействийМедосмотровОбъединенная.Добавить();
		
		СтрокаОбъединеннойТаблицы.ДействиеМедосмотра				 = ДействиеМедосмотра;
		СтрокаОбъединеннойТаблицы.ПриемСсылка						 = ПриемСсылка;
		СтрокаОбъединеннойТаблицы.ДатаВыполненияДействияМедосмотра	 = ДатаВыполненияДействияМедосмотра;
		СтрокаОбъединеннойТаблицы.Заключение						 = Заключение;
	КонецЦикла;
	
	ТаблицаУникальныеПриемы = ТаблицаПоВидуДействийМедосмотров.Скопировать(, "ПриемСсылка");
	ТаблицаУникальныеПриемы.Свернуть("ПриемСсылка");
	МассивПриемов = ТаблицаУникальныеПриемы.ВыгрузитьКолонку("ПриемСсылка");
	
	Для Каждого Прием Из МассивПриемов Цикл
		
		Если Не ЗначениеЗаполнено(Прием) Тогда
			Продолжить;
		КонецЕсли;
		
		мЧастиОписания = Новый Массив;
		СтрокиПоПриему = ТаблицаПоВидуДействийМедосмотровОбъединенная.НайтиСтроки(Новый Структура("ПриемСсылка", Прием));
		Для Каждого СтрокаПоПриему Из СтрокиПоПриему Цикл
			мЧастиОписания.Добавить(ФормированиеОписанияДокумента(СтрокаПоПриему, ТекстЗаключенияПоУмолчанию, ОписаниеСвязанногоДокументаПоУмолчанию));
		КонецЦикла;
		
		Если мЧастиОписания.Количество() > 0 Тогда
			Описание = СтрСоединить(мЧастиОписания, "; ");
		Иначе
			Описание = ОписаниеСвязанногоДокументаПоУмолчанию;
		КонецЕсли;
		
		СтруктураПоВидуДействийМедосмотра = Новый Структура;
		СтруктураПоВидуДействийМедосмотра.Вставить("Дата",				Прием.Дата);
		СтруктураПоВидуДействийМедосмотра.Вставить("Документ",			Прием);
		СтруктураПоВидуДействийМедосмотра.Вставить("Описание",			Описание);
		СтруктураПоВидуДействийМедосмотра.Вставить("ВидДокумента",		ВидДокумента);
		СтруктураПоВидуДействийМедосмотра.Вставить("ИдентификаторМИС",	Строка(Прием.УникальныйИдентификатор()));
		СтруктураПоВидуДействийМедосмотра.Вставить("ИдентификаторРЭМД",	Неопределено);
		МассивСтруктурПоВидуДействийМедосмотра.Добавить(СтруктураПоВидуДействийМедосмотра);
	КонецЦикла;
	
	СтрокиБезПриема = ТаблицаПоВидуДействийМедосмотровОбъединенная.НайтиСтроки(Новый Структура("ПриемСсылка", Неопределено));
	
	Для Каждого СтрокаБезПриема Из СтрокиБезПриема Цикл
		
		Описание = ФормированиеОписанияДокумента(СтрокаБезПриема, ТекстЗаключенияПоУмолчанию, ОписаниеСвязанногоДокументаПоУмолчанию);
		
		СтруктураПоВидуДействийМедосмотра = Новый Структура;
		СтруктураПоВидуДействийМедосмотра.Вставить("Дата",				СтрокаБезПриема.ДатаВыполненияДействияМедосмотра);
		СтруктураПоВидуДействийМедосмотра.Вставить("Документ",			Неопределено);
		СтруктураПоВидуДействийМедосмотра.Вставить("Описание",			Описание);
		СтруктураПоВидуДействийМедосмотра.Вставить("ВидДокумента",		ВидДокумента);
		СтруктураПоВидуДействийМедосмотра.Вставить("ИдентификаторМИС",	Неопределено);
		СтруктураПоВидуДействийМедосмотра.Вставить("ИдентификаторРЭМД",	Неопределено);
		МассивСтруктурПоВидуДействийМедосмотра.Добавить(Новый Структура("Описание, ВидДокумента, Дата, ИдентификаторМИС, ИдентификаторРЭМД, Документ", Описание, ВидДокумента, СтрокаБезПриема.ДатаВыполненияДействияМедосмотра));
	КонецЦикла;
	
	Возврат МассивСтруктурПоВидуДействийМедосмотра;
	
КонецФункции

Функция ФормированиеОписанияДокумента(СтрокаТаблицыПоВиду, ТекстЗаключенияПоУмолчанию, ОписаниеСвязанногоДокументаПоУмолчанию)
	
	Описание = "";
	Если ЗначениеЗаполнено(СтрокаТаблицыПоВиду.ДействиеМедосмотра) Тогда
		НаименованиеВидаДокумента = "Протокол осмотра";
		Если ЗначениеЗаполнено(СтрокаТаблицыПоВиду.ДействиеМедосмотра.ВидИсследования) 
			И СтрокаТаблицыПоВиду.ДействиеМедосмотра.ВидИсследования = Перечисления.ВидыИсследованийДействийМедосмотра.ЛабораторноеИсследование 
		Тогда
			НаименованиеВидаДокумента = "Протокол лабораторного исследования";
		КонецЕсли;
		
		ДатаДействия = "";
		Если ЗначениеЗаполнено(СтрокаТаблицыПоВиду.ДатаВыполненияДействияМедосмотра) Тогда
			ДатаДействия = "от " + Формат(СтрокаТаблицыПоВиду.ДатаВыполненияДействияМедосмотра, "ДФ=dd.MM.yyyy");
		КонецЕсли;
		
		ТекстЗаключенияПоУмолчанию = ?(ЗначениеЗаполнено(СтрокаТаблицыПоВиду.ДействиеМедосмотра.ТекстЗаключенияПоУмолчанию),СтрокаТаблицыПоВиду.ДействиеМедосмотра.ТекстЗаключенияПоУмолчанию,ТекстЗаключенияПоУмолчанию);
		Если ЗначениеЗаполнено(СтрокаТаблицыПоВиду.Заключение) Тогда
			Заключение = СтрокаТаблицыПоВиду.Заключение;
		Иначе
			Заключение = ТекстЗаключенияПоУмолчанию;
		КонецЕсли;
		Описание = СтрШаблон("%1 %2 %3: %4", НаименованиеВидаДокумента, ДатаДействия, СтрокаТаблицыПоВиду.ДействиеМедосмотра.Наименование, Заключение);
	Иначе
		Описание = ОписаниеСвязанногоДокументаПоУмолчанию;
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

Функция ПолучитьЗаключенияПриемов(МассивДействий, ПМО)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаключенияПоДействиямМедосмотра.Заключение КАК Заключение,
	               |	ЗаключенияПоДействиямМедосмотра.Действие КАК Действие
	               |ИЗ
	               |	РегистрСведений.ЗаключенияПоДействиямМедосмотра КАК ЗаключенияПоДействиямМедосмотра
	               |ГДЕ
	               |	ЗаключенияПоДействиямМедосмотра.ПрохождениеМедОсмотра = &ПрохождениеМедОсмотра
	               |	И ЗаключенияПоДействиямМедосмотра.Действие В(&Действия)";
	
	Запрос.УстановитьПараметр("ПрохождениеМедОсмотра", ПМО);
	Запрос.УстановитьПараметр("Действия", МассивДействий);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеСвязанногоДокументаПоУмолчанию_194(ВидДокумента)
	
	Если ВидДокумента = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(5, ,"Справочник.ВидыМедицинскихДокументов") Тогда
		Возврат "Консультация";
	ИначеЕсли ВидДокумента = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(7, ,"Справочник.ВидыМедицинскихДокументов") Тогда
		Возврат "Лабораторное исследование";
	КонецЕсли;
	
	Возврат "—";
	
КонецФункции

Процедура ЗаполнитьТаблицуПараметровПоВК(ТаблицаПараметров, Ссылка, СоответствияПараметрам)
	
	//ВрачебнаяКомиссияЛН = ЗначениеЗаполнено(Ссылка.Основание) И ДопСерверныеФункции.ИмяСсылочногоТипа(Ссылка.Основание) = "Документ.ЛистокНетрудоспособности";
	
	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Заключение,			"РешениеВрачебнойКомиссии");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Номер,					"НомерВрачебнойКомиссии");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Дата,					"ДатаПротоколаВрачебнойКомиссии");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.РассмотренныеВопросы,	"ПереченьОбсуждаемыхВопросов");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Цель,					"ЦельПроведенияВрачебнойКомиссии");
	
	ВидыНозологическихЕдиниц = ВидыНозологическихЕдиницПоКлассификатору();
	
	Для Каждого Диагноз Из Ссылка.Диагнозы Цикл
		ВидНозологическойЕдиницы = ВидыНозологическихЕдиниц.Получить(Диагноз.ВидНозологическойЕдиницы);
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Диагноз.Диагноз, "Диагноз");
		ИндексГруппирующегоПоля = ТаблицаПараметров.Количество() - 1;
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ВидНозологическойЕдиницы, "ВидНозологическойЕдиницы", Новый Структура("ГруппирующееПоле", ИндексГруппирующегоПоля));
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Диагноз.Описание, "ТекстовоеОписаниеНозологическойЕдиницы", Новый Структура("ГруппирующееПоле", ИндексГруппирующегоПоля));
	КонецЦикла;
	
	//Если ВрачебнаяКомиссияЛН Тогда
	//	ДополнитьТаблицуПараметров(ТаблицаПараметров, ВрачебнаяКомиссияВыявленоПриЭкспертизе(Ссылка), "РешениеВрачебнойКомиссии");
	//Иначе
	//	
	//	НомераЭтаповТалона = НомераЭтаповТалонаСМППоКлассификатору();
	//	
	//	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.КодСМП,							"КодСМП");
	//	ДополнитьТаблицуПараметров(ТаблицаПараметров, НомераЭтаповТалона.Получить(Ссылка.Этап),	"НомерЭтапаТалона");
	//	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.РешениеОГоспитализации,			"РешениеОГоспитализации");
	//	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.ПричинаОтказаОтГоспитализации,		"ПричинаОтказаОтГоспитализации");
	//	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.ДатаУведомления,					"ДатаУведомления");
	//	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.СпособУведомления,					"СпособУведомления");
	//КонецЕсли;
	
	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.ПредседательКомиссии, "Сотрудник");
	
КонецПроцедуры

Функция ВидыНозологическихЕдиницПоКлассификатору() Экспорт
	
	ВидыНозологическихЕдиниц = Новый Соответствие;
	ВидыНозологическихЕдиниц.Вставить(Перечисления.КлассификацииДиагнозов.ОсновноеЗаболевание,					НозологическаяЕдиницаОсновногоДиагноза());
	ВидыНозологическихЕдиниц.Вставить(Перечисления.КлассификацииДиагнозов.ОсложнениеОсновногоЗаболевания,		ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидыНозологическихЕдиниц(2));
	ВидыНозологическихЕдиниц.Вставить(Перечисления.КлассификацииДиагнозов.СопутствующееЗаболевание,				ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидыНозологическихЕдиниц(3));
	ВидыНозологическихЕдиниц.Вставить(Перечисления.КлассификацииДиагнозов.КонкурирующееЗаболевание,				ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидыНозологическихЕдиниц(4));
	ВидыНозологическихЕдиниц.Вставить(Перечисления.КлассификацииДиагнозов.ВнешняяПричина,						ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидыНозологическихЕдиниц(5));
	ВидыНозологическихЕдиниц.Вставить(Перечисления.КлассификацииДиагнозов.ФоновоеЗаболевание,					ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидыНозологическихЕдиниц(6));
	ВидыНозологическихЕдиниц.Вставить(Перечисления.КлассификацииДиагнозов.ОсложнениеСопутствующегоЗаболевания,	ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидыНозологическихЕдиниц(7));
	
	Возврат ВидыНозологическихЕдиниц;
	
КонецФункции

Функция СтепениОбоснованностиДиагнозаПоКлассификатору() Экспорт
	
	СтепениОбоснованности = Новый Соответствие;
	СтепениОбоснованности.Вставить(Перечисления.КлассификацииДиагнозов.Предварительный,	ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(1, Перечисления.ВидыКлассификаторовМинЗдрава.СтепеньОбоснованностиДиагноза));
	СтепениОбоснованности.Вставить(Перечисления.КлассификацииДиагнозов.Окончательный,	ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(3, Перечисления.ВидыКлассификаторовМинЗдрава.СтепеньОбоснованностиДиагноза));
	
	Возврат СтепениОбоснованности;
	
КонецФункции

Функция УточненияХарактераДиагнозаПоКлассификатору() Экспорт
	
	УточненияХарактера = Новый Соответствие;
	УточненияХарактера.Вставить(Перечисления.КлассификацииДиагнозов.ХроническоеВпервыеВыявленное,	ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(1, Перечисления.ВидыКлассификаторовМинЗдрава.ХарактерЗаболевания));
	УточненияХарактера.Вставить(Перечисления.КлассификацииДиагнозов.ХроническоеРанееВыявленное,		ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(2, Перечисления.ВидыКлассификаторовМинЗдрава.ХарактерЗаболевания));
	УточненияХарактера.Вставить(Перечисления.КлассификацииДиагнозов.Острое,							ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(3, Перечисления.ВидыКлассификаторовМинЗдрава.ХарактерЗаболевания));
	
	Возврат УточненияХарактера;
	
КонецФункции

Функция НомераЭтаповТалонаСМППоКлассификатору()
	
	НомераЭтаповТалона = Новый Соответствие;
	НомераЭтаповТалона.Вставить(Перечисления[ИмяПеречисленияЭтаповТалона()].ОказаниеМедицинсойПомощи,	ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭтапыТалонаНаОказаниеВысокотехнологичнойМедицинскойПомощи(5));
	НомераЭтаповТалона.Вставить(Перечисления[ИмяПеречисленияЭтаповТалона()].Заключение,					ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭтапыТалонаНаОказаниеВысокотехнологичнойМедицинскойПомощи(6));
	
	Возврат НомераЭтаповТалона;
	
КонецФункции

Функция ИмяПеречисленияЭтаповТалона()
	
	Возврат "ЭтапыТалонаСМП";
	
КонецФункции

Функция ВрачебнаяКомиссияВыявленоПриЭкспертизе(Ссылка)
	
	Возврат СтрШаблон("Жалобы и динамика состояния: %1Проведенное обследование и лечение:%3", Ссылка.Жалобы + Символы.ПС, Ссылка.Лечение);
	
КонецФункции

Функция ПолучитьДанныеКлиентаИзСписка(ПМО)
	
	ДанныеКлиента = Новый Структура("ЦехУчасток, Профессия");
	СПМО = ПМО.СписокНаПрохождениеМедосмотра;
	СтрокиКлиента = СПМО.Клиенты.НайтиСтроки(Новый Структура("Клиент", ПМО.Клиент));
	
	Для Каждого СтрокаКлиента Из СтрокиКлиента Цикл
		ЗаполнитьЗначенияСвойств(ДанныеКлиента, СтрокаКлиента);
		Прервать;
	КонецЦикла;
	
	Возврат ДанныеКлиента;
	
КонецФункции

Функция ДолжностьИзСтрокиПоКлассификатору(ДолжностьСтрокой)
	
	Должность = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.Должность(, ДолжностьСтрокой);
	
	//Если Должность = Неопределено Тогда
	//	Должность = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.Должность(7462);
	//КонецЕсли;
	
	Возврат Должность;
	
КонецФункции

Функция ЗаключениеМедосмотра(УИДЕГИСЗ) Экспорт
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.Заключение(УИДЕГИСЗ);
	
КонецФункции

Функция ВредныеФакторыДокумента(ПрохождениеМедосмотра) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементыКлассификаторовСНомерами.Ссылка КАК ВредныйФактор
		|ИЗ
		|	Документ.ПрохождениеМедосмотра.ФакторыИУсловияРаботы КАК ПрохождениеМедосмотраФакторыИУсловияРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПереченьВредныхФакторовИРабот КАК ВредныеФакторы
		|		ПО (ПрохождениеМедосмотраФакторыИУсловияРаботы.Ссылка = &ПрохождениеМедосмотра)
		|			И (ВредныеФакторы.Ссылка = ПрохождениеМедосмотраФакторыИУсловияРаботы.Фактор)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КлассификаторыМинЗдрава.Ссылка КАК Ссылка,
		|			ВЫРАЗИТЬ(КлассификаторыМинЗдраваАтрибуты.Значение КАК СТРОКА(10)) КАК НомерПП
		|		ИЗ
		|			Справочник.КлассификаторыМинЗдрава КАК КлассификаторыМинЗдрава
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторыМинЗдрава.Атрибуты КАК КлассификаторыМинЗдраваАтрибуты
		|				ПО (КлассификаторыМинЗдрава.ВидКлассификатора = ЗНАЧЕНИЕ(Перечисление.ВидыКлассификаторовМинЗдрава.ПрофессиональныеВредностиПациента))
		|					И КлассификаторыМинЗдрава.Ссылка = КлассификаторыМинЗдраваАтрибуты.Ссылка
		|					И (НЕ КлассификаторыМинЗдрава.Архив)
		|					И (КлассификаторыМинЗдраваАтрибуты.Ключ = ""NUMBER"")) КАК ЭлементыКлассификаторовСНомерами
		|		ПО (ЭлементыКлассификаторовСНомерами.НомерПП = ВредныеФакторы.НомерПП)
		|			И (ПрохождениеМедосмотраФакторыИУсловияРаботы.Фактор.Приказ = ЗНАЧЕНИЕ(Справочник.ПриказыМедосмотров.Приказ29н))";
	
	Запрос.УстановитьПараметр("ПрохождениеМедосмотра", ПрохождениеМедосмотра);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВредныйФактор");
	
КонецФункции

Функция ГруппаЗдоровьяПоДиспансернойГруппеМедосмотра(ПрохождениеМедосмотра)
	
	УИДыГруппЗдоровья = Новый Соответствие;
	УИДыГруппЗдоровья.Вставить(Перечисления.ГруппыЗдоровья.I,	 1);
	УИДыГруппЗдоровья.Вставить(Перечисления.ГруппыЗдоровья.II,	 2);
	УИДыГруппЗдоровья.Вставить(Перечисления.ГруппыЗдоровья.IIIа, 3);
	УИДыГруппЗдоровья.Вставить(Перечисления.ГруппыЗдоровья.IIIб, 4);
	УИДыГруппЗдоровья.Вставить(Перечисления.ГруппыЗдоровья.III,	 5);
	УИДыГруппЗдоровья.Вставить(Перечисления.ГруппыЗдоровья.IV,	 6);
	УИДыГруппЗдоровья.Вставить(Перечисления.ГруппыЗдоровья.V,	 7);
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ГруппаЗдоровья(УИДыГруппЗдоровья.Получить(ПрохождениеМедосмотра.ДиспансернаяГруппа));
	
КонецФункции

Функция ПолучитьСтруктуруТаблицПараметровШаблона()
	
	ЗначенияПараметровHTML = Новый ТаблицаЗначений;
	ЗначенияПараметровHTML.Колонки.Добавить("Параметр");
	ЗначенияПараметровHTML.Колонки.Добавить("Документ");
	ЗначенияПараметровHTML.Колонки.Добавить("ИдентификаторСтрокиШаблона");
	ЗначенияПараметровHTML.Колонки.Добавить("Значение");
	ЗначенияПараметровHTML.Колонки.Добавить("Представление");
	ЗначенияПараметровHTML.Колонки.Добавить("СтрокаУидПараметра");
	
	ДанныеТаблицШаблоновПриема = Новый ТаблицаЗначений;
	ДанныеТаблицШаблоновПриема.Колонки.Добавить("ИдентификаторТаблицы");
	ДанныеТаблицШаблоновПриема.Колонки.Добавить("НомерСтрокиТаблицы");
	ДанныеТаблицШаблоновПриема.Колонки.Добавить("Параметр");
	ДанныеТаблицШаблоновПриема.Колонки.Добавить("Документ");
	ДанныеТаблицШаблоновПриема.Колонки.Добавить("ИдентификаторСтрокиШаблона");
	ДанныеТаблицШаблоновПриема.Колонки.Добавить("Значение");
	ДанныеТаблицШаблоновПриема.Колонки.Добавить("Представление");
	ДанныеТаблицШаблоновПриема.Колонки.Добавить("ИдентификаторСтроки");
	ДанныеТаблицШаблоновПриема.Колонки.Добавить("ИдентификаторРодительскойСтроки");
	ДанныеТаблицШаблоновПриема.Колонки.Добавить("АвтозаполнениеИзДанныхДокумента", Новый ОписаниеТипов("Булево"));
	
	Возврат Новый Структура("ЗначенияПараметровHTML, ДанныеТаблицШаблоновПриема", ЗначенияПараметровHTML, ДанныеТаблицШаблоновПриема);
	
КонецФункции

Функция ОбъединитьСекции(ОбщиеСекции, ИндивидуальныеСекции)
	
	XMLОбщиеСекции = ПолучитьXML(ОбщиеСекции);
	XMLИндивидуальныеСекции = ПолучитьXML(ИндивидуальныеСекции);
	
	component = XMLОбщиеСекции.СоздатьЭлемент("component");
	structuredBody = XMLОбщиеСекции.СоздатьЭлемент("structuredBody");
	component.ДобавитьДочерний(structuredBody);
	
	Для Каждого Узел Из XMLИндивидуальныеСекции.ПервыйДочерний.ДочерниеУзлы Цикл
		structuredBody.ДобавитьДочерний(Узел.КлонироватьУзел(Истина));
	КонецЦикла;
	
	Для Каждого ДочернийУзел Из XMLОбщиеСекции.ДочерниеУзлы Цикл
		Если ДочернийУзел.ИмяУзла = "ClinicalDocument" Тогда
			ДочернийУзел.ДобавитьДочерний(component);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат РаботаСDOMКлиентСервер.СтрокаXMLИзDOM(XMLОбщиеСекции);
	
КонецФункции

Функция СформироватьИндивидуальныеСекции(ТаблицаПараметров, МакетXML, ДокументHTML, НезагруженныеКлассификаторы, ДополнительныеДанные)
	
	Документ = ПолучитьXML(МакетXML);
	
	УзлыДляУдаления = Новый Массив;
	КлонированныеУзлы = Новый Массив;
	СписокLocalid = СписокLocalidМакета(МакетXML);
	СписокLocalid.Вставить("Сотрудник", Новый Структура("localid", "Сотрудник"));
	РекурсивныйОбходXML(Документ.ЭлементДокумента, ТаблицаПараметров, УзлыДляУдаления, Новый Соответствие, ДокументHTML, СписокLocalid, КлонированныеУзлы, НезагруженныеКлассификаторы, ДополнительныеДанные);
	
	Для Каждого УзелДляУдаления Из УзлыДляУдаления Цикл
		РодительУзла = УзелДляУдаления.РодительскийУзел;
		РодительУзла.УдалитьДочерний(УзелДляУдаления);
	КонецЦикла;
	
	Для Каждого КлонированныйУзел Из КлонированныеУзлы Цикл
		КлонированныйУзел.УдалитьАтрибут("КлонированныйУзел");
	КонецЦикла;
	
	Возврат РаботаСDOMКлиентСервер.СтрокаXMLИзDOM(Документ);
	
КонецФункции

Функция ПолучитьXML(ТекстXML)
	
	Возврат РаботаСDOMКлиентСервер.DOMИзСтрокиXML(ТекстXML);
	
КонецФункции

Процедура ДополнитьТаблицуПараметров(ТаблицаПараметров, Значение = Неопределено, localid = Неопределено, ДругиеЗначения = Неопределено)
	
	НоваяСтрока = ТаблицаПараметров.Добавить();
	НоваяСтрока.Значение	= Значение;
	НоваяСтрока.localid		= localid;
	
	Если ДругиеЗначения <> Неопределено Тогда
		Для Каждого КлючИЗначение Из ДругиеЗначения Цикл
			Попытка
				НоваяСтрока[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			Исключение КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ДолжностьУчаствуетВПодписании(Должность)
	
	УИДДолжности = Должность.УИДЕГИСЗ;
	ВыборкаПравил = Справочники.РЭМДПравилаПодписи.Выбрать();
	Пока ВыборкаПравил.Следующий() Цикл
		Если Не ЗначениеЗаполнено(ВыборкаПравил.Роль) Тогда
			Продолжить;
		КонецЕсли;
		СписокДолжностей = СтрРазделить(ВыборкаПравил.Должности, ", ", Ложь);
		Если СписокДолжностей.Найти(Строка(УИДДолжности)) <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ЕстьПрофнепригодностьВТаблицеДиагнозов(Прием) Экспорт
	
	Если Не ЗначениеЗаполнено(Прием) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ДиагнозПриема Из Прием.Диагнозы Цикл
		Если ЗначениеЗаполнено(ДиагнозПриема.ПрофнепригодностьВременная) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ДолжностиВрачаПриемаДля230(Прием)
	
	Если Не ЗначениеЗаполнено(Прием) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ДопустимыеУИДЕГИСЗ = ДопустимыеУИДЕГИСЗДолжностей230();
	
	ДолжностиВрача = ИнтеграцияЕГИСЗВызовСервера.ДолжностиМЗ(Прием.Врач);
	
	ДолжностиВрачаПо230 = Новый Массив;
	Для Каждого ДолжностьВрача Из ДолжностиВрача Цикл
		Если ДопустимыеУИДЕГИСЗ.Найти(ДолжностьВрача.УИДЕГИСЗ) <> Неопределено Тогда
			ДолжностиВрачаПо230.Добавить(ДолжностьВрача);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДолжностиВрачаПо230;
	
КонецФункции

Функция ДопустимыеУИДЕГИСЗДолжностей230() Экспорт
	
	ДопустимыеУИДЕГИСЗ = Новый Массив;
	ДопустимыеУИДЕГИСЗ.Добавить(24);
	ДопустимыеУИДЕГИСЗ.Добавить(53);
	ДопустимыеУИДЕГИСЗ.Добавить(100);
	ДопустимыеУИДЕГИСЗ.Добавить(109);
	
	Возврат ДопустимыеУИДЕГИСЗ; 
	
КонецФункции

Функция УСотрудникаЕстьДолжностьДействияМедосмотра230(Врач, ДействиеМедосмотра, СообщатьПользователю = Ложь) Экспорт
	
	Если ДопустимыеУИДЕГИСЗДолжностей230().Найти(ДействиеМедосмотра.СвязьСКлассификатором.УИДЕГИСЗ) = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДолжностиВрача = ИнтеграцияЕГИСЗВызовСервера.ДолжностиМЗ(Врач);
	
	Для Каждого ДолжностьВрача Из ДолжностиВрача Цикл
		Если ДолжностьВрача.УИДЕГИСЗ = ДействиеМедосмотра.СвязьСКлассификатором.УИДЕГИСЗ Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если СообщатьПользователю Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='У врача, выполнившего действие медосмотра '") + Символ(34) + ДействиеМедосмотра.Наименование 
				+ Символ(34) + НСтр("ru=', нет должности '") 
				+ Символ(34) +ДействиеМедосмотра.СвязьСКлассификатором.Наименование 
				+ Символ(34) + НСтр("ru=' для его выполнения.'"))
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьВредныйФакторПоКлассификатору(ПриказВредныйФактор)
	
	УИДыЕГИСЗПоФакторам = Новый Соответствие;
	УИДыЕГИСЗПоФакторам.Вставить("23", 211);
	УИДыЕГИСЗПоФакторам.Вставить("24", 212);
	УИДыЕГИСЗПоФакторам.Вставить("25", 213);
	УИДыЕГИСЗПоФакторам.Вставить("26", 214);
	
	УИДЕГИСЗФактора = УИДыЕГИСЗПоФакторам.Получить(ПриказВредныйФактор.НомерПП);
	
	Если УИДЕГИСЗФактора = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(УИДЕГИСЗФактора, Перечисления.ВидыКлассификаторовМинЗдрава.ПрофессиональныеВредностиПациента);
	
КонецФункции

Функция ПолучитьКонстантыПоШаблону(ШаблонОсмотра, ТаблицаПараметров, МедицинскийДокумент, ИндексШаблона)
	
	ТаблицаКонстант = ШаблонОсмотра.КонстантыCDAДокумента.Выгрузить();
	//Если ДопСерверныеФункции.ИмяСсылочногоТипа(МедицинскийДокумент) = "Документ.ПрохождениеМедосмотра" Тогда
	//	Возврат ТаблицаКонстант;
	//КонецЕсли;
	
	ВычисляемыеКонстанты = ТаблицаКонстант.НайтиСтроки(Новый Структура("Вычисляется", Истина));
	Если ВычисляемыеКонстанты.Количество() = 0 Тогда
		Возврат ТаблицаКонстант;
	КонецЕсли;
	
	ВременнаяТаблица = ТаблицаПараметров.Скопировать(ТаблицаПараметров.НайтиСтроки(Новый Структура("ИдентификаторСтрокиШаблона", ИндексШаблона)), "Параметр, Значение");
	ТаблицаЗависимыхПараметров = ВременнаяТаблица.СкопироватьКолонки();
	ТаблицаЗависимыхПараметров.Колонки.Добавить("ЗависимыйПараметр");
	
	Для Каждого СтрокаКонстанты Из ВычисляемыеКонстанты Цикл
		НоваяСтрокаПараметра = ВременнаяТаблица.Добавить();
		НоваяСтрокаПараметра.Параметр = Новый Структура("УИД, ЗначениеПоУмолчанию, ФорматнаяСтрока", Новый УникальныйИдентификатор, СтрокаКонстанты.ВычисляемоеЗначение, "");
		Попытка
			ЗначенияПоУмолчанию = РаботаСШаблонамиHTML.ПолучитьЗначенияПараметровПоУмолчанию(ВременнаяТаблица, ТаблицаЗависимыхПараметров, МедицинскийДокумент, НоваяСтрокаПараметра.Параметр,,, Истина);
		Исключение
			Продолжить;
		КонецПопытки;
		Если ЗначенияПоУмолчанию.Количество() > 0 Тогда
			СтрокаКонстанты.Значение = ЗначенияПоУмолчанию[0].Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаКонстант;
	
КонецФункции

#Область МакетыCDAДокументов

Функция ЭтоOIDСправочникаСекций(OID)
	
	Возврат OID = "1.2.643.5.1.13.13.99.2.197"
		Или OID = "1.2.643.5.1.13.13.11.1379"
		Или OID = "1.2.643.5.1.13.2.1.1.1504.23";
	
КонецФункции

Процедура ДобавитьИндексВСтруктуруLocalid(СтруктураLocalid, Индекс)
	
	Если Не СтруктураLocalid.Свойство("Индекс")
		И СтруктураLocalid.Свойство("localid")
	Тогда
		СтруктураLocalid.Вставить("Индекс", Индекс);
		Индекс = Индекс + 1;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьМассивВСтруктуруLocalid(СтруктураLocalid, ИмяСвойства, Значение)
	
	Если СтруктураLocalid.Свойство(ИмяСвойства) Тогда
		Если СтруктураLocalid[ИмяСвойства].Найти(Значение) = Неопределено Тогда
			СтруктураLocalid[ИмяСвойства].Добавить(Значение);
		КонецЕсли;
	Иначе
		МассивТипов = Новый Массив();
		МассивТипов.Добавить(Значение);
		СтруктураLocalid.Вставить(ИмяСвойства, МассивТипов);
	КонецЕсли;
	
КонецПроцедуры

Функция ТипДанныхИзXML(ТекстовоеПредставлениеТипа) Экспорт
	
	Если ТекстовоеПредставлениеТипа = "PQ"
		Или ТекстовоеПредставлениеТипа = "INT"
		Или ТекстовоеПредставлениеТипа = "REAL"
	Тогда
		Возврат Тип("Число");
	ИначеЕсли ТекстовоеПредставлениеТипа = "ST" Тогда
		Возврат Тип("Строка");
	ИначеЕсли ТекстовоеПредставлениеТипа = "BL" Тогда
		Возврат Тип("Булево");
	ИначеЕсли ТекстовоеПредставлениеТипа = "CD" Тогда
		Возврат Тип("СправочникСсылка.КлассификаторыМинЗдрава");
	ИначеЕсли ТекстовоеПредставлениеТипа = "DT"
		Или ТекстовоеПредставлениеТипа = "TS"
	Тогда
		Возврат Тип("Дата");
	КонецЕсли;
	
	Попытка
		ТипРез = Тип(ТекстовоеПредставлениеТипа);
		Возврат ТипРез;
	Исключение
		Возврат Тип("Строка");
	КонецПопытки;
	
КонецФункции

Функция РазбитьСоставноеСлово(Слово)
	
	Рез = Лев(Слово,1);
	Для Индекс = 2 по СтрДлина(Слово) Цикл
		Символ = Сред(Слово, Индекс, 1);
		Символ1 = ?(Индекс + 1 <= СтрДлина(Слово), Сред(Слово, Индекс + 1, 1), Символ);
		Символ2 = ?(Индекс + 2 <= СтрДлина(Слово), Сред(Слово, Индекс + 2, 1), Символ);
		Рез = Рез + ?(ВРег(Символ) = Символ, ?(ВРег(Символ1) = Символ1, Символ, " " + НРег(Символ)), ?(ВРег(Символ1) = Символ1 И ВРег(Символ2) = Символ2, НРег(Символ) + " ", Символ));
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

Функция ЗарезервированныйLocalid(localid) Экспорт
	
	ЗарезервированныеLocalid = Новый Массив;
	ЗарезервированныеLocalid.Добавить("ДатаДокумента");
	ЗарезервированныеLocalid.Добавить("Организация");
	ЗарезервированныеLocalid.Добавить("ОрганизацияАвтора");
	ЗарезервированныеLocalid.Добавить("ОрганизацияЛицаПридавшегоЮрСилу");
	ЗарезервированныеLocalid.Добавить("НаправившаяОрганизация");
	ЗарезервированныеLocalid.Добавить("Сотрудник");
	ЗарезервированныеLocalid.Добавить("ПервичныйПрием");
	
	Возврат ЗарезервированныеLocalid.Найти(localid) <> Неопределено;
	
КонецФункции

Функция РЭМДыСоСпециализациейФРМР()
	
	РЭМДыСоСпециализацией = Новый Массив;
	РЭМДыСоСпециализацией.Добавить(16);
	
	Возврат РЭМДыСоСпециализацией;
	
КонецФункции

#КонецОбласти

#Область ШапкаДокумента

Функция СформироватьОбщиеСекции(СвойстваЭМД, Ссылка, ТаблицаПараметров, МакетСЭМД, НезагруженныеКлассификаторы, ДополнительныеДанные)
	
	XMLМакетаСЭМД = ПолучитьXML(МакетСЭМД);
	
	УзлыДляУдаления = Новый Массив;
	РекурсивныйОбходXMLОбщихСекций(XMLМакетаСЭМД.ЭлементДокумента, ТаблицаПараметров, УзлыДляУдаления, Новый Соответствие, НезагруженныеКлассификаторы, ДополнительныеДанные);
	
	Для Каждого УзелДляУдаления Из УзлыДляУдаления Цикл
		РодительУзла = УзелДляУдаления.РодительскийУзел;
		РодительУзла.УдалитьДочерний(УзелДляУдаления);
	КонецЦикла;
	
	СлужебныеАтрибуты = ПолучитьСлужебныеАтрибуты();
	ОчиститьУзлыОтСлужебныхАтрибутов(XMLМакетаСЭМД.ЭлементДокумента, СлужебныеАтрибуты);
	
	УдалитьЛишниеПространстваИмен(XMLМакетаСЭМД.ЭлементДокумента, Строка(СвойстваЭМД.ИдентификаторРЭМД));
	
	Возврат РаботаСDOMКлиентСервер.СтрокаXMLИзDOM(XMLМакетаСЭМД);
	
КонецФункции

Процедура ОчиститьУзлыОтСлужебныхАтрибутов(XML, СлужебныеАтрибуты)
	
	Для Каждого Узел Из XML.ДочерниеУзлы Цикл
		Для Каждого СлужебныйАтрибут Из СлужебныеАтрибуты Цикл
			Попытка
				Узел.УдалитьАтрибут(СлужебныйАтрибут);
			Исключение КонецПопытки;
		КонецЦикла;
		ОчиститьУзлыОтСлужебныхАтрибутов(Узел, СлужебныеАтрибуты);
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьЛишниеПространстваИмен(Узел, ВидРЭМД)
	
	ЛокальныеИмена = Новый Массив;
	
	Если ВидРЭМД = "194" Тогда
		ЛокальныеИмена.Добавить("xmlns");
		ЛокальныеИмена.Добавить("address");
		ЛокальныеИмена.Добавить("fias");
		ЛокальныеИмена.Добавить("identity");
		ЛокальныеИмена.Добавить("medService");
		ЛокальныеИмена.Добавить("xsi");
	Иначе
		Возврат;
	КонецЕсли;
	
	АтрибутыКУдалению = Новый Массив;
	Для Каждого Атрибут Из Узел.Атрибуты Цикл
		Если ЗначениеЗаполнено(Атрибут.ЛокальноеИмя)
			И ЛокальныеИмена.Найти(Атрибут.ЛокальноеИмя) = Неопределено
		Тогда
			АтрибутыКУдалению.Добавить(Атрибут);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого АтрибутКУдалению Из АтрибутыКУдалению Цикл
		Узел.УдалитьАтрибут(АтрибутКУдалению.URIПространстваИмен, АтрибутКУдалению.ЛокальноеИмя);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьТаблицуПараметровДляОбщихСекций(МедицинскийДокумент, ТаблицаПараметров, СвойстваЭМД, Формат)
	
	ДанныеЭМД = Новый Соответствие;
	
	Пациент = МедицинскийДокумент.Клиент;
	
	СотрудникУстановившийПодпись = Неопределено;
	СтрокаСотрудникУстановившийПодпись = ТаблицаПараметров.Найти("СотрудникУстановившийПодпись", "localid");
	Если СтрокаСотрудникУстановившийПодпись <> Неопределено Тогда
		СотрудникУстановившийПодпись = СтрокаСотрудникУстановившийПодпись.Значение;
	КонецЕсли;
	
	ДолжностьМЗСотрудникаУстановившегоПодпись = Неопределено;
	СтрокаДолжностиМЗ = ТаблицаПараметров.Найти("ДолжностьМЗСотрудникаУстановившегоПодпись", "localid");
	Если СтрокаДолжностиМЗ <> Неопределено Тогда
		ДолжностьМЗСотрудникаУстановившегоПодпись = СтрокаДолжностиМЗ.Значение;
	КонецЕсли;
	
	ДанныеЭМД.Вставить("Организация", МедицинскийДокумент.Филиал.Организация);
	
	ДополнитьДаннымиДокумента(ДанныеЭМД, МедицинскийДокумент, СвойстваЭМД);
	ДополнитьДаннымиОрганизацииДокумента(ДанныеЭМД, МедицинскийДокумент);
	ДополнитьДаннымиПациента(ДанныеЭМД, МедицинскийДокумент, Пациент);
	
	Если СотрудникУстановившийПодпись <> Неопределено Тогда
		ДополнитьДаннымиАвтора(ДанныеЭМД, СотрудникУстановившийПодпись, ДолжностьМЗСотрудникаУстановившегоПодпись);
	КонецЕсли;
	
	ДополнитьДаннымиОрганизацииВладельца(ДанныеЭМД);
	ДополнитьДаннымиЛицаПридавшегоЮрСилу(ДанныеЭМД);
	
	ДополнитьТаблицуЗначениями(ДанныеЭМД, ТаблицаПараметров);
	
	// <participant typeCode="HLD">
	Если Формат = 1 И ЭМДСодержитУзел(ДанныеЭМД.Получить("ВидРЭМД"), "СведенияОСтраховомПолисеОМС") Тогда
		ДополнитьДаннымиСтраховогоПолисаОМС(ДанныеЭМД, ТаблицаПараметров, Пациент);
	КонецЕсли;
	
	// <participant typeCode="REF">
	Если ЭМДСодержитУзел(ДанныеЭМД.Получить("ВидРЭМД"), "СведенияОНаправившемЛице") Тогда
		ДополнитьДаннымиНаправившегоЛица(ДанныеЭМД, ТаблицаПараметров, СотрудникУстановившийПодпись, ДолжностьМЗСотрудникаУстановившегоПодпись);
	КонецЕсли;
	
	// <inFulfillmentOf>
	Если ЭМДСодержитУзел(ДанныеЭМД.Получить("ВидРЭМД"), "СведенияОНаправлении") Тогда
		ДополнитьДаннымиНаправления(ТаблицаПараметров, МедицинскийДокумент);
	КонецЕсли;
	
	// <documentationOf>
	Если ЭМДСодержитУзел(ДанныеЭМД.Получить("ВидРЭМД"), "СведенияОДокументируемомСобытии") Тогда
		ДополнитьДаннымиСобытий(ДанныеЭМД, ТаблицаПараметров, МедицинскийДокумент, СотрудникУстановившийПодпись, ДолжностьМЗСотрудникаУстановившегоПодпись, Формат);
	КонецЕсли;
	
	// <componentOf>
	Если ЭМДСодержитУзел(ДанныеЭМД.Получить("ВидРЭМД"), "СведенияОСлучаеОказанияМедПомощи") Тогда
		ДополнитьДаннымиСлучаяОказанияМедПомощи(ДанныеЭМД, ТаблицаПараметров, МедицинскийДокумент);
	КонецЕсли;
	
	// <recordTarget>/<guardian>
	Если ЭМДСодержитУзел(ДанныеЭМД.Получить("ВидРЭМД"), "Опекун") Тогда
		ДополнитьДаннымиОпекуна(ДанныеЭМД, ТаблицаПараметров, МедицинскийДокумент);
	КонецЕсли;
	
	Если Формат = 2 Тогда
		ДополнитьДаннымиСтраховогоПолисаОМС(ДанныеЭМД, ТаблицаПараметров, Пациент);
		// <participant typeCode="IND">
		ДополнитьДаннымиИсточниковОплаты(ДанныеЭМД, ТаблицаПараметров, Пациент, МедицинскийДокумент);
	КонецЕсли;
	
	// <authenticator>
	Если ЭМДСодержитУзел(ДанныеЭМД.Получить("ВидРЭМД"), "ПриглашенныйКонсультант") Тогда
		ДополнитьДаннымиПриглашенногоКонсультанта(ДанныеЭМД, ТаблицаПараметров);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьТаблицуЗначениями(Данные, ТаблицаПараметров, ГруппирующееПоле = Неопределено)
	
	Для Каждого ЭлементСоответствия Из Данные Цикл
		Если ЭлементСоответствия.Ключ = "ДатаДокумента" Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(ЭлементСоответствия.Значение) Тогда
			ДобавитьЗначенияLocalId(ТаблицаПараметров, ЭлементСоответствия.Ключ, ЭлементСоответствия.Значение, ГруппирующееПоле);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьЗначенияLocalId(ТаблицаПараметров, localid, ЗначениеLocalId, ГруппирующееПоле = Неопределено)
	
	Если ТипЗнч(ЗначениеLocalId) = Тип("Массив") Тогда
		Для Каждого ЗначениеПоlocalid Из ЗначениеLocalId Цикл
			ДобавитьЗначенияLocalId(ТаблицаПараметров, localid, ЗначениеПоlocalid.Значение, ЗначениеПоlocalid.ГруппирующееПоле);
		КонецЦикла;
	Иначе
		Если ЗначениеЗаполнено(ЗначениеLocalId) Тогда
			СтрокаПараметра = ТаблицаПараметров.Добавить();
			СтрокаПараметра.localid = localid;
			СтрокаПараметра.Значение = ЗначениеLocalId;
			Если ГруппирующееПоле <> Неопределено Тогда
				СтрокаПараметра.ГруппирующееПоле = ГруппирующееПоле;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьДаннымиДокумента(ДанныеЭМД, МедицинскийДокумент, СвойстваЭМД)
	
	ДанныеДокумента = Справочники.СообщенияРЭМД.ПолучитьДанныеДокументаПоУИД(СвойстваЭМД.УИДДокумента);
	
	ДанныеЭМД.Вставить("ДатаДокумента",				ИнтеграцияЕГИСЗСервер.ПредставлениеЛокальнойДатыСоСмещением(МедицинскийДокумент.Дата, "ДФ=ггггММддЧЧмм"));
	ДанныеЭМД.Вставить("ВидДокумента",				ИдентификаторШаблонаПоВидуРЭМД(СвойстваЭМД.ИдентификаторРЭМД));
	ДанныеЭМД.Вставить("УИДДокумента",				СвойстваЭМД.УИДДокумента);
	ДанныеЭМД.Вставить("УИДНабораВерсий",			СвойстваЭМД.УИДДокумента);
	ДанныеЭМД.Вставить("ВерсияДокумента",			?(ДанныеДокумента = Неопределено, "1", Строка(ДанныеДокумента.НомерВерсии+1)));
	
	Если СвойстваЭМД.ИдентификаторРЭМД = 196
		Или СвойстваЭМД.ИдентификаторРЭМД = 204
		Или СвойстваЭМД.ИдентификаторРЭМД = 227
		Или СвойстваЭМД.ИдентификаторРЭМД = 230
		Или СвойстваЭМД.ИдентификаторРЭМД = 246
	Тогда
		ДанныеЭМД.Вставить("ВидСЭМД",				СвойстваЭМД.ВидРЭМД);
		ДанныеЭМД.Вставить("ВидДокументаВРЭМД",		СвойстваЭМД.ВидСЭМД);
	Иначе
		ДанныеЭМД.Вставить("ВидСЭМД",				СвойстваЭМД.ВидСЭМД);
		ДанныеЭМД.Вставить("ВидДокументаВРЭМД",		СвойстваЭМД.ВидРЭМД);
	КонецЕсли;
	
	ДанныеЭМД.Вставить("ЗаголовокЭМД",				СвойстваЭМД.ЗаголовокЭМД);
	ДанныеЭМД.Вставить("ВидРЭМД",					СвойстваЭМД.ИдентификаторРЭМД);
	ДанныеЭМД.Вставить("УровеньКонфиденциальности",	ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.УровеньКонфиденциальностиМедицинскогоДокумента(1));
	ДанныеЭМД.Вставить("ПервичныйПрием",			ПервичныйПриемДокумента(МедицинскийДокумент));
	
КонецПроцедуры

Функция ИдентификаторШаблонаПоВидуРЭМД(ВидРЭМД)
	
	ИдентификаторыШаблоновПоВидамРЭМД = ИдентификаторыШаблоновПоВидамРЭМД();
	Для Каждого СтрокаШаблона Из ИдентификаторыШаблоновПоВидамРЭМД.НайтиСтроки(Новый Структура("ВидРЭМД", Формат(ВидРЭМД, "ЧГ=0"))) Цикл
		Возврат СтрокаШаблона.ИдентификаторШаблона;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ВидРЭМДПоИдентификаторуШаблона(ИдентификаторШаблона) Экспорт
	
	ИдентификаторыШаблоновПоВидамРЭМД = ИдентификаторыШаблоновПоВидамРЭМД();
	Для Каждого СтрокаШаблона Из ИдентификаторыШаблоновПоВидамРЭМД.НайтиСтроки(Новый Структура("ИдентификаторШаблона", ИдентификаторШаблона)) Цикл
		Возврат Число(СтрокаШаблона.ВидРЭМД);
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ИдентификаторыШаблоновПоВидамРЭМД()
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.Вывести(Справочники.РегистрируемыеЭлектронныеМедДокументы.ПолучитьМакет("ИдентификаторыШаблонов").ПолучитьОбласть("Данные"));
	
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДокумент.Область(1, 1, ТабДокумент.ВысотаТаблицы, ТабДокумент.ШиринаТаблицы));
	ПостроительОтчета.Выполнить();
	
	Возврат ПостроительОтчета.Результат.Выгрузить();
	
КонецФункции

Функция ПервичныйПриемДокумента(МедицинскийДокумент)
	
	ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(МедицинскийДокумент);
	Если ИмяТипаДокумента = "Документ.Прием"
		И ЗначениеЗаполнено(МедицинскийДокумент.ПервичныйПрием)
	Тогда
		Возврат МедицинскийДокумент.ПервичныйПрием;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Прием.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	Прием.МедицинскаяКарта = &МедицинскаяКарта
		|	И Прием.ЭтоПервичный
		|	И Прием.Проведен
		|	И НЕ Прием.Закрыт
		|
		|УПОРЯДОЧИТЬ ПО
		|	Прием.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("МедицинскаяКарта", МедицинскийДокумент.МедицинскаяКарта);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДополнитьДаннымиОрганизацииДокумента(ДанныеЭМД, МедицинскийДокумент)
	
	Филиал = МедицинскийДокумент.Филиал;
	
	МедицинскаяОрганизация = ?(ТипЗнч(Филиал) = Тип("СправочникСсылка.Филиалы"), Филиал.Организация.МедицинскаяОрганизация, Филиал.МедицинскаяОрганизация); // Вероятно, в итоге какой-то один тип останется.
	РеквизитыЮрЛица = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(Филиал);
	
	АдресОрганизации = АдресОрганизацииФилиала(Филиал);
	КонтактыОрганизации = КонтактыОрганизацииФилиала(Филиал);
	
	ДанныеЭМД.Вставить("ОГРН",						?(ЗначениеЗаполнено(МедицинскаяОрганизация.ОГРН), МедицинскаяОрганизация.ОГРН, РеквизитыЮрЛица.ОГРН));
	ДанныеЭМД.Вставить("ОКПО",						РеквизитыЮрЛица.ОКПО);
	ДанныеЭМД.Вставить("ИННОрганизации",			?(ЗначениеЗаполнено(МедицинскаяОрганизация.ИНН), МедицинскаяОрганизация.ИНН, РеквизитыЮрЛица.ИНН));
	ДанныеЭМД.Вставить("ЛицензияМедДеятельности",	ДанныеЛицензииМедДеятельности(Филиал, МедицинскийДокумент));
	ДанныеЭМД.Вставить("OIDМедицинскойОрганизации",	СокрЛП(МедицинскаяОрганизация.OIDОрганизации));
	ДанныеЭМД.Вставить("НаименованиеОрганизации",	РеквизитыЮрЛица.НазваниеОрганизации);
	ДанныеЭМД.Вставить("КонтактыОрганизации",		КонтактыОрганизации);
	ДанныеЭМД.Вставить("АдресОрганизации",			АдресОрганизации);
	
КонецПроцедуры

Процедура ДополнитьДаннымиПациента(ДанныеЭМД, МедицинскийДокумент, Пациент)
	
	ДанныеЭМД.Вставить("УИДПациента",			Строка(Пациент.УникальныйИдентификатор()));
	ДанныеЭМД.Вставить("СНИЛСПациента",			СтроковыеФункцииКлиентСервер.ПолучитьЦифрыСтроки(Пациент.СНИЛС));
	ДанныеЭМД.Вставить("ДУЛ",					СтруктураДУЛФизЛица(Пациент, МедицинскийДокумент.Дата));
	ДанныеЭМД.Вставить("КонтактыПациента",		КонтактыОбъекта(Пациент));
	ДанныеЭМД.Вставить("ФамилияПациента",		СокрЛП(Пациент.Фамилия));
	ДанныеЭМД.Вставить("ИмяПациента",			СокрЛП(Пациент.Имя));
	ДанныеЭМД.Вставить("ОтчествоПациента",		СокрЛП(Пациент.Отчество));
	ДанныеЭМД.Вставить("ДатаРожденияПациента",	Формат(Пациент.ДатаРождения, "ДФ=ггггММдд"));
	ДанныеЭМД.Вставить("ПолПациента",			ЭлементКлассификатораПолаФизЛица(Пациент.Пол));
	
	ДополнитьДаннымиАдресовПациента(ДанныеЭМД, Пациент);
	
КонецПроцедуры

Процедура ДополнитьДаннымиАдресовПациента(ДанныеЭМД, Пациент)
	
	ФактАдресПациента	= СтруктураАдресаОбъекта(Пациент, Справочники.ВидыКонтактнойИнформации.АдресФактический);
	ЮрАдресПациента		= СтруктураАдресаОбъекта(Пациент, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	
	Если ФактАдресПациента = Неопределено
		И ЮрАдресПациента <> Неопределено
	Тогда
		ФактАдресПациента = ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(ЮрАдресПациента);
		ФактАдресПациента.ТипАдреса = ТипАдресаПациентаПоВидуАдреса(Справочники.ВидыКонтактнойИнформации.АдресФактический);
	ИначеЕсли ЮрАдресПациента = Неопределено
		И ФактАдресПациента <> Неопределено
	Тогда
		ЮрАдресПациента = ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(ФактАдресПациента);
		ЮрАдресПациента.ТипАдреса = ТипАдресаПациентаПоВидуАдреса(Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	КонецЕсли;
	
	Если ДанныеЭМД.Получить("ВидРЭМД") <> 196 Тогда
		ДанныеЭМД.Вставить("ФактАдресПациента", ФактАдресПациента);
	КонецЕсли;
	
	Если ДанныеЭМД.Получить("ВидРЭМД") <> 80
		И ДанныеЭМД.Получить("ВидРЭМД") <> 81
		И ДанныеЭМД.Получить("ВидРЭМД") <> 119
		И ДанныеЭМД.Получить("ВидРЭМД") <> 122
	Тогда
		ДанныеЭМД.Вставить("ЮрАдресПациента", ЮрАдресПациента);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьДаннымиАвтора(ДанныеЭМД, Автор, ДолжностьМЗ)
	
	ВидыДокументаБезДатыПодписиАвтора = ВидыДокументаБезДатыПодписиАвтора();
	Если ВидыДокументаБезДатыПодписиАвтора.Найти(ДанныеЭМД.Получить("ВидРЭМД")) = Неопределено Тогда
		ДанныеЭМД.Вставить("ДатаПодписиДокументаАвтором", ИнтеграцияЕГИСЗСервер.ПредставлениеЛокальнойДатыСоСмещением(ТекущаяДата(), "ДФ=ггггММддЧЧмм"));
	КонецЕсли;
	
	ДанныеЭМД.Вставить("ОрганизацияАвтора",		ДанныеЭМД.Получить("Организация"));
	ДанныеЭМД.Вставить("УИДАвтора",				Строка(Автор.УникальныйИдентификатор()));
	ДанныеЭМД.Вставить("СНИЛСАвтора",			СтроковыеФункцииКлиентСервер.ПолучитьЦифрыСтроки(Автор.СНИЛС));
	
	// TODO: Т.к. во всех СЭМДах узел необязательный — пока он не указывается (до тех пор, пока нет интеграции с ФРМР)
	//ДанныеЭМД.Вставить("УИДАвтораПоФРМР",		);
	ДанныеЭМД.Вставить("АдресАвтора",			СтруктураАдресаОбъекта(Автор, Справочники.ВидыКонтактнойИнформации.АдресЮридический));
	ДанныеЭМД.Вставить("КонтактыАвтора",		КонтактыОбъекта(Автор));
	ДанныеЭМД.Вставить("ДолжностьАвтора",		ДолжностьМЗ);
	ДанныеЭМД.Вставить("ФамилияАвтора",			Автор.Фамилия);
	ДанныеЭМД.Вставить("ИмяАвтора",				Автор.Имя);
	ДанныеЭМД.Вставить("ОтчествоАвтора",		Автор.Отчество);
	ДанныеЭМД.Вставить("СпециальностьАвтора",	ПолучитьСпециализациюФРМР(Автор));
	ДанныеЭМД.Вставить("ПодразделениеАвтора",	Автор.Подразделение.ПодразделениеМинздрава);
	
	ДанныеЭМД.Вставить("OIDМедицинскойОрганизацииАвтора",	ДанныеЭМД.Получить("OIDМедицинскойОрганизации"));
	ДанныеЭМД.Вставить("НаименованиеОрганизацииАвтора",		ДанныеЭМД.Получить("НаименованиеОрганизации"));
	ДанныеЭМД.Вставить("КонтактыОрганизацииАвтора",			ДанныеЭМД.Получить("КонтактыОрганизации"));
	ДанныеЭМД.Вставить("АдресОрганизацииАвтора",			ДанныеЭМД.Получить("АдресОрганизации"));
	ДанныеЭМД.Вставить("ОГРНОрганизацииАвтора",				ДанныеЭМД.Получить("ОГРН"));
	
КонецПроцедуры

Процедура ДополнитьДаннымиОрганизацииВладельца(ДанныеЭМД)
	
	ДанныеЭМД.Вставить("OIDМедицинскойОрганизацииВладельца", ДанныеЭМД.Получить("OIDМедицинскойОрганизации"));
	ДанныеЭМД.Вставить("ОГРНОрганизацииВладельца",			 ДанныеЭМД.Получить("ОГРН"));
	ДанныеЭМД.Вставить("ИННОрганизацииВладельца",			 ДанныеЭМД.Получить("ИННОрганизации"));
	ДанныеЭМД.Вставить("НаименованиеОрганизацииВладельца",	 ДанныеЭМД.Получить("НаименованиеОрганизации"));
	ДанныеЭМД.Вставить("КонтактыОрганизацииВладельца",		 ДанныеЭМД.Получить("КонтактыОрганизации"));
	ДанныеЭМД.Вставить("АдресОрганизацииВладельца",			 ДанныеЭМД.Получить("АдресОрганизации"));
	
КонецПроцедуры

Процедура ДополнитьДаннымиЛицаПридавшегоЮрСилу(ДанныеЭМД)
	
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу = ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу();
	Если ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Найти(ДанныеЭМД.Получить("ВидРЭМД")) = Неопределено Тогда
		ДанныеЭМД.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу", ДанныеЭМД.Получить("ДатаДокумента"));
		ДанныеЭМД.Вставить("ФактНаличияПодписи", "S");
	КонецЕсли;
	
	ДанныеЭМД.Вставить("ОрганизацияЛицаПридавшегоЮрСилу",	ДанныеЭМД.Получить("Организация"));
	ДанныеЭМД.Вставить("УИДЛицаПридавшегоЮрСилу",			ДанныеЭМД.Получить("УИДАвтора"));
	ДанныеЭМД.Вставить("СНИЛСЛицаПридавшегоЮрСилу",			ДанныеЭМД.Получить("СНИЛСАвтора"));
	ДанныеЭМД.Вставить("АдресЛицаПридавшегоЮрСилу",			ДанныеЭМД.Получить("АдресАвтора"));
	ДанныеЭМД.Вставить("КонтактыЛицаПридавшегоЮрСилу",		ДанныеЭМД.Получить("КонтактыАвтора"));
	ДанныеЭМД.Вставить("ФамилияЛицаПридавшегоЮрСилу",		ДанныеЭМД.Получить("ФамилияАвтора"));
	ДанныеЭМД.Вставить("ИмяЛицаПридавшегоЮрСилу",			ДанныеЭМД.Получить("ИмяАвтора"));
	ДанныеЭМД.Вставить("ОтчествоЛицаПридавшегоЮрСилу",		ДанныеЭМД.Получить("ОтчествоАвтора"));
	ДанныеЭМД.Вставить("ДолжностьЛицаПридавшегоЮрСилу",		ДанныеЭМД.Получить("ДолжностьАвтора"));
	ДанныеЭМД.Вставить("ПодразделениеЛицаПридавшегоЮрСилу",	ДанныеЭМД.Получить("ПодразделениеАвтора"));
	
	ДанныеЭМД.Вставить("OIDМедицинскойОрганизацииЛицаПридавшегоЮрСилу",	ДанныеЭМД.Получить("OIDМедицинскойОрганизации"));
	ДанныеЭМД.Вставить("НаименованиеОрганизацииЛицаПридавшегоЮрСилу",	ДанныеЭМД.Получить("НаименованиеОрганизации"));
	ДанныеЭМД.Вставить("КонтактыОрганизацииЛицаПридавшегоЮрСилу",		ДанныеЭМД.Получить("КонтактыОрганизации"));
	ДанныеЭМД.Вставить("АдресОрганизацииЛицаПридавшегоЮрСилу",			ДанныеЭМД.Получить("АдресОрганизации"));
	ДанныеЭМД.Вставить("ОГРНОрганизацииЛицаПридавшегоЮрСилу",			ДанныеЭМД.Получить("ОГРН"));
	
КонецПроцедуры

Процедура ДополнитьДаннымиСтраховогоПолисаОМС(ДанныеЭМД, ТаблицаПараметров, Пациент)
	
	ДанныеПолиса = ПолучитьДанныеПолисаОМСКлиента(Пациент);
	
	Если ДанныеПолиса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтраховогоПолисаОМС = Новый Соответствие;
	ДанныеСтраховогоПолисаОМС.Вставить("ПолисОМС",						ДанныеПолиса);
	ДанныеСтраховогоПолисаОМС.Вставить("КонтактыСтраховойОрганизации",	КонтактыОбъекта(ДанныеПолиса.СтраховаяОрганизация));
	ДанныеСтраховогоПолисаОМС.Вставить("АдресСтраховойОрганизации",		АдресОрганизации(ДанныеПолиса.СтраховаяОрганизация));
	
	ДополнитьТаблицуЗначениями(ДанныеСтраховогоПолисаОМС, ТаблицаПараметров);
	
КонецПроцедуры

Функция ПолучитьДанныеПолисаОМСКлиента(Клиент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраховыеПолисы.Серия КАК Серия,
		|	СтраховыеПолисы.Номер КАК Номер,
		|	СтраховыеПолисы.ВидПолиса.Контрагент КАК СтраховаяОрганизация,
		|	СтраховыеПолисы.ВидПолиса.Контрагент.Наименование КАК НаименованиеСтраховойОрганизации,
		|	СтраховыеПолисы.ВидПолиса.Контрагент.СтраховаяОрганизация КАК СтраховаяОрганизацияКлассификатор,
		|	СтраховыеПолисы.КлассификаторВидовПолисовРЭМД КАК ТипПолисаОМС
		|ИЗ
		|	Справочник.СтраховыеПолисы КАК СтраховыеПолисы
		|ГДЕ
		|	СтраховыеПолисы.ВидПолиса.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыСтраховыхПрограмм.ОМС)
		|	И НЕ СтраховыеПолисы.ПометкаУдаления
		|	И НЕ СтраховыеПолисы.НеДействителен
		|	И СтраховыеПолисы.Владелец = &Клиент";
	
	Запрос.УстановитьПараметр("Клиент", Клиент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеПолиса = Новый Структура("Серия, Номер, ТипПолисаОМС, СтраховаяОрганизация, НаименованиеСтраховойОрганизации, OIDСтраховойОрганизации");
		ЗаполнитьЗначенияСвойств(ДанныеПолиса, Выборка);
		
		ДанныеПолиса.OIDСтраховойОрганизации = ИнтеграцияЕГИСЗСервер.ПолучитьЗначениеАтрибутаЭлементаКлассификатора(Выборка.СтраховаяОрганизацияКлассификатор, "SMOCOD");
		
		Возврат ДанныеПолиса;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДополнитьДаннымиНаправившегоЛица(ДанныеЭМД, ТаблицаПараметров, Врач, ДолжностьМЗ)
	
	ДанныеНаправившегоЛица = Новый Соответствие;
	
	ДанныеНаправившегоЛица.Вставить("НаправившаяОрганизация",					ДанныеЭМД.Получить("Организация"));
	ДанныеНаправившегоЛица.Вставить("УИДНаправившегоЛица",						Строка(Врач.УникальныйИдентификатор()));
	ДанныеНаправившегоЛица.Вставить("СНИЛСНаправившегоЛица",					СтроковыеФункцииКлиентСервер.ПолучитьЦифрыСтроки(Врач.СНИЛС));
	ДанныеНаправившегоЛица.Вставить("ДолжностьНаправившегоЛица",				ДолжностьМЗ);
	ДанныеНаправившегоЛица.Вставить("АдресНаправившегоЛица",					СтруктураАдресаОбъекта(Врач, Справочники.ВидыКонтактнойИнформации.АдресЮридический));
	ДанныеНаправившегоЛица.Вставить("КонтактыНаправившегоЛица",					КонтактыОбъекта(Врач));
	ДанныеНаправившегоЛица.Вставить("ФамилияНаправившегоЛица",					Врач.Фамилия);
	ДанныеНаправившегоЛица.Вставить("ИмяНаправившегоЛица",						Врач.Имя);
	ДанныеНаправившегоЛица.Вставить("ОтчествоНаправившегоЛица",					Врач.Отчество);
	ДанныеНаправившегоЛица.Вставить("OIDОрганизацииНаправившегоЛица",			ДанныеЭМД.Получить("OIDМедицинскойОрганизации"));
	ДанныеНаправившегоЛица.Вставить("НаименованиеОрганизацииНаправившегоЛица",	ДанныеЭМД.Получить("НаименованиеОрганизации"));
	ДанныеНаправившегоЛица.Вставить("КонтактыОрганизацииНаправившегоЛица",		ДанныеЭМД.Получить("КонтактыОрганизации"));
	ДанныеНаправившегоЛица.Вставить("АдресОрганизацииНаправившегоЛица",			ДанныеЭМД.Получить("АдресОрганизации"));
	
	ДополнитьТаблицуЗначениями(ДанныеНаправившегоЛица, ТаблицаПараметров);
	
КонецПроцедуры

Процедура ДополнитьДаннымиНаправления(ТаблицаПараметров, МедицинскийДокумент)
	
	ДанныеНаправления = Новый Соответствие;
	ДанныеНаправления.Вставить("УИДНаправления", ПолучитьУИДНаправления(МедицинскийДокумент));
	
	ДополнитьТаблицуЗначениями(ДанныеНаправления, ТаблицаПараметров);
	
КонецПроцедуры

Процедура ДополнитьДаннымиСобытий(ДанныеЭМД, ТаблицаПараметров, МедицинскийДокумент, ОсновнойИсполнитель, ДолжностьМЗ, Формат)
	
	События = Новый Массив;
	
	Если Формат = 1 Тогда
		
		ВспомогательныеИсполнители = Новый Массив;
		LocalIdТипаСобытия = LocalIdТипаСобытияПоВидуРЭМД(ДанныеЭМД.Получить("ВидРЭМД"));
		
		Если ЗначениеЗаполнено(LocalIdТипаСобытия) Тогда
			СтрокиСобытий = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", LocalIdТипаСобытия));
			Для Каждого СтрокаСобытия Из СтрокиСобытий Цикл
				СтруктураСобытия = Новый Структура;
				СтруктураСобытия.Вставить("ТипСобытия", СтрокаСобытия.Значение);
				СтруктураСобытия.Вставить("ОсновнойИсполнитель", ОсновнойИсполнитель);
				СтруктураСобытия.Вставить("ВспомогательныеИсполнители", ВспомогательныеИсполнители);
				События.Добавить(СтруктураСобытия);
			КонецЦикла;
		Иначе
			СтруктураСобытия = Новый Структура;
			СтруктураСобытия.Вставить("ТипСобытия", "ДокументируемоеСобытие");
			СтруктураСобытия.Вставить("ОсновнойИсполнитель", ОсновнойИсполнитель);
			СтруктураСобытия.Вставить("ВспомогательныеИсполнители", ВспомогательныеИсполнители);
			События.Добавить(СтруктураСобытия);
		КонецЕсли;
	ИначеЕсли Формат = 2 Тогда
		
		//ТипСобытия = ТипСобытияПоВидуРЭМД(ДанныеЭМД.Получить("ВидРЭМД"));
		ТипСобытия = Неопределено;
		
		СтрокаСобытиеИзШаблонаПриема = ТаблицаПараметров.Найти("ТипДокументируемогоСобытия", "localid");
		Если ЗначениеЗаполнено(СтрокаСобытиеИзШаблонаПриема) Тогда
			СобытиеИзШаблонаПриема = СтрокаСобытиеИзШаблонаПриема.Значение;
			
			// Попытка на случай если в данный localid попадёт значение другого типа
			Попытка
				Если СобытиеИзШаблонаПриема.ВидКлассификатора = Перечисления.ВидыКлассификаторовМинЗдрава.ТипыДокументированныхСобытий Тогда
					ТипСобытия = СобытиеИзШаблонаПриема;
				КонецЕсли;
			Исключение КонецПопытки;
		КонецЕсли;
		
		// Если параметре ТипДокументируемогоСобытия не нашли, то ищем в коде
		Если Не ЗначениеЗаполнено(ТипСобытия) Тогда
			ТипСобытия = ТипСобытияПоВидуРЭМД(ДанныеЭМД.Получить("ВидРЭМД"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТипСобытия) Тогда
			СтруктураСобытия = Новый Структура;
			СтруктураСобытия.Вставить("ТипСобытия", ТипСобытия);
			СтруктураСобытия.Вставить("ОсновнойИсполнитель", ОсновнойИсполнитель);
			СтруктураСобытия.Вставить("ВспомогательныеИсполнители", ВспомогательныеИсполнители);
			События.Добавить(СтруктураСобытия);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Событие Из События Цикл
		
		ДанныеСобытия = Новый Соответствие;
		
		СтрокаСобытия = ТаблицаПараметров.Добавить();
		СтрокаСобытия.localid = "ДокументируемоеСобытие";
		СтрокаСобытия.Значение = Событие.ТипСобытия;
		ИндексСтрокИСобытия = ТаблицаПараметров.Индекс(СтрокаСобытия);
		
		// Уже заполненные данные события в приоритете 
		СтрокаДатаНачалаСобытия = ТаблицаПараметров.Найти("ДатаНачалаСобытия", "localid");
		Если СтрокаДатаНачалаСобытия <> Неопределено И ЗначениеЗаполнено(СтрокаДатаНачалаСобытия.Значение) Тогда
			ДанныеСобытия.Вставить("ДатаНачалаСобытия", СтрокаДатаНачалаСобытия.Значение);
		КонецЕсли;
		
		СтрокаДатаОкончанияСобытия = ТаблицаПараметров.Найти("ДатаОкончанияСобытия", "localid");
		Если СтрокаДатаОкончанияСобытия <> Неопределено И ЗначениеЗаполнено(СтрокаДатаОкончанияСобытия.Значение) Тогда
			ДанныеСобытия.Вставить("ДатаОкончанияСобытия", СтрокаДатаОкончанияСобытия.Значение);
		КонецЕсли;
		
		// Данные события
		Если ДанныеЭМД.Получить("ВидРЭМД") = 230
			Или ДанныеЭМД.Получить("ВидРЭМД") = 103
		Тогда
			ДатаЗавершения = ОбщегоНазначенияБИТКлиентСервер.СвойствоОбъекта(МедицинскийДокумент, "ДатаЗавершения", МедицинскийДокумент.Дата);
			
			Если ДанныеСобытия["ДатаНачалаСобытия"] = Неопределено Тогда
				ДанныеСобытия.Вставить("ДатаНачалаСобытия",		ИнтеграцияЕГИСЗСервер.ПредставлениеЛокальнойДатыСоСмещением(НачалоДня(МедицинскийДокумент.Дата), "ДФ=ггггММддЧЧмм"));
			КонецЕсли;
			Если ДанныеСобытия["ДатаОкончанияСобытия"] = Неопределено Тогда
				ДанныеСобытия.Вставить("ДатаОкончанияСобытия",	ИнтеграцияЕГИСЗСервер.ПредставлениеЛокальнойДатыСоСмещением(НачалоДня(ДатаЗавершения), "ДФ=ггггММддЧЧмм"));
			КонецЕсли;
		Иначе
			Если ДанныеСобытия["ДатаНачалаСобытия"] = Неопределено Тогда
				ДанныеСобытия.Вставить("ДатаНачалаСобытия",		ДанныеЭМД.Получить("ДатаДокумента"));
			КонецЕсли;
			Если ДанныеСобытия["ДатаОкончанияСобытия"] = Неопределено Тогда
				ДанныеСобытия.Вставить("ДатаОкончанияСобытия",	ДанныеЭМД.Получить("ДатаДокумента"));
			КонецЕсли;
		КонецЕсли;
		
		// Основной исполнитель
		ДанныеСобытия.Вставить("ОрганизацияОсновногоИсполнителя",	ДанныеЭМД.Получить("Организация"));
		ДанныеСобытия.Вставить("УИДОсновногоИсполнителя",			Строка(Событие.ОсновнойИсполнитель.УникальныйИдентификатор()));
		ДанныеСобытия.Вставить("СНИЛСОсновногоИсполнителя",			СтроковыеФункцииКлиентСервер.ПолучитьЦифрыСтроки(Событие.ОсновнойИсполнитель.СНИЛС));
		ДанныеСобытия.Вставить("ДолжностьОсновногоИсполнителя",		ДолжностьМЗ);
		ДанныеСобытия.Вставить("АдресОсновногоИсполнителя",			СтруктураАдресаОбъекта(Событие.ОсновнойИсполнитель, Справочники.ВидыКонтактнойИнформации.АдресЮридический));
		ДанныеСобытия.Вставить("КонтактыОсновногоИсполнителя",		КонтактыОбъекта(Событие.ОсновнойИсполнитель, ИндексСтрокИСобытия));
		ДанныеСобытия.Вставить("ФамилияОсновногоИсполнителя",		Событие.ОсновнойИсполнитель.Фамилия);
		ДанныеСобытия.Вставить("ИмяОсновногоИсполнителя",			Событие.ОсновнойИсполнитель.Имя);
		ДанныеСобытия.Вставить("ОтчествоОсновногоИсполнителя",		Событие.ОсновнойИсполнитель.Отчество);
		
		// Организация основного исполнителя
		ДанныеСобытия.Вставить("OIDМедицинскойОрганизацииОсновногоИсполнителя",	ДанныеЭМД.Получить("OIDМедицинскойОрганизации"));
		ДанныеСобытия.Вставить("НаименованиеОрганизацииОсновногоИсполнителя",	ДанныеЭМД.Получить("НаименованиеОрганизации"));
		ДанныеСобытия.Вставить("КонтактыОрганизацииОсновногоИсполнителя",		КонтактыОрганизацииФилиала(МедицинскийДокумент.Филиал, ИндексСтрокИСобытия));
		ДанныеСобытия.Вставить("АдресОрганизацииОсновногоИсполнителя",			ДанныеЭМД.Получить("АдресОрганизации"));
		
		// Формат 2
		ДанныеСобытия.Вставить("ФормаОказанияМедПомощи",			ФормаОказанияМедПомощи(ДанныеЭМД));
		ДанныеСобытия.Вставить("ВидМедицинскойПомощи",				ВидМедицинскойПомощи(ДанныеЭМД));
		ДанныеСобытия.Вставить("УсловияОказанияМедицинскойПомощи",	УсловияОказанияМедицинскойПомощи(ДанныеЭМД));
		
		ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(МедицинскийДокумент);
		
		Если ИмяТипаДокумента = "Документ.ПрохождениеМедосмотра" Тогда
			ДополнитьДаннымиИсполнителей(ДанныеСобытия, МедицинскийДокумент.ПредседательМедкомиссии, ДолжностьМЗ, ДанныеЭМД);
		ИначеЕсли ИмяТипаДокумента = "Документ.ВрачебнаяКомиссия" Тогда // Версия КОРП
			ДополнитьДаннымиИсполнителей(ДанныеСобытия, МедицинскийДокумент.ПредседательКомиссии, ДолжностьМЗ, ДанныеЭМД);
		ИначеЕсли ИмяТипаДокумента = "Документ.Рецепт" Тогда
			ДополнитьДаннымиИсполнителей(ДанныеСобытия, МедицинскийДокумент.Врач, ДолжностьМЗ, ДанныеЭМД);
		ИначеЕсли ИмяТипаДокумента = "Документ.Прием" Тогда
			ВидыДокументовССекциейИсполнителя = ВидыДокументовССекциейИсполнителя();
			Если ВидыДокументовССекциейИсполнителя.Найти(ДанныеЭМД.Получить("ВидРЭМД")) <> Неопределено Тогда
				ДополнитьДаннымиИсполнителей(ДанныеСобытия, МедицинскийДокумент.Врач, ДолжностьМЗ, ДанныеЭМД);
			КонецЕсли;
		КонецЕсли;
		
		ДополнитьТаблицуЗначениями(ДанныеСобытия, ТаблицаПараметров, ИндексСтрокИСобытия);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьДаннымиОпекуна(ДанныеЭМД, ТаблицаПараметров, МедицинскийДокумент)
	
	ДанныеОпекуна = Новый Соответствие;
	Если ЗначениеЗаполнено(МедицинскийДокумент.Клиент.ЗаконныйПредставитель)
		И ТипЗнч(МедицинскийДокумент.Клиент.ЗаконныйПредставитель) <> Тип("Строка")
		И Не МедицинскийДокумент.Клиент.ЗаконныйПредставитель.Тестовый
	Тогда
		АдресОпекуна = СтруктураАдресаОбъекта(МедицинскийДокумент.Клиент.ЗаконныйПредставитель, Справочники.ВидыКонтактнойИнформации.АдресФактический);
		Если АдресОпекуна = Неопределено Тогда
			АдресОпекуна = СтруктураАдресаОбъекта(МедицинскийДокумент.Клиент.ЗаконныйПредставитель, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
		КонецЕсли;
		ДанныеОпекуна.Вставить("АдресОпекуна",					АдресОпекуна);
		ДанныеОпекуна.Вставить("ОпекунДатаРождения",			Формат(МедицинскийДокумент.Клиент.ЗаконныйПредставитель.ДатаРождения, "ДФ=yyyyMMdd"));
		ДанныеОпекуна.Вставить("ОпекунКонтактыПредставителя",	КонтактыОбъекта(МедицинскийДокумент.Клиент.ЗаконныйПредставитель));
		ДанныеОпекуна.Вставить("ФамилияОпекуна",				СокрЛП(МедицинскийДокумент.Клиент.ЗаконныйПредставитель.Фамилия));
		ДанныеОпекуна.Вставить("ИмяОпекуна",					СокрЛП(МедицинскийДокумент.Клиент.ЗаконныйПредставитель.Имя));
		ДанныеОпекуна.Вставить("ОтчествоОпекуна",				СокрЛП(МедицинскийДокумент.Клиент.ЗаконныйПредставитель.Отчество));
	КонецЕсли;
	
	ДополнитьТаблицуЗначениями(ДанныеОпекуна, ТаблицаПараметров);
	
КонецПроцедуры

Процедура ДополнитьДаннымиСлучаяОказанияМедПомощи(ДанныеЭМД, ТаблицаПараметров, МедицинскийДокумент)
	
	ДанныеСлучаяОказанияМедПомощи = Новый Соответствие;
	ДанныеСлучаяОказанияМедПомощи.Вставить("ОрганизацияСлучая",					ДанныеЭМД.Получить("Организация"));
	ДанныеСлучаяОказанияМедПомощи.Вставить("СлучайОказанияМедицинскойПомощи",	ПредставлениеСлучаяОказанияПомощи(МедицинскийДокумент));
	ДанныеСлучаяОказанияМедПомощи.Вставить("НомерМедицинскойКарты",				МедицинскийДокумент.МедицинскаяКарта.Наименование);
	ДанныеСлучаяОказанияМедПомощи.Вставить("ДатаНачалаСлучая",					ДанныеЭМД.Получить("ДатаДокумента"));
	ДанныеСлучаяОказанияМедПомощи.Вставить("ДатаОкончанияСлучая",				ДанныеЭМД.Получить("ДатаДокумента"));
	
	// Формат 2
	ДанныеСлучаяОказанияМедПомощи.Вставить("ТипМедицинскойКарты",				ТипМедицинскойКарты(ДанныеЭМД, МедицинскийДокумент.МедицинскаяКарта));
	ДанныеСлучаяОказанияМедПомощи.Вставить("ВидМедицинскойКарты",				ВидМедицинскойКартыПоКлассификатору(ДанныеЭМД, МедицинскийДокумент.МедицинскаяКарта));
	
	ДополнитьТаблицуЗначениями(ДанныеСлучаяОказанияМедПомощи, ТаблицаПараметров);
	
КонецПроцедуры

Функция ПредставлениеСлучаяОказанияПомощи(МедицинскийДокумент)
	
	ДокументСлучая = МедицинскийДокумент;
	
	Если ДопСерверныеФункции.ИмяСсылочногоТипа(МедицинскийДокумент) = "Документ.Прием"
		И ЗначениеЗаполнено(МедицинскийДокумент.ПервичныйПрием)
	Тогда
		ДокументСлучая = МедицинскийДокумент.ПервичныйПрием;
	КонецЕсли;
	
	ИмяТипаДокументаСлучая = ДопСерверныеФункции.ИмяСсылочногоТипа(МедицинскийДокумент);
	Префикс = "";
	
	Если ИмяТипаДокументаСлучая = "Документ.ПрохождениеМедосмотра" Тогда
		Префикс = НСтр("ru='ПМО'");
	ИначеЕсли ИмяТипаДокументаСлучая = "Документ.ВрачебнаяКомиссия" Тогда // Версия КОРП
		Префикс = НСтр("ru='ВК'");
	КонецЕсли;
	
	Возврат СтрШаблон(НСтр("ru='%1%2 от %3'"), Префикс, ДокументСлучая.Номер, ДокументСлучая.Дата);
	
КонецФункции

Функция ВрачДокумента(МедицинскийДокумент) Экспорт
	
	ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(МедицинскийДокумент);
	
	Если ИмяТипаДокумента = "Документ.Прием" Тогда
		Возврат МедицинскийДокумент.Врач;
	ИначеЕсли ИмяТипаДокумента = "Документ.ПрохождениеМедосмотра" Тогда
		Возврат МедицинскийДокумент.ПредседательМедКомиссии;
	ИначеЕсли ИмяТипаДокумента = "Документ.ВрачебнаяКомиссия" Тогда // Версия КОРП
		Возврат МедицинскийДокумент.ПредседательКомиссии;
	ИначеЕсли ИмяТипаДокумента = "Документ.Рецепт" Тогда
		Возврат МедицинскийДокумент.Врач;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьУИДНаправления(МедицинскийДокумент)
	
	Если ТипЗнч(МедицинскийДокумент) = Тип("ДокументСсылка.Прием")
		И ЗначениеЗаполнено(МедицинскийДокумент.ПервичныйПрием)
	Тогда
		Возврат Строка(МедицинскийДокумент.ПервичныйПрием.УникальныйИдентификатор());
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СтруктураДУЛФизЛица(ФизЛицо, Дата)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ФизЛицо) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПаспортныеДанныеСрезПоследних.ДокументСерия КАК Серия,
			|	ПаспортныеДанныеСрезПоследних.ДокументНомер КАК Номер,
			|	ПаспортныеДанныеСрезПоследних.ДокументДатаВыдачи КАК ДатаВыдачи,
			|	ПаспортныеДанныеСрезПоследних.ДокументКемВыдан КАК КемВыдан,
			|	ПаспортныеДанныеСрезПоследних.ДокументКодПодразделения КАК КодПодразделения,
			|	ДокументыУдостоверяющиеЛичность.КлассификаторВидовДУЛРЭМД КАК КлассификаторВидовДУЛРЭМД,
			|	ДокументыУдостоверяющиеЛичность.НеИмеетСерию КАК НеИмеетСерию
			|ИЗ
			|	РегистрСведений.ПаспортныеДанные.СрезПоследних(&Дата, ФизЛицо = &ФизЛицо) КАК ПаспортныеДанныеСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДокументыУдостоверяющиеЛичность КАК ДокументыУдостоверяющиеЛичность
			|		ПО ПаспортныеДанныеСрезПоследних.ДокументВид = ДокументыУдостоверяющиеЛичность.Ссылка";
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("ФизЛицо", ФизЛицо);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Если ЗначениеЗаполнено(Выборка.КлассификаторВидовДУЛРЭМД)
				И (ЗначениеЗаполнено(Выборка.Серия) Или Выборка.НеИмеетСерию)
				И ЗначениеЗаполнено(Выборка.Номер)
			Тогда
				ДУЛ = Новый Структура("КлассификаторВидовДУЛРЭМД, Серия, Номер, КемВыдан, КодПодразделения, ДатаВыдачи, СерияНомер, КемВыданПолностью");
				
				ДУЛ.КлассификаторВидовДУЛРЭМД = Выборка.КлассификаторВидовДУЛРЭМД;
				ДУЛ.Серия = Выборка.Серия;
				ДУЛ.Номер = Выборка.Номер;
				ДУЛ.КемВыдан = Выборка.КемВыдан;
				ДУЛ.КодПодразделения = Выборка.КодПодразделения;
				ДУЛ.ДатаВыдачи = Выборка.ДатаВыдачи;
				ДУЛ.СерияНомер = Выборка.Серия + " " + Выборка.Номер;
				
				Если ЗначениеЗаполнено(Выборка.КемВыдан)
					И ЗначениеЗаполнено(Выборка.КодПодразделения)
					И ЗначениеЗаполнено(Выборка.ДатаВыдачи)
				Тогда
					ДУЛ.КемВыданПолностью = СтрШаблон("%1. Код подразделения: %2. Дата выдачи: %3", Выборка.КемВыдан, Выборка.КодПодразделения, Формат(Выборка.ДатаВыдачи, "ДФ=дд.ММ.гггг"));
				КонецЕсли;
				
				Возврат ДУЛ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СтруктураАдресаОбъекта(Объект, ВидАдреса)
	
	АдресПоВидуАдреса = ИнтеграцияЕГИСЗСервер.ПолучитьАдресПоВидуАдреса(Объект, ВидАдреса);
	
	Если ЗначениеЗаполнено(АдресПоВидуАдреса.ЗначенияПолей) Тогда
		СтруктураАдресОбъекта = Новый Структура("Текст, Регион, AOGUID, HOUSEGUID, Субъект, ТипАдреса, ПочтовыйИндекс, ВидМестаЖительства");
		
		СтруктураАдрес = РаботаСАдресами.СведенияОбАдресе(АдресПоВидуАдреса.ЗначенияПолей);
		СтруктураАдресОбъекта.Текст = СтруктураАдрес.Представление;
		СтруктураАдресОбъекта.Регион = РаботаСАдресами.КодРегиона(СтруктураАдрес.Регион);
		СтруктураАдресОбъекта.ПочтовыйИндекс = СтруктураАдрес.Индекс;
		
		КодыАдреса = АдресныйКлассификаторСлужебный.КодыАдреса(АдресПоВидуАдреса.ЗначенияПолей).КодыАдреса;
		СтруктураАдресОбъекта.AOGUID = КодыАдреса.Идентификатор;
		СтруктураАдресОбъекта.HOUSEGUID = КодыАдреса.ИдентификаторДома;
		
		СтруктураАдресОбъекта.Субъект = РегионПоКлассификаторуСубъектов(АдресПоВидуАдреса.ЗначенияПолей);
		
		Если ЗначениеЗаполнено(СтруктураАдрес.Город) Тогда
			СтруктураАдресОбъекта.ВидМестаЖительства = ВидМестаЖительстваПоУИДЕГИСЗ(1); // Город
		Иначе
			СтруктураАдресОбъекта.ВидМестаЖительства = ВидМестаЖительстваПоУИДЕГИСЗ(2); // Село
		КонецЕсли;
		
		Если ТипЗнч(Объект) = Тип("СправочникСсылка.Клиенты") Тогда
			СтруктураАдресОбъекта.ТипАдреса = ТипАдресаПациентаПоВидуАдреса(ВидАдреса);
		КонецЕсли;
		
		Возврат СтруктураАдресОбъекта;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция КонтактыИсполнителя(Исполнитель, ВидРЭМД)
	
	Если ВидРЭМД = 186
		Или ВидРЭМД = 194
		Или ВидРЭМД = 230
	Тогда
		РабочаяПочта = ПолучитьРабочуюПочту(Исполнитель);
		Если ЗначениеЗаполнено(РабочаяПочта) Тогда
			Возврат СтрШаблон("mailto:%1", РабочаяПочта);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат КонтактыОбъекта(Исполнитель);
	
КонецФункции

Функция КонтактыОбъекта(Объект, ГруппирующееПоле = Неопределено)
	
	Если ЗначениеЗаполнено(Объект) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КонтактнаяИнформация.Представление КАК Представление,
			|	КонтактнаяИнформация.Тип КАК Тип,
			|	ВЫБОР
			|		КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
			|				И КонтактнаяИнформация.Вид <> ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.Факс)
			|			ТОГДА 0
			|		ИНАЧЕ 1
			|	КОНЕЦ КАК Приоритет,
			|	КонтактнаяИнформация.Вид КАК Вид
			|ИЗ
			|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Объект = &ОбъектСсылка
			|	И КонтактнаяИнформация.Тип В(&ТипыКИ)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Приоритет";
		
		ТипыКИ = Новый Массив;
		ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
		ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
		ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
		Запрос.УстановитьПараметр("ОбъектСсылка", Объект);
		Запрос.УстановитьПараметр("ТипыКИ", ТипыКИ);
		
		КонтактыОбъекта = Запрос.Выполнить().Выгрузить();
		Если КонтактыОбъекта.Количество() = 0
			Или КонтактыОбъекта[0].Приоритет <> 0	// Требование по руководству: "Хотя бы один элемент telecom СЛЕДУЕТ указать со схемой «tel:»"
		Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Контакты = Новый Массив;
		
		Для Каждого СтрокаКонтакта Из КонтактыОбъекта Цикл
			Если Не ЗначениеЗаполнено(СтрокаКонтакта.Представление) Тогда
				Продолжить;
			КонецЕсли;
			Если СтрокаКонтакта.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
				НормализованныйНомерТелефона = КонтактнаяИнформацияКлиентСерверПереопределяемый.НормализоватьСотовыйТелефон(СтрокаКонтакта.Представление, Ложь);
				Если ЗначениеЗаполнено(НормализованныйНомерТелефона) Тогда
					Если СтрокаКонтакта.Вид = Справочники.ВидыКонтактнойИнформации.Факс Тогда
						Контакты.Добавить(Новый Структура("Значение, ГруппирующееПоле", СтрШаблон("fax:+7%1", НормализованныйНомерТелефона), ГруппирующееПоле));
					Иначе
						Контакты.Добавить(Новый Структура("Значение, ГруппирующееПоле", СтрШаблон("tel:+7%1", НормализованныйНомерТелефона), ГруппирующееПоле));
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли СтрокаКонтакта.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты Тогда
				Контакты.Добавить(Новый Структура("Значение, ГруппирующееПоле", СтрШаблон("mailto:%1", СтрокаКонтакта.Представление), ГруппирующееПоле));
			КонецЕсли;
		КонецЦикла;
		
		Если Контакты.Количество() > 0 Тогда
			Возврат Контакты;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция АдресОрганизации(Организация) Экспорт
	
	мВидыАдреса = Новый Массив;
	мВидыАдреса.Добавить(Справочники.ВидыКонтактнойИнформации.АдресФактический);
	мВидыАдреса.Добавить(Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	мВидыАдреса.Добавить(Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	
	Для Каждого ВидАдреса Из мВидыАдреса Цикл
		СтруктураАдреса = СтруктураАдресаОбъекта(Организация, ВидАдреса);
		Если СтруктураАдреса <> Неопределено Тогда
			Возврат СтруктураАдреса;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДанныеЛицензииМедДеятельности(Филиал, МедицинскийДокумент)
	
	ОбладательЛицензии = ?(ТипЗнч(Филиал) = Тип("СправочникСсылка.Филиалы"), Филиал.Организация, Филиал); // Вероятно, в итоге какой-то один тип останется.
	
	СтруктураЛицензииФилиала = РегистрыСведений.ЛицензииМедицинскойДеятельности.ПолучитьСтруктуруДанныхЛицензии(ОбладательЛицензии, МедицинскийДокумент.Дата);
	
	Если СтруктураЛицензииФилиала = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеЛицензииМедДеятельности = Новый Структура;
	ДанныеЛицензииМедДеятельности.Вставить("СерияНомер", СтруктураЛицензииФилиала.НомерЛицензии);
	ДанныеЛицензииМедДеятельности.Вставить("КемВыдана", СтрШаблон("%1. Дата регистрации: %2", СтруктураЛицензииФилиала.ВыдавшийЛицензиюОрган, Формат(СтруктураЛицензииФилиала.Период, "ДФ=dd.MM.yyyy.")));
	
	Возврат ДанныеЛицензииМедДеятельности;
	
КонецФункции

Функция ПолучитьСпециализациюФРМР(Сотрудник) Экспорт
	
	Для Каждого СпециализацияФРМР Из Сотрудник.СпециализацииФРМР Цикл
		Возврат СпециализацияФРМР.Специализация;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция РекурсивныйОбходXMLОбщихСекций(XML, ТаблицаПараметров, УзлыДляУдаления, СоответствиеВышестоящихLocalId, НезагруженныеКлассификаторы, ДополнительныеДанные, НезаполненныеПараметры = Неопределено, РодительскийУзел = Неопределено)
	
	СписокУзлов = XML.ДочерниеУзлы;
	Для Каждого Узел Из СписокУзлов Цикл
		
		Если ТипЗнч(Узел) = Тип("КомментарийDOM") Тогда
			ДобавитьУзелДляУдаления(УзлыДляУдаления, Узел);
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Узел) <> Тип("ЭлементDOM") Тогда
			Если ТипЗнч(Узел) = Тип("ТекстDOM") Тогда
				СтрокаГруппирующегоПоля = ПолучитьСтрокуГруппирующегоПоля(РодительскийУзел, ТаблицаПараметров, СоответствиеВышестоящихLocalId);
				ЗаполнитьТекстовоеСодержаниеУзла(Узел, ТаблицаПараметров, СоответствиеВышестоящихLocalId, НезаполненныеПараметры, РодительскийУзел, УзлыДляУдаления, СтрокаГруппирующегоПоля);
			КонецЕсли;
			Продолжить;
		ИначеЕсли Узел.ПолучитьАтрибут("УзелДляКлонирования") <> Неопределено Или Узел.ПолучитьАтрибут("КлонированныйУзел") <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		АтрибутЭМДСодержитУзел = Узел.ПолучитьУзелАтрибута("ЭМДСодержитУзел");
		Если АтрибутЭМДСодержитУзел <> Неопределено
			И Не ВычислитьФункцию(АтрибутЭМДСодержитУзел.ЗначениеУзла, ТаблицаПараметров, СоответствиеВышестоящихLocalId)
		Тогда
			ДобавитьУзелДляУдаления(УзлыДляУдаления, Узел);
			Продолжить;
		КонецЕсли;
		
		Попытка
			УдалитьАтрибутТипа(Узел, ДополнительныеДанные.ВидРЭМД, ТаблицаПараметров, СоответствиеВышестоящихLocalId);
		Исключение КонецПопытки;
		
		ТекущийLocalId = Узел.ПолучитьАтрибут("localid");
		СвойстваУзла = ПолучитьСвойстваУзлаОбщихСекций(Узел, ТекущийLocalId, ТаблицаПараметров, СоответствиеВышестоящихLocalId);
		СтруктураТекущегоУзла = ПолучитьСтруктуруТекущегоУзла(Узел, РодительскийУзел, СвойстваУзла);
		
		Если ТекущийLocalId = Неопределено Тогда
			СтрокаГруппирующегоПоля = ПолучитьСтрокуГруппирующегоПоля(РодительскийУзел, ТаблицаПараметров, СоответствиеВышестоящихLocalId);
			УстановитьЗначениеАтрибутовУзлаОбщихСекций(Узел, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтруктураТекущегоУзла, УзлыДляУдаления, НезаполненныеПараметры, НезагруженныеКлассификаторы, , СтрокаГруппирующегоПоля);
			РекурсивныйОбходXMLОбщихСекций(Узел, ТаблицаПараметров, УзлыДляУдаления, СоответствиеВышестоящихLocalId, НезагруженныеКлассификаторы, ДополнительныеДанные, НезаполненныеПараметры, СтруктураТекущегоУзла);
			Продолжить;
		КонецЕсли;
		
		Если СвойстваУзла.Множественное Тогда
			// [0..*] Или [1..*]
			ПараметрыСТекущимLocalId = ПолучитьПараметрыСТекущимLocalId(Узел, ТекущийLocalId, ТаблицаПараметров, СоответствиеВышестоящихLocalId);
			
			КоличествоСформированныхУзлов = 0;
			
			Для Каждого ПараметрСТекущимLocalId Из ПараметрыСТекущимLocalId Цикл
				
				КлонированныйУзел = Узел.КлонироватьУзел(Истина);
				СтруктураКлонированногоУзла = ПолучитьСтруктуруТекущегоУзла(КлонированныйУзел, РодительскийУзел, СвойстваУзла);
				КлонированныйУзел.УстановитьАтрибут("КлонированныйУзел", "Истина");
				Узел.РодительскийУзел.ВставитьПеред(КлонированныйУзел, Узел);
				
				СоответствиеВышестоящихLocalId.Вставить(ТекущийLocalId, ПараметрСТекущимLocalId);
				ДанныеДляУзлаКлассификатора = Новый Структура("localid, ДополнительныеДанные", ТекущийLocalId, ДополнительныеДанные);
				УстановитьЗначениеАтрибутовУзлаОбщихСекций(КлонированныйУзел, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтруктураКлонированногоУзла, УзлыДляУдаления, НезаполненныеПараметры, НезагруженныеКлассификаторы, ПараметрСТекущимLocalId.Значение, , ДанныеДляУзлаКлассификатора);
				РекурсивныйОбходXMLОбщихСекций(КлонированныйУзел, ТаблицаПараметров, УзлыДляУдаления, СоответствиеВышестоящихLocalId, НезагруженныеКлассификаторы, ДополнительныеДанные, НезаполненныеПараметры, СтруктураКлонированногоУзла);
				СоответствиеВышестоящихLocalId.Удалить(ТекущийLocalId);
				
				// TODO: возможно потребуется добавить в макет общих секций в множественные узлы новый атрибут МинКоличествоУзлов
				Если УзлыДляУдаления.Найти(КлонированныйУзел) = Неопределено Тогда
					КоличествоСформированныхУзлов = КоличествоСформированныхУзлов + 1;
				КонецЕсли;
			КонецЦикла;
			
			Если КоличествоСформированныхУзлов = 0 Тогда
				КлонированныйУзел = Узел.КлонироватьУзел(Истина);
				СтруктураКлонированногоУзла = ПолучитьСтруктуруТекущегоУзла(КлонированныйУзел, РодительскийУзел, СвойстваУзла);
				КлонированныйУзел.УстановитьАтрибут("КлонированныйУзел", "Истина");
				Узел.РодительскийУзел.ВставитьПеред(КлонированныйУзел, Узел);
				ОбработатьУзелБезЗаполненногоПараметра(КлонированныйУзел, СтруктураКлонированногоУзла, УзлыДляУдаления, ТаблицаПараметров, НезаполненныеПараметры);
			КонецЕсли;
			
			Узел.УстановитьАтрибут("УзелДляКлонирования", "Истина");
			ДобавитьУзелДляУдаления(УзлыДляУдаления, Узел);
			
			Продолжить;
		КонецЕсли;
		
		СтрокаГруппирующегоПоля = ПолучитьСтрокуГруппирующегоПоля(РодительскийУзел, ТаблицаПараметров, СоответствиеВышестоящихLocalId);
		ЗначениеLocalIdИзСтроки = ПолучитьЗначениеLocalIdИзСтроки(ТекущийLocalId, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтрокаГруппирующегоПоля);
		
		Если ЗначениеЗаполнено(ЗначениеLocalIdИзСтроки) Тогда
			ДанныеДляУзлаКлассификатора = Новый Структура("localid, ДополнительныеДанные", ТекущийLocalId, ДополнительныеДанные);
			УстановитьЗначениеАтрибутовУзлаОбщихСекций(Узел, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтруктураТекущегоУзла, УзлыДляУдаления, НезаполненныеПараметры, НезагруженныеКлассификаторы, ЗначениеLocalIdИзСтроки, ,ДанныеДляУзлаКлассификатора);
			РекурсивныйОбходXMLОбщихСекций(Узел, ТаблицаПараметров, УзлыДляУдаления, СоответствиеВышестоящихLocalId, НезагруженныеКлассификаторы, ДополнительныеДанные, НезаполненныеПараметры, СтруктураТекущегоУзла);
		Иначе
			Если НезаполненныйУзелКлассификатора(Узел) Тогда
				ДобавитьНезагруженныйКлассификатор(НезагруженныеКлассификаторы, Узел.ПолучитьАтрибут("codeSystem"));
			Иначе
				ОбработатьУзелБезЗаполненногоПараметра(Узел, СтруктураТекущегоУзла, УзлыДляУдаления, ТаблицаПараметров, НезаполненныеПараметры);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Процедура УдалитьАтрибутТипа(Узел, ВидРЭМД, ТаблицаПараметров, СоответствиеВышестоящихLocalId)
	
	ВидыРЭМДБезТипов = Новый Массив;
	ВидыРЭМДБезТипов.Добавить("100");
	ВидыРЭМДБезТипов.Добавить("103");
	ВидыРЭМДБезТипов.Добавить("116");
	ВидыРЭМДБезТипов.Добавить("129");
	ВидыРЭМДБезТипов.Добавить("141");
	ВидыРЭМДБезТипов.Добавить("148");
	ВидыРЭМДБезТипов.Добавить("158");
	ВидыРЭМДБезТипов.Добавить("174");
	ВидыРЭМДБезТипов.Добавить("186");
	ВидыРЭМДБезТипов.Добавить("189");
	ВидыРЭМДБезТипов.Добавить("194");
	ВидыРЭМДБезТипов.Добавить("196");
	ВидыРЭМДБезТипов.Добавить("204");
	ВидыРЭМДБезТипов.Добавить("227");
	ВидыРЭМДБезТипов.Добавить("230");
	ВидыРЭМДБезТипов.Добавить("246");
	
	Если ВидыРЭМДБезТипов.Найти(ВидРЭМД) <> Неопределено
		И Узел.ЕстьАтрибут("http://www.w3.org/2001/XMLSchema-instance", "type")
	Тогда
		АтрибутПринудительноОставитьТип = Узел.ПолучитьАтрибут("ПринудительноОставитьТип");
		Если Не ЗначениеЗаполнено(АтрибутПринудительноОставитьТип)
			Или Не ВычислитьФункцию(АтрибутПринудительноОставитьТип, ТаблицаПараметров, СоответствиеВышестоящихLocalId)
		Тогда
			Узел.УдалитьАтрибут("http://www.w3.org/2001/XMLSchema-instance", "type");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция НезаполненныйУзелКлассификатора(Узел)
	
	Если Узел.ПолучитьАтрибут("codeSystem") = Неопределено
		Или Лев(Узел.ПолучитьАтрибут("codeSystem"), 1) = "#"
	Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого АтрибутУзла Из Узел.Атрибуты Цикл
		Если Лев(АтрибутУзла.ЗначениеУзла, 1) = "#" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьСвойстваУзлаОбщихСекций(Узел, ТекущийLocalId, ТаблицаПараметров, СоответствиеВышестоящихLocalId)
	
	СвойстваУзла = Новый Структура("Обязательное, Множественное, ЗначениеПустогоЗначения, Синоним, СохранятьТипПриПустомЗначении, localid");
	
	// Если узел множественный - узел клонируется столько раз, сколько строк по такому localid есть в таблице параметров ([0..*] или [1..*])
	// Иначе - узел должен быть максимум в одном экземпляре ([0..1] или [1..1])
	АтрибутМножественное = Узел.ПолучитьАтрибут("Множественное");
	Если АтрибутМножественное <> Неопределено Тогда
		СвойстваУзла.Множественное = ВычислитьФункцию(АтрибутМножественное, ТаблицаПараметров, СоответствиеВышестоящихLocalId);
	Иначе
		СвойстваУзла.Множественное = Ложь;
	КонецЕсли;
	
	// Если ПустоеЗначение заполнено, это значит, что: ([1..])
	//	1) При отсутствии значения по localid узла, или одного из дочерних обязательных узлов:
	//		а) Все дочерние узлы удаляются
	//		б) Все атрибуты узла удаляются
	//		в) В узел добавляется атрибут nullFlavor с соответствующим значением
	//	2) При наличии заполненного значения - заполнить узел
	// Иначе: (R[1..1] или [0..])
	//	Зависит от обязательности
	АтрибутПустоеЗначение = Узел.ПолучитьАтрибут("ПустоеЗначение");
	Если АтрибутПустоеЗначение <> Неопределено Тогда
		Если Лев(АтрибутПустоеЗначение,1) = "*" Тогда
			СвойстваУзла.ЗначениеПустогоЗначения = ВычислитьФункцию(АтрибутПустоеЗначение, ТаблицаПараметров, СоответствиеВышестоящихLocalId);
		Иначе
			СвойстваУзла.ЗначениеПустогоЗначения = АтрибутПустоеЗначение;
		КонецЕсли;
	Иначе
		СвойстваУзла.ЗначениеПустогоЗначения = Неопределено;
	КонецЕсли;
	
	// Если узел обязательный: (R[1..])
	//	1) При отсутствии заполненного значения - один из родительских узлов обязан быть необязательным. Найти его, обработать его (либо удалить узел, либо установить nullFlavor). 
	//	2) При наличии заполненного значения - заполнить узел (R[1..])
	// Иначе: ([0..*])
	//	1) При отсутствии заполненного значения - узел следует удалить ([0..0])
	//	2) При наличии заполненного значения - заполнить узел ([..*])
	Если ЗначениеЗаполнено(СвойстваУзла.ЗначениеПустогоЗначения) Тогда
		СвойстваУзла.Обязательное = Ложь;
	Иначе
		АтрибутОбязательное = Узел.ПолучитьАтрибут("Обязательное");
		Если АтрибутОбязательное <> Неопределено Тогда
			СвойстваУзла.Обязательное = ВычислитьФункцию(АтрибутОбязательное, ТаблицаПараметров, СоответствиеВышестоящихLocalId);
		Иначе
			СвойстваУзла.Обязательное = Истина;
		КонецЕсли;
	КонецЕсли;
	
	АтрибутСиноним = Узел.ПолучитьАтрибут("Синоним");
	Если АтрибутСиноним <> Неопределено Тогда
		Если Лев(АтрибутСиноним,1) = "*" Тогда
			СвойстваУзла.Синоним = ВычислитьФункцию(АтрибутСиноним, ТаблицаПараметров, СоответствиеВышестоящихLocalId);
		Иначе
			СвойстваУзла.Синоним = АтрибутСиноним;
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ТекущийLocalId) Тогда
		СвойстваУзла.Синоним = СтрШаблон(НСтр("ru='Поле ЭМД ""%1""'"), ТекущийLocalId);
	КонецЕсли;
	
	Попытка
		СвойстваУзла.СохранятьТипПриПустомЗначении = ВычислитьФункцию(Узел.ПолучитьАтрибут("СохранятьТипПриПустомЗначении"), ТаблицаПараметров, СоответствиеВышестоящихLocalId);
	Исключение
		СвойстваУзла.СохранятьТипПриПустомЗначении = Ложь;
	КонецПопытки;
	
	СвойстваУзла.localid = ТекущийLocalId;
	
	Возврат СвойстваУзла
	
КонецФункции

Функция ПолучитьСтрокуГруппирующегоПоля(РодительскийУзел, ТаблицаПараметров, СоответствиеВышестоящихLocalId)
	
	СтруктураМножественногоРодителя = Неопределено;
	Если РодительскийУзел <> Неопределено Тогда
		стрРодительскийУзел = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(РодительскийУзел);
		
		Пока СтруктураМножественногоРодителя = Неопределено
			И стрРодительскийУзел <> Неопределено
		Цикл
			Если (стрРодительскийУзел.СвойстваУзла.Свойство("Множественное")
				И стрРодительскийУзел.СвойстваУзла.Множественное)
			Тогда
				СтруктураМножественногоРодителя = стрРодительскийУзел;
			КонецЕсли;
			стрРодительскийУзел = стрРодительскийУзел.РодительскийУзел;
		КонецЦикла;
	КонецЕсли;
	
	Если СтруктураМножественногоРодителя <> Неопределено Тогда
		localidМножественногоРодителя = СтруктураМножественногоРодителя.СвойстваУзла.localid;
		ЗначениеВышестоящегоLocalId = СоответствиеВышестоящихLocalId.Получить(localidМножественногоРодителя);
		Если ЗначениеВышестоящегоLocalId <> Неопределено Тогда
			Возврат ЗначениеВышестоящегоLocalId;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьПараметрыСТекущимLocalId(Узел, ТекущийLocalId, ТаблицаПараметров, СоответствиеВышестоящихLocalId)
	
	РодительУзла = Узел.РодительскийУзел;
	РодительскийУзелСLocalId = Неопределено;
	Пока РодительУзла <> Неопределено Цикл
		Если ТипЗнч(РодительУзла) = Тип("ЭлементDOM") И РодительУзла.ПолучитьАтрибут("localid") <> Неопределено Тогда
			РодительскийУзелСLocalId = РодительУзла;
			Прервать;
		КонецЕсли;
		РодительУзла = РодительУзла.РодительскийУзел;
	КонецЦикла;
	
	Если РодительскийУзелСLocalId <> Неопределено Тогда
		// Группирующее поле
		ГруппирующееПоле = Неопределено;
		НомерСтрокиТаблицы = Неопределено;
		
		РодительУзла = Узел.РодительскийУзел;
		Пока РодительУзла <> Неопределено Цикл
			Если ТипЗнч(РодительУзла) = Тип("ЭлементDOM") Тогда
				АтрибутLocalid = РодительУзла.ПолучитьАтрибут("localid");
				Если АтрибутLocalid <> Неопределено Тогда
					ВышестоящийLocalId = СоответствиеВышестоящихLocalId.Получить(АтрибутLocalid);
					Если ВышестоящийLocalId <> Неопределено Тогда
						Если ВышестоящийLocalId.Параметр <> Неопределено Тогда
							ГруппирующееПоле = ВышестоящийLocalId.Параметр;
							НомерСтрокиТаблицы = ВышестоящийLocalId.НомерСтрокиТаблицы;
						Иначе
							// Константа
							ГруппирующееПоле = ТаблицаПараметров.Индекс(ВышестоящийLocalId);
						КонецЕсли;
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			РодительУзла = РодительУзла.РодительскийУзел;
		КонецЦикла;
		
		Если ГруппирующееПоле <> Неопределено Тогда
			ПараметрыСТекущимLocalId = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid, ГруппирующееПоле, НомерСтрокиТаблицы", ТекущийLocalId, ГруппирующееПоле, НомерСтрокиТаблицы));
		Иначе
			ПараметрыСТекущимLocalId = Новый Массив;
		КонецЕсли;
	Иначе
		ПараметрыСТекущимLocalId = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", ТекущийLocalId));
	КонецЕсли;
	
	Возврат ПараметрыСТекущимLocalId;
	
КонецФункции

Процедура ОбработатьУзелБезЗаполненногоПараметра(Узел, СвойстваРодительскогоУзла, УзлыДляУдаления, ТаблицаПараметров, НезаполненныеПараметры)
	
	СвойстваУзла = СвойстваРодительскогоУзла.СвойстваУзла;
	РодительскийУзел = СвойстваРодительскогоУзла.РодительскийУзел;
	СохранятьДочерниеУзлы = СвойстваУзла.Свойство("СохранятьДочерниеУзлы") И СвойстваУзла.СохранятьДочерниеУзлы;
	СохранятьТипПриПустомЗначении = СвойстваУзла.Свойство("СохранятьТипПриПустомЗначении") И СвойстваУзла.СохранятьТипПриПустомЗначении;
	
	Если ЗначениеЗаполнено(СвойстваУзла.ЗначениеПустогоЗначения) Тогда
		УстановитьПустоеЗначениеУзла(Узел, УзлыДляУдаления, СвойстваУзла.ЗначениеПустогоЗначения, СохранятьДочерниеУзлы, СохранятьТипПриПустомЗначении);
	Иначе
		Если СвойстваУзла.Обязательное Тогда
			// Обязательный узел, не подразумевающий nullFlavor с пустым значением существовать не может, поэтому ищем необязательного родителя и удаляем его
			НеобязательныйРодитель = Неопределено;
			
			Если РодительскийУзел <> Неопределено Тогда
				стрРодительскийУзел = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(РодительскийУзел);
				
				Пока НеобязательныйРодитель = Неопределено
					И стрРодительскийУзел <> Неопределено
				Цикл
					Если (Не стрРодительскийУзел.СвойстваУзла.Обязательное
							Или стрРодительскийУзел.СвойстваУзла.Множественное)
						И стрРодительскийУзел.Узел <> Неопределено
					Тогда
						НеобязательныйРодитель = стрРодительскийУзел.Узел;
					Иначе
						стрРодительскийУзел = стрРодительскийУзел.РодительскийУзел;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если НеобязательныйРодитель = Неопределено Тогда
				Если НезаполненныеПараметры <> Неопределено Тогда
					НезаполненныеПараметры.Добавить(Новый Структура("Узел, СвойстваРодительскогоУзла", Узел, СвойстваРодительскогоУзла));
					Возврат;
				Иначе
					// TODO: Убедиться, что такая ситуация невозможна
					ВызватьИсключение(НСтр("ru='Не заполнен обязательный параметр'"));
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(стрРодительскийУзел.СвойстваУзла.ЗначениеПустогоЗначения) Тогда
				УстановитьПустоеЗначениеУзла(НеобязательныйРодитель, УзлыДляУдаления, стрРодительскийУзел.СвойстваУзла.ЗначениеПустогоЗначения, СохранятьДочерниеУзлы, СохранятьТипПриПустомЗначении);
			Иначе
				ДобавитьУзелДляУдаления(УзлыДляУдаления, НеобязательныйРодитель);
			КонецЕсли;
		Иначе
			ДобавитьУзелДляУдаления(УзлыДляУдаления, СвойстваРодительскогоУзла.Узел);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Заполнение атрибутов, значения которы начинаются с #, $, *, %
//
Процедура УстановитьЗначениеАтрибутовУзлаОбщихСекций(Узел, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СвойстваРодительскогоУзла,
	УзлыДляУдаления, НезаполненныеПараметры, НезагруженныеКлассификаторы, ЗначениеLocalIdИзСтроки = Неопределено, СтрокаГруппирующегоПоля = Неопределено, ДанныеДляУзлаКлассификатора = Неопределено)
	
	// Заполнение атрибутов по данным элемента классификатора (#)
	Если ЗначениеLocalIdИзСтроки <> Неопределено
		И ОбщегоНазначения.ЗначениеСсылочногоТипа(ЗначениеLocalIdИзСтроки)
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЗначениеLocalIdИзСтроки, "УИДЕГИСЗ")
	Тогда
		ЗаполнитьАтрибутыУзлаКлассификатора(Узел, ЗначениеLocalIdИзСтроки, НезагруженныеКлассификаторы, ДанныеДляУзлаКлассификатора);
	КонецЕсли;
	
	// Заполнение значений остальных атрибутов по localid ($, *, %)
	СлужебныеАтрибуты = ПолучитьСлужебныеАтрибуты();
	
	Для Каждого АтрибутУзла Из Узел.Атрибуты Цикл
		Если СлужебныеАтрибуты.Найти(АтрибутУзла.ИмяУзла) <> Неопределено
			Или (СтрНайти(АтрибутУзла.ЗначениеУзла, "$") = 0
					И Лев(АтрибутУзла.ЗначениеУзла,1) <> "*"
					И Лев(АтрибутУзла.ЗначениеУзла,1) <> "%")
		Тогда
			Продолжить;
		КонецЕсли;
		Результат = ПолучитьРезультат(Узел, АтрибутУзла.ЗначениеУзла, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтрокаГруппирующегоПоля, Узел.ПолучитьАтрибут("Формат"));
		Если ЗначениеЗаполнено(Результат) Тогда
			Узел.УстановитьАтрибут(АтрибутУзла.ИмяУзла, Результат);
		Иначе
			ОбработатьУзелБезЗаполненногоПараметра(Узел, СвойстваРодительскогоУзла, УзлыДляУдаления, ТаблицаПараметров, НезаполненныеПараметры);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСлужебныеАтрибуты()
	
	СлужебныеАтрибуты = Новый Массив;
	СлужебныеАтрибуты.Добавить("ЭМДСодержитУзел");
	СлужебныеАтрибуты.Добавить("ПустоеЗначение");
	СлужебныеАтрибуты.Добавить("Обязательное");
	СлужебныеАтрибуты.Добавить("Множественное");
	СлужебныеАтрибуты.Добавить("localid");
	СлужебныеАтрибуты.Добавить("КлонированныйУзел");
	СлужебныеАтрибуты.Добавить("УзелДляКлонирования");
	СлужебныеАтрибуты.Добавить("Синоним");
	СлужебныеАтрибуты.Добавить("Формат");
	СлужебныеАтрибуты.Добавить("СохранятьТипПриПустомЗначении");
	СлужебныеАтрибуты.Добавить("ВозможноЗаполнениеИзТаблицыДиагнозов");
	СлужебныеАтрибуты.Добавить("ПринудительноОставитьТип");
	
	Возврат СлужебныеАтрибуты;
	
КонецФункции

Функция ДанныеМакетаПоВидуДокумента(ВидРЭМД)
	
	ДанныеМакетаФормат1 = Новый Структура("Формат, Макет", 1, ПолучитьОбщийМакет("ОбщиеСекцииСЭМД_Формат1").ПолучитьТекст());
	ДанныеМакетаФормат2 = Новый Структура("Формат, Макет", 2, ПолучитьОбщийМакет("ОбщиеСекцииСЭМД_Формат2").ПолучитьТекст());
	
	ДанныеМакетов = Новый Соответствие;
	ДанныеМакетов.Вставить(4,	ДанныеМакетаФормат1);	// Медицинская справка о допуске к управлению транспортными средствами (CDA) Редакция 1
	ДанныеМакетов.Вставить(15,	ДанныеМакетаФормат1);	// Протокол инструментального исследования (CDA) Редакция 1
	ДанныеМакетов.Вставить(16,	ДанныеМакетаФормат1);	// Протокол консультации (CDA) Редакция 2
	ДанныеМакетов.Вставить(17,	ДанныеМакетаФормат1);	// Протокол лабораторного исследования (CDA) Редакция 2
	ДанныеМакетов.Вставить(40,	ДанныеМакетаФормат1);	// Направление на госпитализацию, восстановительное лечение, обследование, консультацию (CDA) Редакция 2
	ДанныеМакетов.Вставить(43,	ДанныеМакетаФормат1);	// Направление на госпитализацию, восстановительное лечение, обследование, консультацию (CDA) Редакция 2
	ДанныеМакетов.Вставить(50,	ДанныеМакетаФормат1);	// Медицинская справка (врачебное профессионально-консультативное заключение) (CDA) Редакция 1
	ДанныеМакетов.Вставить(63,	ДанныеМакетаФормат2);	// Медицинское заключение об отсутствии медицинских противопоказаний к владению оружием (CDA) Редакция 1
	ДанныеМакетов.Вставить(64,	ДанныеМакетаФормат2);	// Медицинское заключение об отсутствии в организме человека наркотических средств, психотропных веществ и их метаболитов (CDA) Редакция 1
	ДанныеМакетов.Вставить(80,	ДанныеМакетаФормат2);	// Справка об отсутствии контактов с инфекционными больными. Справка о временной нетрудоспособности студента, учащегося техникума, профессионально-технического училища, о болезни, карантине и прочих причинах отсутствия ребенка, посещающего школу, детское дошкольное учреждение (Редакция 2)
	ДанныеМакетов.Вставить(81,	ДанныеМакетаФормат2);	// Справка об отсутствии контактов с инфекционными больными. Справка о временной нетрудоспособности студента, учащегося техникума, профессионально-технического училища, о болезни, карантине и прочих причинах отсутствия ребенка, посещающего школу, детское дошкольное учреждение (Редакция 2)
	ДанныеМакетов.Вставить(82,	ДанныеМакетаФормат2);	// Медицинское заключение о принадлежности несовершеннолетнего к медицинской группе для занятий физической культурой (CDA) Редакция 2
	ДанныеМакетов.Вставить(83,	ДанныеМакетаФормат2);	// Медицинское заключение об отсутствии противопоказаний к занятию определенными видами спорта (CDA) Редакция 2
	ДанныеМакетов.Вставить(84,	ДанныеМакетаФормат2);	// Медицинская справка в бассейн (CDA) Редакция 2
	ДанныеМакетов.Вставить(85,	ДанныеМакетаФормат2);	// Направление на консультацию и во вспомогательные кабинеты (CDA) Редакция 1
	ДанныеМакетов.Вставить(86,	ДанныеМакетаФормат2);	// Направление к месту лечения для получения медицинской помощи (CDA) Редакция 1
	ДанныеМакетов.Вставить(87,	ДанныеМакетаФормат2);	// Медицинская справка о состоянии здоровья ребенка, отъезжающего в организацию отдыха детей и их оздоровления (CDA) Редакция 1
	ДанныеМакетов.Вставить(88,	ДанныеМакетаФормат2);	// Медицинская справка (для выезжающего за границу) (CDA) Редакция 1
	ДанныеМакетов.Вставить(92,	ДанныеМакетаФормат2);	// Эпикриз по законченному случаю амбулаторный (CDA) Редакция 4
	ДанныеМакетов.Вставить(99,	ДанныеМакетаФормат2);	// Выписка из протокола врачебной комиссии (CDA) Редакция 1
	ДанныеМакетов.Вставить(100,	ДанныеМакетаФормат2);	// Справка об оплате медицинских услуг для предоставления в налоговые органы Российской Федерации (Редакция 1)
	ДанныеМакетов.Вставить(102,	ДанныеМакетаФормат2);	// Справка об отказе в направлении на медико-социальную экспертизу (CDA) Редакция 1
	ДанныеМакетов.Вставить(103,	ДанныеМакетаФормат2);	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) (Редакция 1)
	ДанныеМакетов.Вставить(116,	ДанныеМакетаФормат2);	// Уведомление о выявлении противопоказаний или аннулировании медицинских заключений к владению оружием (CDA) Редакция 1
	ДанныеМакетов.Вставить(119,	ДанныеМакетаФормат2);	// Протокол консультации (CDA) Редакция 4
	ДанныеМакетов.Вставить(121,	ДанныеМакетаФормат2);	// Направление на медико-социальную экспертизу (CDA) Редакция 6
	ДанныеМакетов.Вставить(122,	ДанныеМакетаФормат2);	// Сведения о результатах диспансеризации или профилактического медицинского осмотра (CDA) Редакция 2
	ДанныеМакетов.Вставить(129,	ДанныеМакетаФормат2);	// Эпикриз по результатам диспансеризации / профилактического медицинского осмотра (CDA) Редакция 1
	ДанныеМакетов.Вставить(141,	ДанныеМакетаФормат2);	// Льготный рецепт на лекарственный препарат, изделие медицинского назначения и специализированный продукт лечебного питания (CDA) Редакция 4
	ДанныеМакетов.Вставить(148,	ДанныеМакетаФормат2);	// Рецепт на лекарственный препарат (CDA) Редакция 2
	ДанныеМакетов.Вставить(158,	ДанныеМакетаФормат2);	// Выписка из протокола решения врачебной комиссии (CDA) Редакция 2
	ДанныеМакетов.Вставить(174,	ДанныеМакетаФормат2);	// Протокол инструментального исследования (СDA) Редакция 4
	ДанныеМакетов.Вставить(186,	ДанныеМакетаФормат2);	// Протокол лабораторного исследования (CDA) Редакция 5
	ДанныеМакетов.Вставить(189,	ДанныеМакетаФормат2);	// Протокол оперативного вмешательства (операции) (CDA) Редакция 1
	ДанныеМакетов.Вставить(194,	ДанныеМакетаФормат2);	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) Редакция 2
	ДанныеМакетов.Вставить(196,	ДанныеМакетаФормат2);	// Медицинская справка (врачебное профессионально-консультативное заключение) (CDA) Редакция 3
	ДанныеМакетов.Вставить(198,	ДанныеМакетаФормат2);	// Первичный осмотр врачом приемного отделения (дежурным врачом или лечащим врачом) (CDA) Редакция 1
	ДанныеМакетов.Вставить(204,	ДанныеМакетаФормат2);	// Медицинское заключение (CDA) Редакция 1
	ДанныеМакетов.Вставить(227,	ДанныеМакетаФормат2);	// Протокол консультации (CDA) Редакция 5
	ДанныеМакетов.Вставить(230,	ДанныеМакетаФормат2);	// Медицинское заключение по результатам медицинского осмотра работника для предоставления в подсистему ЭЛМК (CDA) Редакция 1
	ДанныеМакетов.Вставить(246,	ДанныеМакетаФормат2);	// Протокол трансфузии (CDA) Редакция 5
	
	Возврат ДанныеМакетов.Получить(ВидРЭМД);
	
КонецФункции

Функция ЭлементКлассификатораПолаФизЛица(ПолПациента)
	
	КодПола = КодПола(ПолПациента);
	Если КодПола <> Неопределено Тогда
		Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПолаФизЛица(КодПола);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция КодПола(ПолПациента)
	
	КодыПолов = Новый Соответствие;
	КодыПолов.Вставить(Перечисления.ПолФизическихЛиц.Мужской,	1);
	КодыПолов.Вставить(Перечисления.ПолФизическихЛиц.Женский,	2);
	//КодыПолов.Вставить(Перечисления.ПолФизическихЛиц.НеУказан,	3); // СЭМД не принимают код 3. Только мужской или женский
	
	Возврат КодыПолов.Получить(ПолПациента)
	
КонецФункции

Процедура ДополнитьДаннымиИсточниковОплаты(ДанныеЭМД, ТаблицаПараметров, Пациент, МедицинскийДокумент)
	
	Если ДанныеЭМД.Получить("ВидРЭМД") = 121 Тогда
		// Не обязательная секция.
		Возврат;
	КонецЕсли;
	
	ДанныеИсточниковОплаты = Новый Соответствие;
	
	ДанныеДоговора = Новый Структура("ТипПолиса, Номер, Серия, ДатаНачала, ДатаОкончания");
	ДоговорСКонтрагентом = ТаблицаПараметров.Найти("ДоговорСКонтрагентом", "localid");
	ДокументОплаты = ТаблицаПараметров.Найти("ДокументОплаты", "localid");
	Если ЗначениеЗаполнено(ДокументОплаты) Тогда
		Если ТипЗнч(ДокументОплаты.Значение) = Тип("СправочникСсылка.СтраховыеПолисы") Тогда
			Договор = ДокументОплаты.Значение;
			ДанныеДоговора.ТипПолиса	 = Договор.КлассификаторВидовПолисовРЭМД;
			ДанныеДоговора.Серия		 = Договор.Серия;
			ДанныеДоговора.Номер		 = Договор.Номер;
			ДанныеДоговора.ДатаНачала	 = Договор.СрокДействияНачало;
			ДанныеДоговора.ДатаОкончания = Договор.СрокДействия;
			ИНН = Пациент.ИНН;
			
			// Средства обязательного медицинского страхования
			ИдентификаторИсточникаОплаты = 1;
			
		ИначеЕсли ТипЗнч(ДокументОплаты.Значение) = Тип("ДокументСсылка.ДоговорСКлиентом") Тогда
			Договор = ДокументОплаты.Значение;
			ДанныеДоговора.Номер		 = Договор.Номер;
			ДанныеДоговора.ДатаНачала	 = Договор.Дата;
			ДанныеДоговора.ДатаОкончания = Договор.ДатаОкончания;
			ИНН = Пациент.ИНН;
			
			// Средства пациента
			ИдентификаторИсточникаОплаты = 4;
			
		ИначеЕсли ТипЗнч(ДокументОплаты.Значение) = Тип("СправочникСсылка.СоглашенияСтрахования") Тогда
			Договор = ДокументОплаты.Значение;
			ДанныеДоговора.Номер		 = Договор.НомерДоговора;
			ДанныеДоговора.ДатаНачала	 = Договор.ДатаНачала;
			ДанныеДоговора.ДатаОкончания = Договор.ДатаОкончания;
			
			Контрагент = Договор.Владелец;
			ИНН = ?(ЗначениеЗаполнено(Контрагент), Контрагент.ИНН, Неопределено);
			
			// Средства третьих юридических лиц
			ИдентификаторИсточникаОплаты = 6;
		Иначе
			Возврат;
		КонецЕсли;
	ИначеЕсли Не ЗначениеЗаполнено(ДоговорСКонтрагентом) Тогда
		ДоговорСКлиентом = ТаблицаПараметров.Найти("ДоговорСКлиентом", "localid");
		Если ДоговорСКлиентом = Неопределено Тогда
			Возврат;
		Иначе
			Договор = ДоговорСКлиентом.Значение;
			ДанныеДоговора.Номер		 = Договор.Номер;
			ДанныеДоговора.ДатаНачала	 = Договор.Дата;
			ДанныеДоговора.ДатаОкончания = Договор.ДатаОкончания;
			ИНН = Пациент.ИНН;
			
			// Средства пациента
			ИдентификаторИсточникаОплаты = 4;
		КонецЕсли;
	Иначе
		
		Договор = ДоговорСКонтрагентом.Значение;
		ДанныеДоговора.Номер		 = Договор.НомерДоговора;
		ДанныеДоговора.ДатаНачала	 = Договор.ДатаНачала;
		ДанныеДоговора.ДатаОкончания = Договор.ДатаОкончания;
		
		Контрагент = ТаблицаПараметров.Найти("Контрагент", "localid").Значение;
		ИНН = ?(ЗначениеЗаполнено(Контрагент), Контрагент.ИНН, Неопределено);
		
		// Средства третьих юридических лиц
		ИдентификаторИсточникаОплаты = 6;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеДоговора.ДатаОкончания) Тогда
		ДатаОкончанияДоговора = ДанныеДоговора.ДатаОкончания;
	ИначеЕсли ИдентификаторИсточникаОплаты = 1 Тогда
		ДатаОкончанияДоговора = Неопределено;
	Иначе
		ДатаОкончанияДоговора = ДобавитьМесяц(ДанныеДоговора.ДатаНачала, 12);
	КонецЕсли;
	
	Если ИдентификаторИсточникаОплаты = 1 Тогда
		ДанныеИсточниковОплаты.Вставить("ТипПолиса",	ВидПолисаОМС(ДанныеДоговора.ТипПолиса.УИДЕГИСЗ));
		ДанныеИсточниковОплаты.Вставить("СерияПолиса",	ДанныеДоговора.Серия);
	КонецЕсли;
	
	ДанныеИсточниковОплаты.Вставить("ТипДокументаОснования",		 ТипДокументаОснованияПоИсточникуОплаты(ИдентификаторИсточникаОплаты));
	ДанныеИсточниковОплаты.Вставить("НомерДоговора",				 ДанныеДоговора.Номер);
	ДанныеИсточниковОплаты.Вставить("ИНН",							 ИНН);
	ДанныеИсточниковОплаты.Вставить("ДатаНачалаДействияДоговора",	 Формат(ДанныеДоговора.ДатаНачала, "ДФ=yyyyMMdd"));
	ДанныеИсточниковОплаты.Вставить("ДатаОкончанияДействияДоговора", Формат(ДатаОкончанияДоговора, "ДФ=yyyyMMdd"));
	ДанныеИсточниковОплаты.Вставить("ИсточникОплаты",				 ИсточникОплатыПоКлассификатору(ИдентификаторИсточникаОплаты));
	
	Если Контрагент <> Неопределено Тогда
		НаименованиеКонтрагента = ?(ЗначениеЗаполнено(Контрагент.НаименованиеПолное), Контрагент.НаименованиеПолное, Контрагент.Наименование);
		ДанныеИсточниковОплаты.Вставить("Контрагент",			Новый Структура("Наименование, Идентификатор", НаименованиеКонтрагента));
		ДанныеИсточниковОплаты.Вставить("КонтактыКонтрагента",	КонтактыОбъекта(Контрагент));
		ДанныеИсточниковОплаты.Вставить("АдресКонтрагента",		АдресОрганизации(Контрагент));
	КонецЕсли;
	
	ДополнитьТаблицуЗначениями(ДанныеИсточниковОплаты, ТаблицаПараметров);
	
КонецПроцедуры

Процедура ДополнитьДаннымиПриглашенногоКонсультанта(ДанныеЭМД, ТаблицаПараметров)
	
	ДанныеПриглашенногоКонсультанта = Новый Соответствие;
	
	ДанныеПриглашенногоКонсультанта.Вставить("ДатаПодписиДокументаПриглашеннымКонсультантом",		 ДанныеЭМД.Получить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу"));
	ДанныеПриглашенногоКонсультанта.Вставить("ОрганизацияПриглашенногоКонсультанта",				 ДанныеЭМД.Получить("ОрганизацияЛицаПридавшегоЮрСилу"));
	ДанныеПриглашенногоКонсультанта.Вставить("OIDМедицинскойОрганизацииПриглашенногоКонсультанта", ДанныеЭМД.Получить("OIDМедицинскойОрганизацииЛицаПридавшегоЮрСилу"));
	ДанныеПриглашенногоКонсультанта.Вставить("НаименованиеОрганизацииПриглашенногоКонсультанта",	 ДанныеЭМД.Получить("НаименованиеОрганизацииЛицаПридавшегоЮрСилу"));
	ДанныеПриглашенногоКонсультанта.Вставить("КонтактыОрганизацииПриглашенногоКонсультанта",		 ДанныеЭМД.Получить("КонтактыОрганизацииЛицаПридавшегоЮрСилу"));
	ДанныеПриглашенногоКонсультанта.Вставить("АдресОрганизацииПриглашенногоКонсультанта",			 ДанныеЭМД.Получить("АдресОрганизацииЛицаПридавшегоЮрСилу"));
	
	СтрокиПриглашенногоКонсультанта = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", "ПриглашенныйКонсультант"));
	СтрокиДолжностиПриглашенногоКонсультанта = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", "ДолжностьПриглашенногоКонсультанта"));
	
	Если СтрокиПриглашенногоКонсультанта.Количество() = 0
		Или СтрокиДолжностиПриглашенногоКонсультанта.Количество() = 0
	Тогда
		ДанныеПриглашенногоКонсультанта.Вставить("УИДПриглашенногоКонсультанта",		 ДанныеЭМД.Получить("УИДЛицаПридавшегоЮрСилу"));
		ДанныеПриглашенногоКонсультанта.Вставить("СНИЛСПриглашенногоКонсультанта",		 ДанныеЭМД.Получить("СНИЛСЛицаПридавшегоЮрСилу"));
		ДанныеПриглашенногоКонсультанта.Вставить("ДолжностьПриглашенногоКонсультанта",	 ДанныеЭМД.Получить("ДолжностьЛицаПридавшегоЮрСилу"));
		ДанныеПриглашенногоКонсультанта.Вставить("АдресПриглашенногоКонсультанта",		 ДанныеЭМД.Получить("АдресЛицаПридавшегоЮрСилу"));
		ДанныеПриглашенногоКонсультанта.Вставить("КонтактыПриглашенногоКонсультанта",	 ДанныеЭМД.Получить("КонтактыЛицаПридавшегоЮрСилу"));
		ДанныеПриглашенногоКонсультанта.Вставить("ФамилияПриглашенногоКонсультанта",	 ДанныеЭМД.Получить("ФамилияЛицаПридавшегоЮрСилу"));
		ДанныеПриглашенногоКонсультанта.Вставить("ИмяПриглашенногоКонсультанта",		 ДанныеЭМД.Получить("ИмяЛицаПридавшегоЮрСилу"));
		ДанныеПриглашенногоКонсультанта.Вставить("ОтчествоПриглашенногоКонсультанта",	 ДанныеЭМД.Получить("ОтчествоЛицаПридавшегоЮрСилу"));
	Иначе
		
		ПриглашенныйКонсультант				= СтрокиПриглашенногоКонсультанта[0].Значение;
		УИДПриглашенногоКонсультанта		= Строка(ПриглашенныйКонсультант.УникальныйИдентификатор());
		СНИЛСПриглашенногоКонсультанта		= СтроковыеФункцииКлиентСервер.ПолучитьЦифрыСтроки(ПриглашенныйКонсультант.СНИЛС);
		ДолжностьПриглашенногоКонсультанта	= СтрокиДолжностиПриглашенногоКонсультанта[0].Значение;
		АдресПриглашенногоКонсультанта		= СтруктураАдресаОбъекта(ПриглашенныйКонсультант, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
		КонтактыПриглашенногоКонсультанта	= КонтактыОбъекта(ПриглашенныйКонсультант);
		
		ДанныеПриглашенногоКонсультанта.Вставить("УИДПриглашенногоКонсультанта",		 УИДПриглашенногоКонсультанта);
		ДанныеПриглашенногоКонсультанта.Вставить("СНИЛСПриглашенногоКонсультанта",		 СНИЛСПриглашенногоКонсультанта);
		ДанныеПриглашенногоКонсультанта.Вставить("ДолжностьПриглашенногоКонсультанта",	 ДолжностьПриглашенногоКонсультанта);
		ДанныеПриглашенногоКонсультанта.Вставить("АдресПриглашенногоКонсультанта",		 АдресПриглашенногоКонсультанта);
		ДанныеПриглашенногоКонсультанта.Вставить("КонтактыПриглашенногоКонсультанта",	 КонтактыПриглашенногоКонсультанта);
		ДанныеПриглашенногоКонсультанта.Вставить("ФамилияПриглашенногоКонсультанта",	 ПриглашенныйКонсультант.Фамилия);
		ДанныеПриглашенногоКонсультанта.Вставить("ИмяПриглашенногоКонсультанта",		 ПриглашенныйКонсультант.Имя);
		ДанныеПриглашенногоКонсультанта.Вставить("ОтчествоПриглашенногоКонсультанта",	 ПриглашенныйКонсультант.Отчество);
	КонецЕсли;
	
	ДополнитьТаблицуЗначениями(ДанныеПриглашенногоКонсультанта, ТаблицаПараметров);
	
КонецПроцедуры

Функция ИсточникОплатыПоКлассификатору(УИДЕГИСЗ = 4)
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ИсточникОплатыПоКлассификатору(УИДЕГИСЗ);
	
КонецФункции

Функция ТипДокументаОснованияДляИсточникаОплаты(УИДЕГИСЗ = 3)
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипДокументаОснованияДляИсточникаОплаты(УИДЕГИСЗ);
	
КонецФункции

Функция ПолучитьРольПредседателяМедкомиссии()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.РольСотрудникаПриПодписанииМД(14);
	
КонецФункции

Функция ПолучитьРольЧленаКомиссии()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.РольСотрудникаПриПодписанииМД(16);
	
КонецФункции

Функция LocalIdТипаСобытияПоВидуРЭМД(ВидРЭМД)
	
	// Протокол инструментального исследования (CDA) Редакция 1
	Если ВидРЭМД = 15 Тогда
		Возврат "МетодИнструментальногоИсследования";
		
	// Протокол консультации (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 16 Тогда
		Возврат "ВидКонсультации";
		
	// Протокол телемедицинской консультации (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 40 Тогда
		Возврат "ВидКонсультации";
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ТипСобытияПоВидуРЭМД(ВидРЭМД)
	
	// Медицинская справка (для выезжающего за границу) (CDA) Редакция 1
	Если ВидРЭМД = 88 Тогда
		Возврат ТипСобытияПоРЭМД_88();
	// Эпикриз по законченному случаю амбулаторный редакция 4
	ИначеЕсли ВидРЭМД = 92 Тогда
		Возврат ТипСобытияПоРЭМД_92();
	// Выписка из протокола врачебной комиссии (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 99 Тогда
		Возврат ТипСобытияПоРЭМД_99();
	// Справка об отказе в направлении на медико-социальную экспертизу (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 102 Тогда
		Возврат ТипСобытияПоРЭМД_102();
	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) (Редакция 1)
	ИначеЕсли ВидРЭМД = 103 Тогда
		Возврат ТипСобытияПоРЭМД_103();
	// Протокол консультации (CDA) Редакция 4
	ИначеЕсли ВидРЭМД = 119 Тогда
		Возврат ТипСобытияПоРЭМД_119();
	// Направление на медико-социальную экспертизу (CDA) Редакция 6
	ИначеЕсли ВидРЭМД = 121 Тогда
		Возврат ТипСобытияПоРЭМД_121();
	// Сведения о результатах диспансеризации или профилактического медицинского осмотра (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 122 Тогда
		Возврат ТипСобытияПоРЭМД_122();
	// Эпикриз по результатам диспансеризации / профилактического медицинского осмотра (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 129 Тогда
		Возврат ТипСобытияПоРЭМД_129();
	// Льготный рецепт на лекарственный препарат, изделие медицинского назначения и специализированный продукт лечебного питания (CDA) Редакция 4
	ИначеЕсли ВидРЭМД = 141 Тогда
		Возврат ТипСобытияПоРЭМД_141();
	// Рецепт на лекарственный препарат (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 148 Тогда
		Возврат ТипСобытияПоРЭМД_148();
	// Выписка из протокола решения врачебной комиссии (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 158 Тогда
		Возврат ТипСобытияПоРЭМД_158();
	// Протокол инструментального исследования (СDA) Редакция 4
	ИначеЕсли ВидРЭМД = 174 Тогда
		Возврат ТипСобытияПоРЭМД_174();
	// Протокол лабораторного исследования (CDA) Редакция 5
	ИначеЕсли ВидРЭМД = 186 Тогда
		Возврат ТипСобытияПоРЭМД_186();
	// Протокол оперативного вмешательства (операции) (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 189 Тогда
		Возврат ТипСобытияПоРЭМД_189();
	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 194 Тогда
		Возврат ТипСобытияПоРЭМД_194();
	// Первичный осмотр врачом приемного отделения (дежурным врачом или лечащим врачом) (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 198 Тогда
		Возврат ТипСобытияПоРЭМД_198();
	// Медицинское заключение (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 204 Тогда
		Возврат ТипСобытияПоРЭМД_204();
	// Протокол консультации (CDA) Редакция 5
	ИначеЕсли ВидРЭМД = 227 Тогда
		Возврат ТипСобытияПоРЭМД_227();
	// Медицинское заключение по результатам медицинского осмотра работника для предоставления в подсистему ЭЛМК (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 230 Тогда
		Возврат ТипСобытияПоРЭМД_230();
	// Протокол трансфузии (CDA) Редакция 5
	ИначеЕсли ВидРЭМД = 246 Тогда
		Возврат ТипСобытияПоРЭМД_246();
	КонецЕсли;
	
КонецФункции

Функция ТипСобытияПоРЭМД_88()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(5);
	
КонецФункции

Функция ТипСобытияПоРЭМД_92()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(5);
	
КонецФункции

Функция ТипСобытияПоРЭМД_99()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(5);
	
КонецФункции

Функция ТипСобытияПоРЭМД_102()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(5);
	
КонецФункции

Функция ТипСобытияПоРЭМД_103()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(5);
	
КонецФункции

Функция ТипСобытияПоРЭМД_119()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(1);
	
КонецФункции

Функция ТипСобытияПоРЭМД_121()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(1);
	
КонецФункции

Функция ТипСобытияПоРЭМД_174()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(3);
	
КонецФункции

Функция ТипСобытияПоРЭМД_186()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(4);
	
КонецФункции

Функция ТипСобытияПоРЭМД_189()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(12);
	
КонецФункции

Функция ТипСобытияПоРЭМД_194()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(5);
	
КонецФункции

Функция ТипСобытияПоРЭМД_204()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(5);
	
КонецФункции

Функция ТипСобытияПоРЭМД_230()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(5);
	
КонецФункции

Функция ТипСобытияПоРЭМД_246()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(73);
	
КонецФункции

Функция ФормаОказанияМедПомощи(ДанныеЭМД)
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ФормаОказанияМедПомощи(1);
	
КонецФункции

Функция ВидМедицинскойПомощи(ДанныеЭМД)
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидМедицинскойПомощи(3);
	
КонецФункции

Функция УсловияОказанияМедицинскойПомощи(ДанныеЭМД)
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.УсловияОказанияМедицинскойПомощи(3);
	
КонецФункции

Функция ТипМедицинскойКарты(ДанныеЭМД, МедицинскаяКарта)
	
	Если МедицинскаяКарта.ВидКарты.ТипКарты = Перечисления.ТипыМедицинскихКарт.Амбулаторная Тогда
		Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипМедицинскойКарты(1); // Амбулаторная медицинская карта
	ИначеЕсли МедицинскаяКарта.ВидКарты.ТипКарты = Перечисления.ТипыМедицинскихКарт.Стационар Тогда
		Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипМедицинскойКарты(2); // Стационарная медицинская карта
	Иначе
		Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипМедицинскойКарты(3); // Иная медицинская карта
	КонецЕсли;
	
КонецФункции

Функция ТипАдресаПациентаПоВидуАдреса(ВидАдреса)
	
	КодТипаАдреса = КодТипаАдреса(ВидАдреса);
	Если КодТипаАдреса <> Неопределено Тогда
		Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипАдресаПациентаПоВидуАдреса(КодТипаАдреса);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция КодТипаАдреса(ВидАдреса)
	
	КодыТиповАдресов = Новый Соответствие;
	КодыТиповАдресов.Вставить(Справочники.ВидыКонтактнойИнформации.АдресЮридический, 1);
	КодыТиповАдресов.Вставить(Справочники.ВидыКонтактнойИнформации.АдресФактический, 3);
	
	Возврат КодыТиповАдресов.Получить(ВидАдреса)
	
КонецФункции

Функция РегионПоКлассификаторуСубъектов(ЗначенияПолей)
	
	Попытка
		Регион = РаботаСАдресами.РегионАдресаКонтактнойИнформации(ЗначенияПолей);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторыМинЗдрава.Ссылка КАК Ссылка,
		|	КлассификаторыМинЗдраваАтрибуты.Значение КАК Значение
		|ИЗ
		|	Справочник.КлассификаторыМинЗдрава КАК КлассификаторыМинЗдрава
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторыМинЗдрава.Атрибуты КАК КлассификаторыМинЗдраваАтрибуты
		|		ПО (КлассификаторыМинЗдрава.ВидКлассификатора = &ВидКлассификатора)
		|			И (НЕ КлассификаторыМинЗдрава.Архив)
		|			И (КлассификаторыМинЗдраваАтрибуты.Ссылка = КлассификаторыМинЗдрава.Ссылка)
		|			И (КлассификаторыМинЗдраваАтрибуты.Ключ = ""CODE_FNS"")
		|			И ((ВЫРАЗИТЬ(КлассификаторыМинЗдраваАтрибуты.Значение КАК СТРОКА(10))) = &КодФНС)";
	
	Запрос.УстановитьПараметр("ВидКлассификатора", Перечисления.ВидыКлассификаторовМинЗдрава.СубъектыРФ);
	Запрос.УстановитьПараметр("КодФНС", РаботаСАдресами.КодРегиона(Регион));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Процедура УстановитьПустоеЗначениеУзла(Узел, УзлыДляУдаления, ЗначениеПустогоЗначения, СохранятьДочерниеУзлы, СохранятьТипПриПустомЗначении)
	
	Если ТипЗнч(Узел) = Тип("ТекстDOM") Тогда
		ОбрабатываемыйУзел = Узел.РодительскийУзел;
	Иначе
		ОбрабатываемыйУзел = Узел;
	КонецЕсли;
	
	Если Не СохранятьДочерниеУзлы Тогда
		Для Каждого ДочернийУзел Из ОбрабатываемыйУзел.ДочерниеУзлы Цикл
			ДобавитьУзелДляУдаления(УзлыДляУдаления, ДочернийУзел);
		КонецЦикла;
	КонецЕсли;
	
	мУзлыАтрибутыУзла = Новый Массив;
	Для Каждого УзелАтрибута Из ОбрабатываемыйУзел.Атрибуты Цикл
		Если Не СохранятьТипПриПустомЗначении
			Или УзелАтрибута.ИмяУзла <> "xsi:type"
		Тогда
			мУзлыАтрибутыУзла.Добавить(УзелАтрибута);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УзелАтрибутаУзла Из мУзлыАтрибутыУзла Цикл
		ОбрабатываемыйУзел.УдалитьУзелАтрибута(УзелАтрибутаУзла);
	КонецЦикла;
	
	ОбрабатываемыйУзел.УстановитьАтрибут("nullFlavor", ЗначениеПустогоЗначения);
	
КонецПроцедуры

Функция ВидПолисаОМС(УИДЕГИСЗ)
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(УИДЕГИСЗ, Перечисления.ВидыКлассификаторовМинЗдрава.ВидыПолисаОМС);
	
КонецФункции

Функция ВидыДокументаБезДатыПодписиАвтора()
	
	ВидыДокументаБезДатыПодписиАвтора = Новый Массив;
	ВидыДокументаБезДатыПодписиАвтора.Добавить(63);		// Медицинское заключение об отсутствии медицинских противопоказаний к владению оружием (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиАвтора.Добавить(64);		// Медицинское заключение об отсутствии в организме человека наркотических средств, психотропных веществ и их метаболитов (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиАвтора.Добавить(85);		// Направление на консультацию и во вспомогательные кабинеты (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиАвтора.Добавить(87);		// Медицинская справка о состоянии здоровья ребенка, отъезжающего в организацию отдыха детей и их оздоровления (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиАвтора.Добавить(100);	// Справка об оплате медицинских услуг для предоставления в налоговые органы Российской Федерации (Редакция 1)
	ВидыДокументаБезДатыПодписиАвтора.Добавить(102);	// Справка об отказе в направлении на медико-социальную экспертизу (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиАвтора.Добавить(103);	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиАвтора.Добавить(116);	// Уведомление о выявлении противопоказаний или аннулировании медицинских заключений к владению оружием (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиАвтора.Добавить(119);	// Протокол консультации (CDA) Редакция 4
	ВидыДокументаБезДатыПодписиАвтора.Добавить(121);	// Направление на медико-социальную экспертизу (CDA) Редакция 6
	ВидыДокументаБезДатыПодписиАвтора.Добавить(122);	// Сведения о результатах диспансеризации или профилактического медицинского осмотра (CDA) Редакция 2
	ВидыДокументаБезДатыПодписиАвтора.Добавить(129);	// Эпикриз по результатам диспансеризации / профилактического медицинского осмотра (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиАвтора.Добавить(141);	// Льготный рецепт на лекарственный препарат, изделие медицинского назначения и специализированный продукт лечебного питания (CDA) Редакция 4
	ВидыДокументаБезДатыПодписиАвтора.Добавить(147);	// Эпикриз в стационаре выписной (CDA) Редакция 5
	ВидыДокументаБезДатыПодписиАвтора.Добавить(148);	// Рецепт на лекарственный препарат (CDA) Редакция 2
	ВидыДокументаБезДатыПодписиАвтора.Добавить(158);	// Выписка из протокола решения врачебной комиссии (CDA) Редакция 2
	ВидыДокументаБезДатыПодписиАвтора.Добавить(174);	// Протокол инструментального исследования (СDA) Редакция 4
	ВидыДокументаБезДатыПодписиАвтора.Добавить(186);	// Протокол лабораторного исследования (CDA) Редакция 5
	ВидыДокументаБезДатыПодписиАвтора.Добавить(189);	// Протокол оперативного вмешательства (операции) (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиАвтора.Добавить(194);	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) Редакция 2
	ВидыДокументаБезДатыПодписиАвтора.Добавить(196);	// ММедицинская справка (врачебное профессионально-консультативное заключение) (CDA) Редакция 3
	ВидыДокументаБезДатыПодписиАвтора.Добавить(198);	// Первичный осмотр врачом приемного отделения (дежурным врачом или лечащим врачом) (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиАвтора.Добавить(204);	// Медицинское заключение (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиАвтора.Добавить(227);	// Протокол консультации (CDA) Редакция 5
	ВидыДокументаБезДатыПодписиАвтора.Добавить(230);	// Медицинское заключение по результатам медицинского осмотра работника для предоставления в подсистему ЭЛМК (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиАвтора.Добавить(246);	// Протокол трансфузии (CDA) Редакция 5
	
	Возврат ВидыДокументаБезДатыПодписиАвтора;
	
КонецФункции

Функция ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу()
	
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу = Новый Массив;
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(63);	// Медицинское заключение об отсутствии медицинских противопоказаний к владению оружием (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(64);	// Медицинское заключение об отсутствии в организме человека наркотических средств, психотропных веществ и их метаболитов (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(85);	// Направление на консультацию и во вспомогательные кабинеты (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(87);	// Медицинская справка о состоянии здоровья ребенка, отъезжающего в организацию отдыха детей и их оздоровления (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(100);	// Справка об оплате медицинских услуг для предоставления в налоговые органы Российской Федерации (Редакция 1)
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(102);	// Справка об отказе в направлении на медико-социальную экспертизу (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(103);	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(116);	// Уведомление о выявлении противопоказаний или аннулировании медицинских заключений к владению оружием (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(119);	// Протокол консультации (CDA) Редакция 4
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(121);	// Направление на медико-социальную экспертизу (CDA) Редакция 6
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(122);	// Сведения о результатах диспансеризации или профилактического медицинского осмотра (CDA) Редакция 2
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(129);	// Эпикриз по результатам диспансеризации / профилактического медицинского осмотра (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(141);	// Льготный рецепт на лекарственный препарат, изделие медицинского назначения и специализированный продукт лечебного питания (CDA) Редакция 4
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(147);	// Эпикриз в стационаре выписной (CDA) Редакция 5
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(148);	// Рецепт на лекарственный препарат (CDA) Редакция 2
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(158);	// Выписка из протокола решения врачебной комиссии (CDA) Редакция 2
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(174);	// Протокол инструментального исследования (СDA) Редакция 4
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(186);	// Протокол лабораторного исследования (CDA) Редакция 5
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(189);	// Протокол оперативного вмешательства (операции) (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(194);	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) Редакция 2
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(196);	// ММедицинская справка (врачебное профессионально-консультативное заключение) (CDA) Редакция 3
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(198);	// Первичный осмотр врачом приемного отделения (дежурным врачом или лечащим врачом) (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(204);	// Медицинское заключение (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(227);	// Протокол консультации (CDA) Редакция 5
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(230);	// Медицинское заключение по результатам медицинского осмотра работника для предоставления в подсистему ЭЛМК (CDA) Редакция 1
	ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу.Добавить(246);	// Протокол трансфузии (CDA) Редакция 5
	
	Возврат ВидыДокументаБезДатыПодписиЛицаПридавшегоЮрСилу;
	
КонецФункции

Функция ВидыДокументовССекциейИсполнителя()
	
	ВидыДокументовССекциейИсполнителя = Новый Массив;
	ВидыДокументовССекциейИсполнителя.Добавить(85);		// Направление на консультацию и во вспомогательные кабинеты (CDA) Редакция 1
	ВидыДокументовССекциейИсполнителя.Добавить(88);		// Медицинская справка (для выезжающего за границу) (CDA) Редакция 1
	ВидыДокументовССекциейИсполнителя.Добавить(99);		// Выписка из протокола врачебной комиссии (CDA) Редакция 1
	ВидыДокументовССекциейИсполнителя.Добавить(102);	// Справка об отказе в направлении на медико-социальную экспертизу (CDA) Редакция 1
	ВидыДокументовССекциейИсполнителя.Добавить(103);	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) Редакция 1
	ВидыДокументовССекциейИсполнителя.Добавить(119);	// Протокол консультации (CDA) Редакция 4
	ВидыДокументовССекциейИсполнителя.Добавить(121);	// Направление на медико-социальную экспертизу (CDA) Редакция 6
	ВидыДокументовССекциейИсполнителя.Добавить(122);	// Сведения о результатах диспансеризации или профилактического медицинского осмотра (CDA) Редакция 2
	ВидыДокументовССекциейИсполнителя.Добавить(129);	// Эпикриз по результатам диспансеризации / профилактического медицинского осмотра (CDA) Редакция 1
	ВидыДокументовССекциейИсполнителя.Добавить(158);	// Выписка из протокола решения врачебной комиссии (CDA) Редакция 2
	ВидыДокументовССекциейИсполнителя.Добавить(174);	// Протокол инструментального исследования (СDA) Редакция 4
	ВидыДокументовССекциейИсполнителя.Добавить(186);	// Протокол лабораторного исследования (CDA) Редакция 5
	ВидыДокументовССекциейИсполнителя.Добавить(189);	// Протокол оперативного вмешательства (операции) (CDA) Редакция 1
	ВидыДокументовССекциейИсполнителя.Добавить(194);	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) Редакция 2
	ВидыДокументовССекциейИсполнителя.Добавить(198);	// Первичный осмотр врачом приемного отделения (дежурным врачом или лечащим врачом) (CDA) Редакция 1
	ВидыДокументовССекциейИсполнителя.Добавить(204);	// Медицинское заключение (CDA) Редакция 1
	ВидыДокументовССекциейИсполнителя.Добавить(227);	// Протокол консультации (CDA) Редакция 5
	ВидыДокументовССекциейИсполнителя.Добавить(246);	// Протокол трансфузии (CDA) Редакция 5
	
	Возврат ВидыДокументовССекциейИсполнителя;
	
КонецФункции

Процедура ДополнитьДаннымиИсполнителей(ДанныеСобытия, Исполнитель, ДолжностьМЗ, ДанныеЭМД)
	
	// Исполнитель
	ДанныеСобытия.Вставить("РольСотрудникаПриПодписанииМД", ПолучитьРольПредседателяМедкомиссии());
	
	ДанныеСобытия.Вставить("УИДИсполнителя",			Строка(Исполнитель.УникальныйИдентификатор()));
	ДанныеСобытия.Вставить("СНИЛСИсполнителя",			СтроковыеФункцииКлиентСервер.ПолучитьЦифрыСтроки(Исполнитель.СНИЛС));
	ДанныеСобытия.Вставить("ДолжностьИсполнителя",		ДолжностьМЗ);
	ДанныеСобытия.Вставить("АдресИсполнителя",			СтруктураАдресаОбъекта(Исполнитель, Справочники.ВидыКонтактнойИнформации.АдресЮридический));
	ДанныеСобытия.Вставить("КонтактыИсполнителя",		КонтактыИсполнителя(Исполнитель, ДанныеЭМД.Получить("ВидРЭМД")));
	ДанныеСобытия.Вставить("ФамилияИсполнителя",		Исполнитель.Фамилия);
	ДанныеСобытия.Вставить("ИмяИсполнителя",			Исполнитель.Имя);
	ДанныеСобытия.Вставить("ОтчествоИсполнителя",		Исполнитель.Отчество);
	ДанныеСобытия.Вставить("ПодразделениеИсполнителя",	Исполнитель.Подразделение.ПодразделениеМинздрава);
	
	ДанныеСобытия.Вставить("OIDМедицинскойОрганизацииИсполнителя",	ДанныеЭМД.Получить("OIDМедицинскойОрганизации"));
	ДанныеСобытия.Вставить("НаименованиеОрганизацииИсполнителя",	ДанныеЭМД.Получить("НаименованиеОрганизации"));
	ДанныеСобытия.Вставить("КонтактыОрганизацииИсполнителя",		ДанныеЭМД.Получить("КонтактыОрганизации"));
	ДанныеСобытия.Вставить("АдресОрганизацииИсполнителя",			ДанныеЭМД.Получить("АдресОрганизации"));
	
	Если ЗначениеЗаполнено(Исполнитель.Подразделение.ПодразделениеМинздрава) Тогда
		ДанныеСобытия.Вставить("НаименованиеСтруктурногоПодразделения",	Исполнитель.Подразделение.ПодразделениеМинздрава.ПолноеНаименование);
		// Если есть филиал в подразделении, то указываем адрес филиала подразделения. Иначе адрес организации
		Если ЗначениеЗаполнено(Исполнитель.Подразделение.Филиал.Организация) Тогда
			ДанныеСобытия.Вставить("АдресСтруктурногоПодразделения",	СтруктураАдресаОбъекта(Исполнитель.Подразделение.Филиал.Организация, Справочники.ВидыКонтактнойИнформации.АдресЮридический));
		Иначе
			ДанныеСобытия.Вставить("АдресСтруктурногоПодразделения",	ДанныеЭМД.Получить("АдресОрганизации"));
		КонецЕсли;
	КонецЕсли;
	
	// Другие члены медкомиссии
	
КонецПроцедуры

Функция ВидМедицинскойКартыПоКлассификатору(ДанныеЭМД, МедицинскаяКарта)
	
	Если МедицинскаяКарта.ВидКарты.ТипКарты = Перечисления.ТипыМедицинскихКарт.Стационар Тогда
		Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидМедицинскойДокументации(94); // Медицинская карта пациента, получающего медицинскую помощь в стационарных условиях, в условиях дневного стационара
	ИначеЕсли МедицинскаяКарта.ВидКарты.ТипКарты = Перечисления.ТипыМедицинскихКарт.Стоматологическая Тогда
		Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидМедицинскойДокументации(61); // Медицинская карта стоматологического больного
	ИначеЕсли МедицинскаяКарта.ВидКарты.ТипКарты = Перечисления.ТипыМедицинскихКарт.ГинекологическаяБеременной Тогда
		Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидМедицинскойДокументации(62); // Индивидуальная карта беременной и родильницы
	Иначе
		Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидМедицинскойДокументации(41); // Медицинская карта пациента, получающего медицинскую помощь в амбулаторных условиях
	КонецЕсли;
	
КонецФункции

Функция ТипСобытияПоРЭМД_122()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(14);
	
КонецФункции

Функция ТипСобытияПоРЭМД_129()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(14);
	
КонецФункции

Функция ТипСобытияПоРЭМД_141()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(58);
	
КонецФункции

Функция ТипСобытияПоРЭМД_148()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(58);
	
КонецФункции

Функция ТипСобытияПоРЭМД_158()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(5);
	
КонецФункции

Функция ТипСобытияПоРЭМД_198()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(64);
	
КонецФункции

Функция ТипСобытияПоРЭМД_227()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ТипСобытияПоРЭМД(1);
	
КонецФункции

Функция ВидМестаЖительстваПоУИДЕГИСЗ(УИДЕГИСЗ)
	
	Если ЗначениеЗаполнено(УИДЕГИСЗ) Тогда
		Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидМестаЖительстваПоУИДЕГИСЗ(УИДЕГИСЗ);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ТипДокументаОснованияПоИсточникуОплаты(ИдентификаторИсточникаОплаты)
	
	ТипыДокументов = Новый Соответствие;
	ТипыДокументов.Вставить(1, ТипДокументаОснованияДляИсточникаОплаты(1));
	ТипыДокументов.Вставить(3, ТипДокументаОснованияДляИсточникаОплаты(2));
	ТипыДокументов.Вставить(4, ТипДокументаОснованияДляИсточникаОплаты(3));
	ТипыДокументов.Вставить(5, ТипДокументаОснованияДляИсточникаОплаты(3));
	ТипыДокументов.Вставить(6, ТипДокументаОснованияДляИсточникаОплаты(3));
	
	Возврат ТипыДокументов.Получить(ИдентификаторИсточникаОплаты);
	
КонецФункции

#Область ФункцииМакетовОбщихСекций

// Значение по умолчанию = Ложь
Функция ЭМДСодержитУзел(ВидРЭМД, ТипУзла)
	
	ТипыУзлов = Новый Массив;
	
	// ФОРМАТ 1
	// Медицинская справка о допуске к управлению транспортными средствами (CDA) Редакция 1
	Если ВидРЭМД = 4 Тогда
		ТипыУзлов.Добавить("ДУЛ");
		ТипыУзлов.Добавить("ОГРНОрганизации");
		ТипыУзлов.Добавить("ЛицензияМедДеятельности");
		ТипыУзлов.Добавить("УИДАвтораПоФРМР");
		ТипыУзлов.Добавить("УИДПациента");
		ТипыУзлов.Добавить("МедицинскаяОрганизация");
		ТипыУзлов.Добавить("ДатаСлучаяДваЗначения");
		ТипыУзлов.Добавить("АдресЛицаПридавшегоЮрСилу");
		ТипыУзлов.Добавить("Отчество");
		ТипыУзлов.Добавить("АдресАвтора");
		ТипыУзлов.Добавить("КонтактыОрганизацииВладельца");
		
	// Протокол инструментального исследования (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 15 Тогда
		ТипыУзлов.Добавить("ДУЛ");
		ТипыУзлов.Добавить("СпециальностьАвтора");
		ТипыУзлов.Добавить("СведенияОСтраховомПолисеОМС");
		ТипыУзлов.Добавить("УИДПациента");
		ТипыУзлов.Добавить("МедицинскаяОрганизация");
		ТипыУзлов.Добавить("СведенияОНаправившемЛице");
		ТипыУзлов.Добавить("СведенияОНаправлении");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("ДокументируемоеСобытие");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("ДатаСлучаяДваЗначения");
		ТипыУзлов.Добавить("АдресЛицаПридавшегоЮрСилу");
		ТипыУзлов.Добавить("Отчество");
		ТипыУзлов.Добавить("КонтактыОрганизацииВладельца");
		
	// Протокол консультации (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 16 Тогда
		ТипыУзлов.Добавить("ДУЛ");
		ТипыУзлов.Добавить("СпециальностьАвтора");
		ТипыУзлов.Добавить("СведенияОСтраховомПолисеОМС");
		ТипыУзлов.Добавить("УИДАвтораПоФРМР");
		ТипыУзлов.Добавить("АдресАвтора");
		ТипыУзлов.Добавить("УИДПациента");
		ТипыУзлов.Добавить("МедицинскаяОрганизация");
		ТипыУзлов.Добавить("СведенияОНаправившемЛице");
		ТипыУзлов.Добавить("СведенияОНаправлении");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("ДокументируемоеСобытие");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("ДатаСлучаяДваЗначения");
		ТипыУзлов.Добавить("АдресЛицаПридавшегоЮрСилу");
		ТипыУзлов.Добавить("Отчество");
		ТипыУзлов.Добавить("КонтактыОрганизацииВладельца");
		
	// Протокол лабораторного исследования (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 17 Тогда
		ТипыУзлов.Добавить("ДУЛ");
		ТипыУзлов.Добавить("СведенияОСтраховомПолисеОМС");
		ТипыУзлов.Добавить("УИДПациента");
		ТипыУзлов.Добавить("АдресАвтора");
		ТипыУзлов.Добавить("МедицинскаяОрганизация");
		ТипыУзлов.Добавить("СведенияОНаправившемЛице");
		ТипыУзлов.Добавить("СведенияОНаправлении");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("ДатаОкончанияСлучая");
		ТипыУзлов.Добавить("ДатаСлучаяДваЗначения");
		ТипыУзлов.Добавить("АдресЛицаПридавшегоЮрСилу");
		ТипыУзлов.Добавить("Отчество");
		ТипыУзлов.Добавить("КонтактыОрганизацииВладельца");
		
	// Протокол телемедицинской консультации (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 40 Тогда
		ТипыУзлов.Добавить("ДУЛ");
		ТипыУзлов.Добавить("ОГРНОрганизацииВладельца");
		ТипыУзлов.Добавить("ИННОрганизацииВладельца");
		ТипыУзлов.Добавить("СведенияОСтраховомПолисеОМС");
		ТипыУзлов.Добавить("СведенияОНаправившемЛице");
		ТипыУзлов.Добавить("СведенияОНаправлении");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("ДокументируемоеСобытие");
		ТипыУзлов.Добавить("ДатаСлучаяДваЗначения");
		ТипыУзлов.Добавить("АдресЛицаПридавшегоЮрСилу");
		ТипыУзлов.Добавить("Отчество");
		ТипыУзлов.Добавить("КонтактыОрганизацииВладельца");
		ТипыУзлов.Добавить("ПриглашенныйКонсультант");
		
	// Направление на госпитализацию, восстановительное лечение, обследование, консультацию (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 43 Тогда
		ТипыУзлов.Добавить("ДУЛ");
		ТипыУзлов.Добавить("СведенияОСтраховомПолисеОМС");
		ТипыУзлов.Добавить("УИДПациента");
		ТипыУзлов.Добавить("МедицинскаяОрганизация");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("НомерМедицинскойКарты");
		ТипыУзлов.Добавить("ДатаОкончанияСлучая");
		ТипыУзлов.Добавить("ДатаСлучаяДваЗначения");
		ТипыУзлов.Добавить("АдресЛицаПридавшегоЮрСилу");
		ТипыУзлов.Добавить("Отчество");
		ТипыУзлов.Добавить("КонтактыОрганизацииВладельца");
		
	// Медицинская справка (врачебное профессионально-консультативное заключение) (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 50 Тогда
		ТипыУзлов.Добавить("ЮрАдресПациентаФИАС");
		ТипыУзлов.Добавить("УИДПациента");
		ТипыУзлов.Добавить("ФактАдресПациентаФИАС");
		ТипыУзлов.Добавить("МедицинскаяОрганизация");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("identityОГРНОрганизации");
		ТипыУзлов.Добавить("identityОГРНОрганизацииАвтора");
		ТипыУзлов.Добавить("identityОГРНОрганизацииЛицаПридавшегоЮрСилу");
		ТипыУзлов.Добавить("ДатаСлучаяОдноЗначения");
		ТипыУзлов.Добавить("АдресПоФИАС");
		ТипыУзлов.Добавить("Отчество");
		
	// ФОРМАТ 2
	// Медицинское заключение об отсутствии медицинских противопоказаний к владению оружием (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 63 Тогда
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Медицинское заключение об отсутствии в организме человека наркотических средств, психотропных веществ и их метаболитов (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 64 Тогда
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Справка об отсутствии контактов с инфекционными больными (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 80 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		//ТипыУзлов.Добавить("Исполнитель");
		
	// Справка об отсутствии контактов с инфекционными больными. Справка о временной нетрудоспособности студента, учащегося техникума, профессионально-технического училища, о болезни, карантине и прочих причинах отсутствия ребенка, посещающего школу, детское дошкольное учреждение (Редакция 2)
	ИначеЕсли ВидРЭМД = 81 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		//ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Медицинское заключение о принадлежности несовершеннолетнего к медицинской группе для занятий физической культурой (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 82
		// Медицинское заключение об отсутствии противопоказаний к занятию определенными видами спорта (CDA) Редакция 2
		Или ВидРЭМД = 83
		// Медицинская справка в бассейн (CDA) Редакция 2
		Или ВидРЭМД = 84
	Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		//ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Протокол консультации в рамках диспансерного наблюдения (CDA) Редакция 4
	ИначеЕсли ВидРЭМД = 85 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		//ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Направление к месту лечения для получения медицинской помощи (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 86 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		//ТипыУзлов.Добавить("Исполнитель");
		
	// Медицинская справка о состоянии здоровья ребенка, отъезжающего в организацию отдыха детей и их оздоровления (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 87 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		//ТипыУзлов.Добавить("Исполнитель");
		
	// Медицинская справка (для выезжающего за границу) (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 88 Тогда
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("СНИЛСИсполнителя");
		ТипыУзлов.Добавить("СНИЛСЧленаМедкомиссии");
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		ТипыУзлов.Добавить("ОрганизацияИсполнителя");
		ТипыУзлов.Добавить("ОрганизацияЧленаМедкомиссии");
		ТипыУзлов.Добавить("АдресИсполнителя");
		ТипыУзлов.Добавить("АдресЧленаМедкомиссии");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Эпикриз по законченному случаю амбулаторный (CDA) Редакция 4
	ИначеЕсли ВидРЭМД = 92 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Выписка из протокола врачебной комиссии (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 99 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("СНИЛСИсполнителя");
		ТипыУзлов.Добавить("СНИЛСЧленаМедкомиссии");
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		ТипыУзлов.Добавить("ОрганизацияИсполнителя");
		ТипыУзлов.Добавить("ОрганизацияЧленаМедкомиссии");
		ТипыУзлов.Добавить("АдресИсполнителя");
		ТипыУзлов.Добавить("АдресЧленаМедкомиссии");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Справка об оплате медицинских услуг для предоставления в налоговые органы Российской Федерации (Редакция 1)
	ИначеЕсли ВидРЭМД = 100 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		//ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("ИННОрганизации");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Справка об отказе в направлении на медико-социальную экспертизу (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 102 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("СНИЛСИсполнителя");
		ТипыУзлов.Добавить("СНИЛСЧленаМедкомиссии");
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		ТипыУзлов.Добавить("ОрганизацияИсполнителя");
		ТипыУзлов.Добавить("ОрганизацияЧленаМедкомиссии");
		ТипыУзлов.Добавить("АдресИсполнителя");
		ТипыУзлов.Добавить("АдресЧленаМедкомиссии");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) (Редакция 1) 
	ИначеЕсли ВидРЭМД = 103 Тогда
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("СНИЛСИсполнителя");
		ТипыУзлов.Добавить("СНИЛСЧленаМедкомиссии");
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		ТипыУзлов.Добавить("ОрганизацияИсполнителя");
		ТипыУзлов.Добавить("ОрганизацияЧленаМедкомиссии");
		ТипыУзлов.Добавить("АдресИсполнителя");
		ТипыУзлов.Добавить("АдресЧленаМедкомиссии");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Уведомление о выявлении противопоказаний или аннулировании медицинских заключений к владению оружием (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 116 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Протокол консультации (CDA) Редакция 4
	ИначеЕсли ВидРЭМД = 119 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("СведенияОНаправлении");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("СНИЛСИсполнителя");
		ТипыУзлов.Добавить("СНИЛСЧленаМедкомиссии");
		ТипыУзлов.Добавить("ОрганизацияИсполнителя");
		ТипыУзлов.Добавить("ОрганизацияЧленаМедкомиссии");
		ТипыУзлов.Добавить("АдресИсполнителя");
		ТипыУзлов.Добавить("АдресЧленаМедкомиссии");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Направление на медико-социальную экспертизу (CDA) Редакция 6
	ИначеЕсли ВидРЭМД = 121 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("Опекун");
		ТипыУзлов.Добавить("СНИЛСИсполнителя");
		ТипыУзлов.Добавить("СНИЛСЧленаМедкомиссии");
		ТипыУзлов.Добавить("ОрганизацияИсполнителя");
		ТипыУзлов.Добавить("ОрганизацияЧленаМедкомиссии");
		ТипыУзлов.Добавить("АдресИсполнителя");
		ТипыУзлов.Добавить("АдресЧленаМедкомиссии");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Сведения о результатах диспансеризации или профилактического медицинского осмотра (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 122 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("СНИЛСИсполнителя");
		ТипыУзлов.Добавить("СНИЛСЧленаМедкомиссии");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("ВидМестаЖительстваФактАдресПациента");
		ТипыУзлов.Добавить("ОрганизацияИсполнителя");
		ТипыУзлов.Добавить("ОрганизацияЧленаМедкомиссии");
		ТипыУзлов.Добавить("АдресИсполнителя");
		ТипыУзлов.Добавить("АдресЧленаМедкомиссии");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Эпикриз по результатам диспансеризации / профилактического медицинского осмотра (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 129 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("ВидМестаЖительстваЮрАдресПациента");
		ТипыУзлов.Добавить("ВидМестаЖительстваФактАдресПациента");
		ТипыУзлов.Добавить("Опекун");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОНаправлении"); 
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("СНИЛСИсполнителя");
		ТипыУзлов.Добавить("СНИЛСЧленаМедкомиссии");
		ТипыУзлов.Добавить("ОрганизацияИсполнителя");
		ТипыУзлов.Добавить("ОрганизацияЧленаМедкомиссии");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("АдресИсполнителя");
		ТипыУзлов.Добавить("АдресЧленаМедкомиссии");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Льготный рецепт на лекарственный препарат, изделие медицинского назначения и специализированный продукт лечебного питания (CDA) Редакция 4
	ИначеЕсли ВидРЭМД = 141 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("ОГРНИП");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("ОднаДатаСобытия");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	//// Эпикриз в стационаре выписной (CDA) Редакция 5
	//ИначеЕсли ВидРЭМД = 147 Тогда
	//	ТипыУзлов.Добавить("ПочтовыйИндекс");
	//	ТипыУзлов.Добавить("Опекун");
	//	ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
	//	ТипыУзлов.Добавить("Контрагент");
	//	ТипыУзлов.Добавить("СведенияОНаправлении");
	//	ТипыУзлов.Добавить("ИдентификаторНаправленияРЭМД");
	//	ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
	//	ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
	//	ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
	//	ТипыУзлов.Добавить("ИдентификаторПодразделения");
		
	// Рецепт на лекарственный препарат (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 148 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("ОГРНИП");
		ТипыУзлов.Добавить("ОднаДатаСобытия");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Выписка из протокола решения врачебной комиссии (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 158 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		
	// Протокол инструментального исследования (СDA) Редакция 4
	ИначеЕсли ВидРЭМД = 174 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОНаправлении");
		ТипыУзлов.Добавить("ИдентификаторНаправленияРЭМД");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("СНИЛСИсполнителя");
		ТипыУзлов.Добавить("СНИЛСЧленаМедкомиссии");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("ОрганизацияИсполнителя");
		ТипыУзлов.Добавить("ОрганизацияЧленаМедкомиссии");
		ТипыУзлов.Добавить("АдресИсполнителя");
		ТипыУзлов.Добавить("АдресЧленаМедкомиссии");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Протокол лабораторного исследования (CDA) Редакция 5
	ИначеЕсли ВидРЭМД = 186 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("Опекун");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОНаправлении");
		ТипыУзлов.Добавить("ИдентификаторНаправленияРЭМД");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("ОпекунДатаРождения");
		ТипыУзлов.Добавить("ОднаДатаСобытия");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Протокол оперативного вмешательства (операции) (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 189 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("Опекун");
		ТипыУзлов.Добавить("ОГРНИП");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОНаправлении");
		ТипыУзлов.Добавить("ИдентификаторНаправленияРЭМД");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		
	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 194 Тогда
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОНаправлении");
		ТипыУзлов.Добавить("ИдентификаторНаправленияРЭМД");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Медицинская справка (врачебное профессионально-консультативное заключение) (CDA) Редакция 3
	ИначеЕсли ВидРЭМД = 196 Тогда
		ТипыУзлов.Добавить("ВидДокументаВРЭМД");
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		
	// Первичный осмотр врачом приемного отделения (дежурным врачом или лечащим врачом) (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 198 Тогда
		ТипыУзлов.Добавить("ВидДокументаВРЭМД");
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("ВидМестаЖительстваЮрАдресПациента");
		ТипыУзлов.Добавить("ВидМестаЖительстваФактАдресПациента");
		ТипыУзлов.Добавить("Опекун");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("ОГРНИП");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Медицинское заключение (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 204 Тогда
		ТипыУзлов.Добавить("ВидДокументаВРЭМД");
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("Опекун");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		ТипыУзлов.Добавить("СНИЛСИсполнителя");
		ТипыУзлов.Добавить("СНИЛСЧленаМедкомиссии");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		
	// Протокол консультации (CDA) Редакция 5
	ИначеЕсли ВидРЭМД = 227 Тогда
		ТипыУзлов.Добавить("ВидДокументаВРЭМД");
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("Опекун");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОНаправлении");
		ТипыУзлов.Добавить("ИдентификаторНаправленияРЭМД");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("ОрганизацияИсполнителя");
		ТипыУзлов.Добавить("ОрганизацияЧленаМедкомиссии");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		
	// Медицинское заключение по результатам медицинского осмотра работника для предоставления в подсистему ЭЛМК (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 230 Тогда
		ТипыУзлов.Добавить("ВидДокументаВРЭМД");
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("НаименованиеСтруктурногоПодразделения");
		ТипыУзлов.Добавить("АдресСтруктурногоПодразделения");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		
	// Протокол трансфузии (CDA) Редакция 5
	ИначеЕсли ВидРЭМД = 246 Тогда
		ТипыУзлов.Добавить("ВидДокументаВРЭМД");
		ТипыУзлов.Добавить("ПочтовыйИндекс");
		ТипыУзлов.Добавить("ИдентификаторПодразделенияВСекцииПациента");
		ТипыУзлов.Добавить("ОГРНИП");
		ТипыУзлов.Добавить("НаименованиеСтруктурногоПодразделения");
		ТипыУзлов.Добавить("ИдентификаторПодразделения");
		ТипыУзлов.Добавить("ЛицоПридавшееЮрСилу");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("Контрагент");
		ТипыУзлов.Добавить("СведенияОДокументируемомСобытии");
		ТипыУзлов.Добавить("Исполнитель");
		ТипыУзлов.Добавить("СведенияОСлучаеОказанияМедПомощи");
		
	КонецЕсли;
	
	Возврат ТипыУзлов.Найти(ТипУзла) <> Неопределено;
	
КонецФункции

// Значение по умолчанию = Ложь
Функция Обязательное(ВидРЭМД, ТипУзла)
	
	ТипыУзлов = Новый Массив;
	
	// ФОРМАТ 1
	// Медицинская справка о допуске к управлению транспортными средствами (CDA) Редакция 1
	Если ВидРЭМД = 4 Тогда
		ТипыУзлов.Добавить("ФактАдресПациента");
		ТипыУзлов.Добавить("ЛицензияМедДеятельности");
		
	// Протокол инструментального исследования (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 15 Тогда
		ТипыУзлов.Добавить("ФактАдресПациента");
		
	// Протокол консультации (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 16 Тогда
		ТипыУзлов.Добавить("ФактАдресПациента");
		
	// Протокол лабораторного исследования (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 17 Тогда
		ТипыУзлов.Добавить("ФактАдресПациента");
		
	// Протокол телемедицинской консультации (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 40 Тогда
		ТипыУзлов.Добавить("АдресЛицаПридавшегоЮрСилу");
		
	// Направление на госпитализацию, восстановительное лечение, обследование, консультацию (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 43 Тогда
		ТипыУзлов.Добавить("СведенияОСтраховомПолисеОМС");
		
	// Медицинская справка (врачебное профессионально-консультативное заключение) (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 50 Тогда
		ТипыУзлов.Добавить("АдресОрганизацииЛицаПридавшегоЮрСилу");
		ТипыУзлов.Добавить("МедицинскаяОрганизацияАвтора");
		
	// ФОРМАТ 2
	// Медицинское заключение об отсутствии медицинских противопоказаний к владению оружием (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 63 Тогда
		ТипыУзлов.Добавить("АдресОрганизации");
		ТипыУзлов.Добавить("ЛицензияМедДеятельности");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("ЮрАдресПациента");
		
	// Медицинское заключение об отсутствии в организме человека наркотических средств, психотропных веществ и их метаболитов (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 64 Тогда
		ТипыУзлов.Добавить("ЛицензияМедДеятельности");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("ЮрАдресПациента");
		
	// Справка об отсутствии контактов с инфекционными больными. (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 80 Тогда
		ТипыУзлов.Добавить("ФактАдресПациента");
		ТипыУзлов.Добавить("АдресОрганизации");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		
	// Справка о временной нетрудоспособности студента, учащегося техникума, профессионально-технического училища, о болезни, карантине и прочих причинах отсутствия ребенка, посещающего школу, детское дошкольное учреждение (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 81 Тогда
		ТипыУзлов.Добавить("ФактАдресПациента");
		ТипыУзлов.Добавить("АдресОрганизации");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("НомерМедицинскойКарты");
		ТипыУзлов.Добавить("ТипМедицинскойКарты");
		ТипыУзлов.Добавить("ВидМедицинскойКарты");
		
	// Медицинское заключение о принадлежности несовершеннолетнего к медицинской группе для занятий физической культурой (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 82 Тогда
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		
	// Медицинское заключение об отсутствии противопоказаний к занятию определенными видами спорта (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 83 Тогда
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		
	// Медицинская справка в бассейн (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 84 Тогда
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		
	// Направление на консультацию и во вспомогательные кабинеты (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 85 Тогда
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("ОКПО");
		
	// Направление к месту лечения для получения медицинской помощи (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 86 Тогда
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		
	// Медицинская справка о состоянии здоровья ребенка, отъезжающего в организацию отдыха детей и их оздоровления (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 87 Тогда
		ТипыУзлов.Добавить("ЮрАдресПациента");
		ТипыУзлов.Добавить("АдресОрганизации");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("ОКПО");
		
	// Медицинская справка (для выезжающего за границу) (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 88 Тогда
		ТипыУзлов.Добавить("АдресОрганизации");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		
	//Эпикриз по законченному случаю амбулаторный (CDA) Редакция 4
	ИначеЕсли ВидРЭМД = 92 Тогда
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		
	// Выписка из протокола врачебной комиссии (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 99 Тогда
		ТипыУзлов.Добавить("ЮрАдресПациента");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		
	// Справка об оплате медицинских услуг для предоставления в налоговые органы Российской Федерации (Редакция 1)
	ИначеЕсли ВидРЭМД = 100 Тогда
		ТипыУзлов.Добавить("ЛицензияМедДеятельности");
		ТипыУзлов.Добавить("АдресОрганизации");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		ТипыУзлов.Добавить("КонтактыЛицаПридавшегоЮрСилу");
		ТипыУзлов.Добавить("КонтактыОрганизацииЛицаПридавшегоЮрСилу");
		ТипыУзлов.Добавить("НомерМедицинскойКарты");
		ТипыУзлов.Добавить("ТипМедицинскойКарты");
		
	// Справка об отказе в направлении на медико-социальную экспертизу (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 102 Тогда
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		
	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) (Редакция 1)
	ИначеЕсли ВидРЭМД = 103 Тогда
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		
	// Уведомление о выявлении противопоказаний или аннулировании медицинских заключений к владению оружием (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 116 Тогда
		ТипыУзлов.Добавить("ЮрАдресПациента");
		ТипыУзлов.Добавить("ЛицензияМедДеятельности");
		ТипыУзлов.Добавить("АдресОрганизации");
		ТипыУзлов.Добавить("АдресОрганизацииАвтора");
		
	// Протокол консультации (CDA) Редакция 4
	ИначеЕсли ВидРЭМД = 119 Тогда
		ТипыУзлов.Добавить("ФактАдресПациента");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		
	// Направление на медико-социальную экспертизу (CDA) Редакция 6
	ИначеЕсли ВидРЭМД = 121 Тогда
		ТипыУзлов.Добавить("АдресОрганизации");
		
	// Сведения о результатах диспансеризации или профилактического медицинского осмотра (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 122 Тогда
		ТипыУзлов.Добавить("ФактАдресПациента");
		
	// Эпикриз по результатам диспансеризации / профилактического медицинского осмотра (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 129 Тогда
		ТипыУзлов.Добавить("ФактАдресПациента");
		ТипыУзлов.Добавить("АдресОрганизации");
		
	// Льготный рецепт на лекарственный препарат, изделие медицинского назначения и специализированный продукт лечебного питания (CDA) Редакция 4
	ИначеЕсли ВидРЭМД = 141 Тогда
		ТипыУзлов.Добавить("АдресОрганизации");
		ТипыУзлов.Добавить("НомерМедицинскойКарты");
		
	//// Эпикриз в стационаре выписной (CDA) Редакция 5
	//ИначеЕсли ВидРЭМД = 147 Тогда
	//	ТипыУзлов.Добавить("ЮрАдресПациента");
	//	ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		
	// Рецепт на лекарственный препарат (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 148 Тогда
		ТипыУзлов.Добавить("АдресОрганизации");
		
	// Выписка из протокола решения врачебной комиссии (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 158 Тогда
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		
	// Протокол инструментального исследования (СDA) Редакция 4
	ИначеЕсли ВидРЭМД = 174 Тогда
		
	// Протокол лабораторного исследования (CDA) Редакция 5
	ИначеЕсли ВидРЭМД = 186 Тогда
		ТипыУзлов.Добавить("АдресОрганизации");
		
	// Протокол оперативного вмешательства (операции) (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 189 Тогда
		ТипыУзлов.Добавить("АдресОрганизации");
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		ТипыУзлов.Добавить("НомерМедицинскойКарты");
		ТипыУзлов.Добавить("ТипМедицинскойКарты");
		ТипыУзлов.Добавить("ВидМедицинскойКарты");
		
	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 194 Тогда
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		
	// Медицинская справка (врачебное профессионально-консультативное заключение) (CDA) Редакция 3
	ИначеЕсли ВидРЭМД = 196 Тогда
		ТипыУзлов.Добавить("ЮрАдресПациента");
		ТипыУзлов.Добавить("СведенияОбИсточникеОплаты");
		
	// Первичный осмотр врачом приемного отделения (дежурным врачом или лечащим врачом) (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 198 Тогда
		ТипыУзлов.Добавить("АдресОрганизации");
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
	
	// Протокол консультации (CDA) Редакция 5
	ИначеЕсли ВидРЭМД = 227 Тогда
		ТипыУзлов.Добавить("ВидМедицинскойКарты");
		
	// Медицинское заключение (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 204 Тогда
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		ТипыУзлов.Добавить("ВидМедицинскойКарты");
		
	// Медицинское заключение по результатам медицинского осмотра работника для предоставления в подсистему ЭЛМК (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 230 Тогда
		ТипыУзлов.Добавить("АдресОрганизации");
		ТипыУзлов.Добавить("РольСотрудникаПриПодписанииМД");
		ТипыУзлов.Добавить("РольСотрудникаЧленаМедкомиссииПриПодписанииМД");
		ТипыУзлов.Добавить("НомерМедицинскойКарты");
		
	// Протокол трансфузии (CDA) Редакция 5
	ИначеЕсли ВидРЭМД = 246 Тогда
		ТипыУзлов.Добавить("НомерМедицинскойКарты");
		
	КонецЕсли;
	
	Возврат ТипыУзлов.Найти(ТипУзла) <> Неопределено;
	
КонецФункции

// Значение по умолчанию = Неопределено
Функция ПустоеЗначение(ВидРЭМД, ТипУзла)
	
	ТипыУзлов = Новый Соответствие;
	
	// ФОРМАТ 1
	// Медицинская справка о допуске к управлению транспортными средствами (CDA) Редакция 1
	Если ВидРЭМД = 4 Тогда
		ТипыУзлов.Вставить("СНИЛСПациента",									"NI");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизации",						"OTH");
		ТипыУзлов.Вставить("ОГРНОрганизации",								"NA");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизацииАвтора",				"OTH");
		ТипыУзлов.Вставить("АдресОрганизацииВладельца",						"NI");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизацииВладельца",			"OTH");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизацииЛицаПридавшегоЮрСилу",	"OTH");
		ТипыУзлов.Вставить("АдресОрганизацииАвтора",						"NI");
		
	// Протокол инструментального исследования (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 15 Тогда
		ТипыУзлов.Вставить("ДУЛ",											"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",								"NI");
		ТипыУзлов.Вставить("ДатаРожденияПациента",							"NI");
		ТипыУзлов.Вставить("КонтактыОрганизации",							"NI");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизации",						"OTH");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизацииАвтора",				"OTH");
		ТипыУзлов.Вставить("КонтактыОрганизацииАвтора",						"NI");
		ТипыУзлов.Вставить("ДолжностьЛицаПридавшегоЮрСилу",					"NI");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизацииЛицаПридавшегоЮрСилу",	"OTH");
		ТипыУзлов.Вставить("АдресОрганизацииАвтора",						"NI");
		ТипыУзлов.Вставить("ДолжностьОсновногоИсполнителя",					"NI");
		ТипыУзлов.Вставить("ДолжностьВспомогательногоИсполнителя",			"NI");
		ТипыУзлов.Вставить("АдресОрганизацииВладельца",						"NI");
		ТипыУзлов.Вставить("КонтактыСтраховойОрганизации",					"NI");
		ТипыУзлов.Вставить("АдресСтраховойОрганизации",						"NI");
		ТипыУзлов.Вставить("КонтактыОрганизацииНаправившегоЛица",			"NI");
		ТипыУзлов.Вставить("АдресОрганизацииНаправившегоЛица",				"NI");
		
	// Протокол консультации (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 16 Тогда
		ТипыУзлов.Вставить("ДУЛ",											"NI");
		ТипыУзлов.Вставить("ДатаРожденияПациента",							"NI");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизации",						"OTH");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизацииАвтора",				"OTH");
		ТипыУзлов.Вставить("КонтактыОрганизацииАвтора",						"NI");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизацииЛицаПридавшегоЮрСилу",	"OTH");
		ТипыУзлов.Вставить("АдресОрганизацииАвтора",						"NI");
		ТипыУзлов.Вставить("АдресОрганизацииВладельца",						"NI");
		ТипыУзлов.Вставить("ДолжностьЛицаПридавшегоЮрСилу",					"NI");
		ТипыУзлов.Вставить("ДолжностьОсновногоИсполнителя",					"NI");
		ТипыУзлов.Вставить("ДолжностьВспомогательногоИсполнителя",			"NI");
		
	// Протокол лабораторного исследования (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 17 Тогда
		ТипыУзлов.Вставить("ДУЛ",											"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",								"NI");
		ТипыУзлов.Вставить("ФактАдресПациента",								"NI");
		ТипыУзлов.Вставить("ДатаРожденияПациента",							"NI");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизации",						"OTH");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизацииАвтора",				"OTH");
		ТипыУзлов.Вставить("КонтактыОрганизацииАвтора",						"NI");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизацииЛицаПридавшегоЮрСилу",	"OTH");
		ТипыУзлов.Вставить("АдресОрганизацииАвтора",						"NI");
		ТипыУзлов.Вставить("АдресОрганизацииВладельца",						"NI");
		ТипыУзлов.Вставить("ДолжностьЛицаПридавшегоЮрСилу",					"NI");
		ТипыУзлов.Вставить("ДолжностьОсновногоИсполнителя",					"NI");
		ТипыУзлов.Вставить("ДолжностьВспомогательногоИсполнителя",			"NI");
		
	// Протокол телемедицинской консультации (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 40 Тогда
		ТипыУзлов.Вставить("ДУЛ",											"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",								"NI");
		ТипыУзлов.Вставить("ДатаРожденияПациента",							"NI");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизацииАвтора",				"OTH");
		ТипыУзлов.Вставить("КонтактыОрганизацииАвтора",						"NI");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизацииВладельца",			"OTH");
		ТипыУзлов.Вставить("АдресЛицаПридавшегоЮрСилу",						"NI");
		ТипыУзлов.Вставить("КонтактыЛицаПридавшегоЮрСилу",					"NI");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизацииЛицаПридавшегоЮрСилу",	"OTH");
		ТипыУзлов.Вставить("АдресОрганизацииАвтора",						"NI");
		ТипыУзлов.Вставить("АдресОрганизацииВладельца",						"NI");
		ТипыУзлов.Вставить("ДолжностьЛицаПридавшегоЮрСилу",					"NI");
		ТипыУзлов.Вставить("ДолжностьОсновногоИсполнителя",					"NI");
		ТипыУзлов.Вставить("ДолжностьВспомогательногоИсполнителя",			"NI");
		
	// Направление на госпитализацию, восстановительное лечение, обследование, консультацию (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 43 Тогда
		ТипыУзлов.Вставить("ДУЛ",											"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",								"NI");
		ТипыУзлов.Вставить("КонтактыОрганизации",							"NI");
		ТипыУзлов.Вставить("КонтактыОрганизацииАвтора",						"NI");
		ТипыУзлов.Вставить("КонтактыОрганизацииЛицаПридавшегоЮрСилу",		"NI");
		ТипыУзлов.Вставить("АдресОрганизацииАвтора",						"NI");
		ТипыУзлов.Вставить("АдресОрганизацииВладельца",						"NI");
		
	// Медицинская справка (врачебное профессионально-консультативное заключение) (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 50 Тогда
		ТипыУзлов.Вставить("ПолПациента",									"NI");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизации",						"OTH");
		ТипыУзлов.Вставить("СНИЛСАвтора",									"NI");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизацииАвтора",				"OTH");
		ТипыУзлов.Вставить("СНИЛСЛицаПридавшегоЮрСилу",						"NI");
		ТипыУзлов.Вставить("OIDМедицинскойОрганизацииЛицаПридавшегоЮрСилу",	"OTH");
		
	// ФОРМАТ 2
	// Медицинское заключение об отсутствии медицинских противопоказаний к владению оружием (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 63 Тогда
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("АдресОрганизацииЛицаПридавшегоЮрСилу",		"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("АдресОрганизацииВладельца",					"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Медицинское заключение об отсутствии в организме человека наркотических средств, психотропных веществ и их метаболитов (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 64 Тогда
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("АдресОрганизации",							"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Справка об отсутствии контактов с инфекционными больными. (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 80
		// Справка о временной нетрудоспособности студента, учащегося техникума, профессионально-технического училища, о болезни, карантине и прочих причинах отсутствия ребенка, посещающего школу, детское дошкольное учреждение (CDA) Редакция 2
		Или ВидРЭМД = 81
	Тогда
		ТипыУзлов.Вставить("ДУЛ",					"NI");
		ТипыУзлов.Вставить("ПолисОМС",				"NI");
		ТипыУзлов.Вставить("ПолПациента",			"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",	"NI");
		ТипыУзлов.Вставить("ИНН",					"NI");
		
	// Медицинское заключение о принадлежности несовершеннолетнего к медицинской группе для занятий физической культурой (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 82
		// Медицинское заключение об отсутствии противопоказаний к занятию определенными видами спорта (CDA) Редакция 2
		Или ВидРЭМД = 83
		// Медицинская справка в бассейн (CDA) Редакция 2
		Или ВидРЭМД = 84
	Тогда
		ТипыУзлов.Вставить("ДУЛ",					"NI");
		ТипыУзлов.Вставить("ПолисОМС",				"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",		"NI");
		ТипыУзлов.Вставить("ПолПациента",			"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",	"NI");
		ТипыУзлов.Вставить("ДатаРожденияПациента",	"NI");
		ТипыУзлов.Вставить("ИНН",					"NI");
		
	// Направление на консультацию и во вспомогательные кабинеты (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 85 Тогда
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("ДатаРожденияПациента",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Направление к месту лечения для получения медицинской помощи (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 86 Тогда
		ТипыУзлов.Вставить("ЮрАдресПациента",		"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",	"NI");
		ТипыУзлов.Вставить("ИНН",					"NI");
		
	// Медицинская справка о состоянии здоровья ребенка, отъезжающего в организацию отдыха детей и их оздоровления (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 87 Тогда
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("КонтактыПациента",							"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Медицинская справка (для выезжающего за границу) (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 88 Тогда
		ТипыУзлов.Вставить("ДУЛ",					"NI");
		ТипыУзлов.Вставить("ПолисОМС",				"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",		"NI");
		ТипыУзлов.Вставить("ПолПациента",			"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",	"NI");
		ТипыУзлов.Вставить("СерияПолисаОМС",		"NI"); // Вынужденная мера, ошибка в схематроне на стороне ЕГИСЗ
		ТипыУзлов.Вставить("ИНН",					"NI");
		
	// Эпикриз по законченному случаю амбулаторный (CDA) Редакция 4
	ИначеЕсли ВидРЭМД = 92 Тогда
		ТипыУзлов.Вставить("ДУЛ",					"NI");
		ТипыУзлов.Вставить("ПолисОМС",				"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",		"NI");
		ТипыУзлов.Вставить("КонтактыПациента",		"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",	"NI");
		ТипыУзлов.Вставить("АдресОрганизации",		"NI");
		ТипыУзлов.Вставить("ИНН",					"NI");
		
	// Выписка из протокола врачебной комиссии (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 99 Тогда
		ТипыУзлов.Вставить("ПолисОМС",					"NI");
		ТипыУзлов.Вставить("ПолПациента",				"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",		"NI");
		ТипыУзлов.Вставить("МедицинскаяОрганизация",	"NI");
		ТипыУзлов.Вставить("ИНН",						"NI");
		
	// Справка об оплате медицинских услуг для предоставления в налоговые органы Российской Федерации (Редакция 1)
	ИначеЕсли ВидРЭМД = 100 Тогда
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("ДатаРожденияПациента",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("УИДЛицаПридавшегоЮрСилу",					"NI");
		ТипыУзлов.Вставить("СНИЛСЛицаПридавшегоЮрСилу",					"NI");
		ТипыУзлов.Вставить("ДолжностьЛицаПридавшегоЮрСилу",				"NI");
		ТипыУзлов.Вставить("УИДАвтора",									"NI");
		ТипыУзлов.Вставить("СНИЛСАвтора",								"NI");
		ТипыУзлов.Вставить("ДолжностьАвтора",							"NI");
		ТипыУзлов.Вставить("КонтактыАвтора",							"NI");
		ТипыУзлов.Вставить("КонтактыЛицаПридавшегоЮрСилу",				"NI");
		
	// Справка об отказе в направлении на медико-социальную экспертизу (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 102 Тогда
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		//ТипыУзлов.Вставить("АдресОрганизации",							"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) (Редакция 1)
	ИначеЕсли ВидРЭМД = 103 Тогда
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Уведомление о выявлении противопоказаний или аннулировании медицинских заключений к владению оружием (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 116 Тогда
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		
	// Протокол консультации (CDA) Редакция 4
	ИначеЕсли ВидРЭМД = 119 Тогда
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("НомерМедицинскойКарты",						"NI");
		ТипыУзлов.Вставить("ТипМедицинскойКарты",						"NI");
		ТипыУзлов.Вставить("ВидМедицинскойКарты",						"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Направление на медико-социальную экспертизу (CDA) Редакция 6
	ИначеЕсли ВидРЭМД = 121 Тогда
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("КонтактыПациента",							"NI");
		//ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("КонтактыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("КонтактыОрганизацииАвтора",					"NI");
		ТипыУзлов.Вставить("АдресОрганизацииАвтора",					"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("АдресОрганизацииЛицаПридавшегоЮрСилу",		"NI");
		ТипыУзлов.Вставить("КонтактыОрганизацииИсполнителя",			"NI");
		ТипыУзлов.Вставить("АдресОрганизацииИсполнителя",				"NI");
		ТипыУзлов.Вставить("КонтактыОрганизацииЧленаМедкомиссии",		"NI");
		ТипыУзлов.Вставить("АдресОрганизацииЧленаМедкомиссии",			"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Сведения о результатах диспансеризации или профилактического медицинского осмотра (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 122 Тогда

		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ТипМедицинскойКарты",						"NI");
		ТипыУзлов.Вставить("ВидМедицинскойКарты",						"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Эпикриз по результатам диспансеризации / профилактического медицинского осмотра (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 129 Тогда
		ТипыУзлов.Вставить("СНИЛСПациента",								"NI");
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("ФормаОказанияМедПомощи",					"NI");
		ТипыУзлов.Вставить("ВидМедицинскойПомощи",						"NI");
		ТипыУзлов.Вставить("УсловияОказанияМедицинскойПомощи",			"NI");
		ТипыУзлов.Вставить("НомерМедицинскойКарты",						"NI");
		ТипыУзлов.Вставить("ТипМедицинскойКарты",						"NI");
		ТипыУзлов.Вставить("ВидМедицинскойКарты",						"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Льготный рецепт на лекарственный препарат, изделие медицинского назначения и специализированный продукт лечебного питания (CDA) Редакция 4
	ИначеЕсли ВидРЭМД = 141 Тогда
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("ОГРНИП",									"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		
	//// Эпикриз в стационаре выписной (CDA) Редакция 5
	//ИначеЕсли ВидРЭМД = 147 Тогда
	//	ТипыУзлов.Вставить("ДУЛ",										"NI");
	//	ТипыУзлов.Вставить("ПолисОМС",									"NI");
	//	ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
	//	ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
	//	ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
	//	ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
	//	ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
	//	ТипыУзлов.Вставить("ИдентификаторНаправления",					"NI");
	//	ТипыУзлов.Вставить("ИдентификаторНаправленияРЭМД",				"NI");
	//	ТипыУзлов.Вставить("ВидНаправления",							"NI");
	//	ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Рецепт на лекарственный препарат (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 148 Тогда
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ОГРНИП",									"NI");
		ТипыУзлов.Вставить("КонтактыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Выписка из протокола решения врачебной комиссии (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 158 Тогда
		ТипыУзлов.Вставить("ДатаДокументаДляОбщихСекций",				"NA");
		ТипыУзлов.Вставить("СНИЛСПациента",								"NI");
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("МедицинскаяОрганизация",					"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
		
	// Протокол инструментального исследования (СDA) Редакция 4
	ИначеЕсли ВидРЭМД = 174 Тогда
		ТипыУзлов.Вставить("СНИЛСПациента",								"NI");
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("ДатаРожденияПациента",						"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("ФормаОказанияМедПомощи",					"NI");
		ТипыУзлов.Вставить("УсловияОказанияМедицинскойПомощи",			"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Протокол лабораторного исследования (CDA) Редакция 5
	ИначеЕсли ВидРЭМД = 186 Тогда
		ТипыУзлов.Вставить("СНИЛСПациента",								"NI");
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("ДатаРожденияПациента",						"NI");
		ТипыУзлов.Вставить("ОпекунДатаРождения",						"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("ФормаОказанияМедПомощи",					"NI");
		ТипыУзлов.Вставить("ВидМедицинскойПомощи",						"NI");
		ТипыУзлов.Вставить("УсловияОказанияМедицинскойПомощи",			"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Протокол оперативного вмешательства (операции) (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 189 Тогда
		ТипыУзлов.Вставить("СНИЛСПациента",								"NI");
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("ДатаРожденияПациента",						"NI");
		ТипыУзлов.Вставить("ОГРНИП",									"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		
	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 194 Тогда
		ТипыУзлов.Вставить("СНИЛСПациента",								"NI");
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Медицинская справка (врачебное профессионально-консультативное заключение) (CDA) Редакция 3
	ИначеЕсли ВидРЭМД = 196 Тогда
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("МедицинскаяОрганизация",					"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		ТипыУзлов.Вставить("ОКПО",										"NI");
		
	// Первичный осмотр врачом приемного отделения (дежурным врачом или лечащим врачом) (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 198 Тогда
		ТипыУзлов.Вставить("СНИЛСПациента",								"NI");
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("ДатаРожденияПациента",						"NI");
		ТипыУзлов.Вставить("ОГРНИП",									"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("НомерМедицинскойКарты",						"NI");
		ТипыУзлов.Вставить("ТипМедицинскойКарты",						"NI");
		
	// Медицинское заключение (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 204 Тогда
		ТипыУзлов.Вставить("СНИЛСПациента",								"NI");
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("ДатаРожденияПациента",						"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		
	// Протокол консультации (CDA) Редакция 5
	ИначеЕсли ВидРЭМД = 227 Тогда
		ТипыУзлов.Вставить("СНИЛСПациента",								"NI");
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("ДатаРожденияПациента",						"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Медицинское заключение по результатам медицинского осмотра работника для предоставления в подсистему ЭЛМК (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 230 Тогда
		ТипыУзлов.Вставить("СНИЛСПациента",								"NI");
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ИНН",										"NI");
		
	// Протокол трансфузии (CDA) Редакция 5
	ИначеЕсли ВидРЭМД = 246 Тогда
		ТипыУзлов.Вставить("СНИЛСПациента",								"NI");
		ТипыУзлов.Вставить("ДУЛ",										"NI");
		ТипыУзлов.Вставить("ПолисОМС",									"NI");
		ТипыУзлов.Вставить("ЮрАдресПациента",							"NI");
		ТипыУзлов.Вставить("ПолПациента",								"NI");
		ТипыУзлов.Вставить("ДатаРожденияПациента",						"NI");
		ТипыУзлов.Вставить("РеквизитыОрганизации",						"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаАвтором",				"NI");
		ТипыУзлов.Вставить("ДатаПодписиДокументаЛицаПридавшегоЮрСилу",	"NI");
		ТипыУзлов.Вставить("ФактНаличияПодписи",						"NI");
		ТипыУзлов.Вставить("ТипМедицинскойКарты",						"NI");
		
	КонецЕсли;
	
	Возврат ТипыУзлов.Получить(ТипУзла);
	
КонецФункции

// Значение по умолчанию = Ложь
Функция Множественное(ВидРЭМД, ТипУзла)
	
	ТипыУзлов = Новый Массив;
	
	// ФОРМАТ 2
	// Медицинское заключение об отсутствии медицинских противопоказаний к владению оружием (CDA) Редакция 1
	Если ВидРЭМД = 63 Тогда
		
	// Медицинское заключение об отсутствии в организме человека наркотических средств, психотропных веществ и их метаболитов (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 64 Тогда
		
	// Справка об отсутствии контактов с инфекционными больными (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 80 Тогда
		
	// Справка об отсутствии контактов с инфекционными больными. Справка о временной нетрудоспособности студента, учащегося техникума, профессионально-технического училища, о болезни, карантине и прочих причинах отсутствия ребенка, посещающего школу, детское дошкольное учреждение (Редакция 2)
	ИначеЕсли ВидРЭМД = 81 Тогда
		
	// Медицинское заключение о принадлежности несовершеннолетнего к медицинской группе для занятий физической культурой (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 82
		// Медицинское заключение об отсутствии противопоказаний к занятию определенными видами спорта (CDA) Редакция 2
		Или ВидРЭМД = 83
		// Медицинская справка в бассейн (CDA) Редакция 2
		Или ВидРЭМД = 84
	Тогда
		
	// Протокол консультации в рамках диспансерного наблюдения (CDA) Редакция 4
	ИначеЕсли ВидРЭМД = 85 Тогда
		
	// Направление к месту лечения для получения медицинской помощи (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 86 Тогда
		
	// Медицинская справка о состоянии здоровья ребенка, отъезжающего в организацию отдыха детей и их оздоровления (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 87 Тогда
		
	// Медицинская справка (для выезжающего за границу) (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 88 Тогда
		ТипыУзлов.Добавить("КонтактыИсполнителя");
		ТипыУзлов.Добавить("КонтактыЧленаМедкомиссии");
		
	// Эпикриз по законченному случаю амбулаторный (CDA) Редакция 4
	ИначеЕсли ВидРЭМД = 92 Тогда
		
	// Выписка из протокола врачебной комиссии (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 99 Тогда
		ТипыУзлов.Добавить("КонтактыИсполнителя");
		ТипыУзлов.Добавить("КонтактыЧленаМедкомиссии");
		
	// Справка об оплате медицинских услуг для предоставления в налоговые органы Российской Федерации (Редакция 1)
	ИначеЕсли ВидРЭМД = 100 Тогда
		
	// Справка об отказе в направлении на медико-социальную экспертизу (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 102 Тогда
		ТипыУзлов.Добавить("КонтактыИсполнителя");
		ТипыУзлов.Добавить("КонтактыЧленаМедкомиссии");
		
	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) (Редакция 1) 
	ИначеЕсли ВидРЭМД = 103 Тогда
		ТипыУзлов.Добавить("КонтактыИсполнителя");
		ТипыУзлов.Добавить("КонтактыЧленаМедкомиссии");
		
	// Уведомление о выявлении противопоказаний или аннулировании медицинских заключений к владению оружием (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 116 Тогда
		
	// Протокол консультации (CDA) Редакция 4
	ИначеЕсли ВидРЭМД = 119 Тогда
		ТипыУзлов.Добавить("КонтактыОрганизацииВладельца");
		ТипыУзлов.Добавить("КонтактыИсполнителя");
		ТипыУзлов.Добавить("КонтактыЧленаМедкомиссии");
		
	// Направление на медико-социальную экспертизу (CDA) Редакция 6
	ИначеЕсли ВидРЭМД = 121 Тогда
		ТипыУзлов.Добавить("КонтактыИсполнителя");
		ТипыУзлов.Добавить("КонтактыЧленаМедкомиссии");
		
	// Эпикриз по результатам диспансеризации / профилактического медицинского осмотра (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 129 Тогда
		ТипыУзлов.Добавить("КонтактыИсполнителя");
		ТипыУзлов.Добавить("КонтактыЧленаМедкомиссии");
		
	//// Эпикриз в стационаре выписной (CDA) Редакция 5
	//ИначеЕсли ВидРЭМД = 147 Тогда
		
	// Протокол инструментального исследования (СDA) Редакция 4
	ИначеЕсли ВидРЭМД = 174 Тогда
		ТипыУзлов.Добавить("КонтактыИсполнителя");
		ТипыУзлов.Добавить("КонтактыЧленаМедкомиссии");
		
	// Протокол лабораторного исследования (CDA) Редакция 5
	ИначеЕсли ВидРЭМД = 186 Тогда
		
	// Медицинское заключение по результатам предварительного (периодического) медицинского осмотра (обследования) (CDA) Редакция 2
	ИначеЕсли ВидРЭМД = 194 Тогда
		
	// Медицинское заключение (CDA) Редакция 1
	ИначеЕсли ВидРЭМД = 204 Тогда
		ТипыУзлов.Добавить("КонтактыИсполнителя");
		ТипыУзлов.Добавить("КонтактыЧленаМедкомиссии");
		
	// Протокол консультации (CDA) Редакция 5
	ИначеЕсли ВидРЭМД = 227 Тогда
		ТипыУзлов.Добавить("КонтактыИсполнителя");
		ТипыУзлов.Добавить("КонтактыЧленаМедкомиссии");
		
	// Протокол трансфузии (CDA) Редакция 5
	ИначеЕсли ВидРЭМД = 246 Тогда
		ТипыУзлов.Добавить("КонтактыИсполнителя");
		ТипыУзлов.Добавить("КонтактыЧленаМедкомиссии");
		
	КонецЕсли;
	
	Возврат ТипыУзлов.Найти(ТипУзла) <> Неопределено;
	
КонецФункции

Функция НаименованиеПолучающейОрганизации()
	
	Возврат "Министерство здравоохранения Российской Федерации (ИЭМК)";
	
КонецФункции

Функция СинонимИННПоВидуОплаты(ТаблицаПараметров)
	
	СинонимИНН = "ИНН";
	
	ИсточникОплаты = ТаблицаПараметров.Найти("ИсточникОплаты");
	Если ИсточникОплаты <> Неопределено
		И ЗначениеЗаполнено(ИсточникОплаты.Значение)
	Тогда
		Если ИсточникОплаты.Значение.УИДЕГИСЗ = 6 Тогда
			СинонимИНН = "ИНН контрагента";
		ИначеЕсли ИсточникОплаты.Значение.УИДЕГИСЗ = 4 Тогда
			СинонимИНН = "ИНН пациента"
		КонецЕсли;
	КонецЕсли;
	
	Возврат СинонимИНН;
	
КонецФункции

Функция СинонимНомераДоговораПоВидуОплаты(ТаблицаПараметров)
	
	СинонимНомераДоговора = "Номер договора";
	
	ИсточникОплаты = ТаблицаПараметров.Найти("ИсточникОплаты");
	Если ИсточникОплаты <> Неопределено
		И ЗначениеЗаполнено(ИсточникОплаты.Значение)
	Тогда
		Если ИсточникОплаты.Значение.УИДЕГИСЗ = 6 Тогда
			СинонимНомераДоговора = "Номер соглашения страхования программы обслуживания";
		ИначеЕсли ИсточникОплаты.Значение.УИДЕГИСЗ = 4 Тогда
			СинонимНомераДоговора = "Номер договора с пациентом";
		ИначеЕсли ИсточникОплаты.Значение.УИДЕГИСЗ = 1 Тогда
			СинонимНомераДоговора = "Номер полиса ОМС";
		КонецЕсли;
	КонецЕсли;
	
	Возврат СинонимНомераДоговора;
	
КонецФункции

Функция СинонимДатыНачалаДоговораПоВидуОплаты(ТаблицаПараметров)
	
	СинонимДатыНачала = "Дата начала действия договора";
	
	ИсточникОплаты = ТаблицаПараметров.Найти("ИсточникОплаты");
	Если ИсточникОплаты <> Неопределено
		И ЗначениеЗаполнено(ИсточникОплаты.Значение)
	Тогда
		Если ИсточникОплаты.Значение.УИДЕГИСЗ = 6 Тогда
			СинонимДатыНачала = "Дата начала действия соглашения страхования программы обслуживания";
		ИначеЕсли ИсточникОплаты.Значение.УИДЕГИСЗ = 4 Тогда
			СинонимДатыНачала = "Дата начала действия договора с пациентом"
		КонецЕсли;
	КонецЕсли;
	
	Возврат СинонимДатыНачала;
	
КонецФункции

Функция СинонимИсполнителя(ВидРЭМД, Узел)
	
	Синонимы = Новый Соответствие;
	
	Если ВидРЭМД = 174
		Или ВидРЭМД = 186
	Тогда
		Синонимы.Вставить("УИДИсполнителя",			"Исполнитель");
		Синонимы.Вставить("СНИЛСИсполнителя",		"СНИЛС исполнителя");
		Синонимы.Вставить("ДолжностьИсполнителя",	"Должность минздрава в должности исполнителя");
		Синонимы.Вставить("ФамилияИсполнителя",		"Фамилия исполнителя");
		Синонимы.Вставить("ИмяИсполнителя",			"Имя исполнителя");
	Иначе
		Синонимы.Вставить("УИДИсполнителя",			"Председатель медкомиссии");
		Синонимы.Вставить("СНИЛСИсполнителя",		"СНИЛС председателя медкомиссии");
		Синонимы.Вставить("ДолжностьИсполнителя",	"Должность минздрава в должности председателя медкомиссии");
		Синонимы.Вставить("ФамилияИсполнителя",		"Фамилия председателя медкомиссии");
		Синонимы.Вставить("ИмяИсполнителя",			"Имя председателя медкомиссии");
	КонецЕсли;
	
	Возврат Синонимы.Получить(Узел);
	
КонецФункции

Функция СтационарнаяКарта(ТипМедицинскойКарты)
	
	Попытка
		Возврат ТипМедицинскойКарты.УИДЕГИСЗ = 2;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция ФактНаличияКонтактаСИнфекционнымиБольными(ИнфекционныйБольной, НаличиеКонтактаСИнфекционнымиБольными)
	
	Возврат ЗначениеЗаполнено(ИнфекционныйБольной) Или НаличиеКонтактаСИнфекционнымиБольными;
	
КонецФункции

Функция НеобходимоЗаполнитьВидМедицинскойКарты(ВидРЭМД, ТипМедицинскойКарты)
	
	Если ВидРЭМД = 189
		Или ВидРЭМД = 196
		Или ВидРЭМД = 204
		Или ВидРЭМД = 227
	Тогда
		Возврат ЗначениеЗаполнено(ТипМедицинскойКарты) И ТипМедицинскойКарты.УИДЕГИСЗ = 3;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// Особое условие для обработки узла со словом ДОЛЖЕН. Противопоставление НеобходимоЗаполнитьВидМедицинскойКарты
Функция НеЗаполнятьВидМедицинскойКарты(ВидРЭМД, ТипМедицинскойКарты)
	
	Если ВидРЭМД = 189 Тогда
		Возврат Не (ЗначениеЗаполнено(ТипМедицинскойКарты) И ТипМедицинскойКарты.УИДЕГИСЗ = 3);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЕстьУзелСоСтруктурнымПодразделением(ВидРЭМД, ИдентификаторПодразделения, ПодразделениеАвтора)
	
	Если ЗначениеЗаполнено(ПодразделениеАвтора)
		И ЗначениеЗаполнено(ПодразделениеАвтора.OIDСтруктурногоПодразделения)
		И ИнтеграцияЕГИСЗСервер.ПолучитьЗначениеАтрибутаЭлементаКлассификатора(ПодразделениеАвтора, "MO_OID") <> Неопределено
	Тогда
		Возврат ЭМДСодержитУзел(ВидРЭМД, ИдентификаторПодразделения);
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

Функция КонтактыОрганизацииФилиала(Филиал, ГруппирующееПоле = Неопределено)
	
	КонтактыОрганизацииФилиала = КонтактыОбъекта(Филиал.Организация, ГруппирующееПоле);
	Если КонтактыОрганизацииФилиала = Неопределено Тогда
		КонтактыОрганизацииФилиала = КонтактыОбъекта(Филиал, ГруппирующееПоле);
	КонецЕсли;
	
	Возврат КонтактыОрганизацииФилиала;
	
КонецФункции

Функция АдресОрганизацииФилиала(Филиал)
	
	АдресОрганизацииФилиала = АдресОрганизации(Филиал.Организация);
	Если АдресОрганизацииФилиала = Неопределено Тогда
		АдресОрганизацииФилиала = АдресОрганизации(Филиал);
	КонецЕсли;
	
	Возврат АдресОрганизацииФилиала;
	
КонецФункции

#КонецОбласти

Процедура ДобавитьУзелДляУдаления(УзлыДляУдаления, Узел)
	
	Если УзлыДляУдаления.Найти(Узел) = Неопределено Тогда
		УзлыДляУдаления.Добавить(Узел);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТекстовоеСодержаниеУзла(Узел, ТаблицаПараметров, СоответствиеВышестоящихLocalId, НезаполненныеПараметры = Неопределено, РодительскийУзел = Неопределено, УзлыДляУдаления = Неопределено, СтрокаГруппирующегоПоля = Неопределено)
	
	Результат = ПолучитьРезультат(Узел, Узел.ЗначениеУзла, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтрокаГруппирующегоПоля);
	Если ЗначениеЗаполнено(Результат) Тогда
		Узел.ЗначениеУзла = Результат;
	ИначеЕсли РодительскийУзел <> Неопределено
		И (СтрНайти(Узел.ЗначениеУзла, "$") > 0
			Или Лев(Узел.ЗначениеУзла,1) = "*"
			Или Лев(Узел.ЗначениеУзла,1) = "%")
	Тогда
		ОбработатьУзелБезЗаполненногоПараметра(Узел, РодительскийУзел, УзлыДляУдаления, ТаблицаПараметров, НезаполненныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Функция ОчиститьУзелОтАтрибутов(Узел)
	
	Для Каждого СлужебныйАтрибутТела Из ПолучитьСлужебныеАтрибутыТела() Цикл
		Узел.УдалитьАтрибут(СлужебныйАтрибутТела);
	КонецЦикла;
	
КонецФункции

Функция ПолучитьРезультат(Узел, Сущность, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтрокаГруппирующегоПоля = Неопределено, Знач ФорматнаяСтрока = Неопределено)
	
	Результат = Неопределено;
	Если СтрНайти(Сущность, "$") > 0 Тогда
		
		// Зарезервированный
		ЗарезервированноеСлово = СтрРазделить(Сущность, "$", Ложь)[0];
		ЗарезервированноеСлово = Прав(ЗарезервированноеСлово, СтрДлина(ЗарезервированноеСлово)-1);
		
		ПараметрЗарезервированноегоСлова = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", ЗарезервированноеСлово));
		Если ПараметрЗарезервированноегоСлова.Количество() = 0 Тогда
			Результат = Неопределено;
		Иначе
			ЗначениеПараметра = ПараметрЗарезервированноегоСлова[0].Значение;
			Результат = ОпределитьЧислоПоЗарезервированномуСловуОрганизация(Сущность, ЗначениеПараметра);
		КонецЕсли;
		
	ИначеЕсли Лев(Сущность,1) = "*" Тогда
		
		// Функция
		Результат = ВычислитьФункцию(Сущность, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтрокаГруппирующегоПоля);
		
	ИначеЕсли Лев(Сущность,1) = "%" Тогда
		
		// Значение
		ЗначениеПоLocalIdИзСтроки = ПолучитьЗначениеLocalIdИзСтроки(Сущность, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтрокаГруппирующегоПоля);
		
		Если Не ЗначениеЗаполнено(ФорматнаяСтрока) Тогда
			СформироватьФорматнуюСтрокуПоТипуУзла(ФорматнаяСтрока, Узел);
		КонецЕсли;
		
		Попытка
			Результат = Формат(ЗначениеПоLocalIdИзСтроки, ФорматнаяСтрока);
		Исключение
			Результат = Строка(ЗначениеПоLocalIdИзСтроки);
		КонецПопытки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВычислитьФункцию(Сущность, ТаблицаПараметров = Неопределено, СоответствиеВышестоящихLocalId = Неопределено, СтрокаГруппирующегоПоля = Неопределено)
	
	СтрокаФункции = Прав(Сущность, СтрДлина(Сущность)-1);
	
	ВычисляемыеПараметры = Новый Массив;
	ЗаполнитьВычисляемыеПараметры(СтрокаФункции, ВычисляемыеПараметры);
	
	ЗначенияВычисляемыхПараметров = Новый Массив;
	
	Для Инд = 1 - ВычисляемыеПараметры.Количество() По 0 Цикл
		ДанныеПараметра = ВычисляемыеПараметры[-Инд];
		ЗначениеИзСтроки = ПолучитьЗначениеLocalIdИзСтроки(ДанныеПараметра.СтрокаПараметра, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтрокаГруппирующегоПоля);
		НоваяСтрокаПараметра = СтрШаблон("ЗначенияВычисляемыхПараметров[%1]", ЗначенияВычисляемыхПараметров.Количество());
		ЗначенияВычисляемыхПараметров.Добавить(ЗначениеИзСтроки);
		СтрокаФункции = Лев(СтрокаФункции, ДанныеПараметра.Начало - 1) + НоваяСтрокаПараметра + Прав(СтрокаФункции, СтрДлина(СтрокаФункции) - ДанныеПараметра.Конец);
	КонецЦикла;
	
	Результат = Неопределено;
	Выполнить(СтрШаблон("Результат = %1", СтрокаФункции));
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьВычисляемыеПараметры(ИсходноеИмяФункции, ВычисляемыеПараметры)
	
	ГраницыСтрок = Новый Массив;
	ЗаполнитьГраницыСтрок(ИсходноеИмяФункции, ГраницыСтрок);
	
	НомерВхождения = 1;
	Пока Истина Цикл
		
		Позиция = СтрНайти(ИсходноеИмяФункции, "%",,,НомерВхождения);
		Если Позиция = 0 Тогда
			Прервать;
		Иначе
			НомерВхождения = НомерВхождения + 1;
		КонецЕсли;
		
		СимволВСтроке = Ложь;
		Для Каждого ГраницыСтроки Из ГраницыСтрок Цикл
			Если Позиция > ГраницыСтроки.Начало
				И Позиция < ГраницыСтроки.Конец
			Тогда
				СимволВСтроке = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если СимволВСтроке Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеСтрокиПараметра = ПолучитьДанныеСтрокиПараметра(ИсходноеИмяФункции, Позиция);
		Если ДанныеСтрокиПараметра <> Неопределено Тогда
			ВычисляемыеПараметры.Добавить(ДанныеСтрокиПараметра);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьГраницыСтрок(Знач ИсходноеИмяФункции, ГраницыСтрок)
	
	РазмерТекста = СтрДлина(ИсходноеИмяФункции);
	НачалоСтроки = Неопределено;
	
	Для Позиция = 1 По РазмерТекста Цикл
		Если КодСимвола(ИсходноеИмяФункции, Позиция) = КодСимвола("""") Тогда
			Если НачалоСтроки = Неопределено Тогда
				НачалоСтроки = Позиция;
			Иначе
				Если Позиция <> РазмерТекста И КодСимвола(ИсходноеИмяФункции, Позиция + 1) = КодСимвола("""") Тогда
					Позиция = Позиция + 1;
				Иначе
					ГраницыСтрок.Добавить(Новый Структура("Начало, Конец", НачалоСтроки, Позиция));
					НачалоСтроки = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НачалоСтроки <> Неопределено Тогда
		ГраницыСтрок.Добавить(Новый Структура("Начало, Конец", НачалоСтроки, РазмерТекста));
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеСтрокиПараметра(Знач ИсходноеИмяФункции, НачальнаяПозиция)
	
	КонечнаяПозиция = НачальнаяПозиция;
	ВключаяЦифры = Ложь; // Первый символ не может быть цифрой
	Для Позиция = НачальнаяПозиция + 1 По СтрДлина(ИсходноеИмяФункции) Цикл
		Если Не СимволНаименованияПараметра(КодСимвола(ИсходноеИмяФункции, Позиция), ВключаяЦифры) Тогда
			Прервать;
		КонецЕсли;
		КонечнаяПозиция = Позиция;
		ВключаяЦифры = Истина;
	КонецЦикла;
	
	Если КонечнаяПозиция <= НачальнаяПозиция Тогда
		Возврат Неопределено
	КонецЕсли;
	
	СтрокаПараметра = Сред(ИсходноеИмяФункции, НачальнаяПозиция, КонечнаяПозиция+1-НачальнаяПозиция);
	
	Возврат Новый Структура("СтрокаПараметра, Начало, Конец", СтрокаПараметра, НачальнаяПозиция, КонечнаяПозиция);
	
КонецФункции

Функция СимволНаименованияПараметра(КодСимвола, ВключаяЦифры = Истина) Экспорт
	
	Диапазоны = Новый Массив;
	Если ВключаяЦифры Тогда
		Диапазоны.Добавить(Новый Структура("Мин,Макс", 48, 57));	// цифры
	КонецЕсли;
	
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 65, 90));		// латиница большие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 97, 122));		// латиница маленькие
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1040, 1103));	// кириллица
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1025, 1025));	// символ "Ё"
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 1105, 1105));	// символ "ё"
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 95, 95));		// символ "_"
	Диапазоны.Добавить(Новый Структура("Мин,Макс", 46, 46));		// символ "."
	
	Для Каждого Диапазон Из Диапазоны Цикл
		Если КодСимвола >= Диапазон.Мин И КодСимвола <= Диапазон.Макс Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ОпределитьЧислоПоЗарезервированномуСловуОрганизация(ПараметрОрганизация, Организация)
	
	OIDОрганизации = СокрЛП(Организация.МедицинскаяОрганизация.OIDОрганизации);
	ИдентификацияОбъекта = ПолучитьИдентификациюОбъекта(СтрРазделить(ПараметрОрганизация, "$", Ложь)[1]);
	
	Возврат СтрШаблон("%1.100.1.1.%2", OIDОрганизации, ИдентификацияОбъекта);
	
КонецФункции

Функция ПолучитьИдентификациюОбъекта(Наименование)
	
	Назначения = Новый Соответствие;
	Назначения.Вставить("МедСправка",				3);
	Назначения.Вставить("Пациент",					10);
	Назначения.Вставить("Медпомощь",				15);
	Назначения.Вставить("ИсторияБолезни",			16);
	Назначения.Вставить("СтационарнаяПомощь",		16);
	Назначения.Вставить("АмбулаторнаяПомощь",		17);
	Назначения.Вставить("АмбулаторнаяКарта",		17);
	Назначения.Вставить("НаборВерсий",				50);
	Назначения.Вставить("ЛабораторноеИсследование",	51);
	Назначения.Вставить("ВнешнийДокумент",			51);
	Назначения.Вставить("СвязанныйДокумент",		51);
	Назначения.Вставить("ЭМД",						51);
	Назначения.Вставить("ВитальныйПараметр",		52);
	Назначения.Вставить("ВыполненнаяУслуга",		52);
	Назначения.Вставить("Осложнение",				52);
	Назначения.Вставить("Компонент",				52);
	Назначения.Вставить("Направление",				59);
	Назначения.Вставить("Штрихкод",					66);
	Назначения.Вставить("Оборудование",				67);
	Назначения.Вставить("Сотрудник",				70);
	Назначения.Вставить("Терапевт",					70);
	Назначения.Вставить("Хирург",					71);
	Назначения.Вставить("Невролог",					72);
	Назначения.Вставить("Оториноларинголог",		73);
	Назначения.Вставить("Офтальмолог",				74);
	Назначения.Вставить("Гинеколог",				75);
	Назначения.Вставить("Препарат",					93);
	
	Возврат Назначения.Получить(Наименование);
	
КонецФункции

Процедура ЗаполнитьАтрибутыУзлаКлассификатора(Узел, Ссылка, НезагруженныеКлассификаторы, ДанныеДляУзлаКлассификатора, ЗначенияПараметров = Неопределено)
	
	Если ЗначенияПараметров = Неопределено Тогда
		ЗначенияПараметров = ИнтеграцияЕГИСЗСервер.ПолучитьЗначенияПараметровЭлементаКлассификатора(Ссылка);
		
		КорректныйCodeSystem = ПолучитьКорректныйCodeSystemПоВидуДокумента(ДанныеДляУзлаКлассификатора);
		Если ЗначениеЗаполнено(КорректныйCodeSystem) Тогда
			ЗначенияПараметров.codesystem = КорректныйCodeSystem;
		КонецЕсли;
		
		// В некоторых СЭМДах фиксированные версии классификаторов, подменяем значения атрибутов
		АтрибутыФиксированнойВерсииКлассификатора = ПолучитьАтрибутыФиксированнойВерсииКлассификатора(Ссылка, ДанныеДляУзлаКлассификатора);
		Если АтрибутыФиксированнойВерсииКлассификатора <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ЗначенияПараметров, АтрибутыФиксированнойВерсииКлассификатора);
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого АтрибутУзла Из Узел.Атрибуты Цикл
		Если Лев(АтрибутУзла.ЗначениеУзла, 1) = "#" Тогда
			ЗначениеАтрибута = ЗначенияПараметров[НРег(СтрЗаменить(АтрибутУзла.ЗначениеУзла, "#", ""))];
			Если ЗначениеЗаполнено(ЗначениеАтрибута) Тогда
				Узел.УстановитьАтрибут(АтрибутУзла.ИмяУзла, Строка(ЗначениеАтрибута));
			Иначе
				ДобавитьНезагруженныйКлассификатор(НезагруженныеКлассификаторы, ЗначенияПараметров.codesystem);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьКорректныйCodeSystemПоВидуДокумента(ДанныеДляУзлаКлассификатора)
	
	Попытка
		СтруктураПоиска = Новый Структура("localid", ДанныеДляУзлаКлассификатора.localid);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	СтрокиCodeSystem = ДанныеДляУзлаКлассификатора.ДополнительныеДанные.КорректныеCodeSystem.НайтиСтроки(СтруктураПоиска);
	Если СтрокиCodeSystem.Количество() > 0 Тогда
		Возврат СтрокиCodeSystem[0].codesystem;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаполнитьАтрибутыУзлаСлужебногоКлассификатораПоИдентфикатору(Узел, НезагруженныеКлассификаторы)
	
	OID = Строка(Узел.ПолучитьАтрибут("codeSystem"));
	Идентификатор = Строка(Узел.ПолучитьАтрибут("code"));
	
	Если Не (НевычисляемоеЗначениеАтрибута(OID)
		И НевычисляемоеЗначениеАтрибута(Идентификатор))
	Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияПараметров = ИнтеграцияЕГИСЗСервер.ПолучитьЗначенияПараметровЭлементаКлассификатораПоИдентификатору(OID, Идентификатор);
	Если ЗначенияПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого АтрибутУзла Из Узел.Атрибуты Цикл
		Если Лев(АтрибутУзла.ЗначениеУзла, 1) = "#" Тогда
			ЗначениеАтрибута = ЗначенияПараметров[НРег(СтрЗаменить(АтрибутУзла.ЗначениеУзла, "#", ""))];
			Если ЗначениеЗаполнено(ЗначениеАтрибута) Тогда
				Узел.УстановитьАтрибут(АтрибутУзла.ИмяУзла, Строка(ЗначениеАтрибута));
			Иначе
				ДобавитьНезагруженныйКлассификатор(НезагруженныеКлассификаторы, OID);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// TODO: Если в итоге остались пустые значения атрибутов или значения #version/#codesystemname/#name — вызывать исключение, или добавлять в массив ошибок
	
КонецПроцедуры

Процедура ДобавитьНезагруженныйКлассификатор(НезагруженныеКлассификаторы, OIDКлассификатора)
	
	ПараметрыСправочника = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьПараметрыСправочникаЕГИСЗ(OIDКлассификатора);
	
	Если ПараметрыСправочника.Свойство("ВидКлассификатора") Тогда
		Наименование = Строка(ПараметрыСправочника.ВидКлассификатора);
	Иначе
		Наименование = ПараметрыСправочника.Представление;
	КонецЕсли;
	
	Если НезагруженныеКлассификаторы.Найти(Наименование) = Неопределено Тогда
		НезагруженныеКлассификаторы.Добавить(Наименование);
	КонецЕсли;
	
КонецПроцедуры

Функция НевычисляемоеЗначениеАтрибута(ЗначениеАтрибута)
	
	Возврат ЗначениеЗаполнено(ЗначениеАтрибута)
			И Лев(ЗначениеАтрибута, 1) <> "*"
			И Лев(ЗначениеАтрибута, 1) <> "%"
			И Лев(ЗначениеАтрибута, 1) <> "$"
			И Лев(ЗначениеАтрибута, 1) <> "#";
	
КонецФункции

Функция ПолучитьЗначениеLocalIdИзСтроки(ТекущийLocalId, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтрокаГруппирующегоПоля = Неопределено)
	
	ТекущийLocalId = СокрЛП(ТекущийLocalId);
	LocalId = Неопределено;
	Реквизит = Неопределено;
	
	ЗначениеУзла = СтрЗаменить(ТекущийLocalId, "%", "");
	ПоКлассификацииПоля = СтрНайти(ТекущийLocalId, ".") <> 0 И СтрНайти(Врег(ТекущийLocalId), "КЛАССИФИКАЦИЯПОЛЯ") <> 0;
	
	Если ПоКлассификацииПоля Тогда
		ЗначенияСтроки = СтрРазделить(ЗначениеУзла, ".", Ложь);
		НовоеЗначениеСтроки = Новый Массив;
		Для Каждого ЗначениеСтроки Из ЗначенияСтроки Цикл
			Если СтрНайти(ВРег(ЗначениеСтроки), "КЛАССИФИКАЦИЯПОЛЯ") = 0 Тогда
				НовоеЗначениеСтроки.Добавить(ЗначениеСтроки);
			КонецЕсли;
		КонецЦикла;
		ЗначениеУзла = СтрСоединить(НовоеЗначениеСтроки, ".");
	КонецЕсли;
	
	Если СтрНайти(ЗначениеУзла, ".") > 0 Тогда
		LocalId = Лев(ЗначениеУзла, СтрНайти(ЗначениеУзла, ".") - 1);
		Реквизит = Прав(ЗначениеУзла, СтрДлина(ЗначениеУзла) - СтрДлина(LocalId) - 1);
	Иначе
		LocalId = ЗначениеУзла;
	КонецЕсли;
	
	СтрокаТаблицыСПараметром = Неопределено;
	
	Если СоответствиеВышестоящихLocalId <> Неопределено Тогда
		СтрокаТаблицыСПараметром = СоответствиеВышестоящихLocalId.Получить(LocalId);
		
		Если СтрокаТаблицыСПараметром = Неопределено
			И СоответствиеСодержитКлюч(СоответствиеВышестоящихLocalId, LocalId)
		Тогда
			// См. #1
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаТаблицыСПараметром = Неопределено Тогда
		
		СтруктураПоиска = Новый Структура("localid", LocalId);
		
		Если СтрокаГруппирующегоПоля <> Неопределено Тогда
			Если ЗначениеЗаполнено(СтрокаГруппирующегоПоля.Параметр) Тогда
				СтруктураПоиска.Вставить("ГруппирующееПоле", СтрокаГруппирующегоПоля.Параметр);
			Иначе
				СтруктураПоиска.Вставить("ГруппирующееПоле", ТаблицаПараметров.Индекс(СтрокаГруппирующегоПоля));
			КонецЕсли;
			СтруктураПоиска.Вставить("НомерСтрокиТаблицы", СтрокаГруппирующегоПоля.НомерСтрокиТаблицы);
		КонецЕсли;
		
		СтрокиТаблицыСПараметром = ТаблицаПараметров.НайтиСтроки(СтруктураПоиска);
		
		Если СтрокиТаблицыСПараметром.Количество() > 0 Тогда
			СтрокаТаблицыСПараметром = СтрокиТаблицыСПараметром[0];
		КонецЕсли;
	КонецЕсли;
	
	Если СтрокаТаблицыСПараметром = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПоКлассификацииПоля Тогда
		Если Реквизит <> Неопределено Тогда
			Попытка
				// Реквизит классификации поля
				ЗначениеАтрибута = Вычислить("СтрокаТаблицыСПараметром.КлассификацияПоля." + Реквизит);
			Исключение
				// Атрибут из тч
				КлассификацияПоля = СтрокаТаблицыСПараметром.КлассификацияПоля;
				Если Не ЗначениеЗаполнено(КлассификацияПоля) Тогда
					Возврат Неопределено;
				КонецЕсли;
				
				ЗначениеАтрибута = "";
				Для Каждого СтрокаАтрибута Из КлассификацияПоля.Атрибуты Цикл
					Если ВРег(СтрокаАтрибута.Ключ) = ВРег(Реквизит) Тогда
						ЗначениеАтрибута = СтрокаАтрибута.Значение;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецПопытки;
		Иначе
			//Ссылка
			ЗначениеАтрибута = СтрокаТаблицыСПараметром.КлассификацияПоля;
		КонецЕсли;
	Иначе
		Если Реквизит <> Неопределено Тогда
			// Реквизит
			ЗначениеАтрибута = Неопределено;
			Попытка
				ЗначениеПараметра = СтрокаТаблицыСПараметром.Значение;
			Исключение КонецПопытки;
			
			Если ЗначениеПараметра <> Неопределено Тогда
				Попытка
					ЗначениеАтрибута = Вычислить("ЗначениеПараметра." + Реквизит);
				Исключение
					Попытка
						Для Каждого СтрокаАтрибута Из ЗначениеПараметра.Атрибуты Цикл
							Если ВРег(СтрокаАтрибута.Ключ) = ВРег(Реквизит) Тогда
								ЗначениеАтрибута = СтрокаАтрибута.Значение;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					Исключение КонецПопытки;
				КонецПопытки;
			КонецЕсли;
		Иначе
			// Ссылка
			Если ТипЗнч(СтрокаТаблицыСПараметром.Значение) = Тип("Строка")
				И Не ЗарезервированныйLocalid(localid)
			Тогда
				ЗначениеАтрибута = ПолучитьЗначениеАтрибутаПоОбъединяющемуПолю(СтрокаТаблицыСПараметром, ТаблицаПараметров);
			Иначе
				ЗначениеАтрибута = СтрокаТаблицыСПараметром.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеАтрибута;
	
КонецФункции

Функция ПолучитьЗначениеАтрибутаПоОбъединяющемуПолю(СтрокаПараметра, ТаблицаПараметров)
	
	ЗначениеАтрибута = Новый Массив;
	ЗначениеАтрибута.Добавить(СтрокаПараметра.Значение);
	
	Если ЗначениеЗаполнено(СтрокаПараметра.Параметр) 
		И СтрокаПараметра.НаименованиеДляВрачаВОбъединяющемПоле = Истина 
	Тогда
		НаименованиеПараметраДляВрача = ?(ЗначениеЗаполнено(СтрокаПараметра.Параметр.НаименованиеДляВрача), СтрокаПараметра.Параметр.НаименованиеДляВрача, Строка(СтрокаПараметра.Параметр));
		ЗначениеАтрибута[0] = (НаименованиеПараметраДляВрача + ": " + СтрокаПараметра.Значение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаПараметра.Параметр) Тогда
		ЗначениеОбъединяющегоПоля = СтрокаПараметра.Параметр;
		СтрокиПоОбъединяющемуПолю = ТаблицаПараметров.НайтиСтроки(Новый Структура("ОбъединяющееПоле, ИдентификаторСтроки", ЗначениеОбъединяющегоПоля, СтрокаПараметра.ИдентификаторСтроки));
	Иначе
		ЗначениеОбъединяющегоПоля = ТаблицаПараметров.Индекс(СтрокаПараметра);
		СтрокиПоОбъединяющемуПолю = ТаблицаПараметров.НайтиСтроки(Новый Структура("ОбъединяющееПоле", ЗначениеОбъединяющегоПоля));
	КонецЕсли;
	
	ОбщегоНазначенияСервер.ВосстановитьПорядокНайденныхСтрок(СтрокиПоОбъединяющемуПолю, ТаблицаПараметров);
	
	Для Каждого Строка Из СтрокиПоОбъединяющемуПолю Цикл
		ЗначениеАтрибутаДляПодстановки = Строка.Значение;
		
		Если Строка.НаименованиеДляВрачаВОбъединяющемПоле = Истина Тогда
			НаименованиеПараметраДляВрача = ?(ЗначениеЗаполнено(Строка.Параметр.НаименованиеДляВрача), Строка.Параметр.НаименованиеДляВрача, Строка(Строка.Параметр));
			ЗначениеАтрибутаДляПодстановки = НаименованиеПараметраДляВрача + ": " + ЗначениеАтрибутаДляПодстановки;
		КонецЕсли;
		
		ЗначениеАтрибута.Добавить(ЗначениеАтрибутаДляПодстановки);
	КонецЦикла;
	
	Возврат СтрСоединить(ЗначениеАтрибута, ", ");
	
КонецФункции

#Область ТелоДокумента

Функция РекурсивныйОбходXML(XML, ТаблицаПараметров, УзлыДляУдаления, СоответствиеВышестоящихLocalId, ДокументHTML, СписокLocalid, КлонированныеУзлы,
	НезагруженныеКлассификаторы, ДополнительныеДанные, НезаполненныеПараметры = Неопределено, РодительскийУзел = Неопределено, НезаполненныеТекстовыеСекции = Неопределено)
	
	СписокУзлов = XML.ДочерниеУзлы;
	Для Каждого Узел Из СписокУзлов Цикл
		
		Если ТипЗнч(Узел) = Тип("КомментарийDOM") Тогда
			ДобавитьУзелДляУдаления(УзлыДляУдаления, Узел);
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Узел) <> Тип("ЭлементDOM") Тогда
			Если ТипЗнч(Узел) = Тип("ТекстDOM") Тогда
				
				LocalIdРодителя = РодительскийУзел.СвойстваУзла.localid;
				СтрокаГруппирующегоПоля = Неопределено;
				
				Если ЗначениеЗаполнено(LocalIdРодителя) Тогда
					СтруктураLocalid = СписокLocalid.Получить(LocalIdРодителя);
					Если СтруктураLocalid.Свойство("Родитель") Тогда
						Для Каждого РодительПоLocalId Из СтруктураLocalid.Родитель Цикл
							ВышестоящийLocalId = СоответствиеВышестоящихLocalId.Получить(РодительПоLocalId.localid);
							Если ВышестоящийLocalId <> Неопределено Тогда
								СтрокаГруппирующегоПоля = ВышестоящийLocalId;
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
				
				ЗаполнитьТекстовоеСодержаниеУзла(Узел, ТаблицаПараметров, СоответствиеВышестоящихLocalId, НезаполненныеПараметры, РодительскийУзел, УзлыДляУдаления, СтрокаГруппирующегоПоля);
			КонецЕсли;
			Продолжить;
		ИначеЕсли Узел.ПолучитьАтрибут("УзелДляКлонирования") <> Неопределено Или Узел.ПолучитьАтрибут("КлонированныйУзел") <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаГруппирующегоПоля = ПолучитьСтрокуГруппирующегоПоля(РодительскийУзел, ТаблицаПараметров, СоответствиеВышестоящихLocalId);
		ТекущийLocalId = Узел.ПолучитьАтрибут("localid");
		СвойстваУзла = ПолучитьСвойстваУзлаТела(Узел, ТекущийLocalId, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтрокаГруппирующегоПоля);
		СтруктураТекущегоУзла = ПолучитьСтруктуруТекущегоУзла(Узел, РодительскийУзел, СвойстваУзла);
		
		Если Узел.ЕстьАтрибут("УсловиеИспользования")
			И Не ВычислитьФункцию(Узел.ПолучитьАтрибут("УсловиеИспользования"), ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтрокаГруппирующегоПоля)
		Тогда
			ДобавитьУзелДляУдаления(УзлыДляУдаления, Узел);
			Продолжить;
		КонецЕсли;
		
		Если НРег(Узел.ИмяУзла) = "text"
			И НРег(Узел.РодительскийУзел.ИмяУзла) = "section"
			И ДокументHTML <> Неопределено
			И Узел.ДочерниеУзлы.Количество() = 0
		Тогда
			Для Каждого ДочернийУзелСекции Из Узел.РодительскийУзел.ДочерниеУзлы Цикл
				Если НРег(ДочернийУзелСекции.ИмяУзла) = "code"
					И ДочернийУзелСекции.ЕстьАтрибут("code")
				Тогда
					ЗаполнитьНаполнениеСекции(Узел, ДочернийУзелСекции.ПолучитьАтрибут("code"), ДокументHTML, ТаблицаПараметров, НезаполненныеТекстовыеСекции);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			// При отсутствии текста секции подставляется "—"
			Если Не ЗначениеЗаполнено(Узел.ТекстовоеСодержимое) Тогда
				Узел.ТекстовоеСодержимое = "—";
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		Если Узел.ЕстьАтрибут("codeSystem") Тогда
			ЗаполнитьАтрибутыУзлаСлужебногоКлассификатораПоИдентфикатору(Узел, НезагруженныеКлассификаторы);
		КонецЕсли;
		
		Если НРег(Узел.ИмяУзла) = "reference" Тогда
			ИмеетДочерниеУзлы = Ложь;
			ЗаполнитьУзелСсылки(Узел, СоответствиеВышестоящихLocalId, ТаблицаПараметров, УзлыДляУдаления, ИмеетДочерниеУзлы);
			
			Если ИмеетДочерниеУзлы Тогда
				РекурсивныйОбходXML(Узел, ТаблицаПараметров, УзлыДляУдаления, СоответствиеВышестоящихLocalId, ДокументHTML, СписокLocalid, КлонированныеУзлы, НезагруженныеКлассификаторы, ДополнительныеДанные, НезаполненныеПараметры, СтруктураТекущегоУзла, НезаполненныеТекстовыеСекции);
			КонецЕсли;
			
			Продолжить;
		КонецЕсли;
		
		Если СвойстваУзла.Множественное Тогда
			// [0..*] Или [1..*]
			СтруктураТекущегоLocalId = СписокLocalid.Получить(ТекущийLocalId);
			Если СтруктураТекущегоLocalId <> Неопределено
				И СтруктураТекущегоLocalId.Свойство("Родитель")
			Тогда
				// Группирующее поле
				ГруппирующееПоле	= Неопределено;
				НомерСтрокиТаблицы	= Неопределено;
				ИдентификаторСтроки	= Неопределено;
				ТаблицаШаблонов		= Неопределено;
				Для Каждого РодительПоLocalId Из СтруктураТекущегоLocalId.Родитель Цикл
					ВышестоящийLocalId = СоответствиеВышестоящихLocalId.Получить(РодительПоLocalId.localid);
					Если ВышестоящийLocalId <> Неопределено Тогда
						Если ВышестоящийLocalId.Параметр <> Неопределено Тогда
							ГруппирующееПоле	= ВышестоящийLocalId.Параметр;
							НомерСтрокиТаблицы	= ВышестоящийLocalId.НомерСтрокиТаблицы;
							ИдентификаторСтроки	= ВышестоящийLocalId.ИдентификаторСтроки;
							ТаблицаШаблонов		= ВышестоящийLocalId.ТаблицаШаблонов;
						Иначе
							// Константа
							ГруппирующееПоле = ТаблицаПараметров.Индекс(ВышестоящийLocalId);
						КонецЕсли;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ГруппирующееПоле <> Неопределено Тогда
					Если Не ЗначениеЗаполнено(ИдентификаторСтроки) Тогда
						Если Не ЗначениеЗаполнено(ТаблицаШаблонов) Тогда
							// Вышестоящий localid не в многострочной таблице
							ПараметрыСТекущимLocalId = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid, ГруппирующееПоле", ТекущийLocalId, ГруппирующееПоле));
						Иначе
							// Приём создан до добавления вложенных многострочных таблиц
							ПараметрыСТекущимLocalId = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid, ГруппирующееПоле, НомерСтрокиТаблицы", ТекущийLocalId, ГруппирующееПоле, НомерСтрокиТаблицы));
						КонецЕсли;
					Иначе
						ПараметрыСТекущимLocalId = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid, ГруппирующееПоле, ИдентификаторСтроки", ТекущийLocalId, ГруппирующееПоле, ИдентификаторСтроки));
						Если ПараметрыСТекущимLocalId.Количество() = 0 Тогда
							// Вложенная таблица
							ПараметрыСТекущимLocalId = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid, ГруппирующееПоле, ИдентификаторРодительскойСтроки", ТекущийLocalId, ГруппирующееПоле, ИдентификаторСтроки));
						КонецЕсли;
					КонецЕсли;
				Иначе
					ПараметрыСТекущимLocalId = Новый Массив;
				КонецЕсли;
			Иначе
				ПараметрыСТекущимLocalId = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", ТекущийLocalId));
			КонецЕсли;
			
			ОчиститьУзелОтАтрибутов(Узел);
			КоличествоСформированныхУзлов = 0;
			
			Если ПараметрыСТекущимLocalId.Количество() = 0 Тогда
				// #1: Существуют узлы [1..*], в которых все дочерние узлы [1..*]/[0..*], т.е. узел обязательный, при этом все дочерние могут быть с nullFlavor, добавляем фиктивный параметр без значения, пытаемся сформировать с ним
				ПараметрыСТекущимLocalId.Добавить(Неопределено);
			КонецЕсли;
			
			Для Каждого ПараметрСТекущимLocalId Из ПараметрыСТекущимLocalId Цикл
				КлонированныйУзел = Неопределено;
				Попытка
					СоответствиеВышестоящихLocalId.Вставить(ТекущийLocalId, ПараметрСТекущимLocalId);
					КлонированныйУзел = Узел.КлонироватьУзел(Истина);
					СтруктураКлонированногоУзла = ПолучитьСтруктуруТекущегоУзла(КлонированныйУзел, РодительскийУзел, СвойстваУзла);
					Узел.РодительскийУзел.ВставитьПеред(КлонированныйУзел, Узел);
					
					ДанныеДляУзлаКлассификатора = Новый Структура("localid, ДополнительныеДанные", ТекущийLocalId, ДополнительныеДанные);
					ЗначениеLocalid = ?(ПараметрСТекущимLocalId = Неопределено, Неопределено, ПараметрСТекущимLocalId.Значение);
					УстановитьЗначениеАтрибутовУзлаТела(КлонированныйУзел, СоответствиеВышестоящихLocalId, ТаблицаПараметров, СтруктураКлонированногоУзла, УзлыДляУдаления, НезаполненныеПараметры, НезагруженныеКлассификаторы, ДанныеДляУзлаКлассификатора, ЗначениеLocalid);
					
					РекурсивныйОбходXML(КлонированныйУзел, ТаблицаПараметров, УзлыДляУдаления, СоответствиеВышестоящихLocalId, ДокументHTML, СписокLocalid, КлонированныеУзлы, НезагруженныеКлассификаторы, ДополнительныеДанные, НезаполненныеПараметры, СтруктураКлонированногоУзла, НезаполненныеТекстовыеСекции);
					КлонированныйУзел.УстановитьАтрибут("КлонированныйУзел", "Истина");
					КлонированныеУзлы.Добавить(КлонированныйУзел);
					
					СоответствиеВышестоящихLocalId.Удалить(ТекущийLocalId);
					
					Если УзлыДляУдаления.Найти(КлонированныйУзел) = Неопределено Тогда
						КоличествоСформированныхУзлов = КоличествоСформированныхУзлов + 1;
					КонецЕсли;
				Исключение
					ТекстОшибки = ОписаниеОшибки(); // Для отладки
					Если КлонированныйУзел <> Неопределено
						И УзлыДляУдаления.Найти(КлонированныйУзел) = Неопределено
					Тогда
						// Узел успел клонироваться, но не смог обработаться
						УзлыДляУдаления.Добавить(КлонированныйУзел);
					КонецЕсли;
				КонецПопытки;
			КонецЦикла;
			
			// TODO: возможно потребуется добавить в макет секций тела в множественные узлы новый атрибут МинКоличествоУзлов
			Если КоличествоСформированныхУзлов = 0 Тогда
				ОбработатьУзелБезЗаполненногоПараметра(Узел, СтруктураТекущегоУзла, УзлыДляУдаления, ТаблицаПараметров, НезаполненныеПараметры);
			КонецЕсли;
			
			Узел.УстановитьАтрибут("УзелДляКлонирования", "Истина");
			ДобавитьУзелДляУдаления(УзлыДляУдаления, Узел);
		Иначе
			// [0..1]/[1..1]/R[1..1]
			СтрокаГруппирующегоПоля = Неопределено;
			ЗначениеLocalIdИзСтроки = Неопределено;
			Если ТекущийLocalId <> Неопределено Тогда
				СтрокаГруппирующегоПоля = ПолучитьСтрокуГруппирующегоПоля(РодительскийУзел, ТаблицаПараметров, СоответствиеВышестоящихLocalId);
				
				Если СтрокаГруппирующегоПоля = Неопределено
					И СоответствиеСодержитКлюч(СоответствиеВышестоящихLocalId, ТекущийLocalId)
				Тогда
					// См. #1
					ЗначениеLocalIdИзСтроки = Неопределено;
				Иначе
					ЗначениеLocalIdИзСтроки = ПолучитьЗначениеLocalIdИзСтроки(ТекущийLocalId, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтрокаГруппирующегоПоля);
				КонецЕсли;
			КонецЕсли;
			ДанныеДляУзлаКлассификатора = Новый Структура("localid, ДополнительныеДанные", ТекущийLocalId, ДополнительныеДанные);
			УстановитьЗначениеАтрибутовУзлаТела(Узел, СоответствиеВышестоящихLocalId, ТаблицаПараметров, СтруктураТекущегоУзла, УзлыДляУдаления, НезаполненныеПараметры, НезагруженныеКлассификаторы, ДанныеДляУзлаКлассификатора, ЗначениеLocalIdИзСтроки, СтрокаГруппирующегоПоля);
			
			РекурсивныйОбходXML(Узел, ТаблицаПараметров, УзлыДляУдаления, СоответствиеВышестоящихLocalId, ДокументHTML, СписокLocalid, КлонированныеУзлы, НезагруженныеКлассификаторы, ДополнительныеДанные, НезаполненныеПараметры, СтруктураТекущегоУзла, НезаполненныеТекстовыеСекции);
			ОчиститьУзелОтАтрибутов(Узел);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьСтруктуруТекущегоУзла(Узел, РодительскийУзел, СвойстваУзла)
	
	СтруктураТекущегоУзла = Новый Структура("Узел, СвойстваУзла, РодительскийУзел");
	СтруктураТекущегоУзла.Узел = Узел;
	СтруктураТекущегоУзла.СвойстваУзла = СвойстваУзла;
	СтруктураТекущегоУзла.РодительскийУзел = РодительскийУзел;
	
	Возврат СтруктураТекущегоУзла;
	
КонецФункции

Функция ПолучитьСвойстваУзлаТела(Узел, ТекущийLocalId, ТаблицаПараметров = Неопределено, СоответствиеВышестоящихLocalId = Неопределено, СтрокаГруппирующегоПоля = Неопределено)
	
	СвойстваУзла = Новый Структура("Обязательное, Множественное, ЗначениеПустогоЗначения, Синоним, localid, ДопустимыеЗначения, УсловиеОбязательное, СохранятьДочерниеУзлы, СохранятьТипПриПустомЗначении, НеОтображатьВШаблоне");
	
	ЗначениеПустогоЗначения = Узел.ПолучитьАтрибут("ПустоеЗначение");
	
	Если ЗначениеЗаполнено(ЗначениеПустогоЗначения)
		И СтрНачинаетсяС(ЗначениеПустогоЗначения, "*")
	Тогда
		Попытка
			ЗначениеПустогоЗначения = ВычислитьФункцию(ЗначениеПустогоЗначения, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтрокаГруппирующегоПоля);
		Исключение КонецПопытки;
	КонецЕсли;
	
	СвойстваУзла.ЗначениеПустогоЗначения = ЗначениеПустогоЗначения;
	
	Если ЗначениеЗаполнено(СвойстваУзла.ЗначениеПустогоЗначения) Тогда
		СвойстваУзла.Обязательное = Ложь;
	Иначе
		СвойстваУзла.Обязательное = Истина;
		АтрибутОбязательное = Узел.ПолучитьАтрибут("Обязательное");
		Если АтрибутОбязательное <> Неопределено Тогда
			СвойстваУзла.УсловиеОбязательное = АтрибутОбязательное;
			Попытка
				СвойстваУзла.Обязательное = Булево(ВычислитьФункцию(АтрибутОбязательное, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтрокаГруппирующегоПоля));
			Исключение КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	АтрибутСиноним = Узел.ПолучитьАтрибут("Синоним");
	
	Если СтрЗаканчиваетсяНа(НРег(ТекущийLocalId), ".классификацияполя") Тогда
		Если АтрибутСиноним <> Неопределено Тогда
			ИмяПоляКлассификации = АтрибутСиноним;
		Иначе
			ИмяПоляКлассификации = РазбитьСоставноеСлово(СтрРазделить(ТекущийLocalId, ".")[0]);
		КонецЕсли;
		
		СвойстваУзла.Синоним = СтрШаблон(НСтр("ru='Классификация поля ""%1""'"), ИмяПоляКлассификации);
	Иначе
		Если АтрибутСиноним <> Неопределено Тогда
			СвойстваУзла.Синоним = АтрибутСиноним;
		ИначеЕсли ЗначениеЗаполнено(ТекущийLocalId) Тогда
			СвойстваУзла.Синоним = СтрШаблон(НСтр("ru='Поле ЭМД ""%1""'"), ТекущийLocalId);
		КонецЕсли;
	КонецЕсли;
	СвойстваУзла.localid = ТекущийLocalId;
	
	Попытка
		СвойстваУзла.Множественное = ВычислитьФункцию(Узел.ПолучитьАтрибут("Множественное"));
	Исключение
		СвойстваУзла.Множественное = Ложь;
	КонецПопытки;
	
	Попытка
		СвойстваУзла.СохранятьДочерниеУзлы = ВычислитьФункцию(Узел.ПолучитьАтрибут("СохранятьДочерниеУзлы"));
	Исключение
		СвойстваУзла.СохранятьДочерниеУзлы = Ложь;
	КонецПопытки;
	
	Попытка
		СвойстваУзла.СохранятьТипПриПустомЗначении = ВычислитьФункцию(Узел.ПолучитьАтрибут("СохранятьТипПриПустомЗначении"));
	Исключение
		СвойстваУзла.СохранятьТипПриПустомЗначении = Ложь;
	КонецПопытки;
	
	АтрибутДопустимыеЗначения = Узел.ПолучитьАтрибут("ДопустимыеЗначения");
	Если АтрибутДопустимыеЗначения <> Неопределено Тогда
		СвойстваУзла.ДопустимыеЗначения = АтрибутДопустимыеЗначения;
	КонецЕсли;
	
	Попытка
		СвойстваУзла.НеОтображатьВШаблоне = ВычислитьФункцию(Узел.ПолучитьАтрибут("НеОтображатьВШаблоне"));
	Исключение
		СвойстваУзла.НеОтображатьВШаблоне = Ложь;
	КонецПопытки;
	
	Возврат СвойстваУзла;
	
КонецФункции

Процедура УстановитьЗначениеАтрибутовУзлаТела(Узел, СоответствиеВышестоящихLocalId, ТаблицаПараметров, СвойстваРодительскогоУзла, УзлыДляУдаления,
	НезаполненныеПараметры, НезагруженныеКлассификаторы, ДанныеДляУзлаКлассификатора, ЗначениеLocalIdИзСтроки = Неопределено, СтрокаГруппирующегоПоля = Неопределено)
	
	// Заполнение атрибутов по данным элемента классификатора (#)
	Если НРег(Узел.ПолучитьАтрибут("code")) = "#code" Тогда
		Если ЗначениеЗаполнено(ЗначениеLocalIdИзСтроки) Тогда
			ЗаполнитьАтрибутыУзлаКлассификатора(Узел, ЗначениеLocalIdИзСтроки, НезагруженныеКлассификаторы, ДанныеДляУзлаКлассификатора);
		ИначеЕсли УзелКлассификатора(Узел) Тогда
			ОбработатьУзелБезЗаполненногоПараметра(Узел, СвойстваРодительскогоУзла, УзлыДляУдаления, ТаблицаПараметров, НезаполненныеПараметры);
			Возврат;
		КонецЕсли;
	ИначеЕсли Лев(Узел.ПолучитьАтрибут("code"), 1) = "%" Тогда
		CodeSystem = "";
		ЕстьАтрибутКлассификатораКЗаполнению = Ложь;
		Для Каждого Атрибут Из Узел.Атрибуты Цикл
			Если НРег(Атрибут.ИмяУзла) = "codesystem"
				И Лев(Атрибут.ЗначениеУзла, 1) <> "#"
			Тогда
				CodeSystem = Атрибут.ЗначениеУзла;
			КонецЕсли;
			Если Лев(Атрибут.ЗначениеУзла, 1) = "#" Тогда
				ЕстьАтрибутКлассификатораКЗаполнению = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(CodeSystem) И ЕстьАтрибутКлассификатораКЗаполнению Тогда
			
			ПараметрыКлассификатора = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьПараметрыСправочникаЕГИСЗ(CodeSystem);
			Если ЗначениеЗаполнено(ЗначениеLocalIdИзСтроки)
				И ПараметрыКлассификатора.ВидКлассификатора = ЗначениеLocalIdИзСтроки.ВидКлассификатора
			Тогда
				// Узел классификатора по текущему localid, но с переопределённым значением атрибута "code"
				ЗаполнитьАтрибутыУзлаКлассификатора(Узел, ЗначениеLocalIdИзСтроки, НезагруженныеКлассификаторы, ДанныеДляУзлаКлассификатора);
			Иначе
				// Узел классификатора не по текущему localid, идентификатор элемента классификатора определяется значением атрибута "code"
				УИДЕГИСЗ = ПолучитьЗначениеLocalIdИзСтроки(Узел.ПолучитьАтрибут("code"), ТаблицаПараметров, СоответствиеВышестоящихLocalId);
				ЗначенияПараметров = ИнтеграцияЕГИСЗСервер.ПолучитьЗначенияПараметровЭлементаКлассификатораПоИдентификатору(CodeSystem, УИДЕГИСЗ);
				Если ЗначенияПараметров = Неопределено Тогда
					ОбработатьУзелБезЗаполненногоПараметра(Узел, СвойстваРодительскогоУзла, УзлыДляУдаления, ТаблицаПараметров, НезаполненныеПараметры);
					Возврат;
				Иначе
					ЗаполнитьАтрибутыУзлаКлассификатора(Узел, Неопределено, НезагруженныеКлассификаторы, ДанныеДляУзлаКлассификатора, ЗначенияПараметров);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПустоеЗначение = Ложь;
	СлужебныеАтрибутыТела = ПолучитьСлужебныеАтрибутыТела();
	
	Для Каждого АтрибутУзла Из Узел.Атрибуты Цикл
		Если СлужебныеАтрибутыТела.Найти(АтрибутУзла.ИмяУзла) <> Неопределено
			Или (СтрНайти(АтрибутУзла.ЗначениеУзла, "$") = 0
					И Лев(АтрибутУзла.ЗначениеУзла,1) <> "*"
					И Лев(АтрибутУзла.ЗначениеУзла,1) <> "%")
		Тогда
			Продолжить;
		КонецЕсли;
		
		Результат = ПолучитьРезультат(Узел, АтрибутУзла.ЗначениеУзла, ТаблицаПараметров, СоответствиеВышестоящихLocalId, СтрокаГруппирующегоПоля, Узел.ПолучитьАтрибут("Формат"));
		// TODO Возможно при Результат = Неопределено - производить проверку
		Если Результат <> Неопределено Тогда
			Узел.УстановитьАтрибут(АтрибутУзла.ИмяУзла, Результат);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Если НРег(АтрибутУзла.ИмяУзла) = "value" Тогда
				ПустоеЗначение = Истина;
			Иначе
				ОбработатьУзелБезЗаполненногоПараметра(Узел, СвойстваРодительскогоУзла, УзлыДляУдаления, ТаблицаПараметров, НезаполненныеПараметры);
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ПустоеЗначение Тогда
		ЗначениеПустогоЗначения = Узел.ПолучитьАтрибут("ПустоеЗначение");
		Если ЗначениеПустогоЗначения <> Неопределено Тогда
			Узел.УдалитьАтрибут("ПустоеЗначение");
		КонецЕсли;
		Если ЗначениеЗаполнено(ЗначениеПустогоЗначения) Тогда
			Узел.УстановитьАтрибут("nullFlavor", ЗначениеПустогоЗначения);
		Иначе
			ОбработатьУзелБезЗаполненногоПараметра(Узел, СвойстваРодительскогоУзла, УзлыДляУдаления, ТаблицаПараметров, НезаполненныеПараметры);
			Возврат;
		КонецЕсли;
		Узел.УдалитьАтрибут("value");
	КонецЕсли;
	
КонецПроцедуры

Функция УзелКлассификатора(Узел)
	
	Для Каждого АтрибутУзла Из Узел.Атрибуты Цикл
		Если Лев(АтрибутУзла.ЗначениеУзла, 1) = "#" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура ЗаполнитьНаполнениеСекции(Узел, НаименованиеСекции, ДокументHTML, ТаблицаПараметров, НезаполненныеТекстовыеСекции)
	
	Если Не ЗначениеЗаполнено(НаименованиеСекции) Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыСекции = Новый Массив;
	УзлыСекций = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(ДокументHTML,,,"data-bit-sectionname");
	
	Для Каждого УзелСекции Из УзлыСекций Цикл
		Если СтрНайти(УзелСекции.ПолучитьАтрибут("data-bit-sectionname"), НаименованиеСекции) > 0 Тогда
			ЭлементыСекции.Добавить(УзелСекции);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементСекции Из ЭлементыСекции Цикл
		ДобавитьНормализованныеУзлыДокументаHTMLВУзелНаполнения(ЭлементСекции, Узел, ДокументHTML, НаименованиеСекции, ТаблицаПараметров);
	КонецЦикла;
	
	Если НезаполненныеТекстовыеСекции <> Неопределено
		И Узел.ДочерниеУзлы.Количество() = 0
	Тогда
		НезаполненныеТекстовыеСекции.Добавить(НаименованиеСекции);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУзелСсылки(Узел, СоответствиеВышестоящихLocalId, ТаблицаПараметров, УзлыДляУдаления, ИмеетДочерниеУзлы)
	
	НовоеЗначениеRef = Новый УникальныйИдентификатор;
	ЗначениеRef = Узел.ПолучитьАтрибут("value");
	
	Если ЗначениеRef <> Неопределено Тогда
		Если Лев(ЗначениеRef, 1) = "*" Тогда
			Если ЗначениеЗаполнено(ЗначениеRef) Тогда
				
				LocalIdСсылки = Прав(ЗначениеRef, СтрДлина(ЗначениеRef)-1);
				СтрокаТаблицыСПараметром = СоответствиеВышестоящихLocalId.Получить(LocalIdСсылки);
				
				Если СтрокаТаблицыСПараметром = Неопределено Тогда
					СтрокиLocalid = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", LocalIdСсылки));
					Если СтрокиLocalid.Количество() > 0 Тогда
						СтрокаТаблицыСПараметром = СтрокиLocalid[0];
					КонецЕсли;
				КонецЕсли;
				
				Если СтрокаТаблицыСПараметром <> Неопределено И ЗначениеЗаполнено(СтрокаТаблицыСПараметром.Параметр) Тогда
					НовоеЗначениеRef = СтрокаТаблицыСПараметром.Параметр.УникальныйИдентификатор();
				КонецЕсли;
				
			КонецЕсли;
			
			Узел.УстановитьАтрибут("value", Строка(НовоеЗначениеRef));
		КонецЕсли;
	Иначе
		LocalIdСсылки = Узел.ПолучитьАтрибут("localid");
		Если LocalIdСсылки <> Неопределено Тогда
			Если ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", LocalIdСсылки)).Количество() > 0 Тогда
				ОчиститьУзелОтАтрибутов(Узел);
				ИмеетДочерниеУзлы = Истина;
			Иначе
				ДобавитьУзелДляУдаления(УзлыДляУдаления, Узел);
			КонецЕсли;
		Иначе
			ИмеетДочерниеУзлы = Узел.ДочерниеУзлы.Количество() > 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВалидныйАдрес(Ссылка)
	
	АдресФактический = ИнтеграцияЕГИСЗСервер.ПолучитьАдресПоВидуАдреса(Ссылка, Справочники.ВидыКонтактнойИнформации.АдресФактический);
	Если ЗначениеЗаполнено(АдресФактический.Представление) Тогда
		Возврат АдресФактический;
	КонецЕсли;
	
	АдресЮридический = ИнтеграцияЕГИСЗСервер.ПолучитьАдресПоВидуАдреса(Ссылка, Справочники.ВидыКонтактнойИнформации.АдресЮридический);
	Если ЗначениеЗаполнено(АдресЮридический.Представление) Тогда
		Возврат АдресЮридический;
	КонецЕсли;
	
	АдресПочтовый	 = ИнтеграцияЕГИСЗСервер.ПолучитьАдресПоВидуАдреса(Ссылка, Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	Если ЗначениеЗаполнено(АдресПочтовый.Представление) Тогда
		Возврат АдресПочтовый;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДобавитьНормализованныеУзлыДокументаHTMLВУзелНаполнения(ЭлементСекции, Узел, ДокументHTML, НаименованиеСекции, ТаблицаПараметров, ДобавленаОсновнаяТаблица = Ложь)
	
	ДопустимыеТипыУзлов = Новый Массив;
	ДопустимыеТипыУзлов.Добавить("COLGROUP");
	ДопустимыеТипыУзлов.Добавить("THEAD");
	ДопустимыеТипыУзлов.Добавить("TBODY");
	ДопустимыеТипыУзлов.Добавить("TABLE");
	ДопустимыеТипыУзлов.Добавить("CAPTION");
	ДопустимыеТипыУзлов.Добавить("COL");
	ДопустимыеТипыУзлов.Добавить("TFOOT");
	ДопустимыеТипыУзлов.Добавить("TH");
	ДопустимыеТипыУзлов.Добавить("TD");
	ДопустимыеТипыУзлов.Добавить("TR");
	ДопустимыеТипыУзлов.Добавить("CONTENT");
	ДопустимыеТипыУзлов.Добавить("#TEXT");
	ДопустимыеТипыУзлов.Добавить("BR");
	
	Для Каждого ДочернийУзел Из ЭлементСекции.ДочерниеУзлы Цикл
		
		Если ДочернийУзел.Атрибуты <> Неопределено
			И ДочернийУзел.ПолучитьАтрибут("hidden") = "true"
		Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ДочернийУзел) = Тип("ЭлементDOM") Тогда
			НаименованиеСекцииТекущегоУзла = ДочернийУзел.ПолучитьАтрибут("data-bit-sectionname");
			Если НаименованиеСекцииТекущегоУзла <> Неопределено И СтрНайти(НаименованиеСекцииТекущегоУзла, НаименованиеСекции) = 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		ИмяДочернегоУзла = ВРег(ДочернийУзел.ИмяУзла);
		
		Если ДопустимыеТипыУзлов.Найти(ИмяДочернегоУзла) <> Неопределено Тогда
			
			ЭтоУзелОсновнойТаблицы = Ложь;
			Если ИмяДочернегоУзла = "TABLE" Тогда
				
				ЕстьЗаполненныеСтроки = Ложь;
				Для Каждого ТелоТаблицы Из ДочернийУзел.ПолучитьТелоТаблицы() Цикл
					Для Каждого СтрокаТаблицы Из ТелоТаблицы.ДочерниеУзлы Цикл
						Если СтрокаТаблицы.Атрибуты = Неопределено
							Или СтрокаТаблицы.ПолучитьАтрибут("hidden") <> "true"
						Тогда
							ЕстьЗаполненныеСтроки = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Прервать;
				КонецЦикла;
				
				Если Не ЕстьЗаполненныеСтроки Тогда
					// РЭМД не принимает таблицы с пустым содержимым
					Продолжить;
				КонецЕсли;
				
				Если ДобавленаОсновнаяТаблица Тогда
					ДобавитьВложеннуюТаблицу(ДочернийУзел, ДокументHTML, Узел);
					Продолжить;
				Иначе
					ЭтоУзелОсновнойТаблицы = Истина;
				КонецЕсли;
			КонецЕсли;
			
			НовыйУзелУзла = ДочернийУзел.КлонироватьУзел(Ложь);
			//Если Не ТипЗнч(ДочернийУзел) = Тип("ТекстDOM") Тогда
			//	Для Каждого Атрибут Из ДочернийУзел.Атрибуты Цикл
			//		НовыйУзелНовогоУзла.УстановитьАтрибут(Атрибут.Имя, Атрибут.Значение);
			//	КонецЦикла;
			//КонецЕсли;
			
			Узел.ДобавитьДочерний(НовыйУзелУзла);
			
			Если ИмяДочернегоУзла = "CAPTION" Тогда
				НовыйУзелУзла.ДобавитьДочерний(ДочернийУзел.ДокументВладелец.СоздатьТекстовыйУзел(ДочернийУзел.ТекстовоеСодержимое).КлонироватьУзел(Ложь));
			Иначе
				ДобавитьНормализованныеУзлыДокументаHTMLВУзелНаполнения(ДочернийУзел, НовыйУзелУзла, ДокументHTML, НаименованиеСекции, ТаблицаПараметров, ДобавленаОсновнаяТаблица Или ЭтоУзелОсновнойТаблицы);
			КонецЕсли;
		Иначе
			Если ИмяДочернегоУзла = "DIV"
				Или ИмяДочернегоУзла = "P"
			Тогда
				Узел.ДобавитьДочерний(ДокументHTML.СоздатьЭлемент("br").КлонироватьУзел(Ложь));
			КонецЕсли;
			ДобавитьНормализованныеУзлыДокументаHTMLВУзелНаполнения(ДочернийУзел, Узел, ДокументHTML, НаименованиеСекции, ТаблицаПараметров, ДобавленаОсновнаяТаблица);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьВложеннуюТаблицу(ЭлементТаблицы, ДокументHTML, Узел);
	
	// TODO: Надо бы рекурсивно обходить, начиная с самых вложенных таблиц
	
	ТелоТаблицы = ЭлементТаблицы.ПолучитьТелоТаблицы();
	Если ТелоТаблицы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыСписка = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТелоТаблицы[0].ДочерниеУзлы Цикл
		НовыйУзелЭлемента = ДокументHTML.СоздатьЭлемент("item").КлонироватьУзел(Ложь);
		Если СтрокаТаблицы.Атрибуты <> Неопределено
			И СтрокаТаблицы.ПолучитьАтрибут("hidden") = "true"
		Тогда
			Продолжить;
		КонецЕсли;
		
		УзелЭлемента = Узел.ДобавитьДочерний(НовыйУзелЭлемента);
		УзелЭлемента.ДобавитьДочерний(ДокументHTML.СоздатьТекстовыйУзел(СтрокаТаблицы.ТекстовоеСодержимое).КлонироватьУзел(Ложь));
		ЭлементыСписка.Добавить(УзелЭлемента);
	КонецЦикла;
	
	Если ЭлементыСписка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НовыйУзелСписка = ДокументHTML.СоздатьЭлемент("list").КлонироватьУзел(Ложь);
	
	УзелСписка = Узел.ДобавитьДочерний(НовыйУзелСписка);
	Для Каждого ЭлементСписка Из ЭлементыСписка Цикл
		УзелСписка.ДобавитьДочерний(ЭлементСписка);
	КонецЦикла;
	
КонецПроцедуры

#Область ФункцииМакетовТелаДокумента

Функция УникальныйИдентификаторПоСсылке(Ссылка)
	
	Попытка
		Возврат Строка(ИнтеграцияЕГИСЗСервер.УИДВЧисло(Ссылка.УникальныйИдентификатор()));
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьНомерМедкарты(Медкарта)
	
	Возврат СтрЗаменить(Медкарта.Наименование, ", " + CRMСервер.ПолучитьФИООбъекта(Медкарта.Клиент), "");
	
КонецФункции

Функция ПолучитьТелефон(Ссылка)
	
	НомерТелефона = Строка(КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Ссылка, Перечисления.ТипыКонтактнойИнформации.Телефон));
	Возврат НомерТелефона;
	
КонецФункции

Функция ПолучитьРегион(Ссылка)
	
	ВалидныйАдрес = ПолучитьВалидныйАдрес(Ссылка);
	
	Если ВалидныйАдрес <> Неопределено Тогда
		СтруктураАдрес = РаботаСАдресами.СведенияОбАдресе(ВалидныйАдрес.ЗначенияПолей);
		Возврат Строка(АдресныйКлассификатор.КодРегионаПоНаименованию(СтруктураАдрес.Регион));
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьАдрес(Ссылка)
	
	ВалидныйАдрес = ПолучитьВалидныйАдрес(Ссылка);
	
	Если ВалидныйАдрес <> Неопределено Тогда
		Возврат ВалидныйАдрес.Представление;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьТипШкалыИзмерений(Параметр)
	
	Если ЗначениеЗаполнено(Параметр) Тогда
		Возврат ИнтеграцияЕГИСЗСервер.ПолучитьЗначениеАтрибутаЭлементаКлассификатора(Параметр, "SCALETYPE");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьВычисляемоеЗначениеДляТС(Аргумент1, Аргумент2, Аргумент3, Аргумент4 = Неопределено, Аргумент5 = Неопределено)
	
	Результат = Аргумент1 Или Аргумент2 Или Аргумент3;
	Если Аргумент4 <> Неопределено И Аргумент5 <> Неопределено Тогда
		Результат = Результат Или Аргумент4 Или Аргумент5;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДатаСоСмещением(Дата, Формат)
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Дата) = Тип("Строка") Тогда
		Попытка
			Дата = СтроковыеФункцииКлиентСервер.СтрокаВДату(Дата);
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		Возврат ИнтеграцияЕГИСЗСервер.ПредставлениеЛокальнойДатыСоСмещением(Дата, Формат);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьДатуИзСтроки(ДатаВремяДокументаСтрокой) Экспорт
	
	// Формат YYYYMMDD[HHMM[SS]+|ZZZZ]
	ДатаСтрокой = Лев(ДатаВремяДокументаСтрокой, 8);
	
	ГодСтрокой	 = Лев(ДатаСтрокой, 4);
	МесяцСтрокой = Сред(ДатаСтрокой, 5, 2);
	ДеньСтрокой	 = Сред(ДатаСтрокой, 7, 2);
	
	Если СтрДлина(ДатаВремяДокументаСтрокой) > 8 Тогда
		ВремяСоСмещениемСтрокой = Сред(ДатаВремяДокументаСтрокой, 9);
		
		РазделительСмещение = Неопределено;
		Если СтрНайти(ВремяСоСмещениемСтрокой, "+") > 0 Тогда
			РазделительСмещение = "+";
		ИначеЕсли СтрНайти(ВремяСоСмещениемСтрокой, "-") > 0 Тогда
			РазделительСмещение = "-";
		КонецЕсли;
		
		ВремяИСмещение = СтрРазделить(ВремяСоСмещениемСтрокой, РазделительСмещение, Ложь);
		ВремяСтрокой = ВремяИСмещение[0];
		ЧасыСтрокой = Лев(ВремяСтрокой, 2);
		МинутыСтрокой = Сред(ВремяСтрокой, 3, 2);
		Если СтрДлина(ВремяСтрокой) > 4 Тогда
			СекундыСтрокой = Сред(ВремяСтрокой, 5, 2);
		Иначе
			СекундыСтрокой = "00";
		КонецЕсли;
		
		ПредставлениеВременнойЗоны = ВремяИСмещение[1];
		ПредставлениеЧасовогоПояса = "GMT" + РазделительСмещение + Лев(ПредставлениеВременнойЗоны, 2) + ":" + Сред(ПредставлениеВременнойЗоны, 3, 2);
	Иначе
		ЧасыСтрокой = "00";
		МинутыСтрокой = "00";
		СекундыСтрокой = "00";
		ПредставлениеЧасовогоПояса = ПредставлениеЧасовогоПояса(ЧасовойПоясСеанса());
	КонецЕсли;
	
	Возврат МестноеВремя(УниверсальноеВремя(Дата(ГодСтрокой, МесяцСтрокой, ДеньСтрокой, ЧасыСтрокой, МинутыСтрокой, СекундыСтрокой)), ПредставлениеЧасовогоПояса);
	
КонецФункции

Функция ПолучитьДатуИзСтрокиВТребуемомФормате(ДатаВремяСтрокой, Формат)
	
	Возврат Формат(ПолучитьДатуИзСтроки(ДатаВремяСтрокой), Формат);
	
КонецФункции

Функция ЗначениеЭлементаКлассификатора(Знач ЭлементКлассификатора = Неопределено, Знач OIDКлассификатора = Неопределено, Знач ИдентификаторЭлемента = Неопределено, Знач ТипЗначения = "name")
	
	Значение = "";
	
	Если ЭлементКлассификатора = Неопределено
		И OIDКлассификатора <> Неопределено
		И ИдентификаторЭлемента <> Неопределено
	Тогда
		ЭлементКлассификатора = ЭлементКлассификатора(ИдентификаторЭлемента, OIDКлассификатора);
	КонецЕсли;
	
	Если ЭлементКлассификатора <> Неопределено Тогда
		ЗначенияПараметров = ИнтеграцияЕГИСЗСервер.ПолучитьЗначенияПараметровЭлементаКлассификатора(ЭлементКлассификатора);
		Если ЗначенияПараметров <> Неопределено И ЗначенияПараметров.Свойство(ТипЗначения) Тогда
			Значение = ЗначенияПараметров[ТипЗначения];
		КонецЕсли;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ЭлементКлассификатора(ИдентификаторЭлемента, OIDКлассификатора)
	
	Попытка
		УИДЕГИСЗ = Число(ИдентификаторЭлемента);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	ПараметрыСправочника = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьПараметрыСправочникаЕГИСЗ(OIDКлассификатора);
	
	ШаблонЗапроса = 
		"ВЫБРАТЬ
		|	КлассификаторыМинЗдрава.Ссылка КАК Ссылка
		|ИЗ
		|	%1 КАК КлассификаторыМинЗдрава
		|ГДЕ
		|	КлассификаторыМинЗдрава.УИДЕГИСЗ = &УИДЕГИСЗ %2";
	
	Запрос = Новый Запрос;
	
	УсловиеВидаКлассификатора = "";
	Если ПараметрыСправочника.Свойство("ВидКлассификатора") Тогда
		УсловиеВидаКлассификатора = "И КлассификаторыМинЗдрава.ВидКлассификатора = &ВидКлассификатора";
		Запрос.УстановитьПараметр("ВидКлассификатора", ПараметрыСправочника.ВидКлассификатора);
	КонецЕсли;
	
	Запрос.Текст = СтрШаблон(ШаблонЗапроса, ПараметрыСправочника.ПолноеНаименование, УсловиеВидаКлассификатора);
	Запрос.УстановитьПараметр("УИДЕГИСЗ", УИДЕГИСЗ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПредставлениеЕдиницыИзмеренияВитальногоПараметра(ВитальныйПараметр, АтрибутПредставления = "PRINTNAME") Экспорт
	
	Если Не ЗначениеЗаполнено(ВитальныйПараметр)
		Или ДопСерверныеФункции.ИмяСсылочногоТипа(ВитальныйПараметр) <> "Справочник.КлассификаторыМинЗдрава"
	Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Старый формат классификатора (версия <= 3.4)
	ЕдиницаИзмерения = ВитальныйПараметр.Атрибуты.Найти("Unit", "Ключ");
	
	Если ЕдиницаИзмерения <> Неопределено Тогда
		Возврат ЕдиницаИзмерения.Значение;
	КонецЕсли;
	
	// Новый формат классификатора (версия >= 4.1)
	ЕдиницаИзмерения = ВитальныйПараметр.Атрибуты.Найти("UnitCode", "Ключ");
	Если ЕдиницаИзмерения <> Неопределено
		И ЗначениеЗаполнено(ЕдиницаИзмерения.Значение)
	Тогда
		Возврат ПредставлениеЕдиницыИзмерения(ЕдиницаИзмерения.Значение, АтрибутПредставления);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПредставлениеЕдиницыИзмерения(Знач УИДЕГИСЗ, АтрибутПредставления = "UCUM")
	
	Если ТипЗнч(УИДЕГИСЗ) = Тип("Строка") Тогда
		ЦифрыСтрокиУИДЕГИСЗ = СтроковыеФункцииКлиентСервер.ПолучитьЦифрыСтроки(УИДЕГИСЗ);
		Если ЗначениеЗаполнено(ЦифрыСтрокиУИДЕГИСЗ) Тогда
			УИДЕГИСЗ = Число(ЦифрыСтрокиУИДЕГИСЗ);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	ИначеЕсли ТипЗнч(УИДЕГИСЗ) <> Тип("Число") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЕдиницаИзмерения = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЕдиницыИзмерения(УИДЕГИСЗ);
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		СтрокаАтрибута = ЕдиницаИзмерения.Атрибуты.Найти(АтрибутПредставления, "Ключ");
		Возврат СтрокаАтрибута.Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПредставлениеДиагнозаСКодом(Диагноз, Описание = "")
	
	Попытка
		ПредставлениеДиагноза = Новый Массив;
		ПредставлениеДиагноза.Добавить(Справочники.Диагнозы.ПредставлениеДиагнозаСКодом(Диагноз));
		Если ЗначениеЗаполнено(Описание) Тогда
			ПредставлениеДиагноза.Добавить(Описание);
		КонецЕсли;
		Возврат СтрСоединить(ПредставлениеДиагноза, ", ");
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПараметрЯвляетсяЭлементомКлассификатора(Параметр)
	
	Если ЗначениеЗаполнено(Параметр) Тогда
		Возврат ИнтеграцияЕГИСЗСервер.ПолучитьЗначениеАтрибутаЭлементаКлассификатора(Параметр, "УИДЕГИСЗ") <> Неопределено;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция КлассификаторыЗначенийВитальныхПараметров()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(КлассификаторыМинЗдраваАтрибуты.Значение КАК СТРОКА(100)) КАК Значение
		|ИЗ
		|	Справочник.КлассификаторыМинЗдрава.Атрибуты КАК КлассификаторыМинЗдраваАтрибуты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторыМинЗдрава КАК КлассификаторыМинЗдрава
		|		ПО КлассификаторыМинЗдраваАтрибуты.Ссылка = КлассификаторыМинЗдрава.Ссылка
		|			И (КлассификаторыМинЗдрава.ВидКлассификатора = ЗНАЧЕНИЕ(Перечисление.ВидыКлассификаторовМинЗдрава.ВитальныеПараметры))
		|			И (КлассификаторыМинЗдраваАтрибуты.Ключ = ""OID"")";
	
	Классификации = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение");
	
	Возврат СтрСоединить(Классификации, ",");
	
КонецФункции

Функция ПараметрУказанногоТипа(Параметр, ПредставлениеТипа)
	
	Возврат ТипЗнч(Параметр) = Тип(ПредставлениеТипа);
	
КонецФункции

Функция ПолучитьРабочуюПочту(Ссылка)
	
	Возврат КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Ссылка, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий, Истина, Ложь);
	
КонецФункции

Функция ПараметрУказанногоКлассификатора(Параметр, OIDКлассификатора)
	
	Попытка
		Возврат Параметр.OIDКлассификатораМинздрава = OIDКлассификатора;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Функция НаименованиеОрганизации(Ссылка)
	
	ИмяТипаСправочника = ДопСерверныеФункции.ИмяСсылочногоТипа(Ссылка);
	
	Если ИмяТипаСправочника = "Справочник.РеестрМедицинскихОрганизаций" Тогда
		Возврат Ссылка.ПолноеНаименование;
	КонецЕсли;
	
	Если ИмяТипаСправочника = "Справочник.Филиалы" Тогда
		Организация = Ссылка.Организация;
	ИначеЕсли ИмяТипаСправочника = "Справочник.Организации" Тогда
		Организация = Ссылка;
	Иначе
		Возврат "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация.МедицинскаяОрганизация) Тогда
		Возврат Организация.МедицинскаяОрганизация.ПолноеНаименование;
	Иначе
		Возврат Организация.НаименованиеПолное;
	КонецЕсли;
	
КонецФункции

Функция ТаблицаНеОсновныхДиагнозов(ТаблицаДиагнозовПриема)
	
	НозологическаяЕдиницаОсновногоДиагноза = НозологическаяЕдиницаОсновногоДиагноза();
	
	ТаблицаНеОсновныхДиагнозов = ТаблицаДиагнозовПриема.СкопироватьКолонки();
	Для Каждого СтрокаДиагноза Из ТаблицаДиагнозовПриема Цикл
		Если СтрокаДиагноза.ВидНозологическойЕдиницы <> НозологическаяЕдиницаОсновногоДиагноза Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаНеОсновныхДиагнозов.Добавить(), СтрокаДиагноза);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаНеОсновныхДиагнозов;
	
КонецФункции

Функция НозологическаяЕдиницаОсновногоДиагноза()
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидыНозологическихЕдиниц(1);
	
КонецФункции

Функция ЭтоПМОНесовершеннолетнего(КлиентДатаРождения, ДатаДокумента = Неопределено, ТипСобытия)
	
	Если Не РаботаСКлиентами.КлиентЯвляетсяСовершеннолетним(КлиентДатаРождения, ДатаДокумента) И ТипСобытия.УИДЕГИСЗ = 10 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоНеПМОНесовершеннолетнего(КлиентДатаРождения, ДатаДокумента = Неопределено, ТипСобытия)
	
	Если Не РаботаСКлиентами.КлиентЯвляетсяСовершеннолетним(КлиентДатаРождения, ДатаДокумента) И ТипСобытия.УИДЕГИСЗ = 10 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЭтоВторойЭтапДиспансеризацииСовершеннолетнего(КлиентДатаРождения, ДатаДокумента = Неопределено, ТипСобытия)
	
	Если РаботаСКлиентами.КлиентЯвляетсяСовершеннолетним(КлиентДатаРождения, ДатаДокумента) И (ТипСобытия.УИДЕГИСЗ = 25 Или ТипСобытия.УИДЕГИСЗ = 53) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ЭтоНеВторойЭтапДиспансеризацииСовершеннолетнего(КлиентДатаРождения, ДатаДокумента = Неопределено, ТипСобытия)
	
	Если РаботаСКлиентами.КлиентЯвляетсяСовершеннолетним(КлиентДатаРождения, ДатаДокумента) И (ТипСобытия.УИДЕГИСЗ = 25 Или ТипСобытия.УИДЕГИСЗ = 53) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ЕстьОборудование(ТаблицаПараметров, localid)
	
	Для Каждого Оборудование Из ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", localid)) Цикл
		Если ЗначениеЗаполнено(Оборудование.Значение) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьПредставлениеАтрибутаПоLocalid(ЗначениеУзла, Атрибут)
	
	ПредставлениеАтрибута = Неопределено;
	Попытка
		ПредставлениеАтрибутаСтрока = ЗначениеУзла.Атрибуты.Найти(Атрибут, "Ключ");
		Если ПредставлениеАтрибутаСтрока <> Неопределено Тогда
			ПредставлениеАтрибута = ПредставлениеАтрибутаСтрока.Значение;
		КонецЕсли;
	Исключение КонецПопытки;
	
	Возврат ПредставлениеАтрибута;
	
КонецФункции

Функция ЕдиницаИзмеренияВитальногоПараметра(ВитальныйПараметр) Экспорт
	
	Если Не ЗначениеЗаполнено(ВитальныйПараметр)
		Или ДопСерверныеФункции.ИмяСсылочногоТипа(ВитальныйПараметр) <> "Справочник.КлассификаторыМинЗдрава"
	Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЕдиницаИзмерения = ВитальныйПараметр.Атрибуты.Найти("UnitCode", "Ключ");
	Если ЕдиницаИзмерения = Неопределено
		Или Не ЗначениеЗаполнено(ЕдиницаИзмерения.Значение)
	Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	УИДЕГИСЗ = ЕдиницаИзмерения.Значение;
	Если ТипЗнч(УИДЕГИСЗ) = Тип("Строка") Тогда
		ЦифрыСтрокиУИДЕГИСЗ = СтроковыеФункцииКлиентСервер.ПолучитьЦифрыСтроки(УИДЕГИСЗ);
		Если ЗначениеЗаполнено(ЦифрыСтрокиУИДЕГИСЗ) Тогда
			УИДЕГИСЗ = Число(ЦифрыСтрокиУИДЕГИСЗ);
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	ИначеЕсли ТипЗнч(УИДЕГИСЗ) <> Тип("Число") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЕдиницыИзмерения(УИДЕГИСЗ);
	
КонецФункции

Функция ПустоеЗначениеОсобоеУсловие(ВидРЭМД, ТипУзла, ТаблицаПараметров)
	
	Если ВидРЭМД = 158 И ВыпискаСпециализированнаяИлиВысокотехнологичнаяПомощь(ТаблицаПараметров) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ПустоеЗначение(ВидРЭМД, ТипУзла);
КонецФункции

Функция ВыпискаСпециализированнаяИлиВысокотехнологичнаяПомощь(ТаблицаПараметров)
	
	ЦельВрачебнойКомиссии = ТаблицаПараметров.Найти("ЦельПроведенияВрачебнойКомиссии", "localid");
	Если ЗначениеЗаполнено(ЦельВрачебнойКомиссии)
		И ЗначениеЗаполнено(ЦельВрачебнойКомиссии.Значение.УИДЕГИСЗ)
		И (ЦельВрачебнойКомиссии.Значение.УИДЕГИСЗ = 21 Или ЦельВрачебнойКомиссии.Значение.УИДЕГИСЗ = 28)
	Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция НаименованиеОборудования(Оборудование) Экспорт
	
	Если Не ЗначениеЗаполнено(Оборудование)
		Или ДопСерверныеФункции.ИмяСсылочногоТипа(Оборудование) <> "Справочник.МедицинскоеОборудование"
	Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Оборудование.НаименованиеПолное) Тогда
		Возврат Оборудование.НаименованиеПолное;
	ИначеЕсли ЗначениеЗаполнено(Оборудование.Наименование) Тогда
		Возврат Оборудование.Наименование;
	Иначе
		Возврат "—";
	КонецЕсли;
	
КонецФункции

Функция ПустоеЗначениеИННПоТипуДокументаОснования(ВидРЭМД, ТипДокументаОснования)
	
	// Если не заполнено, то секция не сформируется
	Если Не ЗначениеЗаполнено(ТипДокументаОснования) Тогда
		Возврат "NI";
	КонецЕсли;
	
	// identity:INN обязательный
	Если ВидРЭМД = 100 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Для типа документа основания "Договор на оказание платных медицинских услуг" значение из функции
	Если ТипДокументаОснования = 3 Тогда
		Возврат ПустоеЗначение(ВидРЭМД, "ИНН");
	КонецЕсли;
	
	// Для остальных типов оплаты не заполняется
	Возврат "NI";
	
КонецФункции

#КонецОбласти

#КонецОбласти

Функция ПолучитьДанныеПоШаблону(Ссылка, СвойстваЭМД, ДополнительныеПараметры)
	
	ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(Ссылка);
	
	Если ИмяТипаДокумента = "Документ.Прием" Тогда
		ПараметрыШаблона	= ПолучитьСтруктуруТаблицПараметровШаблона();
		ДополнительныеПараметры.ПараметрыШаблона = ПараметрыШаблона;
		
		ТаблицаПараметров	= ПолучитьТаблицуПараметров(Ссылка, ИмяТипаДокумента, ДополнительныеПараметры);
		СтрокаШаблона		= Ссылка.ШаблоныПриема[ДополнительныеПараметры.ИндексШаблона];
		
		Если ДополнительныеПараметры.ШаблонОсмотра.ВидШаблона = Перечисления.ВидыШаблонов.Обработка Тогда
			ТекстHTMLТела	= РаботаСDOMКлиентСервер.ПолучитьКодТелаHTMLИзКодаДокумента(СтрокаШаблона.ТекстДляПечати);
		Иначе
			ДанныеШаблона		 = Новый Структура("Шаблон, ТекстШаблона, ИдентификаторСтрокиШаблона", ДополнительныеПараметры.ШаблонОсмотра, ДополнительныеПараметры.ШаблонОсмотра.ТекстHTML, ДополнительныеПараметры.ИндексШаблона);
			ВерсияШаблона		 = ВерсионированиеШаблонов.ПолучитьВерсиюШаблона(СтрокаШаблона.ШаблонПриема, Ссылка.Дата);
			ДанныеТаблицШаблонов = Новый Структура("ПараметрыТаблицШаблонов, ЭталонныеСтрокиТаблиц", ПараметрыШаблона.ДанныеТаблицШаблоновПриема, РаботаСШаблонамиHTML.ЭталонныеСтрокиТаблиц(ВерсияШаблона.ТекстHTML));
			СтрТекстHTML		 = РаботаСШаблонамиHTMLКлиентСервер.СформироватьВерсиюДляПечатиШаблонаОсмотра(Ссылка, ДанныеШаблона, ПараметрыШаблона.ЗначенияПараметровHTML,,,,, ДанныеТаблицШаблонов, Истина);
			ТекстHTMLТела		 = СтрТекстHTML.ТекстШаблонаТело;
			
			ДополнитьТекстHTML(ТекстHTMLТела, ВерсияШаблона, Ссылка);
		КонецЕсли;
		
		ДокументHTML		= РаботаСDOMКлиентСервер.СоздатьДокументDOM(ТекстHTMLТела);
		
	ИначеЕсли ИмяТипаДокумента = "Документ.ПрохождениеМедосмотра"
		Или ИмяТипаДокумента = "Документ.ВрачебнаяКомиссия" // Версия КОРП
		Или ИмяТипаДокумента = "Документ.Рецепт"
	Тогда
		ТаблицаПараметров	= ПолучитьТаблицуПараметров(Ссылка, ИмяТипаДокумента, ДополнительныеПараметры);
		ДокументHTML		= Неопределено;
	КонецЕсли;
	
	// Дополнение параметрами по РЭМД
	ДополнитьПараметрамиПоРЭМД(СвойстваЭМД.ИдентификаторРЭМД, ТаблицаПараметров, Ссылка, СвойстваЭМД);
	
	Возврат Новый Структура("ТаблицаПараметров, ДокументHTML", ТаблицаПараметров, ДокументHTML)
	
КонецФункции

Процедура ДополнитьПараметрамиПоРЭМД(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка, СвойстваЭМД = Неопределено)
	
	Если ИдентификаторРЭМД = 50 Тогда
		ДополнитьПараметрамиПоРЭМД_50(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка);
	ИначеЕсли ИдентификаторРЭМД = 63 Тогда
		ДополнитьПараметрамиПоРЭМД_63(ИдентификаторРЭМД, ТаблицаПараметров);
	ИначеЕсли ИдентификаторРЭМД = 121 Тогда
		ДополнитьПараметрамиПоРЭМД_121(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка);
	ИначеЕсли ИдентификаторРЭМД = 158 Тогда
		ДополнитьПараметрамиПоРЭМД_158(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка);
	ИначеЕсли ИдентификаторРЭМД = 186 Тогда
		ДополнитьПараметрамиПоРЭМД_186(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка);
	ИначеЕсли ИдентификаторРЭМД = 189 Тогда
		ДополнитьПараметрамиПоРЭМД_189(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка);
	ИначеЕсли ИдентификаторРЭМД = 198 Тогда
		ДополнитьПараметрамиПоРЭМД_198(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка);
	ИначеЕсли ИдентификаторРЭМД = 227 Тогда
		ДополнитьПараметрамиПоРЭМД_227(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка);
	ИначеЕсли ИдентификаторРЭМД = 246 Тогда
		ДополнитьПараметрамиПоРЭМД_246(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка, СвойстваЭМД);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьПараметрамиПоРЭМД_50(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка)
	
	ДанныеЭМД = Новый Соответствие;
	ДополнитьДаннымиОрганизацииДокумента(ДанныеЭМД, Ссылка);
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ДанныеЭМД.Получить("OIDМедицинскойОрганизации"),	"OIDМедицинскойОрганизации_50");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ДанныеЭМД.Получить("ОГРН"),						"ОГРН_50");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ДанныеЭМД.Получить("НаименованиеОрганизации"),	"НаименованиеОрганизации_50");
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ДанныеЭМД.Получить("АдресОрганизации"),			"АдресОрганизации_50");
	
КонецПроцедуры

Процедура ДополнитьПараметрамиПоРЭМД_63(ИдентификаторРЭМД, ТаблицаПараметров)
	
	// Связанные документы
	Для Каждого СтрокаСвязанногоДокумента Из ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", "СвязанныйДокумент")) Цикл
		МедицинскийДокумент = СтрокаСвязанногоДокумента.Значение;
		Если МедицинскийДокумент = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ДопСерверныеФункции.ИмяСсылочногоТипа(МедицинскийДокумент) = "Документ.Прием" Тогда
			Для Каждого СтрокаШаблона Из МедицинскийДокумент.ШаблоныПриема Цикл
				Шаблон = СтрокаШаблона.ШаблонПриема;
				ДополнитьТаблицуДаннымиСвязанногоДокументаПоШаблону(Шаблон, ТаблицаПараметров, МедицинскийДокумент);
			КонецЦикла;
		Иначе
			Шаблон = МедицинскийДокумент.Номенклатура.ВредныйФакторСправки.ШаблонОсмотраСправки;
			ДополнитьТаблицуДаннымиСвязанногоДокументаПоШаблону(Шаблон, ТаблицаПараметров, МедицинскийДокумент);
		КонецЕсли;
	КонецЦикла;
	
	// Договор
	СтрокаДоговора = ТаблицаПараметров.Найти("Договор", "localid");
	Если СтрокаДоговора <> Неопределено И ЗначениеЗаполнено(СтрокаДоговора.Значение) Тогда
		ДополнитьТаблицуДаннымиДоговора(СтрокаДоговора.Значение, ТаблицаПараметров);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьПараметрамиПоРЭМД_121(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка)
	
	ДанныеЭМД = Новый Соответствие;
	ДополнитьДаннымиОрганизацииДокумента(ДанныеЭМД, Ссылка);
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ДанныеЭМД.Получить("АдресОрганизации"), "АдресФилиала");
	
	КонтактыФилиала = ДанныеЭМД.Получить("КонтактыОрганизации");
	Если КонтактыФилиала = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Контакт Из КонтактыФилиала Цикл
		Если СтрНачинаетсяС(Контакт.Значение, "tel:") Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Контакт.Значение, "ТелефонФилиала");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ТипЗнч(Ссылка.Клиент.умцМестоРаботы) <> Тип("Строка") Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, АдресОрганизации(Ссылка.Клиент.умцМестоРаботы), "АдресРаботы");
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьПараметрамиПоРЭМД_158(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка)
	
	// Неактуально. См. файл "Пояснения (разъяснения) к Руководству по реализации СЭМД.docx"
	
	// Удаляем значение даты документа
	//СтрокаДатыДокумента = ТаблицаПараметров.Найти("ДатаДокументаДляОбщихСекций", "localid");
	//Если СтрокаДатыДокумента <> Неопределено Тогда
	//	СтрокаДатыДокумента.Значение = Неопределено;
	//КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьПараметрамиПоРЭМД_186(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка)
	
	УникальноеОборудование = Новый Массив;
	Для Каждого СтрокаОборудования Из ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", "ИспользуемоеОборудование")) Цикл
		Если ЗначениеЗаполнено(СтрокаОборудования.Значение)
			И УникальноеОборудование.Найти(СтрокаОборудования.Значение) = Неопределено
		Тогда
			УникальноеОборудование.Добавить(СтрокаОборудования.Значение);
			ДополнитьТаблицуПараметров(ТаблицаПараметров, СтрокаОборудования.Значение, "ОборудованиеИнструментальногоИсследования");
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаУслуги Из ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", "ВыполненнаяМедицинскаяУслуга")) Цикл
		
		Если СтрокаУслуги.Параметр <> Неопределено Тогда
			ГруппирующееПоле	= СтрокаУслуги.Параметр;
			ИдентификаторСтроки	= СтрокаУслуги.ИдентификаторСтроки;
		Иначе
			// Константа
			ГруппирующееПоле	= ТаблицаПараметров.Индекс(СтрокаУслуги);
			ИдентификаторСтроки	= Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИдентификаторСтроки) Тогда
			ПараметрыДатыТекущейУслуги = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid, ГруппирующееПоле, ИдентификаторСтроки", "ДатаВыполненнойМедицинскойУслуги", ГруппирующееПоле, ИдентификаторСтроки));
		Иначе
			ПараметрыДатыТекущейУслуги = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid, ГруппирующееПоле", "ДатаВыполненнойМедицинскойУслуги", ГруппирующееПоле));
		КонецЕсли;
		
		Если ПараметрыДатыТекущейУслуги.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДатаОказанияУслуги = ПараметрыДатыТекущейУслуги[0].Значение;
		ДополнитьТаблицуПараметров(ТаблицаПараметров, СтрокаУслуги.Значение, "ОказаннаяУслуга");
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ДатаОказанияУслуги, "ДатаОказанияУслуги", Новый Структура("ГруппирующееПоле", ТаблицаПараметров.Количество() - 1));
	КонецЦикла;
	
КонецПроцедуры

Процедура ДополнитьПараметрамиПоРЭМД_189(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка)
	
	// Не заставляем пользователя заполнять булевы значения вручную если можем определить сами по коду
	СтрокаПремедикация = ТаблицаПараметров.Найти("ОписаниеПроведеннойПремедикации", "localid"); 
	Если СтрокаПремедикация <> Неопределено И ЗначениеЗаполнено(СтрокаПремедикация.Значение) Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Истина, "ПремедикацияПроведена");
	Иначе
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Ложь, "ПремедикацияПроведена");
	КонецЕсли;
	
	СтрокаАнтибиотикопрофилактика = ТаблицаПараметров.Найти("ОписаниеПериоперационнойАнтибиотикопрофилактики", "localid"); 
	Если СтрокаАнтибиотикопрофилактика <> Неопределено И ЗначениеЗаполнено(СтрокаАнтибиотикопрофилактика.Значение) Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Истина, "ПериоперационнаяАнтибиотикопрофилактикаПроведена");
	Иначе
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Ложь, "ПериоперационнаяАнтибиотикопрофилактикаПроведена");
	КонецЕсли;
	
	// Считаем количество услуг сами
	КоличествоОказанныхУслуг = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", "ОказаннаяУслуга")).Количество();
	ДополнитьТаблицуПараметров(ТаблицаПараметров, КоличествоОказанныхУслуг, "КоличествоОказанныхУслуг");
	
	// В зависимости от типа параметра ХирургическаяОперация заполняем связанные реквизиты
	СтрокаХирургическаяОперация = ТаблицаПараметров.Найти("ХирургическаяОперация", "localid"); 
	Если СтрокаХирургическаяОперация <> Неопределено И ЗначениеЗаполнено(СтрокаХирургическаяОперация.Значение) Тогда
		Операция = СтрокаХирургическаяОперация.Значение;
		Если ПараметрУказанногоТипа(Операция, "СправочникСсылка.НоменклатураМедицинскихУслуг") Тогда
			
			НаименованиеУслуги = ?(ЗначениеЗаполнено(Операция.ПолноеНаименование), Операция.ПолноеНаименование, Операция.Наименование);
			ДополнитьТаблицуПараметров(ТаблицаПараметров, НаименованиеУслуги, "НаименованиеХирургическойОперации");
			
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Операция, "ХирургическаяОперация");
			
		ИначеЕсли ПараметрУказанногоТипа(Операция, "Строка") Тогда
			
			// Из-за того, что "ХирургическаяОперация" строка, в code подставится nullFlavor="OTH"
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Операция, "ХирургическаяОперация");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Операция, "НаименованиеХирургическойОперации");
			
		КонецЕсли;
	КонецЕсли;
	
	// Дополняем общие секции performer
	Для Каждого СтрокаЧленаБригады Из ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", "ЧленОперационнойБригады")) Цикл
		ЧленБригады = СтрокаЧленаБригады.Значение;
		
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ЧленБригады, "ЧленКомиссии");
		
		// Ищем должность в таблице параметров
		ДолжностьЧленаМедкомиссии = Неопределено;
		СтрокиДолжностей = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid, ГруппирующееПоле", "ДолжностьЧленаОперационнойБригады", СтрокаЧленаБригады.Параметр));
		// Добавить учет констант в группирующих полях
		Если СтрокиДолжностей.Количество() <> 0 Тогда
			ДолжностьЧленаМедкомиссии = СтрокиДолжностей[0].Значение;
		КонецЕсли;
		
		// Дополнительный поиск для констант
		Если ДолжностьЧленаМедкомиссии = Неопределено Тогда
			СтрокиДолжностей = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid, ГруппирующееПоле", "ДолжностьЧленаОперационнойБригады", ТаблицаПараметров.Индекс(СтрокаЧленаБригады)));
			Если СтрокиДолжностей.Количество() <> 0 Тогда
				ДолжностьЧленаМедкомиссии = СтрокиДолжностей[0].Значение;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДолжностьЧленаМедкомиссии) Тогда
			Продолжить;
		КонецЕсли;
		
		// Ищем роль в таблице параметров
		РольЧленаКомиссии = Неопределено;
		СтрокиРолей = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid, ГруппирующееПоле", "РольЧленаОперационнойБригады", СтрокаЧленаБригады.Параметр));
		// Добавить учет констант в группирующих полях
		Если СтрокиРолей.Количество() <> 0 Тогда
			РольЧленаКомиссии = СтрокиРолей[0].Значение;
		КонецЕсли;
		
		// Дополнительный поиск для констант
		Если РольЧленаКомиссии = Неопределено Тогда
			СтрокиДолжностей = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid, ГруппирующееПоле", "РольЧленаОперационнойБригады", ТаблицаПараметров.Индекс(СтрокаЧленаБригады)));
			Если СтрокиДолжностей.Количество() <> 0 Тогда
				РольЧленаКомиссии = СтрокиДолжностей[0].Значение;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(РольЧленаКомиссии) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураЗаполнения = Новый Структура();
		СтруктураЗаполнения.Вставить("ГруппирующееПоле", ТаблицаПараметров.Количество() - 1);
		
		ДополнитьТаблицуПараметров(ТаблицаПараметров, РольЧленаКомиссии,								"РольСотрудникаЧленаМедкомиссииПриПодписанииМД", СтруктураЗаполнения);
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Строка(ЧленБригады.УникальныйИдентификатор()),	"УИДЧленаМедкомиссии",							 СтруктураЗаполнения);
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ДолжностьЧленаМедкомиссии,						"ДолжностьЧленаМедкомиссии",					 СтруктураЗаполнения);
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ПолучитьРабочуюПочту(ЧленБригады),				"КонтактыЧленаМедкомиссии",						 СтруктураЗаполнения);
		
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ЧленБригады.Фамилия,	 "ФамилияЧленаМедкомиссии",	 СтруктураЗаполнения);
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ЧленБригады.Имя,		 "ИмяЧленаМедкомиссии",		 СтруктураЗаполнения);
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ЧленБригады.Отчество, "ОтчествоЧленаМедкомиссии", СтруктураЗаполнения);
	КонецЦикла;
	
	// Дополняем данными о дате начала и дате окончания документированного события
	ДатаНачалаОперации = Неопределено;
	
	СтрокаДатаНачала = ТаблицаПараметров.Найти("ДатаНачалаОперации", "localid"); 
	Если СтрокаДатаНачала <> Неопределено И ЗначениеЗаполнено(СтрокаДатаНачала.Значение) Тогда
		ДатаНачалаОперации = ИнтеграцияЕГИСЗСервер.ПредставлениеЛокальнойДатыСоСмещением(СтрокаДатаНачала.Значение, "ДФ=ггггММддЧЧмм");
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ДатаНачалаОперации, "ДатаНачалаСобытия");
	КонецЕсли;
	
	СтрокаДатаОкончания = ТаблицаПараметров.Найти("ДатаОкончанияОперации", "localid"); 
	Если СтрокаДатаОкончания <> Неопределено И ЗначениеЗаполнено(СтрокаДатаОкончания.Значение) Тогда
		ДатаОкончанияОперации = ИнтеграцияЕГИСЗСервер.ПредставлениеЛокальнойДатыСоСмещением(СтрокаДатаОкончания.Значение, "ДФ=ггггММддЧЧмм");
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ДатаОкончанияОперации, "ДатаОкончанияСобытия");
	// Постраховка если дата окончания не заполнена, чтобы не подставлялась дата документа (избежать отрицательной длительности операции)
	ИначеЕсли ДатаНачалаОперации <> Неопределено Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, ДатаНачалаОперации, "ДатаОкончанияСобытия");
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ДополнитьПараметрамиПоРЭМД_198(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка)
	
	ДобавитьПорядковыйНомерИИдентификаторВитальныхПараметров(ТаблицаПараметров);
	
КонецПроцедуры

Процедура ДополнитьПараметрамиПоРЭМД_246(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка, СвойстваЭМД)
	
	ДобавитьПорядковыйНомерИИдентификаторВитальныхПараметров(ТаблицаПараметров);
	ДобавитьИдентификаторыКомпонентов(ТаблицаПараметров, СвойстваЭМД);
	
КонецПроцедуры

Процедура ДополнитьПараметрамиПоРЭМД_227(ИдентификаторРЭМД, ТаблицаПараметров, Ссылка)
	
	ДобавитьПорядковыйНомерИИдентификаторВитальныхПараметров(ТаблицаПараметров);
	
КонецПроцедуры

Процедура ДополнитьТаблицуДаннымиСвязанногоДокументаПоШаблону(Шаблон, ТаблицаПараметров, МедицинскийДокумент)
	
	Если Не ЗначениеЗаполнено(Шаблон.ВидДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСвязанногоДокумента = Новый Структура("ВидСЭМД, ВидРЭМД, ДатаДокумента, Серия, Номер, Ссылка");
	ДанныеСвязанногоДокумента.ВидРЭМД = Шаблон.ВидДокумента;
	ДанныеСвязанногоДокумента.ВидСЭМД = Шаблон.ВидДокумента.ВидДокумента;
	ДанныеСвязанногоДокумента.ДатаДокумента = ИнтеграцияЕГИСЗСервер.ПредставлениеЛокальнойДатыСоСмещением(МедицинскийДокумент.Дата, "ДФ=ггггММддЧЧмм");
	ДанныеСвязанногоДокумента.Номер = МедицинскийДокумент.Номер;
	ДанныеСвязанногоДокумента.Ссылка = МедицинскийДокумент;
	
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ДанныеСвязанногоДокумента, "ДанныеСвязанногоДокумента");
	
КонецПроцедуры

Процедура ДополнитьТаблицуДаннымиДоговора(Договор, ТаблицаПараметров)
	
	Если ДопСерверныеФункции.ИмяСсылочногоТипа(Договор) = "Документ.ДоговорСКлиентом" Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Договор, "ДоговорСКлиентом");
	ИначеЕсли ДопСерверныеФункции.ИмяСсылочногоТипа(Договор) = "Справочник.СоглашенияСтрахования" Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Договор, "ДоговорСКонтрагентом");
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Договор.Владелец, "Контрагент");
	КонецЕсли;
	
КонецПроцедуры

Функция ДополнительныеДанныеДляФормированияСЭМД(ИдентификаторРЭМД)
	
	ДополнительныеДанные = Новый Структура;
	ДополнительныеДанные.Вставить("ВидРЭМД", Строка(ИдентификаторРЭМД));
	ДополнительныеДанные.Вставить("КорректныеCodeSystem", ПолучитьКорректныеCodeSystem(Строка(ИдентификаторРЭМД)));
	ДополнительныеДанные.Вставить("ФиксированныеВерсииКлассификаторов", ПолучитьФиксированныеВерсииКлассификаторов(Строка(ИдентификаторРЭМД)));
	
	Возврат ДополнительныеДанные;
	
КонецФункции

Функция ПолучитьФиксированныеВерсииКлассификаторов(ВидРЭМД)
	
	ТабДокФиксированныеВерсии = Справочники.РегистрируемыеЭлектронныеМедДокументы.ПолучитьМакет("ФиксированныеВерсииКлассификаторов");
	
	Если ТабДокФиксированныеВерсии.Области.Найти(СтрШаблон("ВидРЭМД_%1", ВидРЭМД)) = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.Вывести(ТабДокФиксированныеВерсии.ПолучитьОбласть("Шапка"));
	ТабДокумент.Вывести(ТабДокФиксированныеВерсии.ПолучитьОбласть(СтрШаблон("ВидРЭМД_%1", ВидРЭМД)));
	
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабДокумент.Область(1, 1, ТабДокумент.ВысотаТаблицы, ТабДокумент.ШиринаТаблицы));
	ПостроительОтчета.Выполнить();
	
	ФиксированныеВерсииКлассификаторов = ПостроительОтчета.Результат.Выгрузить();
	ФиксированныеВерсииКлассификаторов.Колонки.Добавить("Идентификаторы", Новый ОписаниеТипов("Массив"));
	
	Для Каждого СтрокаФиксированныхВерсий Из ФиксированныеВерсииКлассификаторов Цикл
		ИдентификаторыКлассификаторов = Новый Массив;
		Для Каждого Идентификатор Из СтрРазделить(СтрокаФиксированныхВерсий.ИдентификаторыСтрокой, ",", Ложь) Цикл
			Попытка
				ИдентификаторыКлассификаторов.Добавить(Число(СокрЛП(Идентификатор)));
			Исключение КонецПопытки;
		КонецЦикла;
		СтрокаФиксированныхВерсий.Идентификаторы = ИдентификаторыКлассификаторов;
	КонецЦикла;
	
	ФиксированныеВерсииКлассификаторов.Колонки.Удалить("ВидРЭМД");
	ФиксированныеВерсииКлассификаторов.Колонки.Удалить("ИдентификаторыСтрокой");
	
	Возврат ФиксированныеВерсииКлассификаторов;
	
КонецФункции

Функция ПолучитьАтрибутыФиксированнойВерсииКлассификатора(Ссылка, ДанныеДляУзлаКлассификатора)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ФиксированныеВерсииКлассификаторов = ДанныеДляУзлаКлассификатора.ДополнительныеДанные.ФиксированныеВерсииКлассификаторов;
	Если ФиксированныеВерсииКлассификаторов = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		УИДЕГИСЗ = Ссылка.УИДЕГИСЗ;
		OIDКлассификатора = Ссылка.OIDСправочникаИсточника;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	СтрокиФиксированнойВерсии = ФиксированныеВерсииКлассификаторов.НайтиСтроки(Новый Структура("Классификатор", OIDКлассификатора));
	Если СтрокиФиксированнойВерсии.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВерсияКлассификатора = СтрокиФиксированнойВерсии[0].Версия;
	
	НЗ = РегистрыСведений.НаименованияЭлементовФиксированныхВерсийКлассификаторовЕГИСЗ.СоздатьНаборЗаписей();
	НЗ.Отбор.УИДЕГИСЗ.Установить(УИДЕГИСЗ);
	НЗ.Отбор.OIDКлассификатора.Установить(OIDКлассификатора);
	НЗ.Отбор.ВерсияКлассификатора.Установить(ВерсияКлассификатора);
	НЗ.Прочитать();
	Если НЗ.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеВерсииКлассификатора = ИнтеграцияЕГИСЗСервер.ДанныеВерсииКлассификатора(OIDКлассификатора, ВерсияКлассификатора);
	
	АтрибутыФиксированнойВерсииКлассификатора = Новый Структура;
	АтрибутыФиксированнойВерсииКлассификатора.Вставить("version", ВерсияКлассификатора);
	АтрибутыФиксированнойВерсииКлассификатора.Вставить("name", НЗ[0].Наименование);
	АтрибутыФиксированнойВерсииКлассификатора.Вставить("codesystemname", ДанныеВерсииКлассификатора.Наименование);
	
	Возврат АтрибутыФиксированнойВерсииКлассификатора;
	
КонецФункции

Функция ЗаполняетсяПоДаннымДокумента(СтрокаLocalid, Шаблон)
	
	Если Шаблон.ЗаполнятьДиагнозыИзТабличнойЧасти Тогда
		Возврат СтрокаLocalid.Свойство("ИсточникЗаполнения") И СтрокаLocalid.ИсточникЗаполнения = ИсточникЗаполненияПоДиагнозам();
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ЗаполнитьТаблицуПараметровПоРецепту(ТаблицаПараметров, Ссылка, СоответствияПараметрам)
	
	Если Ссылка.ФормаРецепта = Перечисления.ФормыРецептов.Форма107_1_у Тогда
		ЗаполнитьТаблицуПараметровПоРецепту107_1_у(ТаблицаПараметров, Ссылка, СоответствияПараметрам);
	ИначеЕсли Ссылка.ФормаРецепта = Перечисления.ФормыРецептов.Форма148_1_у_04_л Тогда
		ЗаполнитьТаблицуПараметровПоРецепту148_1_у_04_л(ТаблицаПараметров, Ссылка, СоответствияПараметрам);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуПараметровПоРецепту107_1_у(ТаблицаПараметров, Ссылка, СоответствияПараметрам)
	
	ЕдиницаИзмеренияСуткиПоКлассификатору = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(24, Перечисления.ВидыКлассификаторовМинЗдрава.ЕдиницыИзмерения);
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ЕдиницаИзмеренияСуткиПоКлассификатору, "ЕдиницаИзмеренияСуткиПоКлассификатору");
	
	Срочность = Неопределено;
	Если Ссылка.Срочность = "cito" Тогда
		Срочность = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(1, Перечисления.ВидыКлассификаторовМинЗдрава.ПриоритетИсполненияРецепта);
	ИначеЕсли Ссылка.Срочность = "statim" Тогда
		Срочность = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(2, Перечисления.ВидыКлассификаторовМинЗдрава.ПриоритетИсполненияРецепта);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Срочность) Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Срочность, "ПриоритетИсполненияРецепта");
	КонецЕсли;
	
	Если Ссылка.ПоСпециальномуНазначению Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Истина, "СпециальноеНазначение");
	Иначе
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Ложь, "СпециальноеНазначение");
	КонецЕсли;
	
	// Вычислим срок действия рецепта в днях по кодам
	СрокДействияРецептаВДнях = 0;
	СрокДействияРецепта = Неопределено;
	СрокДействияРецептаВДнях = Ссылка.Срок * 30;
	Если СрокДействияРецептаВДнях = 60 Тогда
		СрокДействияРецепта = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(3, Перечисления.ВидыКлассификаторовМинЗдрава.СрокДействияРецепта);
	ИначеЕсли СрокДействияРецептаВДнях = 90 Тогда
		СрокДействияРецепта = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(4, Перечисления.ВидыКлассификаторовМинЗдрава.СрокДействияРецепта);
	Иначе
		// До 1 года
		СрокДействияРецепта = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(5, Перечисления.ВидыКлассификаторовМинЗдрава.СрокДействияРецепта);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СрокДействияРецептаВДнях) Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Дата + СрокДействияРецептаВДнях * 86400, "ДатаОкончанияДействияРецепта");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СрокДействияРецепта) Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, СрокДействияРецепта, "СрокДействияРецепта");
	КонецЕсли;
	
	// Заполнение данных по первой номенклатуре
	Если ЗначениеЗаполнено(Ссылка.Номенклатура1) Тогда
		
		Если ТипЗнч(Ссылка.Номенклатура1) = Тип("СправочникСсылка.СправочникМеждународныхНепатентованныхНаименований") Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Номенклатура1, "ЛекарственныйПрепарат1");
		ИначеЕсли ТипЗнч(Ссылка.Номенклатура1) = Тип("СправочникСсылка.Номенклатура") Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Номенклатура1.Наименование, "ЛекарственныйПрепаратСтрокой1");
		ИначеЕсли ТипЗнч(Ссылка.Номенклатура1) = Тип("Строка") Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Номенклатура1, "ЛекарственныйПрепаратСтрокой1");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.СколькоДней1) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.СколькоДней1, "ДлительностьПриемаПрепарата1");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.ПутьВведенияПрепарата1) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.ПутьВведенияПрепарата1, "ПутьВведенияПрепарата1");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.РазВДень1) Тогда
			ЧастотаПриемаПрепарата1 = Окр(1 / Ссылка.РазВДень1, 4, РежимОкругления.Окр15как10);
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ЧастотаПриемаПрепарата1, "ЧастотаПриемаПрепарата1");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.Количество1)
			И ЗначениеЗаполнено(Ссылка.ЕдИзмПоКлассификатору1)
		Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Количество1, "РазоваяДозаПрепарата1");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.ЕдИзмПоКлассификатору1, "ЕдиницаИзмеренияДозыПрепарата1");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.РазВДень1)
			И ЗначениеЗаполнено(Ссылка.СколькоДней1)
		Тогда
			КоличествоНазначенныхДоз1 = Ссылка.РазВДень1 * Ссылка.СколькоДней1;
			ДополнитьТаблицуПараметров(ТаблицаПараметров, КоличествоНазначенныхДоз1, "КоличествоНазначенныхДоз1");
		КонецЕсли;
		
		ОсобыеУказания1 = "";
		
		Если ЗначениеЗаполнено(Ссылка.СпособПрименения1) Тогда
			ОсобыеУказания1 = ОсобыеУказания1 + "Способ применения:" + Символы.ПС + Ссылка.СпособПрименения1 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.Дозировка1) Тогда
			ОсобыеУказания1 = ОсобыеУказания1 + "Дозировка:" + Символы.ПС + Ссылка.Дозировка1 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.ВремяПриемаОтносительноЕды1) Тогда
			ОсобыеУказания1 = ОсобыеУказания1 + "Время приема относительно еды:" + Символы.ПС + Ссылка.ВремяПриемаОтносительноЕды1 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.ВремяПриемаОтносительноСна1) Тогда
			ОсобыеУказания1 = ОсобыеУказания1 + "Время приема относительно сна:" + Символы.ПС + Ссылка.ВремяПриемаОтносительноСна1 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.Дополнение1) Тогда
			ОсобыеУказания1 = ОсобыеУказания1 + "Дополнительно:" + Символы.ПС + Ссылка.Дополнение1 + Символы.ПС;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОсобыеУказания1) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ОсобыеУказания1, "ОсобыеУказания1");
		КонецЕсли;
	КонецЕсли;
	
	// Заполнение данных по второй номенклатуре
	Если ЗначениеЗаполнено(Ссылка.Номенклатура2) Тогда
		
		Если ТипЗнч(Ссылка.Номенклатура2) = Тип("СправочникСсылка.СправочникМеждународныхНепатентованныхНаименований") Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Номенклатура2, "ЛекарственныйПрепарат2");
		ИначеЕсли ТипЗнч(Ссылка.Номенклатура2) = Тип("СправочникСсылка.Номенклатура") Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Номенклатура2.Наименование, "ЛекарственныйПрепаратСтрокой2");
		ИначеЕсли ТипЗнч(Ссылка.Номенклатура2) = Тип("Строка") Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Номенклатура2, "ЛекарственныйПрепаратСтрокой2");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.СколькоДней2) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.СколькоДней2, "ДлительностьПриемаПрепарата2");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.ПутьВведенияПрепарата2) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.ПутьВведенияПрепарата2, "ПутьВведенияПрепарата2");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.РазВДень2) Тогда
			ЧастотаПриемаПрепарата2 = Окр(1 / Ссылка.РазВДень2, 4, РежимОкругления.Окр15как10);
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ЧастотаПриемаПрепарата2, "ЧастотаПриемаПрепарата2");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.Количество2)
			И ЗначениеЗаполнено(Ссылка.ЕдИзмПоКлассификатору2)
		Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Количество2, "РазоваяДозаПрепарата2");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.ЕдИзмПоКлассификатору2, "ЕдиницаИзмеренияДозыПрепарата2");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.РазВДень2)
			И ЗначениеЗаполнено(Ссылка.СколькоДней2)
		Тогда
			КоличествоНазначенныхДоз2 = Ссылка.РазВДень2 * Ссылка.СколькоДней2;
			ДополнитьТаблицуПараметров(ТаблицаПараметров, КоличествоНазначенныхДоз2, "КоличествоНазначенныхДоз2");
		КонецЕсли;
		
		ОсобыеУказания2 = "";
		
		Если ЗначениеЗаполнено(Ссылка.СпособПрименения2) Тогда
			ОсобыеУказания2 = ОсобыеУказания2 + "Способ применения:" + Символы.ПС + Ссылка.СпособПрименения2 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.Дозировка2) Тогда
			ОсобыеУказания2 = ОсобыеУказания2 + "Дозировка:" + Символы.ПС + Ссылка.Дозировка2 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.ВремяПриемаОтносительноЕды2) Тогда
			ОсобыеУказания2 = ОсобыеУказания2 + "Время приема относительно еды:" + Символы.ПС + Ссылка.ВремяПриемаОтносительноЕды2 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.ВремяПриемаОтносительноСна2) Тогда
			ОсобыеУказания2 = ОсобыеУказания2 + "Время приема относительно сна:" + Символы.ПС + Ссылка.ВремяПриемаОтносительноСна2 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.Дополнение2) Тогда
			ОсобыеУказания2 = ОсобыеУказания2 + "Дополнительно:" + Символы.ПС + Ссылка.Дополнение2 + Символы.ПС;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОсобыеУказания2) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ОсобыеУказания2, "ОсобыеУказания2");
		КонецЕсли;
	КонецЕсли;
	
	// Заполнение данных по третьей номенклатуре
	Если ЗначениеЗаполнено(Ссылка.Номенклатура3) Тогда
		
		Если ТипЗнч(Ссылка.Номенклатура3) = Тип("СправочникСсылка.СправочникМеждународныхНепатентованныхНаименований") Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Номенклатура3, "ЛекарственныйПрепарат3");
		ИначеЕсли ТипЗнч(Ссылка.Номенклатура3) = Тип("СправочникСсылка.Номенклатура") Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Номенклатура3.Наименование, "ЛекарственныйПрепаратСтрокой3");
		ИначеЕсли ТипЗнч(Ссылка.Номенклатура3) = Тип("Строка") Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Номенклатура3, "ЛекарственныйПрепаратСтрокой3");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.СколькоДней3) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.СколькоДней3, "ДлительностьПриемаПрепарата3");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.ПутьВведенияПрепарата3) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.ПутьВведенияПрепарата3, "ПутьВведенияПрепарата3");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.РазВДень3) Тогда
			ЧастотаПриемаПрепарата3 = Окр(1 / Ссылка.РазВДень3, 4, РежимОкругления.Окр15как10);
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ЧастотаПриемаПрепарата3, "ЧастотаПриемаПрепарата3");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.Количество3)
			И ЗначениеЗаполнено(Ссылка.ЕдИзмПоКлассификатору3)
		Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Количество3, "РазоваяДозаПрепарата3");
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.ЕдИзмПоКлассификатору2, "ЕдиницаИзмеренияДозыПрепарата3");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.РазВДень3)
			И ЗначениеЗаполнено(Ссылка.СколькоДней3)
		Тогда
			КоличествоНазначенныхДоз3 = Ссылка.РазВДень3 * Ссылка.СколькоДней3;
			ДополнитьТаблицуПараметров(ТаблицаПараметров, КоличествоНазначенныхДоз3, "КоличествоНазначенныхДоз3");
		КонецЕсли;
		
		ОсобыеУказания3 = "";
		
		Если ЗначениеЗаполнено(Ссылка.СпособПрименения3) Тогда
			ОсобыеУказания3 = ОсобыеУказания3 + "Способ применения:" + Символы.ПС + Ссылка.СпособПрименения3 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.Дозировка3) Тогда
			ОсобыеУказания3 = ОсобыеУказания3 + "Дозировка:" + Символы.ПС + Ссылка.Дозировка3 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.ВремяПриемаОтносительноЕды3) Тогда
			ОсобыеУказания3 = ОсобыеУказания3 + "Время приема относительно еды:" + Символы.ПС + Ссылка.ВремяПриемаОтносительноЕды3 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.ВремяПриемаОтносительноСна3) Тогда
			ОсобыеУказания3 = ОсобыеУказания3 + "Время приема относительно сна:" + Символы.ПС + Ссылка.ВремяПриемаОтносительноСна3 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.Дополнение3) Тогда
			ОсобыеУказания3 = ОсобыеУказания3 + "Дополнительно:" + Символы.ПС + Ссылка.Дополнение3 + Символы.ПС;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОсобыеУказания3) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ОсобыеУказания3, "ОсобыеУказания3");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьТекстHTML(ТекстHTMLТела, ВерсияШаблона, Ссылка)
	
	Если ВерсияШаблона.ЗаполнятьДиагнозыИзТабличнойЧасти Тогда
		ДополнитьТекстHTMLПоТЧДиагнозов(ТекстHTMLТела, ВерсияШаблона, Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьТекстHTMLПоТЧДиагнозов(ТекстHTMLТела, ВерсияШаблона, Ссылка)
	
	ТаблицаДиагнозовПриема = ПолучитьТаблицуДиагнозовПоТабличнойЧасти(Ссылка);
	
	Если ТаблицаДиагнозовПриема.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ДокументXML = ПолучитьXML(ПолучитьМакетСправочникаПоВидуДокумента(ВерсияШаблона.ВидДокумента));
		УзлыОписанияДиагнозов = ДокументXML.ПолучитьЭлементыПоИмени("bitDiagnosis");
	Исключение
		Возврат;
	КонецПопытки;
	
	Если УзлыОписанияДиагнозов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаголовкиКолонок = Новый Массив;
	ДополнитьЗаголовкиКолонокТаблицыДиагнозов(ЗаголовкиКолонок, ТаблицаДиагнозовПриема, "Диагноз",					"Диагноз");
	ДополнитьЗаголовкиКолонокТаблицыДиагнозов(ЗаголовкиКолонок, ТаблицаДиагнозовПриема, "ВидНозологическойЕдиницы",	"Вид нозологической единицы");
	ДополнитьЗаголовкиКолонокТаблицыДиагнозов(ЗаголовкиКолонок, ТаблицаДиагнозовПриема, "Описание",					"Описание");
	ДополнитьЗаголовкиКолонокТаблицыДиагнозов(ЗаголовкиКолонок, ТаблицаДиагнозовПриема, "СтепеньОбоснованности",	"Степень обоснованности");
	ДополнитьЗаголовкиКолонокТаблицыДиагнозов(ЗаголовкиКолонок, ТаблицаДиагнозовПриема, "УточнениеХарактера",		"Уточнение характера");
	
	ТаблицыДиагнозовHTML = Новый Массив;
	
	Для Каждого УзелСтруктурыДиагноза Из УзлыОписанияДиагнозов[0].ДочерниеУзлы Цикл
		АтрибутСекции = УзелСтруктурыДиагноза.ПолучитьАтрибут("Секция");
		Если Не ЗначениеЗаполнено(АтрибутСекции) Тогда
			Продолжить;
		КонецЕсли;
		
		АтрибутОтбора = УзелСтруктурыДиагноза.ПолучитьАтрибут("Отбор");
		ТаблицаНеобходимыхДиагнозов = ПолучитьТаблицуНеобходимыхДиагнозовПоОтбору(ТаблицаДиагнозовПриема.Скопировать(), АтрибутОтбора);
		Если ТаблицаНеобходимыхДиагнозов.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокиТаблицыHTML = Новый Массив;
		
		ЯчейкиСтрокиЗаголовка = Новый Массив;
		Для Каждого СтруктураЗаголовка Из ЗаголовкиКолонок Цикл
			ЯчейкиСтрокиЗаголовка.Добавить(СтрШаблон("<th>%1</th>", СтруктураЗаголовка.Заголовок));
		КонецЦикла;
		СтрокиТаблицыHTML.Добавить(СтрШаблон("<tr>%1</tr>", СтрСоединить(ЯчейкиСтрокиЗаголовка, "")));
		
		Для Каждого СтрокаДиагноза Из ТаблицаНеобходимыхДиагнозов Цикл
			ЯчейкиСтрокиДиагноза = Новый Массив;
			Для Каждого СтруктураЗаголовка Из ЗаголовкиКолонок Цикл
				ЯчейкиСтрокиДиагноза.Добавить(СтрШаблон("<td>%1</td>", СтрокаДиагноза[СтруктураЗаголовка.ИмяКолонки]));
			КонецЦикла;
			СтрокиТаблицыHTML.Добавить(СтрШаблон("<tr>%1</tr>", СтрСоединить(ЯчейкиСтрокиДиагноза, "")));
		КонецЦикла;
		
		ТаблицыДиагнозовHTML.Добавить(СтрШаблон("<div data-bit-sectionname='%1'><table><tbody>%2</tbody></table></div>", АтрибутСекции, СтрСоединить(СтрокиТаблицыHTML, "")));
	КонецЦикла;
	
	Если ТаблицыДиагнозовHTML.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM(ТекстHTMLТела);
	Для Каждого ТаблицаДиагнозовHTML Из ТаблицыДиагнозовHTML Цикл
		РаботаСDOMКлиентСервер.ДобавитьПроизвольныйHTMLВЭлемент(ДокументHTML.Тело, ТаблицаДиагнозовHTML);
	КонецЦикла;
	
	ТекстHTMLТела = РаботаСDOMКлиентСервер.ПолучитьКодТелаHTMLИзДокументаDOM(ДокументHTML);
	
КонецПроцедуры

Процедура ДополнитьЗаголовкиКолонокТаблицыДиагнозов(ЗаголовкиКолонок, ТаблицаДиагнозов, ИмяКолонки, Заголовок)
	
	Если ТаблицаДиагнозов.Колонки.Найти(ИмяКолонки) <> Неопределено Тогда
		ЗаголовкиКолонок.Добавить(Новый Структура("ИмяКолонки, Заголовок", ИмяКолонки, Заголовок));
	КонецЕсли;
	
КонецПроцедуры

Функция СоответствиеСодержитКлюч(Соответствие, Ключ)
	
	Если ТипЗнч(Соответствие) <> Тип("Соответствие") Тогда
		Возврат Ложь;
	ИначеЕсли Соответствие.Получить(Ключ) <> Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	КоличествоЭлементов = Соответствие.Количество();
	Соответствие.Вставить(Ключ, Неопределено);
	
	Если Соответствие.Количество() > КоличествоЭлементов Тогда
		Соответствие.Удалить(Ключ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьСлужебныеАтрибутыТела()
	
	СлужебныеАтрибуты = Новый Массив;
	СлужебныеАтрибуты.Добавить("localid");
	СлужебныеАтрибуты.Добавить("localidСиноним");
	СлужебныеАтрибуты.Добавить("ВозможноЗаполнениеИзТаблицыДиагнозов");
	СлужебныеАтрибуты.Добавить("ДопустимыеЗначения");
	СлужебныеАтрибуты.Добавить("Классификация");
	СлужебныеАтрибуты.Добавить("Множественное");
	СлужебныеАтрибуты.Добавить("НеОтображатьВШаблоне");
	СлужебныеАтрибуты.Добавить("Обязательное");
	СлужебныеАтрибуты.Добавить("ПустоеЗначение");
	СлужебныеАтрибуты.Добавить("Синоним");
	СлужебныеАтрибуты.Добавить("СохранятьДочерниеУзлы");
	СлужебныеАтрибуты.Добавить("СохранятьТипПриПустомЗначении");
	СлужебныеАтрибуты.Добавить("ТипДанных");
	СлужебныеАтрибуты.Добавить("УсловиеИспользования");
	СлужебныеАтрибуты.Добавить("УсловиеОбязательное");
	СлужебныеАтрибуты.Добавить("Формат");
	
	Возврат СлужебныеАтрибуты;
	
КонецФункции

Функция ИсточникОплатыПМОПоДоговоруСКлиентом(ПМО)
	
	Возврат ТипЗнч(ПМО.ВидПолиса) = Тип("ДокументСсылка.ДоговорСКлиентом");
	
КонецФункции

Процедура СформироватьФорматнуюСтрокуПоТипуУзла(ФорматнаяСтрока, Узел);
	
	Если ТипЗнч(Узел) <> Тип("ЭлементDOM") Тогда
		Возврат;
	КонецЕсли;
	
	АтрибутТипа = Узел.ПолучитьАтрибут("http://www.w3.org/2001/XMLSchema-instance", "type");
	
	Если Не ЗначениеЗаполнено(АтрибутТипа) Тогда
		Возврат;
	КонецЕсли;
	
	ФорматныеСтрокиТипов = Новый Соответствие;
	ФорматныеСтрокиТипов.Вставить("PQ",		"ЧГ=0;ЧРД=.");
	ФорматныеСтрокиТипов.Вставить("INT",	"ЧГ=0");
	ФорматныеСтрокиТипов.Вставить("REAL",	"ЧГ=0;ЧДЦ=0;ЧРД=.");
	
	ФорматнаяСтрока = ФорматныеСтрокиТипов.Получить(ВРег(АтрибутТипа));
	
КонецПроцедуры

Процедура УдалитьНаименееЗаполненныеДублиДействий230(ТаблицаПоВидуДействийМедосмотровОбъединенная, МассивДействий, ЭтоДействияВрача, ЭтоИнструментальноеИсследование)
	
	КоличествоДействий = МассивДействий.Количество();
	Если КоличествоДействий < 2 Тогда
		// Дублей нет
		Возврат;
	КонецЕсли;
	
	// Если не врач и не инструментальное, то лабораторное
	ЭтоЛабораторныеИсследования = Не ЭтоДействияВрача И Не ЭтоИнструментальноеИсследование;
	
	ТекстЗаключенияПоУмолчанию = МедосмотрыКлиентСервер.ТекстЗаключенияПоУмолчанию();
	
	// Ищем различные действия с совпадающим СвязьСКлассификатором.УИДЕГИСЗ 
	Для СчетчикВнеш = 0 По КоличествоДействий - 2 Цикл
		Для СчетчикВнут = СчетчикВнеш + 1 По КоличествоДействий - 1 Цикл
			// Для инструментальных исследований должно остаться только одно
			Если ЭтоИнструментальноеИсследование 
				Или МассивДействий[СчетчикВнеш].СвязьСКлассификатором.УИДЕГИСЗ = МассивДействий[СчетчикВнут].СвязьСКлассификатором.УИДЕГИСЗ 
			Тогда
				// Находим строки в ТаблицаПоВидуДействийМедосмотровОбъединенная по действиям
				СтрокаВнеш = ТаблицаПоВидуДействийМедосмотровОбъединенная.Найти(МассивДействий[СчетчикВнеш], "ДействиеМедосмотра");
				Если СтрокаВнеш = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаВнут = ТаблицаПоВидуДействийМедосмотровОбъединенная.Найти(МассивДействий[СчетчикВнут], "ДействиеМедосмотра");
				Если СтрокаВнут = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СуммаБалловСтрокиВнеш = 0;
				СуммаБалловСтрокиВнут = 0;
				// Каждой строке присваиваем баллы за заполненные поля
				Если ЗначениеЗаполнено(СтрокаВнеш.ПриемСсылка) Тогда
					СуммаБалловСтрокиВнеш = СуммаБалловСтрокиВнеш + 2;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаВнут.ПриемСсылка) Тогда
					СуммаБалловСтрокиВнут = СуммаБалловСтрокиВнут + 2;
				КонецЕсли;
				
				// Обязательный реквизит
				Если ЗначениеЗаполнено(СтрокаВнеш.ДатаВыполненияДействияМедосмотра) Тогда
					СуммаБалловСтрокиВнеш = СуммаБалловСтрокиВнеш + 20;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаВнут.ДатаВыполненияДействияМедосмотра) Тогда
					СуммаБалловСтрокиВнут = СуммаБалловСтрокиВнут + 20;
				КонецЕсли;
				
				// Отдаем приоритет действию, выявившему противопоказание
				Если СтрокаВнеш.ВыявленыПротивопоказания = Истина Тогда
					СуммаБалловСтрокиВнеш = СуммаБалловСтрокиВнеш + 3;
				КонецЕсли;
				Если СтрокаВнут.ВыявленыПротивопоказания = Истина Тогда
					СуммаБалловСтрокиВнут = СуммаБалловСтрокиВнут + 3;
				КонецЕсли;
				
				Если ЭтоДействияВрача Тогда
					// Обязательно для консультаций
					Если ЗначениеЗаполнено(СтрокаВнеш.Сотрудник) Тогда
						СуммаБалловСтрокиВнеш = СуммаБалловСтрокиВнеш + 20;
					КонецЕсли; 
					Если ЗначениеЗаполнено(СтрокаВнут.Сотрудник) Тогда
						СуммаБалловСтрокиВнут = СуммаБалловСтрокиВнут + 20;
					КонецЕсли;
				КонецЕсли;
				
				// Ищем заключение введенное пользователем вручную
				Если ЗначениеЗаполнено(СтрокаВнеш.Заключение) 
					И СтрокаВнеш.Заключение <> СтрокаВнеш.ДействиеМедосмотра.ТекстЗаключенияПоУмолчанию 
					И СтрокаВнеш.Заключение <> ТекстЗаключенияПоУмолчанию 
				Тогда
					СуммаБалловСтрокиВнеш = СуммаБалловСтрокиВнеш + 1;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаВнут.Заключение) 
					И СтрокаВнут.Заключение <> СтрокаВнут.ДействиеМедосмотра.ТекстЗаключенияПоУмолчанию 
					И СтрокаВнут.Заключение <> ТекстЗаключенияПоУмолчанию 
				Тогда
					СуммаБалловСтрокиВнут = СуммаБалловСтрокиВнут + 1;
				КонецЕсли;
				
				// Для лабораторного исследования ищем заполненный титр серологического обследования
				Если ЭтоЛабораторныеИсследования Тогда
					Если ЗначениеЗаполнено(СтрокаВнеш.ТитрСерологическогоОбследования) Тогда
						СуммаБалловСтрокиВнеш = СуммаБалловСтрокиВнеш + 2;
					КонецЕсли; 
					Если ЗначениеЗаполнено(СтрокаВнут.ТитрСерологическогоОбследования) Тогда
						СуммаБалловСтрокиВнут = СуммаБалловСтрокиВнут + 2;
					КонецЕсли;
				КонецЕсли;
				
				// При равенстве баллов оставляем первую
				Если СуммаБалловСтрокиВнеш >= СуммаБалловСтрокиВнут Тогда
					ТаблицаПоВидуДействийМедосмотровОбъединенная.Удалить(СтрокаВнут);
				Иначе
					ТаблицаПоВидуДействийМедосмотровОбъединенная.Удалить(СтрокаВнеш);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ЕстьКритичныеОшибкиПоФактору230(ПМО, ПриказВредныйФактор)
	
	ВредныйФактор = ПолучитьВредныйФакторПоКлассификатору(ПриказВредныйФактор);
	
	Если ВредныйФактор = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	ЕстьКритичныеОшибки = Ложь;
	
	ЕстьПрививкаОтКори = Ложь;
	
	ТаблицаВакцинацийПоФактору = ТаблицаВакцинацийПоФактору230(ПМО, ВредныйФактор, ЕстьПрививкаОтКори);
	
	ЗаключениеПоФактору = ЗаключениеПоФакторуПМО(ВредныйФактор, ПМО);
	Если Не ЗначениеЗаполнено(ЗаключениеПоФактору) Тогда
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	ДанныеКонсультаций = ПолучитьДанныеСвязанныхОсмотровВрачейСпециалистов230(ПМО);
	Если ДанныеКонсультаций.Количество() <> 4 Тогда
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	Для Каждого Консультация Из ДанныеКонсультаций Цикл
		Если Не (ЗначениеЗаполнено(Консультация.Сотрудник)
			И ЗначениеЗаполнено(Консультация.СвязьСКлассификатором)
			И ЗначениеЗаполнено(Консультация.ДатаВыполненияДействияМедосмотра)
			И ДатаВ20Или21Веке(Консультация.ДатаВыполненияДействияМедосмотра))
		Тогда
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// Лабораторные исследования
	ТаблицаДляПроверки = Неопределено;
	ДанныеЛабИсследований = ПолучитьДанныеЛабораторныхИсследований230(ПМО, ВредныйФактор, ЕстьПрививкаОтКори, ТаблицаДляПроверки);
	Если ДанныеЛабИсследований.Количество() = 0 Тогда
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	Для Каждого ЛабИсследование Из ТаблицаДляПроверки Цикл
		Если ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10268
			Или ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10479
			Или ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10506
			Или ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10507
			Или ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10508
			Или ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10509
			Или ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10510
		Тогда
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЛабИсследование Из ДанныеЛабИсследований Цикл
		Если Не (ЗначениеЗаполнено(ЛабИсследование.СвязьСКлассификатором) 
			И ЗначениеЗаполнено(ЛабИсследование.ДатаВыполненияДействияМедосмотра)
			И ДатаВ20Или21Веке(ЛабИсследование.ДатаВыполненияДействияМедосмотра))
		Тогда
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// Инструментальные исследования (только одна строка)
	ДанныеИнстрИсследований = ПолучитьДанныеИнструментальногоИсследования230(ПМО, ВредныйФактор);
	Если ДанныеИнстрИсследований.Количество() = 0 Тогда
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	Для Каждого ИнстрИсследование Из ДанныеИнстрИсследований Цикл
		Если Не (ЗначениеЗаполнено(ИнстрИсследование.СвязьСКлассификатором) 
			И ЗначениеЗаполнено(ИнстрИсследование.ДатаВыполненияДействияМедосмотра)
			И ДатаВ20Или21Веке(ИнстрИсследование.ДатаВыполненияДействияМедосмотра))
		Тогда
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ЕстьКритичныеОшибки;
	
КонецФункции

Функция ТаблицаВакцинацийПоФактору230(ПМО, ВредныйФактор, ЕстьПрививкаОтКори)
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ГруппаЗаболеваний");
	ТаблицаРезультат.Колонки.Добавить("ДатаВакцинации");
	ТаблицаРезультат.Колонки.Добавить("НаименованиеПрививки");
	ТаблицаРезультат.Колонки.Добавить("Повторная");
	ТаблицаРезультат.Колонки.Добавить("ПорядковыйНомер");
	
	ЕстьЗаполненнаяСтрока = Ложь;
	
	Если ВредныйФактор.УИДЕГИСЗ = 211 Тогда
		СтрокаОграничений = СтрокаОграниченийВакцинацииФактор23_230(ПМО.ПрофильРаботы);
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 212 Тогда
		СтрокаОграничений = СтрокаОграниченийВакцинацииФактор24_230();
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 213 Тогда
		СтрокаОграничений = СтрокаОграниченийВакцинацииФактор25_230();
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 214 Тогда
		СтрокаОграничений = СтрокаОграниченийВакцинацииФактор26_230();
	КонецЕсли;
	
	СтрокаОграничений = СтрЗаменить(СтрокаОграничений, " ", "");
	СтрокаОграничений = СтрЗаменить(СтрокаОграничений, Символы.ПС, "");
	МассивОграничений = СтрРазделить(СтрокаОграничений, ",", Ложь);
	ОграниченияВакцинацииУИДЕГИСЗ = Новый Массив;
	Для Каждого Ограничение Из МассивОграничений Цикл
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Ограничение) Тогда
			ОграниченияВакцинацииУИДЕГИСЗ.Добавить(Число(Ограничение));
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ПрофПрививка Из ПМО.ПрофилактическиеПрививки Цикл
		
		Если Не ЗначениеЗаполнено(ПрофПрививка.ГруппаЗаболеваний) 
			Или ОграниченияВакцинацииУИДЕГИСЗ.Найти(ПрофПрививка.ГруппаЗаболеваний.УИДЕГИСЗ) = Неопределено 
		Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРез = ТаблицаРезультат.Добавить();
		СтрокаРез.ГруппаЗаболеваний = ПрофПрививка.ГруппаЗаболеваний;
		СтрокаРез.ДатаВакцинации = ПрофПрививка.ДатаВакцинации;
		СтрокаРез.НаименованиеПрививки = ПрофПрививка.НаименованиеПрививки;
		СтрокаРез.Повторная = ПрофПрививка.Повторная;
		СтрокаРез.ПорядковыйНомер = ПрофПрививка.ПорядковыйНомер;
		
		Если ПрофПрививка.ГруппаЗаболеваний.УИДЕГИСЗ = 18 Тогда
			ЕстьПрививкаОтКори = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

Функция ДатаВ20Или21Веке(ПроверяемаяДата) Экспорт
	
	Если ПроверяемаяДата > Дата("18991231")
		И ПроверяемаяДата < Дата("21000101")
	Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция НаличиеПротивопоказанийПоДействию230(Прием, Действие, ПМО)
	
	// Истина только если есть профнепригодность и один прием отвечает за одно действие медосмотра
	ЕстьПрофнепригодностьПоДействию = Ложь;
	
	СписокПротивопоказаний = Документы.ПрохождениеМедосмотра.ПротивопоказанияМедОсмотра(ПМО);
	ФакторыМедкнижки = МедосмотрыСервер.ПунктыВредныхФакторовДляМедкнижки();
	СтрокиПротивопоказаний = СписокПротивопоказаний.НайтиСтроки(Новый Структура("Действие", Действие));
	Для Каждого СтрокаПротивопоказания Из СтрокиПротивопоказаний Цикл
		Если СтрокаПротивопоказания.ВредныйФактор.Приказ = Справочники.ПриказыМедосмотров.Приказ29н 
			И ФакторыМедкнижки.Найти(СтрокаПротивопоказания.ВредныйФактор.НомерПП) <> Неопределено
		Тогда
			ЕстьПрофнепригодностьПоДействию = Истина; 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьПрофнепригодностьПоДействию Тогда
		НаборЗаписей = РегистрыСведений.ОтметкиВыполненияДействий.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ПрохождениеМедОсмотра.Установить(ПМО);
		НаборЗаписей.Прочитать();
		Счетчик = 0;
		
		Для Каждого Запись Из НаборЗаписей Цикл
			Если Запись.ДокументРегистратор = Прием Тогда
				Счетчик = Счетчик + 1;
				Если Счетчик > 1 Тогда
					Возврат Ложь;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если Счетчик = 1 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаполнитьТаблицуПараметровПоРецепту148_1_у_04_л(ТаблицаПараметров, Ссылка, СоответствияПараметрам)
	
	ЕдиницаИзмеренияСуткиПоКлассификатору = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(24, Перечисления.ВидыКлассификаторовМинЗдрава.ЕдиницыИзмерения);
	ДополнитьТаблицуПараметров(ТаблицаПараметров, ЕдиницаИзмеренияСуткиПоКлассификатору, "ЕдиницаИзмеренияСуткиПоКлассификатору");
	
	Срочность = Неопределено;
	Если Ссылка.Срочность = "cito" Тогда
		Срочность = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(1, Перечисления.ВидыКлассификаторовМинЗдрава.ПриоритетИсполненияРецепта);
	ИначеЕсли Ссылка.Срочность = "statim" Тогда
		Срочность = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(2, Перечисления.ВидыКлассификаторовМинЗдрава.ПриоритетИсполненияРецепта);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка.Серия) Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Серия, "СерияРецепта");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка.Номер) Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Номер, "НомерРецепта");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Срочность) Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Срочность, "ПриоритетИсполненияРецепта");
	КонецЕсли;
	
	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.ПоСпециальномуНазначению, "СпециальноеНазначение");
	
	// Данная отметка может иметь значение true в случае назначения медицинского изделия (не поддерживается)
	ДополнитьТаблицуПараметров(ТаблицаПараметров, Ложь, "НаличиеХроническихЗаболеваний");
	
	Если ЗначениеЗаполнено(Ссылка.Диагноз) Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Диагноз, "Диагноз");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка.ЛьготнаяКатегория) Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.ЛьготнаяКатегория, "ЛьготнаяКатегория");
		Если ЗначениеЗаполнено(Ссылка.ТипЛьготы) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.ТипЛьготы, "ИсточикФинансирования");
			ВидЛьготы = ВидЛьготыПоКатегорииИТипу(Ссылка.ЛьготнаяКатегория, Ссылка.ТипЛьготы);
			Если ВидЛьготы <> Неопределено Тогда
				ДополнитьТаблицуПараметров(ТаблицаПараметров, ВидЛьготы, "ВидПредоставляемойЛьготы");
				СтрокаРазмерЛьготы = ВидЛьготы.Атрибуты.Найти("PERCENT");
				Если СтрокаРазмерЛьготы <> Неопределено Тогда
					ДополнитьТаблицуПараметров(ТаблицаПараметров, Число(СтрокаРазмерЛьготы.Значение), "РазмерЛьготы");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Вычислим срок действия рецепта в днях по кодам
	// Доступные сроки действия рецепта на лекарственный препарат или специализированный продукт лечебного питания: 15 дней, 30 дней и 90 дней
	СрокДействияРецептаВДнях = 0;
	СрокДействияРецепта = Неопределено;
	Если Ссылка.Срок = 50 Тогда
		СрокДействияРецептаВДнях = 15;
		СрокДействияРецепта = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(1, Перечисления.ВидыКлассификаторовМинЗдрава.СрокДействияРецепта);
	ИначеЕсли Ссылка.Срок = 0 Тогда
		СрокДействияРецептаВДнях = 30;
		СрокДействияРецепта = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(2, Перечисления.ВидыКлассификаторовМинЗдрава.СрокДействияРецепта);
	ИначеЕсли Ссылка.Срок = 60 Тогда
		СрокДействияРецептаВДнях = 90;
		СрокДействияРецепта = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(4, Перечисления.ВидыКлассификаторовМинЗдрава.СрокДействияРецепта);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СрокДействияРецептаВДнях) Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Дата + СрокДействияРецептаВДнях * 86400, "ДатаОкончанияДействияРецепта");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СрокДействияРецепта) Тогда
		ДополнитьТаблицуПараметров(ТаблицаПараметров, СрокДействияРецепта, "СрокДействияРецепта");
	КонецЕсли;
	
	// Заполнение данных по первой номенклатуре
	Если ЗначениеЗаполнено(Ссылка.Номенклатура1) Тогда
		
		Если ТипЗнч(Ссылка.Номенклатура1) = Тип("СправочникСсылка.СправочникМеждународныхНепатентованныхНаименований") Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Номенклатура1, "ЛекарственныйПрепарат");
		ИначеЕсли ТипЗнч(Ссылка.Номенклатура1) = Тип("СправочникСсылка.Номенклатура") Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Номенклатура1.Наименование, "ЛекарственныйПрепаратСтрокой");
		ИначеЕсли ТипЗнч(Ссылка.Номенклатура1) = Тип("Строка") Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Номенклатура1, "ЛекарственныйПрепаратСтрокой");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.СколькоДней1) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.СколькоДней1, "ДлительностьПриемаПрепарата");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.ПутьВведенияПрепарата1) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.ПутьВведенияПрепарата1, "ПутьВведенияПрепарата");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.РазВДень1) Тогда
			ЧастотаПриемаПрепарата1 = Окр(1 / Ссылка.РазВДень1, 4, РежимОкругления.Окр15как10);
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ЧастотаПриемаПрепарата1, "ЧастотаПриемаПрепарата");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.Количество1)
			И ЗначениеЗаполнено(Ссылка.ЕдиницаИзмерения1)
		Тогда
			ЕдиницаИзмеренияКоличества1 = Неопределено;
			Если ТипЗнч(Ссылка.ЕдиницаИзмерения1) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
				ЕдиницаИзмеренияКоличества1 = Ссылка.ЕдиницаИзмерения1;
			ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Ссылка.ЕдиницаИзмерения1, "ЕдиницаПоКлассификатору")
				И ЗначениеЗаполнено(Ссылка.ЕдиницаИзмерения1.ЕдиницаПоКлассификатору)
			Тогда
				ЕдиницаИзмеренияКоличества1 = Ссылка.ЕдиницаИзмерения1.ЕдиницаПоКлассификатору;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЕдиницаИзмеренияКоличества1) Тогда
				ЕдиницаИзмеренияКоличестваПоКлассификаторуНСИ1 = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЕдиницаИзмененияНСИПоОКЕИ(ЕдиницаИзмеренияКоличества1);
				Если ЗначениеЗаполнено(ЕдиницаИзмеренияКоличестваПоКлассификаторуНСИ1) Тогда
					ДополнитьТаблицуПараметров(ТаблицаПараметров, Ссылка.Количество1, "РазоваяДозаПрепарата");
					ДополнитьТаблицуПараметров(ТаблицаПараметров, ЕдиницаИзмеренияКоличестваПоКлассификаторуНСИ1, "ЕдиницаИзмеренияДозыПрепарата");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Ссылка.РазВДень1)
			И ЗначениеЗаполнено(Ссылка.СколькоДней1)
		Тогда
			КоличествоНазначенныхДоз1 = Ссылка.РазВДень1 * Ссылка.СколькоДней1;
			ДополнитьТаблицуПараметров(ТаблицаПараметров, КоличествоНазначенныхДоз1, "КоличествоНазначенныхДоз");
		КонецЕсли;
		
		ОсобыеУказания1 = "";
		
		Если ЗначениеЗаполнено(Ссылка.СпособПрименения1) Тогда
			ОсобыеУказания1 = ОсобыеУказания1 + "Способ применения:" + Символы.ПС + Ссылка.СпособПрименения1 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.Дозировка1) Тогда
			ОсобыеУказания1 = ОсобыеУказания1 + "Дозировка:" + Символы.ПС + Ссылка.Дозировка1 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.ВремяПриемаОтносительноЕды1) Тогда
			ОсобыеУказания1 = ОсобыеУказания1 + "Время приема относительно еды:" + Символы.ПС + Ссылка.ВремяПриемаОтносительноЕды1 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.ВремяПриемаОтносительноСна1) Тогда
			ОсобыеУказания1 = ОсобыеУказания1 + "Время приема относительно сна:" + Символы.ПС + Ссылка.ВремяПриемаОтносительноСна1 + Символы.ПС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Ссылка.Дополнение1) Тогда
			ОсобыеУказания1 = ОсобыеУказания1 + "Дополнительно:" + Символы.ПС + Ссылка.Дополнение1 + Символы.ПС;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОсобыеУказания1) Тогда
			ДополнитьТаблицуПараметров(ТаблицаПараметров, ОсобыеУказания1, "ОсобыеУказания");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ВидЛьготыПоКатегорииИТипу(ЛьготнаяКатегория, ТипЛьготы)
	
	СтрокаАтрибута = ЛьготнаяКатегория.Атрибуты.Найти("ID");
	Если СтрокаАтрибута = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Льготы.Ссылка КАК Ссылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		КлассификаторыМинЗдрава.Ссылка КАК Ссылка
		|	ИЗ
		|		Справочник.КлассификаторыМинЗдрава КАК КлассификаторыМинЗдрава
		|	ГДЕ
		|		КлассификаторыМинЗдрава.ВидКлассификатора = &ВидКлассификатора) КАК Льготы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторыМинЗдрава.Атрибуты КАК Атрибут_ID_LGOTA
		|		ПО Льготы.Ссылка = Атрибут_ID_LGOTA.Ссылка
		|			И ((ВЫРАЗИТЬ(Атрибут_ID_LGOTA.Ключ КАК СТРОКА(100))) = ""ID_LGOTA"")
		|			И ((ВЫРАЗИТЬ(Атрибут_ID_LGOTA.Значение КАК СТРОКА(100))) = &ID_LGOTA)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторыМинЗдрава.Атрибуты КАК Атрибут_ID_LGOTA_LIST
		|		ПО Льготы.Ссылка = Атрибут_ID_LGOTA_LIST.Ссылка
		|			И ((ВЫРАЗИТЬ(Атрибут_ID_LGOTA_LIST.Ключ КАК СТРОКА(100))) = ""ID_LGOTA_LIST"")
		|			И ((ВЫРАЗИТЬ(Атрибут_ID_LGOTA_LIST.Значение КАК СТРОКА(100))) = &ID_LGOTA_LIST)";
	
	Запрос.УстановитьПараметр("ВидКлассификатора",	Перечисления.ВидыКлассификаторовМинЗдрава.ВидыПредоставляемыхЛьгот);
	Запрос.УстановитьПараметр("ID_LGOTA",			СтрокаАтрибута.Значение);
	Запрос.УстановитьПараметр("ID_LGOTA_LIST",		Строка(ТипЛьготы.УИДЕГИСЗ));
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДобавитьПорядковыйНомерИИдентификаторВитальныхПараметров(ТаблицаПараметров, LocalidВитальногоПараметра = "ВитальныйПараметр")
	
	ПорядковыйНомерПараметра = 1;
	ВитальныеПараметры = ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", LocalidВитальногоПараметра));
	Для Каждого ВитальныйПараметр Из ВитальныеПараметры Цикл
		Если ЗначениеЗаполнено(ВитальныйПараметр.КлассификацияПоля)
			И ЗначениеЗаполнено(ВитальныйПараметр.КлассификацияПоля.УИДЕГИСЗ)
		Тогда
			Если ТипЗнч(ВитальныйПараметр.Параметр) = Тип("ПланВидовХарактеристикСсылка.ПараметрыHTML") Тогда
				Если ЗначениеЗаполнено(ВитальныйПараметр.ТаблицаШаблонов) Тогда
					// Параметр в многострочной таблице
					СтруктураЗаполнения = Новый Структура();
					СтруктураЗаполнения.Вставить("ГруппирующееПоле",				ВитальныйПараметр.Параметр);
					СтруктураЗаполнения.Вставить("ИдентификаторРодительскойСтроки",	ВитальныйПараметр.ИдентификаторРодительскойСтроки);
					СтруктураЗаполнения.Вставить("ИдентификаторСтроки",				ВитальныйПараметр.ИдентификаторСтроки);
					СтруктураЗаполнения.Вставить("ИдентификаторСтрокиШаблона",		ВитальныйПараметр.ИдентификаторСтрокиШаблона);
					СтруктураЗаполнения.Вставить("НомерСтрокиТаблицы",				ВитальныйПараметр.НомерСтрокиТаблицы);
					
					ДополнитьТаблицуПараметров(ТаблицаПараметров, ПорядковыйНомерПараметра, "ПорядковыйНомер", СтруктураЗаполнения);
					ДополнитьТаблицуПараметров(ТаблицаПараметров, ВитальныйПараметр.КлассификацияПоля.УИДЕГИСЗ, "ИдентификаторВитальногоПараметра", СтруктураЗаполнения);
					
				Иначе
					// Параметр в теле шаблона приёма, но не в многострочной таблице
					СтруктураЗаполнения = Новый Структура();
					СтруктураЗаполнения.Вставить("ГруппирующееПоле", ВитальныйПараметр.Параметр);
					ДополнитьТаблицуПараметров(ТаблицаПараметров, ПорядковыйНомерПараметра, "ПорядковыйНомер", СтруктураЗаполнения);
					ДополнитьТаблицуПараметров(ТаблицаПараметров, ВитальныйПараметр.КлассификацияПоля.УИДЕГИСЗ, "ИдентификаторВитальногоПараметра", СтруктураЗаполнения);
				КонецЕсли;
			ИначеЕсли ВитальныйПараметр.Параметр = Неопределено Тогда
				// Параметр в константе
				ИндексВитальногоПараметра = -1;
				// Ищем индекс строки для подстановки в группирующее поле
				Для Индекс = 0 По ТаблицаПараметров.Количество() - 1 Цикл
					СтрокаТЗ = ТаблицаПараметров[Индекс];
					Если СтрокаТЗ.localid = ВитальныйПараметр.localid
						И СтрокаТЗ.КлассификацияПоля = ВитальныйПараметр.КлассификацияПоля
						И СтрокаТЗ.Значение = ВитальныйПараметр.Значение
					Тогда
						ИндексВитальногоПараметра = Индекс;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ИндексВитальногоПараметра > -1 Тогда
					СтруктураЗаполнения = Новый Структура();
					СтруктураЗаполнения.Вставить("ГруппирующееПоле", ИндексВитальногоПараметра);
					ДополнитьТаблицуПараметров(ТаблицаПараметров, ПорядковыйНомерПараметра, "ПорядковыйНомер", СтруктураЗаполнения);
					ДополнитьТаблицуПараметров(ТаблицаПараметров, ВитальныйПараметр.КлассификацияПоля.УИДЕГИСЗ, "ИдентификаторВитальногоПараметра", СтруктураЗаполнения);
				КонецЕсли;
			КонецЕсли;
			ПорядковыйНомерПараметра = ПорядковыйНомерПараметра + 1;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ЭтоЭлементКлассификатора(Объект)
	
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(Объект)
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "УИДЕГИСЗ")
	Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ДобавитьИдентификаторыКомпонентов(ТаблицаПараметров, СвойстваЭМД)
	
	Если СвойстваЭМД <> Неопределено Тогда
		ПрефиксИдентификатораКомпонента = СвойстваЭМД.УИДДокумента;
	Иначе
		ПрефиксИдентификатораКомпонента = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	
	ДобавитьИдентификаторКомпонента(ТаблицаПараметров, ПрефиксИдентификатораКомпонента, "ПрофильЛабораторногоИсследования", "УникальныйИдентификаторКомпонентаЛабИсследования");
	ДобавитьИдентификаторКомпонента(ТаблицаПараметров, ПрефиксИдентификатораКомпонента, "ТипКлиническойШкалы", "УникальныйИдентификаторКомпонентаШкалы");
	
КонецПроцедуры

Процедура ДобавитьИдентификаторКомпонента(ТаблицаПараметров, ПрефиксИдентификатораКомпонента, LocalidКомпонента, LocalidУИДаКомпонента)
	
	Для Каждого СтрокаПрофиля Из ТаблицаПараметров.НайтиСтроки(Новый Структура("localid", LocalidКомпонента)) Цикл
		
		Если ЗначениеЗаполнено(СтрокаПрофиля.ИдентификаторСтроки) Тогда
			УИДКомпонента = СтрШаблон("%1_%2", ПрефиксИдентификатораКомпонента, СтрокаПрофиля.ИдентификаторСтроки);
		ИначеЕсли ЗначениеЗаполнено(СтрокаПрофиля.Параметр) Тогда
			УИДКомпонента = СтрШаблон("%1_%2", ПрефиксИдентификатораКомпонента, Строка(СтрокаПрофиля.ИдентификаторСтроки.УникальныйИдентификатор()));
		ИначеЕсли СтрокаПрофиля.Параметр = Неопределено Тогда
			УИДКомпонента = СтрШаблон("%1_%2", ПрефиксИдентификатораКомпонента, Строка(ТаблицаПараметров.Индекс(СтрокаПрофиля)));
		Иначе
			УИДКомпонента = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
		
		Если ТипЗнч(СтрокаПрофиля.Параметр) = Тип("ПланВидовХарактеристикСсылка.ПараметрыHTML") Тогда
			Если ЗначениеЗаполнено(СтрокаПрофиля.ТаблицаШаблонов) Тогда
				// Параметр в многострочной таблице
				СтруктураЗаполнения = Новый Структура();
				СтруктураЗаполнения.Вставить("ГруппирующееПоле",				СтрокаПрофиля.Параметр);
				СтруктураЗаполнения.Вставить("ИдентификаторРодительскойСтроки",	СтрокаПрофиля.ИдентификаторРодительскойСтроки);
				СтруктураЗаполнения.Вставить("ИдентификаторСтроки",				СтрокаПрофиля.ИдентификаторСтроки);
				СтруктураЗаполнения.Вставить("ИдентификаторСтрокиШаблона",		СтрокаПрофиля.ИдентификаторСтрокиШаблона);
				СтруктураЗаполнения.Вставить("НомерСтрокиТаблицы",				СтрокаПрофиля.НомерСтрокиТаблицы);
				
				ДополнитьТаблицуПараметров(ТаблицаПараметров, УИДКомпонента, LocalidУИДаКомпонента, СтруктураЗаполнения);
				
			Иначе
				// Параметр в теле шаблона приёма, но не в многострочной таблице
				УИДКомпонента = СтрШаблон("%1_%2", ПрефиксИдентификатораКомпонента, СтрокаПрофиля.ИдентификаторСтроки);
				ДополнитьТаблицуПараметров(ТаблицаПараметров, УИДКомпонента, LocalidУИДаКомпонента, Новый Структура("ГруппирующееПоле", СтрокаПрофиля.Параметр));
			КонецЕсли;
		ИначеЕсли СтрокаПрофиля.Параметр = Неопределено Тогда
			// Параметр в константе
			ИндексСтроки = ТаблицаПараметров.Индекс(СтрокаПрофиля);
			Если ИндексСтроки > -1 Тогда
				ДополнитьТаблицуПараметров(ТаблицаПараметров, УИДКомпонента, LocalidУИДаКомпонента, Новый Структура("ГруппирующееПоле", ИндексСтроки));
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти