&НаКлиенте
Перем мТекущаяДатаДокумента Экспорт; // Хранит текущую дату документа - для проверки перехода документа в другой период установки номера
&НаКлиенте
Перем мПериодичностьПланирования; // Размер периода планирования документа
&НаКлиенте
Перем мЗапроситьПричинуОтменыПриЗаписи;

// При автоподборе и окончании ввода текста указывает, следует ли искать введенное значение в кодах справочника.
&НаКлиенте
Перем мИспользоватьАвтоПодборКлиентовПоКоду;

&НаКлиенте
Перем НоваяЗаявка;                

&НаКлиенте
Процедура НесколькоСотрудниковПриИзменении(Элемент)
	
	Если Объект.ХочуРаньше И Объект.НесколькоСотрудников Тогда
		ПоказатьПредупреждение(,ПолучитьТекстПредупрежденияОдновременноХочуРаньшеНесколькоСотрудников(), 30);
		Объект.НесколькоСотрудников = Ложь;
	КонецЕсли;

	/////////////////////////////////////////////////////////
	// ОМГ
	Если Объект.НесколькоСотрудников и ЗначениеЗаполнено(мУчетнаяПолитика.омг_ВрачПоУмолчанию) Тогда
	Объект.Сотрудник = мУчетнаяПолитика.омг_ВрачПоУмолчанию;
	
	Для каждого строка из Объект.Работы цикл
	строка.Сотрудник = мУчетнаяПолитика.омг_ВрачПоУмолчанию 
	КонецЦикла
	
	КонецЕсли;  
	омг_БлокировкаМедПерсонала();
	// ОМГ  
	/////////////////////////////////////////////////////////
	
	ДополнительныеПараметры = Новый Структура;
	
	Если ТекущийРежимЗаписиНаПрием = ПредопределенноеЗначение("Перечисление.РежимыЗаписиНаПрием.КВрачу") Тогда
		ПроверитьСотрудниковВТЧ(ДополнительныеПараметры);
	ИначеЕсли ТекущийРежимЗаписиНаПрием = ПредопределенноеЗначение("Перечисление.РежимыЗаписиНаПрием.ВКабинет") Тогда
		ДополнительныеПараметры.Вставить("СдвинутьЗначенияКолонокОборудованияНесколькоВрачейПриИзменении", Истина);
		ДополнительныеПараметры.Вставить("УстановитьКабинетыВТЧ", Истина);
		НесколькоСотрудниковПриИзмененииЗавершение(ДополнительныеПараметры);
	ИначеЕсли ТекущийРежимЗаписиНаПрием = ПредопределенноеЗначение("Перечисление.РежимыЗаписиНаПрием.ВКабинетКВрачу") Тогда
		ДополнительныеПараметры.Вставить("СдвинутьЗначенияКолонокОборудованияНесколькоВрачейПриИзменении", Истина);
		ДополнительныеПараметры.Вставить("УстановитьКабинетыВТЧ", Истина);
		ПроверитьСотрудниковВТЧ(ДополнительныеПараметры);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура НесколькоСотрудниковПриИзмененииЗавершение(ДополнительныеПараметры)
	
	Элементы.РаботыСотрудник.Видимость = Объект.НесколькоСотрудников;
	Элементы.РежимДлительностиЗаявки.Доступность = Не Объект.НесколькоСотрудников;
	
	/////////////////////////////////////////////////////////////////////////////////
	// ОМГ     
	
	Омг_НесколькоВрачей();	
	
	// ОМГ
    /////////////////////////////////////////////////////////////////////////////////
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоОбъекта(ДополнительныеПараметры, "СдвинутьЗначенияКолонокОборудованияНесколькоВрачейПриИзменении", Ложь) Тогда
	    СдвинутьЗначенияКолонокОборудованияНесколькоВрачейПриИзменении();
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоОбъекта(ДополнительныеПараметры, "УстановитьКабинетыВТЧ", Ложь) Тогда
	    УстановитьКабинетыВТЧ();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьЗначенияКолонокОборудованияНесколькоВрачейПриИзменении()
	
	Для Каждого СтрокаРаботы Из Объект.Работы Цикл
		
		Если Объект.НесколькоСотрудников Тогда
			
			СтрокаРаботы.Оборудование3 = СтрокаРаботы.Оборудование2;
			СтрокаРаботы.Оборудование2 = СтрокаРаботы.Оборудование1;
			СтрокаРаботы.Оборудование1 = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
			
		Иначе
			
			СтрокаРаботы.Оборудование1 = СтрокаРаботы.Оборудование2;
			СтрокаРаботы.Оборудование2 = СтрокаРаботы.Оборудование3;
			СтрокаРаботы.Оборудование3 = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьКабинетыВТЧ()

	Если ТекущийРежимЗаписиНаПрием = ПредопределенноеЗначение("Перечисление.РежимыЗаписиНаПрием.ВКабинет")
		Или ТекущийРежимЗаписиНаПрием = ПредопределенноеЗначение("Перечисление.РежимыЗаписиНаПрием.ВКабинетКВрачу")
	Тогда
		Если Не Объект.НесколькоСотрудников Тогда
			Если ПерваяКолонкаКабинеты Тогда
				ПерваяКолонкаКабинеты = Ложь;
				Элементы.РаботыОборудование1.Заголовок = "Кабинет/Оборудование";
			КонецЕсли;
		Иначе
			Элементы.РаботыОборудование1.Заголовок = "Кабинет";
			ПерваяКолонкаКабинеты = Истина;
		КонецЕсли;
	Иначе
		ПерваяКолонкаКабинеты = Ложь;
		Элементы.РаботыОборудование1.Заголовок = "Кабинет/Оборудование";
	КонецЕсли;
	НастройкаВидимостиКолонокРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСотрудниковВТЧ(ДополнительныеПараметры)

	ВыполнитьНесколькоСотрудниковПриИзмененииЗавершение = Истина;
	
	Если Не Объект.НесколькоСотрудников Тогда
		
		флЕстьСотрудника = Ложь;
		Для Каждого СтрРабота Из Объект.Работы Цикл
			Если ЗначениеЗаполнено(СтрРабота.Сотрудник) Тогда
				флЕстьСотрудника = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если флЕстьСотрудника Тогда
			ВыполнитьНесколькоСотрудниковПриИзмененииЗавершение = Ложь;
			ПоказатьВопрос(Новый ОписаниеОповещения("ПроверитьСотрудниковВТЧЗавершение", ЭтотОбъект, ДополнительныеПараметры),
				НСтр("ru='Сотрудники в табличной части будут очищены. Продолжить?'"),
				РежимДиалогаВопрос.ОКОтмена);
		КонецЕсли;

	КонецЕсли;
	
	Если ВыполнитьНесколькоСотрудниковПриИзмененииЗавершение Тогда
		НесколькоСотрудниковПриИзмененииЗавершение(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСотрудниковВТЧЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Для Каждого СтрРабота Из Объект.Работы Цикл
			СтрРабота.Сотрудник = Неопределено;
		КонецЦикла;
	Иначе
		Объект.НесколькоСотрудников = Истина;	
	КонецЕсли;
	
	НесколькоСотрудниковПриИзмененииЗавершение(ДополнительныеПараметры);

КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	РаботаСФормамиКлиент.ОбработчикРегулированияКвантуемогоВремени(Объект.ВремяНачала,Направление,мПериодичностьПланирования);
	ВремяНачалаПриИзменении(Элемент);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	////////////////////////////////////////////////////////////
	// ОМГ   
	Если Объект.Ссылка.Пустая() и РольДоступна("оиг_ДобавлениеИзменениеЗаявка") Тогда
	иначе
		Если Объект.Ссылка.Пустая() и РольДоступна("омг_Врач")  или
			Объект.Ссылка.Пустая() и РольДоступна("омг_МедПерсонал")  Тогда 		
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
		Если не РольДоступна("ПолныеПрава") Тогда
			
			Если РольДоступна("омг_Врач")  или РольДоступна("омг_Оператор") или РольДоступна("омг_Регистратор") Тогда
				Элементы.Ответственный.ТолькоПросмотр = Истина		
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Если не РольДоступна("ПолныеПрава") Тогда
		
		Организация  = омг_ВернутьОрганизациюПоФилиалу(Объект.Филиал);
		
		Если ЗначениеЗаполнено(Организация) Тогда
			
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Организация", Организация);
			НовыйМассив = Новый Массив();
			НовыйМассив.Добавить(НовыйПараметр);
			НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
			
			Элементы.омг_СтраховаяПрограмма.ПараметрыВыбора = НовыеПараметры;
			
		КонецЕсли;
	//КонецЕсли;
		
    ОМГ_ОтобразитьИИН();
	// ОМГ
	////////////////////////////////////////////////////////////
	
	// Добавлено Макеев (	
	ДобавляемыеРеквизиты = Новый Массив;
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("СправочникСсылка.Контрагенты"));
	МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("омг_ТекущийВрач", Новый ОписаниеТипов(МассивТипов)));
	ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	// )
	Если Объект.РежимДлительностиЗаявки <> Перечисления.РежимДлительностиЗаявки.Фиксированная Или Объект.НесколькоСотрудников Тогда
		Объект.РежимДлительностиЗаявки = Перечисления.РежимДлительностиЗаявки.ПоНормам;
		Если Объект.НесколькоСотрудников Тогда
			Элементы.РежимДлительностиЗаявки.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();	
	ТекущийРежимЗаписиНаПрием = мУчетнаяПолитика.РежимЗаписиНаПрием;
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма);
	
	ДополнительныеСвойства = Новый Структура;
	
	Если ОграничениеДоступаНаУровнеЗаписей.ЗаписьВЖурналЗаписиФилиалаЗапрещенаПользователю(Объект.Филиал) Тогда
		ДополнительныеСвойства.Вставить("ЗаписьВЖурналЗаписиФилиалаЗапрещенаПользователю", Истина);
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Параметры.Оборудование)
	Тогда
		Если ЗначениеЗаполнено(Параметры.Оборудование.ОсновнаяУслуга) Тогда
			Номенклатура = Параметры.Оборудование.ОсновнаяУслуга;
			СтруктураОборудования = ПроцедурыСпециализацииПоставки.ПолучитьЗначенияОборудования(Номенклатура,Объект.Филиал);
			ОбработкаВнесенияРаботы(Номенклатура, 1,,Объект);
			СтрокаРаботы = Объект.Работы[Объект.Работы.Количество()-1];
			Если ТекущийРежимЗаписиНаПрием = Перечисления.РежимыЗаписиНаПрием.КВрачу Тогда 
				Для инд = 1 По 3 Цикл
					Если СтруктураОборудования["Оборудование"+инд] = Параметры.Оборудование.Модель Тогда
						СтрокаРаботы["Оборудование"+инд] = Параметры.Оборудование;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			ПересчетВремениОкончания(Объект, Продолжительность);
		КонецЕсли;
		
		Если ТекущийРежимЗаписиНаПрием = Перечисления.РежимыЗаписиНаПрием.ВКабинет
			Или ТекущийРежимЗаписиНаПрием = Перечисления.РежимыЗаписиНаПрием.ВКабинетКВрачу
		Тогда 
			Объект.Кабинет = Параметры.Оборудование;
		КонецЕсли;
	КонецЕсли;
	
	ПроцедурыСпециализацииПоставки.УстановитьСинонимНесколькимВрачам(Элементы.НесколькоСотрудников.Заголовок,ТекущийРежимЗаписиНаПрием);
	РаботаСФормамиСервер.НастройкаПодбораПриСоздании(ЭтаФорма, Истина, "Работы", "Услуга", "Набор");
	
	Элементы.РаботыОборудование1.Видимость = Ложь;
	Элементы.РаботыОборудование2.Видимость = Ложь;
	Элементы.РаботыОборудование3.Видимость = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Состояние = Справочники.ВидыСостоянийЗаявок.Запланирована;
		Если Не ЗначениеЗаполнено(ОбщегоНазначенияКлиентСервер.ВремяВСекунды(Объект.ДатаНачала)) Тогда
			
			Если Не ЗначениеЗаполнено(Объект.ДатаНачала) Тогда              
				Объект.ДатаНачала = НачалоДня(Объект.Дата);
			КонецЕсли;
			
			ВремяНачалаРаботыСек = ОбщегоНазначенияКлиентСервер.ВремяВСекунды(мУчетнаяПолитика.ВремяНачалаРаботы);
			
			Объект.ДатаНачала = Объект.ДатаНачала + ВремяНачалаРаботыСек;
			ТекДата = ТекущаяДата();
			Если ТекДата > Объект.ДатаНачала Тогда
				Объект.ДатаНачала = НачалоДня(Объект.ДатаНачала) + ОбщегоНазначенияКлиентСервер.ВремяВСекунды(ТекДата);

				КалендарьПланирования.ОкруглитьВремяДоПериодаПланирования(Объект.ДатаНачала);

				Если ОбщегоНазначенияКлиентСервер.ВремяВСекунды(Объект.ДатаНачала) > ОбщегоНазначенияКлиентСервер.ВремяВСекунды(мУчетнаяПолитика.ВремяОкончанияРаботы) Тогда
					Объект.ДатаНачала = НачалоДня(Объект.ДатаНачала) + 86400 + ВремяНачалаРаботыСек;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		ПродолжительностьЗаявки = Объект.ДатаОкончания - Объект.ДатаНачала;
		Если Объект.РежимДлительностиЗаявки <> Перечисления.РежимДлительностиЗаявки.Фиксированная Тогда
			Для Каждого СтрРаботы Из Объект.Работы Цикл
				Если Не ЗначениеЗаполнено(СтрРаботы.Продолжительность) Тогда 
					//////////////////////////////////////////////////////////
					// ОМГ
					Если ЗначениеЗаполнено(СтрРаботы.омг_Набор) Тогда
						ОбработкаВнесенияРаботы(СтрРаботы.Номенклатура, 1,,Объект,,СтрРаботы.омг_Набор)
					иначе
						ОбработкаВнесенияРаботы(СтрРаботы.Номенклатура, 1,,Объект)
					КонецЕсли;	
					// ОМГ
	                //////////////////////////////////////////////////////////
					КонецЕсли;
			КонецЦикла;
		Иначе
			
			Если Объект.Работы.Количество() = 0 Тогда
				Объект.Работы.Добавить();
			КонецЕсли;
			
			Для Каждого СтрРаботы Из Объект.Работы Цикл
				СтрРаботы.Продолжительность = Дата(1,1,1);
			КонецЦикла;
				
			Объект.Работы[0].Продолжительность = Дата(1,1,1) + ПродолжительностьЗаявки;
		КонецЕсли;
		
		Объект.ДатаОкончания = Объект.ДатаНачала + ПродолжительностьЗаявки;
		Если Объект.ДатаОкончания < Объект.ДатаНачала Тогда 
			Объект.ДатаОкончания = Объект.ДатаНачала;
		КонецЕсли;
		
		Объект.ВремяНачала		= Объект.ДатаНачала;
		Объект.ВремяОкончания	= Объект.ДатаОкончания;
		
		// Определение нужного значения флага "Несколько сотрудников".
		ЗаполненоНесколькоИсполнителей = Ложь;
		РаботыКопия = Объект.Работы.Выгрузить(,"Сотрудник");
		РаботыКопия.Свернуть("Сотрудник","");
		Объект.НесколькоСотрудников = РаботыКопия.Количество() > 1 Или мУчетнаяПолитика.ИспользоватьНесколькоСотрудниковВДокументах И мУчетнаяПолитика.ОсновноеЗначениеПереключателяНесколькихСотрудниковВЗаявке;
		
		//////////////////////////////////////////////////////////
		// ОМГ

		ОбновитьПредоплату();	
		
		// ОМГ
	    //////////////////////////////////////////////////////////

	Иначе		
		Если Параметры.Свойство("ЗначенияПерезаполнения") Тогда
			ПерезаполнитьЗаявку(Параметры.ЗначенияПерезаполнения);
		КонецЕсли;
		
		ЭтаФорма.ДатаЗаявкиПредыдущейВерсииДокумента = Объект.ДатаНачала;
	КонецЕсли;
	
	ОбновитьВыпадающийСписокСотрудниковСервер();

	Элементы.Кабинет.Видимость	=	(мУчетнаяПолитика.РежимЗаписиНаПрием = Перечисления.РежимыЗаписиНаПрием.ВКабинет
								 Или мУчетнаяПолитика.РежимЗаписиНаПрием = Перечисления.РежимыЗаписиНаПрием.ВКабинетКВрачу);
	Элементы.ВыравниваниеВертикальное3.Видимость = Элементы.Кабинет.Видимость;
								 
	Элементы.НесколькоСотрудников.Видимость = мУчетнаяПолитика.ИспользоватьНесколькоСотрудниковВДокументах;
	Элементы.НесколькоСотрудников.Доступность = Объект.РежимДлительностиЗаявки <> Перечисления.РежимДлительностиЗаявки.Фиксированная; 
	Элементы.РаботыСотрудник.Видимость	= Объект.НесколькоСотрудников
									И мУчетнаяПолитика.РежимЗаписиНаПрием <> Перечисления.РежимыЗаписиНаПрием.ВКабинет;

	// Установка текущего элемента исходя из заполненности полей.
	Если Объект.Клиент.Пустая() Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Клиент;
	ИначеЕсли Объект.Сотрудник.Пустая()
			И ТекущийРежимЗаписиНаПрием <> Перечисления.РежимыЗаписиНаПрием.ВКабинет
	Тогда
		ЭтаФорма.ТекущийЭлемент = Элементы.Сотрудник;
	ИначеЕсли Объект.Кабинет.Пустая()
			И Элементы.Кабинет.Видимость
	Тогда
	    ЭтаФорма.ТекущийЭлемент = Элементы.Кабинет;
	Иначе
		ЭтаФорма.ТекущийЭлемент = Элементы.Работы;
	КонецЕсли;

	// Настройка видимости элементов блока "Хочу посещение раньше"
	Элементы.ХочуРаньше.Видимость = мУчетнаяПолитика.ИспользоватьХочуРаньшеВЗаявках;
	Элементы.СтраницаХочуРаньше.Видимость = мУчетнаяПолитика.ИспользоватьХочуРаньшеВЗаявках И Объект.ХочуРаньше;
	
	Элементы.КомментарийКлиента.Видимость = ЗначениеЗаполнено(Объект.КомментарийКлиента); // Видимость комментария клиента, полученного при импорте заявлки из вненей системы.
	
	УстановитьВидимостьКнопкиПодбораРасписания(Объект, Элементы.РаботыПодборВремени, ТекущийРежимЗаписиНаПрием, мУчетнаяПолитика);
	
	ОбновитьСвойства();
	ОбновитьВидимостьСтраницПанелиФормы(Элементы.Страницы);
	
	НесколькоКлиентов = РаботаСКлиентамиПереопределяемый.ЭтоГрупповаяЗаявка(Объект.Клиент);
	Элементы.Клиент.Доступность = Не НесколькоКлиентов;
	
	// Добавлено Макеев (
	Если Объект.Состояние = ПолучитьСостояниеПришел() Тогда
		Элементы.омг_Пришел.ЦветФона = Новый Цвет(0,128,0);
	Иначе
		Элементы.омг_Пришел.ЦветФона = ЦветаСтиля.ЦветФонаПоля;
	КонецЕсли;
	Если Параметры.Ключ.Пустая() Тогда
		Объект.НесколькоСотрудников = Ложь;
	КонецЕсли;
	Если Объект.омг_Прейскурант.Пустая() Тогда
		Объект.омг_Прейскурант = ЭтаФорма.РеквизитПрейскурант;
	КонецЕсли;
	Если Не Объект.омг_Прейскурант = ЭтаФорма.РеквизитПрейскурант Тогда
		ЭтаФорма.РеквизитПрейскурант = Объект.омг_Прейскурант;
	КонецЕсли;
	// )   
	
	/////////////////////////////////////////////////////////////////////////////////
	// ОМГ    
	Если РольДоступна("омг_ЗапретРедактированияОтветственного") Тогда
		Элементы.Ответственный.ТолькоПросмотр = Истина;
	КонецЕсли;	 
	
	Элементы.омг_РаботыВремяНачала.Видимость = Объект.НесколькоСотрудников;
	Элементы.омг_РаботыДатаНачала.Видимость = Объект.НесколькоСотрудников; 
	Элементы.омг_РаботыВремяОкончания.Видимость = Объект.НесколькоСотрудников;
	НовыйЭлемент = Элементы.Добавить("Количество",Тип("ПолеФормы"),Элементы.Работы);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Работы.Количество";
	НовыйЭлемент.Видимость = Истина;   
	Элементы.Переместить(НовыйЭлемент,Элементы.Работы,Элементы.Работыомг_Продано);

	//НовыйЭлемент = Элементы.Добавить("омг_РаботыДатаОкончания",Тип("ПолеФормы"),Элементы.Работы);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	//НовыйЭлемент.ПутьКДанным = "Объект.Работы.ДатаОкончания";
	//НовыйЭлемент.Видимость = Ложь;
			
	Омг_НесколькоВрачей();	
	ОМГ_ПроверитьРиски();  
	Если не Объект.Ссылка.Пустая() Тогда
		ОМГ_ЗаполнитьПродажи()
	КонецЕсли;
	Элементы.Работыомг_НаправившийВрач.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	Элементы.Работыомг_НаправившийВрач.ДоступныеТипы = Новый ОписаниеТипов("СправочникСсылка.Контрагенты"); 
	
	Элементы.Состояние.Доступность = ?(РольДоступна("ПолныеПрава") или РольДоступна("омг_Оператор"),Истина,Ложь); 
	
	// ОМГ
    /////////////////////////////////////////////////////////////////////////////////

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
 	мПериодичностьПланирования			  = мУчетнаяПолитика.ПериодичностьПланирования;
	мИспользоватьАвтоПодборКлиентовПоКоду = мУчетнаяПолитика.ИспользоватьАвтоПодборКлиентовПоКоду;
	мТекущаяДатаДокумента = Объект.Дата;
	
	Если ДополнительныеСвойства.Свойство("ЗаписьВЖурналЗаписиФилиалаЗапрещенаПользователю") Тогда
		Предупреждение(НСтр("ru='Запись в журнал записи в указанный филиал запрещена Вашему пользователю!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Истина // ИспользоватьПодключаемоеОборудование  Проверка на включенную ФО "Использовать ВО"
	   И МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда // Проверка на определенность рабочего места ВО.
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
		
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);    
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, ПоддерживаемыеТипыВО);

	КонецЕсли;

	РаботаСФормамиКлиент.ОчиститьЛишниеКомандыПобор(ЭтаФорма);
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
	РассчитатьПродолжительностьПосещения(Продолжительность);
	ПересчитатьДоступностьВремениОкончания();
	УстановитьКабинетыВТЧ();
	
	Если мУчетнаяПолитика.ИспользоватьХочуРаньшеВЗаявках Тогда
		ОбновитьОграничениеТиповОтборовХочуРаньше();
		УстановитьВидимостьОтбораХочуРаньше(Элементы.ОтборыХочуРаньше, Элементы.ВидОтбораХочуРаньше.СписокВыбора, Объект.ОтборХочуРаньше);
	КонецЕсли;
	
	НоваяЗаявка = Объект.Ссылка.Пустая();
	
	фитОбновитьОтображениеЭлементовФормы();  
	
	//////////////////////////////////////////////////////////////////////////////
	// ОМГ    
	
    ЗаполнитьКомПанель();
	
	Если НоваяЗаявка Тогда
		
		Если Объект.Работы.Количество() = 0 Тогда
			Если Объект.ДатаОкончания <> Объект.ДатаНачала Тогда
				Объект.Работы.Добавить();
				КорректируемаяСтрока = Объект.Работы[0];
				КорректируемаяСтрока.Продолжительность = Дата(1,1,1) + (Объект.ДатаОкончания - Объект.ДатаНачала)
			КонецЕсли; 
		иначе
			Для каждого строкаРаботы из Объект.Работы Цикл
				Если строкаРаботы.Продолжительность = Дата(1,1,1) Тогда
					строкаРаботы.Продолжительность 	= Дата(1,1,1) + (Объект.ДатаОкончания - Объект.ДатаНачала)				
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;  
		
	КонецЕсли;
	ОмгПродолжительность(); 
	омг_БлокировкаМедПерсонала(); 
	Элементы.ФормаОбщаяКомандаПечатьПоУмолчанию.Видимость = Ложь;
	// ОМГ
	//////////////////////////////////////////////////////////////////////////////
	// Для 8.5 Карсаков
	Элементы.ГруппаСтраниц.Скрыть();
	ЗаполнитьИнструкциюНаСервере();

	ОбновитьИнформациюОКорзине();
    ОбновитьИнформациюОМедПерсонале();
    // Конец для 8.5 Карсаков
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
			
	ТипСостояния = ДопСерверныеФункции.ПолучитьРеквизит(Объект.Состояние, "ТипСостояния");
	Если Объект.ДатаНачала = Объект.ДатаОкончания И
		Не Объект.ПометкаУдаления И
		ТипСостояния <> ПредопределенноеЗначение("Перечисление.ТипыСостоянийЗаявок.Выполнена") И
		Объект.Состояние <> ПредопределенноеЗначение("Справочник.ВидыСостоянийЗаявок.Выполнена") И
		ТипСостояния <> ПредопределенноеЗначение("Перечисление.ТипыСостоянийЗаявок.Отменена")  И
		Объект.Состояние <> ПредопределенноеЗначение("Справочник.ВидыСостоянийЗаявок.Отменена") И 
		ТипСостояния <> ПредопределенноеЗначение("Перечисление.ТипыСостоянийЗаявок.Выполняется")
	//////////////////////////////////////////////////////////////////////////////
	// ОМГ
	И  не Объект.омг_БезЗаписи 
	// ОМГ
	//////////////////////////////////////////////////////////////////////////////

	Тогда
		Ответ = Вопрос(НСтр("ru='Заявка имеет нулевую продолжительность и поэтому не будет отображена в журнале записи. Всё равно записать?'"),
						РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет, НСтр("ru='Продолжительность не указана'"), КодВозвратаДиалога.Нет);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда 
			Отказ = Истина;					
		КонецЕсли;				
	КонецЕсли;
	ОчиститьОборудование();
	Если КалендарьПланирования.ИнтерактивнаяСменаСостоянияЗаявкиТребуетУказанияПричиныОтмены(Объект.Состояние, Объект.Ссылка) Тогда
		ОтменитьЗаявкуКлиент(Отказ, Объект.Состояние);
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
	Если мУчетнаяПолитика.ИспользоватьХочуРаньшеВЗаявках Тогда
		ПроверитьКорректностьОтборовЗаявкиХочуРаньше(Отказ);	
	КонецЕсли;
	
	// Подготовка к автоустановке исхода звонка или обработки обращения.
	Если ЗначениеЗаполнено(Объект.Основание)
		И (		ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Событие")
			Или	ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЛистОжидания"))
	Тогда
		// Изменено Макеев (
		//Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Событие") Тогда
		//	//ФормаСобытия = ПолучитьФорму("Документ.Событие.ФормаОбъекта", Новый Структура("Ключ", Объект.Основание));
		//ИначеЕсли ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЛистОжидания") Тогда
		//	ФормаСобытия = ПолучитьФорму("Документ.ЛистОжидания.ФормаОбъекта", Новый Структура("Ключ", Объект.Основание));
		//КонецЕсли;
		//Если Не ФормаСобытия.Открыта() Тогда
		//	ПараметрыЗаписи.Вставить("ДокументОснованиеДляОбновления", Объект.Основание);
		//КонецЕсли;
		// )
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Организация  = омг_ДополнительныеАлгоритмы.омг_ВернутьОрганизациюПоФилиалу(Объект.Филиал);
		
		Если ЗначениеЗаполнено(Организация) Тогда
			
			Если не ВернутьСтатусОплаты() и Не ЗначениеЗаполнено(Объект.ОМГ_ПричинаОтсутствияПредоплаты) и омг_Предоплата.омг_ИспользуетсяПредоплата(Организация) Тогда
				
				Отказ = Истина; 
				
				Ответ = Вопрос(" ",
				РежимДиалогаВопрос.ОК,
				0, // таймаут в секундах
				КодВозвратаДиалога.ОК, // (необ.) кнопка по умолчанию
				"Возьмите предоплату или выберите причину отсутствия предоплаты!" // (необ.) заголовок
				);

				//Ответ = Вопрос(" ",
				//РежимДиалогаВопрос.ДаНет,
				//0, // таймаут в секундах
				//КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
				//"Взять предоплату?" // (необ.) заголовок
				//);
				//
				//Если Ответ = КодВозвратаДиалога.Да Тогда 
				//	
				//	Кнопки = Новый СписокЗначений;
				//	Кнопки.Добавить("БанковскаяКарта", "Банковская карта");
				//	Кнопки.Добавить("Наличные", "Наличные");
				//	
				//	Ответ = Вопрос("Выберите тип оплаты:",Кнопки,0,"БанковскаяКарта", "Предоплата");
				//	
				//	ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
				//					
				//	Если Ответ = "Наличные" Тогда
				//		
				//		ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.Форма.ФормаДокументаУпр", ПараметрыФормы);
				//		
				//	ИначеЕсли Ответ = "БанковскаяКарта" Тогда
				//		
				//		ОткрытьФорму("Документ.ОплатаПлатежнойКартой.Форма.ФормаДокументаУпр", ПараметрыФормы);
				//		
				//	КонецЕсли;    
				//	
				//	ОбновитьПредоплату();  
				//	
				//иначе 
				//	
				//	Результат = ОткрытьФормуМодально("Справочник.ОМГ_ПричинаОтсутствияПредоплаты.ФормаВыбора");
				//	
				//	Если Результат <> Неопределено Тогда
				//		Объект.ОМГ_ПричинаОтсутствияПредоплаты = Результат 
				//	иначе
				//		Отказ = Истина; 
				//		Сообщить("Выберите причину отсутствия предоплаты",статусСообщения.ОченьВажное);
				//	КонецЕсли;
				//	
				//КонецЕсли;
				
			КонецЕсли; 
		КонецЕсли;	
		Если ЗначениеЗаполнено(Объект.омг_СтраховаяПрограмма) и ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			Стр = "";
			
			ТекстОшибкиПоСтраховым = омг_ПроверкаНаПовторСтраховых();  
			
			Если не ТекстОшибкиПоСтраховым = "" Тогда
				Сообщить("По данному клиенту в течении последних 30-ти дней были уже были зарегестрированы следующие услуги:" + Символы.ПС +ТекстОшибкиПоСтраховым,СтатусСообщения.ОченьВажное);
				Если ВвестиСтроку(Стр, "Укажите причину повторной регистрации клиента по договору страхования (минимум 5 символов)",300,Истина)  Тогда 
					Если СтрДлина(Стр) < 5 Тогда 
						Сообщить("Минимум 5 символов!",статусСообщения.ОченьВажное);
						Отказ = Истина;
					Иначе	
						Объект.омг_ПричинаПовтораСтраховых  = Стр
					КонецЕсли;
				иначе
					Отказ = Истина;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//////////////////////////////////////////////////////////////////////////////
	// ОМГ       

	Если не Объект.омг_БезЗаписи Тогда 
	// ОМГ
	//////////////////////////////////////////////////////////////////////////////

	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗаписьВФорме");
	
	// Установить необходимость указания причины закрытия заявки, если требуется.
	КалендарьПланирования.ЗаявкаПриИнтерактивнойСменеСостояния(ТекущийОбъект);
	
	СвойстваИЗначенияСервер.ПодготовитьКЗаписиЗначенияСвойствВФорме(ТекущийОбъект, Свойства.СвойстваИЗначения);
	
	//////////////////////////////////////////////////////////////////////////////
	// ОМГ
	КонецЕсли; 
	// ОМГ
	//////////////////////////////////////////////////////////////////////////////

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);
	
	// Если форма открыта на основании листа ожидания с указанием дополнительных листов записи, они тоже выполняются.
	Если ТипЗнч(Параметры.ПараметрыЗаписиПоДокументу) = Тип("Структура")
		И Параметры.ПараметрыЗаписиПоДокументу.Свойство("СопутствующиеЛистыОжидания")
	Тогда
	    СопутствующиеЛистыОжидания = Параметры.ПараметрыЗаписиПоДокументу.СопутствующиеЛистыОжидания;
		Для Каждого ЛистОжидания Из СопутствующиеЛистыОжидания Цикл
			Попытка
				CRMСервер.ОтметитьВыполнениеЛистаОжидания(ЛистОжидания, Объект.Ссылка);
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	// Автоустановка исхода звонка или обработки обращения.
	ДокументОснованиеДляОбновления = Неопределено;
	ПараметрыЗаписи.Свойство("ДокументОснованиеДляОбновления", ДокументОснованиеДляОбновления);
	Если ТипЗнч(ДокументОснованиеДляОбновления) = Тип("ДокументСсылка.Событие") Тогда
		Попытка
			CRMСервер.УстановитьИсходЗаписанСобытию(Объект.Основание, Объект.Ссылка);
		Исключение
		КонецПопытки;
		ДокументОснованиеДляОбновления = Неопределено;
	ИначеЕсли ТипЗнч(ДокументОснованиеДляОбновления) = Тип("ДокументСсылка.ЛистОжидания") Тогда
		Попытка
			CRMСервер.ОтметитьВыполнениеЛистаОжидания(Объект.Основание, Объект.Ссылка);
		Исключение
		КонецПопытки;
		ДокументОснованиеДляОбновления = Неопределено;
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////
	// ОМГ
	Если не Объект.омг_БезЗаписи Тогда 
	// ОМГ
	//////////////////////////////////////////////////////////////////////////////

	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ОповеститьОбИзмененииЗаявки") Тогда
		ДополнительныеСвойства.Вставить("ОповеститьОбИзмененииЗаявки", ТекущийОбъект.ДополнительныеСвойства.ОповеститьОбИзмененииЗаявки);
	КонецЕсли;
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ИзменилосьТолькоСостояние") Тогда
		ДополнительныеСвойства.Вставить("ИзменилосьТолькоСостояние", ТекущийОбъект.ДополнительныеСвойства.ИзменилосьТолькоСостояние);
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////
	// ОМГ
	КонецЕсли; 
	ОМГ_ЗаполнитьПродажи();
	// ОМГ
	//////////////////////////////////////////////////////////////////////////////

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//////////////////////////////////////////////////////////////////////////////
	// ОМГ
		
	Если не Объект.омг_БезЗаписи Тогда 
	// ОМГ
	//////////////////////////////////////////////////////////////////////////////

	ПараметрыОповещенияЗаявкаИзменение = Новый Структура("Дата, Ссылка", Новый Массив, Объект.Ссылка);
	ПараметрыОповещенияЗаявкаИзменение.Дата.Добавить(Объект.ДатаНачала);
	
	// Оповещение той даты, с которой переместили заявку
	Если ЗначениеЗаполнено(ДатаЗаявкиПредыдущейВерсииДокумента) 
		И ДатаЗаявкиПредыдущейВерсииДокумента <> Объект.ДатаНачала
	Тогда
		ПараметрыОповещенияЗаявкаИзменение.Дата.Добавить(ДатаЗаявкиПредыдущейВерсииДокумента);
	КонецЕсли;
	ДатаЗаявкиПредыдущейВерсииДокумента = Объект.ДатаНачала;
	
	Если ДополнительныеСвойства.ОповеститьОбИзмененииЗаявки Тогда
		Если ДополнительныеСвойства.Свойство("ИзменилосьТолькоСостояние") Тогда
			ПараметрыОповещенияЗаявкаИзменение.Вставить("ИзменилосьТолькоСостояние", ДополнительныеСвойства.ИзменилосьТолькоСостояние);
		КонецЕсли;
		Оповестить("ЗаявкаИзменение", ПараметрыОповещенияЗаявкаИзменение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда  
		Оповестить("ЗаявкаПоДокументуЗапись", Новый Структура("ДокументЗаписи, Заявка", Объект.Основание, Объект.Ссылка), Объект.Ссылка);
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////
	// ОМГ
	КонецЕсли; 
	// ОМГ
	/////////////////////////////////////////////////////////////////////////////
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	// МеханизмВнешнегоОборудования
	ПоддерживаемыеТипыВО = Новый Массив();
	ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
	ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	// Конец МеханизмВнешнегоОборудования
	
	Если Не ЗавершениеРаботы Тогда
		Если НоваяЗаявка И ЗначениеЗаполнено(Объект.Ссылка)
			И Не ЗначениеЗаполнено(Объект.Основание)
			И CRMСервер.НайтиВероятныеЛистыОжиданияПоЗаявке(Объект.Ссылка, Истина)
		Тогда
			ОткрытьФорму("ОбщаяФорма.ЛистыОжиданияКлиента", Новый Структура("Заявка", Объект.Ссылка));	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" Тогда
		Если ВводДоступен() Тогда
			ТипШК = Неопределено;
			РаботаСТорговымОборудованиемКлиент.ОбработатьСобытиеСШКФормы(ЭтаФорма, Параметр, ТипШК);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "TracksData" Тогда
		Если ВводДоступен() Тогда
			КодКарты = Неопределено;
			СМК = Неопределено;
			РаботаСТорговымОборудованиемКлиент.ОбработатьСобытиеСМК(ЭтаФорма,  Параметр[0], СМК, Неопределено, Неопределено);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ЗаявкаИзменена" И Параметр = Объект.Ссылка Тогда
		Прочитать();
	ИначеЕсли ИмяСобытия = "ЗаписьОУпоГрупповойЗаявке" Тогда
		Если Параметр.Заявка = Объект.Ссылка Тогда
			ЗаполнитьСведенияОПосещенияхПоГрупповойЗаявке();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора, РучноеРедактирование = Ложь)
	
	Результат = "";
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		
		ДобавитьВыбранныеУслугиНаСервере(ВыбранноеЗначение);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Клиенты") Тогда
		Если ЭтоГрупповаяЗаявка() Тогда
			ОбработкаВыбораКлиентаГрупповойЗаявки(ВыбранноеЗначение);
		Иначе
			Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
				Объект.Клиент = ВыбранноеЗначение;
			КонецЕсли;
		КонецЕсли; 
		ОМГ_ОтобразитьИИН();
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		Результат = ОбработкаВводаНоменклатуры(ВыбранноеЗначение.Номенклатура, ВыбранноеЗначение.Количество);
	Иначе
		ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			СтрокаТабличнойЧасти = Элементы.Работы.ТекущиеДанные.НомерСтроки-1;
			Если СтрокаТабличнойЧасти <> Неопределено Тогда
				ПозицияВводаСтроки = СтрокаТабличнойЧасти;
				Если РаботаСФормамиСервер.ЭтоНабор(Элементы.Работы.ТекущиеДанные.Номенклатура) Тогда
					Объект.Работы.Удалить(ПозицияВводаСтроки);
				КонецЕсли;
			Иначе
				ПозицияВводаСтроки = Объект.Работы.Количество()-1;
			КонецЕсли;
		Иначе
			ПозицияВводаСтроки = Неопределено;
		КонецЕсли;
		Результат = ОбработкаВводаНоменклатуры(ВыбранноеЗначение,,ПозицияВводаСтроки, РучноеРедактирование);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Результат) Тогда 
		Предупреждение(Результат);
	КонецЕсли;
	ОбновитьИнформациюОКорзине();

КонецПроцедуры 
&НаСервере
Процедура ДобавитьВыбранныеУслугиНаСервере(МассивУслуг)
	
	Для Каждого ДанныеУслуги Из МассивУслуг Цикл
		
		НоваяСтрока = Объект.Работы.Добавить();
		НоваяСтрока.Номенклатура = ДанныеУслуги.Номенклатура;
		НоваяСтрока.Количество   = ДанныеУслуги.Количество;
		Если ДанныеУслуги.Свойство("омг_Набор") Тогда
			НоваяСтрока.омг_Набор = ДанныеУслуги.омг_Набор;
		КонецЕсли;
		Если ДанныеУслуги.Свойство("омг_НаборЛИС") Тогда
    		НоваяСтрока.омг_НаборЛИС = ДанныеУслуги.омг_НаборЛИС;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ОбработкаВводаНоменклатуры(Номенклатура, Количество = 1, ПозицияВводаСтроки = Неопределено, РучноеРедактирование = Ложь)
	
	// Изменения Макеев 07-12-2025 (
	Если Номенклатура.ЭтоГруппа Тогда
		Возврат "";
	КонецЕсли;
	
	Если Номенклатура.Пустая() Или Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда
		ОбработкаВнесенияРаботы(Номенклатура, Количество, ПозицияВводаСтроки, Объект, РучноеРедактирование);
	ИначеЕсли Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор Тогда
		СоставНабора = ОбщегоНазначенияСервер.ПолучитьСоставНабора(Номенклатура);
		МассивНаборов = Новый Массив;
		МассивКомплектующих = Новый Массив; 
		МассивНаборов.Добавить(Номенклатура);
		омг_ПолучитьВсеНаборы(СоставНабора,МассивНаборов,МассивКомплектующих);
		Для Каждого СтрокаСостава Из МассивКомплектующих Цикл
			// Изменено Макеев ( 
			Если не СтрокаСостава.омг_Набор = Номенклатура Тогда
			омг_НаборУровень = СтрокаСостава.омг_Набор
			иначе
			омг_НаборУровень = Неопределено
			КонецЕсли;
			ОбработкаВнесенияРаботы(СтрокаСостава.Комплектующая, СтрокаСостава.Количество*Количество, ПозицияВводаСтроки, Объект,, Номенклатура,омг_НаборУровень, СтрокаСостава.ЭтоНаборЛИС);
			// )
			Если ПозицияВводаСтроки <> Неопределено Тогда
				ПозицияВводаСтроки = ПозицияВводаСтроки + 1;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Возврат Строка("Номенклатура "+Строка(Номенклатура)+" не является работой. Допускается только подбор работ.");
	КонецЕсли; 
	
	Возврат "";
	
КонецФункции

&НаСервере
Процедура ОбработкаВнесенияРаботы(Номенклатура, Количество, ПозицияВводаСтроки, ДокументОбъект, 
	РучноеРедактирование = Ложь, Набор = Неопределено,омг_НаборУровень= Неопределено, ЭтоНаборЛИС = Ложь)

	
	// Изменения Макеев 07-12-2025 (
	Если Количество = 0 Тогда
		Количество = 1;
	КонецЕсли;
	
	Если ПозицияВводаСтроки <> Неопределено
		И ПозицияВводаСтроки < (ДокументОбъект.Работы.Количество() - 1)
	Тогда
		СтрокаРаботы = ДокументОбъект.Работы[ПозицияВводаСтроки];
	Иначе
		СтруктураПоиска = Новый Структура("Номенклатура", Номенклатура);
		// Добавлено Макеев (
		Если Набор = Неопределено Тогда 
			СтруктураПоиска.Вставить("омг_Набор", Справочники.Номенклатура.ПустаяСсылка());
		Иначе
			СтруктураПоиска.Вставить("омг_Набор", Набор);
		КонецЕсли;
		// )
		СуществующиеСтрокиРабот = ДокументОбъект.Работы.НайтиСтроки(СтруктураПоиска);
		Если СуществующиеСтрокиРабот.Количество() > 0 Тогда
			СтрокаРаботы = СуществующиеСтрокиРабот[СуществующиеСтрокиРабот.Количество() - 1]; 
		////////////////////////////////////////////////////////////////
		// ОМГ
			СтрокаРаботы.Количество = СтрокаРаботы.Количество + Количество;
		Иначе
			СтрокаРаботы = ДокументОбъект.Работы.Добавить(); 
			СтрокаРаботы.Количество = Количество; 
		// ОМГ
	    ////////////////////////////////////////////////////////////////
		КонецЕсли;
	КонецЕсли;
	
	ИнкрементацияКоличества = Не РучноеРедактирование И СтрокаРаботы.Номенклатура = Номенклатура;
	СтрокаРаботы.Номенклатура = Номенклатура;
	
	Если Объект.РежимДлительностиЗаявки <> Перечисления.РежимДлительностиЗаявки.Фиксированная Тогда
		// Установка продолжительности по норме
		Если ЗначениеЗаполнено(СтрокаРаботы.Номенклатура) Тогда
			
			СтрокаРаботы.ПродолжительностьИзмененаВручную = Ложь;
			
			ИспользоватьОсновнуюПродолжительностьРаботы = Истина;
			ТекущийСотрудник = ПолучитьТекущегоСотрудникаРабот(СтрокаРаботы, Объект.Сотрудник, Объект.НесколькоСотрудников);
			
			нзОУС = РегистрыСведений.ОсновныеУслугиСотрудников.СоздатьНаборЗаписей();
			нзОУС.Отбор.Сотрудник.Установить(ТекущийСотрудник);
			нзОУС.Отбор.Номенклатура.Установить(СтрокаРаботы.Номенклатура);
			нзОУС.Прочитать();
			Если нзОУС.Количество() <> 0 Тогда
				СтрокаУслуги = нзОУС[0];
				Если (СтрокаУслуги.Часы + СтрокаУслуги.Минуты) <> 0 Тогда
					ПродолжительностьУслугиЧас = СтрокаУслуги.Часы;	
					ПродолжительностьУслугиМин = СтрокаУслуги.Минуты;
					ИспользоватьОсновнуюПродолжительностьРаботы = Ложь;
			    КонецЕсли;
			КонецЕсли;
			
			Если ИспользоватьОсновнуюПродолжительностьРаботы Тогда
				ПродолжительностьУслугиЧас = СтрокаРаботы.Номенклатура.ПродолжительностьЧас;	
				ПродолжительностьУслугиМин = СтрокаРаботы.Номенклатура.ПродолжительностьМин;
			КонецЕсли;
			
			СтрокаРаботы.Продолжительность	= Дата(1,1,1)
											+ (ПродолжительностьУслугиЧас*60*60
											+  ПродолжительностьУслугиМин*60)
											* Количество
											+ ?(ИнкрементацияКоличества, ОбщегоНазначения.ВремяВСекунды(СтрокаРаботы.Продолжительность), 0);
		КонецЕсли;
	ИначеЕсли ПозицияВводаСтроки = 0 Тогда
		СтрокаРаботы.Продолжительность = Дата(1,1,1) + Продолжительность * 60;
	КонецЕсли;
		
	ЭтаФорма.Элементы.Работы.ТекущаяСтрока = СтрокаРаботы.ПолучитьИдентификатор();

	ПересчетВремениОкончания(Объект, Продолжительность);
	// Добавлено Макеев (    
	
	Если не ЗначениеЗаполнено(СтрокаРаботы.ДатаНачала) и не ЗначениеЗаполнено(СтрокаРаботы.ДатаОкончания) Тогда
		    ЗаполнитьЗначенияСвойств(СтрокаРаботы, Объект,"ДатаНачала,ДатаОкончания");
			//СтрокаРаботы.Продолжительность = Дата(1,1,1) + (Объект.ДатаОкончания - Объект.ДатаНачала);
	КонецЕсли;

	СтрокаРаботы.омг_НаправившийВрач = ЭтаФорма.омг_ТекущийВрач;
	СтрокаРаботы.омг_Набор = Набор;
	Если не омг_НаборУровень = Неопределено Тогда
		СтрокаРаботы.омг_НаборУровень = омг_НаборУровень;
	КонецЕсли;
	Если ЭтоНаборЛИС Тогда
		СтрокаРаботы.омг_НаборЛИС = омг_НаборУровень;
	КонецЕсли;
	// )
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчетВремениОкончания(Объект, Продолжительность = Неопределено)
	
	/////////////////////////////////////////////////////////////
	// ОМГ 	
	Если не Объект.НесколькоСотрудников Тогда

	Объект.ДатаОкончания = Объект.ДатаНачала;
	Объект.ВремяОкончания = Объект.ВремяНачала;
	
	Если Объект.РежимДлительностиЗаявки <> ПредопределенноеЗначение("Перечисление.РежимДлительностиЗаявки.Фиксированная") Тогда
		Для Каждого СтрокаТабличнойЧасти Из Объект.Работы Цикл
			ПродолжительностьСтроки = (СтрокаТабличнойЧасти.Продолжительность-НачалоДня(СтрокаТабличнойЧасти.Продолжительность));
			
			Если Объект.ДатаОкончания + ПродолжительностьСтроки > КонецДня(Объект.ДатаНачала)+1 Тогда
				СтрокаТабличнойЧасти.Продолжительность = Дата(1,1,1) + 86400 - ОбщегоНазначенияКлиентСервер.ВремяВСекунды(Объект.ВремяОкончания);
				Объект.ВремяОкончания =	Дата(1,1,1);
				Объект.ДатаОкончания  = КонецДня(Объект.ДатаНачала) + 1; 
			Иначе	
				Объект.ВремяОкончания = Объект.ВремяОкончания + ПродолжительностьСтроки;
				Объект.ДатаОкончания  = Объект.ДатаОкончания  + ПродолжительностьСтроки;
			КонецЕсли;
		КонецЦикла;
	Иначе
		СтрокаТабличнойЧасти = Объект.Работы[0];		
		Если Объект.ДатаОкончания + Продолжительность * 60 > КонецДня(Объект.ДатаНачала)+1 Тогда
			СтрокаТабличнойЧасти.Продолжительность = Дата(1,1,1) + 86400 - ОбщегоНазначенияКлиентСервер.ВремяВСекунды(Объект.ВремяОкончания);
			Объект.ВремяОкончания =	Дата(1,1,1);
			Объект.ДатаОкончания  = КонецДня(Объект.ДатаНачала) + 1; 
		Иначе	
			Объект.ВремяОкончания = Объект.ВремяОкончания + Продолжительность * 60;
			Объект.ДатаОкончания  = Объект.ДатаОкончания  + Продолжительность * 60;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВремяОкончания) Тогда
	    Продолжительность = (КонецДня(Объект.ВремяОкончания)+1 - Объект.ВремяНачала)/60;
	Иначе
		Продолжительность = (Объект.ВремяОкончания - Объект.ВремяНачала)/60;
	КонецЕсли;
	КонецЕсли;
    // ОМГ 
	/////////////////////////////////////////////////////////////
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ФиксированнаяПродолжительность(Объект, Продолжительность)
	
	Если Объект.Работы.Количество() = 0 Тогда
		Объект.Работы.Добавить();
	КонецЕсли;
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.Работы Цикл
		СтрокаТабличнойЧасти.Продолжительность = Дата(1,1,1);
	КонецЦикла;
	
	Объект.Работы[0].Продолжительность = Дата(1,1,1) + Продолжительность * 60;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииСервер(мТекущаяДатаДокумента);
	мТекущаяДатаДокумента = Объект.Дата;
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииСервер(НачальнаяДатаДокумента)
	
	РаботаСДиалогамиСервер.ПроверитьНомерДокумента(ЭтаФорма, НачальнаяДатаДокумента);	
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)

	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора, мИспользоватьАвтоПодборКлиентовПоКоду);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)

	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора, мИспользоватьАвтоПодборКлиентовПоКоду);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискКлиентов(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаПоискаКлиентаУпр_85",,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Объект.ДатаНачала = НачалоДня(Объект.ДатаНачала) + ОбщегоНазначенияКлиентСервер.ВремяВСекунды(Объект.ВремяНачала);

	Если Объект.ДатаНачала + Продолжительность*60 > КонецДня(Объект.ДатаНачала) + 1 Тогда 
		// При такой дате начала время в заявку не влезет - отбрасываем время начала.
	    Объект.ДатаНачала	 = КонецДня(Объект.ДатаНачала) + 1 - Продолжительность*60;
		Объект.ДатаОкончания = КонецДня(Объект.ДатаНачала) + 1; 
	КонецЕсли;
	
	Объект.ВремяНачала	 = Объект.ДатаНачала;
	Объект.ДатаОкончания = Объект.ДатаНачала + 60 * Продолжительность;
	
	ОбновитьВыпадающийСписокСотрудников(); 
	
	 ////////////////////////////////////////////////////
	 // ОМГ
	   ЭтаФорма.РеквизитСписокПодбор.Параметры.УстановитьЗначениеПараметра("ДатаДок",Объект.ДатаНачала);
	   РаботаСформамиКЛиент.ОбновитьДинамическийСписокПринудительно(ЭтаФорма.РеквизитСписокПодбор);
	 // ОМГ
	 ///////////////////////////////////////////////////
	 
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаПриИзменении(Элемент)
	
	ДатаНачалаПриИзменении(Элемент);
	ПересчетВремениОкончания(Объект, Продолжительность);
	//////////////////////////////////////////////////////////////////////////////
	// ОМГ
	 ОмгПродолжительность(); 
	// ОМГ
	//////////////////////////////////////////////////////////////////////////////	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ВремяОкончания) Тогда
	    Объект.ВремяОкончания = НачалоМинуты(Макс(Объект.ВремяНачала, Объект.ВремяОкончания));
		Объект.ДатаОкончания  = НачалоДня(Объект.ДатаНачала) + ОбщегоНазначенияКлиентСервер.ВремяВСекунды(Объект.ВремяОкончания);
		РассчитатьПродолжительностьПосещения(Продолжительность);
	Иначе
		Объект.ДатаОкончания  = КонецДня(Объект.ДатаНачала) + 1;
		Объект.ВремяОкончания = Объект.ДатаОкончания;
		Продолжительность = (86400 - ОбщегоНазначенияКлиентСервер.ВремяВСекунды(Объект.ВремяНачала))/60;
	КонецЕсли;
	
	СуммарнаяПродолжительность = 0;	
	КоличествоНенулевыхСтрок = 0;
	
	Если Объект.Работы.Количество() = 0 Тогда
		Если Объект.ДатаОкончания <> Объект.ДатаНачала Тогда
			Объект.Работы.Добавить();
			КорректируемаяСтрока = Объект.Работы[0];
			УстановитьВидимостьКнопкиПодбораРасписания(Объект, Элементы.РаботыПодборВремени, ТекущийРежимЗаписиНаПрием, мУчетнаяПолитика);
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		КорректируемаяСтрока = Объект.Работы[0];
		Для Каждого Работа из Объект.Работы Цикл
			Если Работа.Продолжительность > Дата(1,1,1) Тогда
				КорректируемаяСтрока = Работа;
				КоличествоНенулевыхСтрок = КоличествоНенулевыхСтрок + 1;
				СуммарнаяПродолжительность = СуммарнаяПродолжительность + (Работа.Продолжительность - Дата(1,1,1));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если КоличествоНенулевыхСтрок <= 1 Тогда
		КорректируемаяСтрока.Продолжительность = Дата(1,1,1) + (Объект.ДатаОкончания - Объект.ДатаНачала);
	Иначе
		Объект.ВремяОкончания = Объект.ВремяНачала + СуммарнаяПродолжительность;			
	КонецЕсли;
	
	Если Объект.Работы[0].Продолжительность = Дата(1,1,1)
		И Не ЗначениеЗаполнено(Объект.Работы[0].Номенклатура)
	Тогда
		Объект.Работы.Удалить(0);
		УстановитьВидимостьКнопкиПодбораРасписания(Объект, Элементы.РаботыПодборВремени, ТекущийРежимЗаписиНаПрием, мУчетнаяПолитика);
	КонецЕсли; 
	
	//////////////////////////////////////////////////////////////////////////////
	// ОМГ
	 ОмгПродолжительность(); 
	// ОМГ
	//////////////////////////////////////////////////////////////////////////////
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	
	Если НачалоДня(Объект.ДатаОкончания) <> НачалоДня(Объект.ДатаНачала)
		И Направление = 1
	Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСФормамиКлиент.ОбработчикРегулированияКвантуемогоВремени(Объект.ДатаОкончания,Направление,мПериодичностьПланирования);
	Объект.ВремяОкончания = Объект.ДатаОкончания;
	ВремяОкончанияПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПродолжительностьПосещения(Продолжительность)
	
	Если Не ЗначениеЗаполнено(Объект.ВремяОкончания)
		И НачалоДня(Объект.ДатаОкончания) <> НачалоДня(Объект.ДатаНачала)
	Тогда
		Продолжительность = (86400 - ОбщегоНазначенияКлиентСервер.ВремяВСекунды(Объект.ВремяНачала))/60
	Иначе
		Продолжительность = (Объект.ВремяОкончания - Объект.ВремяНачала)/60;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжительностьПриИзменении(Элемент)
	
	Продолжительность = Мин(Продолжительность, (86400 - ОбщегоНазначенияКлиентСервер.ВремяВСекунды(Объект.ВремяНачала))/60);
	
	Если Продолжительность < (КонецДня(Объект.ВремяНачала) - Объект.ВремяНачала)/60 Тогда
		Объект.ВремяОкончания = Объект.ВремяНачала + Продолжительность * 60;
		Объект.ВремяОкончания = Макс(Объект.ВремяОкончания, Объект.ВремяНачала);
	Иначе
		Объект.ВремяОкончания = Дата(1,1,1);
	КонецЕсли;
	
	ВремяОкончанияПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжительностьРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	
	КвантПланирования = ОбщегоНазначенияКлиент.ВремяВСекунды(мПериодичностьПланирования) / 60; // В минутах.
	Продолжительность = Продолжительность + КвантПланирования * Направление;
	
	ПродолжительностьПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	////Код из версии 8.3. Не используется в 8.5(
	//РаботаСФормамиКлиент.КнопкаПодборПриНажатии(ЭтаФорма, "Работы");	
	//Элементы.ГруппаПодбор.Ширина = 50;
	//Элементы.ГруппаШапкаПраво.Видимость = не Элементы.ГруппаПодбор.Видимость;
	//Элементы.Работыомг_НаправившийВрач.Видимость = не Элементы.ГруппаПодбор.Видимость;
	//Элементы.РаботыПродолжительность.Видимость = не Элементы.ГруппаПодбор.Видимость;
	//Элементы.ГруппаНомерИДата.Видимость = не Элементы.ГруппаПодбор.Видимость;
	//Элементы.ГруппаКомандыЗаявки.Видимость = не Элементы.ГруппаПодбор.Видимость;
	////   Элементы.ГруппаДанныхОКлиенте.Видимость = не Элементы.ГруппаПодбор.Видимость;


	//Элементы.ГруппаДокумента.Ширина = ?(Элементы.ГруппаПодбор.Видимость,10,0);
	//)
	/////////////////////////////////////
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Филиал", Объект.Филиал); 
	ПараметрыПодбора.Вставить("СтраховаяПрограмма", Объект.омг_СтраховаяПрограмма);
	ПараметрыОкна = Новый Структура;
	ПараметрыОкна.Вставить("РежимОткрытияОкна", РежимОткрытияОкнаФормы.Независимый);
	
	ОткрытьФорму("Обработка.омг_ПодборУслуг_85.Форма.Форма85", ПараметрыПодбора, ЭтаФорма,,,,,РежимБлокировкиПриОткрытииОкнаФормы.БлокироватьВладельца,РежимОтображенияОкнаФормы.ВДиалоговомОкне);
КонецПроцедуры

&НаСервере
Процедура ДобавитьРаботыИзПодбораНаСервере(МассивВыбранныхУслуг)
	
	Для Каждого ДанныеУслуги Из МассивВыбранныхУслуг Цикл
		
		ПараметрыПоиска = Новый Структура("Номенклатура", ДанныеУслуги.Номенклатура);
		НайденныеСтроки = Объект.Работы.НайтиСтроки(ПараметрыПоиска);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			НоваяСтрока = НайденныеСтроки[0];
			НоваяСтрока.Количество = НоваяСтрока.Количество + ДанныеУслуги.Количество;
		Иначе
			НоваяСтрока = Объект.Работы.Добавить();
			НоваяСтрока.Номенклатура = ДанныеУслуги.Номенклатура;
			НоваяСтрока.Количество   = ДанныеУслуги.Количество;
			НоваяСтрока.Цена         = ДанныеУслуги.Цена;
		КонецЕсли;
		
		НоваяСтрока.Сумма = НоваяСтрока.Количество * НоваяСтрока.Цена;
		
		
	КонецЦикла;
	 
КонецПроцедуры

&НаКлиенте
Процедура омг_ПослеВыбораНаправившегоВрача(Врач, Номенклатура) Экспорт
	
	Если Врач = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЭтаФорма.омг_ТекущийВрач = Врач;
	
	СтандартнаяОбработка = Ложь;
	ОбработкаВводаНоменклатуры(Номенклатура, 1);
	ПересчитатьДоступностьВремениОкончания();
	Модифицированность = Истина;
	
	УстановитьВидимостьКнопкиПодбораРасписания(Объект, Элементы.РаботыПодборВремени, ТекущийРежимЗаписиНаПрием, мУчетнаяПолитика);
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ПродолжитьОбработкуВыбора(ВыбранноеЗначение, ЭлементПодбор)
	
	Если ЗначениеЗаполнено(ЭлементПодбор.ТекущиеДанные.Цена) и ЭтаФорма.омг_ТекущийВрач = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("омг_ПослеВыбораНаправившегоВрача", ЭтаФорма, ВыбранноеЗначение);
		ОткрытьФорму("ОбщаяФорма.омг_ВыборВрача", , ЭтаФорма, УникальныйИдентификатор,,, ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	иначеЕсли ЗначениеЗаполнено(ЭлементПодбор.ТекущиеДанные.Цена) и не ЭтаФорма.омг_ТекущийВрач =	Неопределено и не ВыбранноеЗначение = Неопределено Тогда
		омг_ПослеВыбораНаправившегоВрача(ЭтаФорма.омг_ТекущийВрач, ВыбранноеЗначение)	
	иначе
		Действие = "ПодборРаботы";	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеОтветаНаВопросОДобавленииПриостановленного(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	омг_ПродолжитьОбработкуВыбора(ДопПараметры.ВыбранноеЗначение, ДопПараметры.Подбор);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыборПодбор(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// Изменено Макеев (
	//СтандартнаяОбработка = Ложь;
	//ОбработкаВводаНоменклатуры(ВыбранноеЗначение, 1);
	//ПересчитатьДоступностьВремениОкончания();
	//Модифицированность = Истина;
	//
	//УстановитьВидимостьКнопкиПодбораРасписания(Объект, Элементы.РаботыПодборВремени, ТекущийРежимЗаписиНаПрием, мУчетнаяПолитика);
	// )
	// Добавлено Макеев (
	//Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Цена) Тогда
	//	ОписаниеОповещения = Новый ОписаниеОповещения("омг_ПослеВыбораНаправившегоВрача", ЭтаФорма, ВыбранноеЗначение);
	//	ОткрытьФорму("ОбщаяФорма.омг_ВыборВрача", , ЭтаФорма, УникальныйИдентификатор,,, ОписаниеОповещения,
	//	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//КонецЕсли; 
		
	// Добавлено Макеев (
	Если Элемент.ТекущиеДанные.Приостановлено И Не ВыбранноеЗначение = Неопределено Тогда
		
		ТекстВопроса = "Исследование было приостановлено лабораторией. Продолжить добавление в документ?";
		ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросОДобавленииПриостановленного", ЭтаФорма, 
			Новый Структура("Подбор, ВыбранноеЗначение", Элемент, ВыбранноеЗначение));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
		
		Возврат;
	КонецЕсли;
	// )
	///////////////////////////////////////////////////////////////////////////
	// ОМГ
	омг_ПродолжитьОбработкуВыбора(ВыбранноеЗначение, Элемент);
	// ОМГ
	///////////////////////////////////////////////////////////////////////////
	// )
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////
// ОМГ

&НаКлиенте
Процедура Подключаемый_Омг_ТолькоСЦенами(Элемент)
	
	ЭтаФорма.РеквизитСписокПодбор.Параметры.УстановитьЗначениеПараметра("Омг_ТолькоСЦенами",ЭтаФорма.Омг_ТолькоСЦенами);
	РаботаСформамиКЛиент.ОбновитьДинамическийСписокПринудительно(ЭтаФорма.РеквизитСписокПодбор); 
	
КонецПроцедуры

// ОМГ
///////////////////////////////////////////////////////////////////////////

&НаКлиенте
Процедура Подключаемый_ПрейскурантПодборПриИзменении(Элемент)
	РаботаСФормамиКлиент.УстановитьПараметрПрейскурантПодбора(ЭтаФорма);
	// Добавлено Макеев (
	Объект.омг_Прейскурант = ЭтаФорма.РеквизитПрейскурант;
	// )
КонецПроцедуры

&НаКлиенте
Процедура РаботыПослеУдаления(Элемент)
	
	Если Объект.Работы.Количество() = 0 Тогда
		НоваяСтрока = Объект.Работы.Добавить();
		НоваяСтрока.Продолжительность = Дата(1,1,1) + Продолжительность * 60;
	КонецЕсли;
	
	Если Объект.РежимДлительностиЗаявки <> ПредопределенноеЗначение("Перечисление.РежимДлительностиЗаявки.Фиксированная") Тогда
		ПересчетВремениОкончания(Объект, Продолжительность);
	Иначе
		ФиксированнаяПродолжительность(Объект, Продолжительность);
	КонецЕсли;
	
	НастройкаВидимостиКолонокРаботы();
	ПересчитатьДоступностьВремениОкончания();

	Если Объект.ХочуРаньше 
		И Объект.ОтборХочуРаньше = "К врачу, с теми же компетенциями"
	Тогда
		ЗаполнитьОтборХочуРаньшеСпециализациямиУслугДокумента();
	КонецЕсли;
	
	УстановитьВидимостьКнопкиПодбораРасписания(Объект, Элементы.РаботыПодборВремени, ТекущийРежимЗаписиНаПрием, мУчетнаяПолитика);
	 ОбновитьИнформациюОКорзине();
КонецПроцедуры

&НаКлиенте
Процедура РаботыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование И Объект.РежимДлительностиЗаявки = ПредопределенноеЗначение("Перечисление.РежимДлительностиЗаявки.Фиксированная") Тогда
		Элементы.Работы.ТекущиеДанные.Продолжительность = Дата(1,1,1);
	КонецЕсли; 
	
	//Если Элементы.Работы.ТекущиеДанные.Количество = 0 Тогда
	//	
	//	Элементы.Работы.ТекущиеДанные.Количество = 1
	//	
	//КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РаботыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПересчетВремениОкончания(Объект, Продолжительность);
	
	Если ОтменаРедактирования Тогда
		НастройкаВидимостиКолонокРаботы();
	Иначе
		ПересчитатьДоступностьВремениОкончания();
	КонецЕсли;	

	Если Объект.ХочуРаньше 
		И Объект.ОтборХочуРаньше = "К врачу, с теми же компетенциями"
	Тогда
		ЗаполнитьОтборХочуРаньшеСпециализациямиУслугДокумента();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыРаботаПриИзменении(Элемент)
	
	ОбработкаВыбора(Элемент.Родитель.ТекущиеДанные.Номенклатура, Неопределено, Истина);
	НастройкаВидимостиКолонокРаботы();
	
	УстановитьВидимостьКнопкиПодбораРасписания(Объект, Элементы.РаботыПодборВремени, ТекущийРежимЗаписиНаПрием, мУчетнаяПолитика);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыПродолжительностьПриИзменении(Элемент)
	
	ПересчетВремениОкончания(Объект, Продолжительность);
	
	ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
	ТекущаяСтрока.ПродолжительностьИзмененаВручную = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыПродолжительностьРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	
	ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
	
	РаботаСФормамиКлиент.ОбработчикРегулированияКвантуемогоВремени(ТекущаяСтрока.Продолжительность,Направление,мПериодичностьПланирования);
	ПересчетВремениОкончания(Объект, Продолжительность);
	
	ТекущаяСтрока.ПродолжительностьИзмененаВручную = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДоступностьВремениОкончания()
	
	КоличествоНенулевыхСтрок = 0;
	
	Для Каждого Работа Из Объект.Работы Цикл
		Если Работа.Продолжительность > Дата(1,1,1) Тогда
			КоличествоНенулевыхСтрок = КоличествоНенулевыхСтрок + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.РежимДлительностиЗаявки <> ПредопределенноеЗначение("Перечисление.РежимДлительностиЗаявки.Фиксированная") Тогда
		Элементы.ВремяОкончания.Доступность = Объект.Работы.Количество() <= 1
											Или (Объект.Работы.Количество() > 1 И КоличествоНенулевыхСтрок <= 1);
	
		Элементы.Продолжительность.Доступность = Элементы.ВремяОкончания.Доступность;
	Иначе
		Элементы.ВремяОкончания.Доступность = Истина;	
		Элементы.Продолжительность.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаявку(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не сохраненная заявка не может быть отменена!'"));
	ИначеЕсли Объект.ПометкаУдаления Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Заявка помечена на удаление!'"));
	Иначе
		ОтменитьЗаявкуКлиент();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаявкуКлиент(Отказ = Ложь, СостояниеОтмены = Неопределено)
	
	Если мУчетнаяПолитика.ЗапрашиватьПричинуЗакрытияЗаявок Тогда
		КалендарьПланированияКлиент.ОткрытьДиалогПричиныОтменыЗаявки(Объект.Ссылка, СостояниеОтмены);
	Иначе
		ОтменитьЗаявкуСервер();
		Если ТипЗнч(ВладелецФормы) = Тип("ТаблицаФормы") Тогда
			ВладелецФормы.Обновить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьЗаявкуСервер()
	
	ЗаявкаОбъект = РеквизитФормыВЗначение("Объект");
	КалендарьПланирования.ОтменитьЗаявкуСервер(Неопределено, ЗаявкаОбъект);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБОРУДОВАНИЕ УСЛУГ

&НаКлиенте
Процедура РаботыПриАктивизацииСтроки(Элемент)
	Если Элементы.Работы.ТекущиеДанные <> Неопределено Тогда
		НастройкаКолонокРаботы(Элементы.Работы.ТекущиеДанные.Номенклатура);
	КонецЕсли;	
КонецПроцедуры

// Настройка доступности колонок ТЧ Работы
&НаКлиенте
Процедура НастройкаКолонокРаботы(Номенклатура)
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ОборудованиеУслуги = ПроцедурыСпециализацииПоставки.ПолучитьЗначенияОборудования(Номенклатура,Объект.Филиал);
	Иначе
		ОборудованиеУслуги = Новый Структура("Оборудование1, Оборудование2, Оборудование3");
	КонецЕсли;
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.Оборудование"));
	ОписТипов = Новый ОписаниеТипов(Массив);
		
	Для Инд = 1 По ?(ПерваяКолонкаКабинеты,2,3) Цикл
		
		Элт = Элементы["РаботыОборудование" + (Инд + ?(ПерваяКолонкаКабинеты,1,0))];
		Элт.ОграничениеТипа = ОписТипов;
		
		ОборудованиеЗначениеЗаполнено = ЗначениеЗаполнено(ОборудованиеУслуги["Оборудование" + Инд]);
		Если НЕ ОборудованиеЗначениеЗаполнено 
			ИЛИ (ОборудованиеЗначениеЗаполнено И ТипЗнч(ОборудованиеУслуги["Оборудование" + Инд]) = Тип("СправочникСсылка.Оборудование")) Тогда
			ОборудованиеДоступность = Ложь;
		Иначе
			ОборудованиеДоступность = Истина;
		КонецЕсли;	
		
		Элт.ТолькоПросмотр = Не ОборудованиеДоступность;
		
	КонецЦикла;
	
	Если ПерваяКолонкаКабинеты Тогда
		Элементы.РаботыОборудование1.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры	

// Настройка доступности колонок ТЧ Работы
&НаКлиенте
Процедура НастройкаВидимостиКолонокРаботы()
	
	КолонкиРабот = Элементы.Работы.ПодчиненныеЭлементы;
	СтруктураВидимостиКолонок = Новый Структура;
	Для Инд = 1 По 3 Цикл
		СтруктураВидимостиКолонок.Вставить("РаботыОборудование"+Инд, Ложь);
	КонецЦикла;
		
	Для ИндСтр = 0 По Объект.Работы.Количество() - 1 Цикл 
		
		Если ЗначениеЗаполнено(Объект.Работы[ИндСтр].Номенклатура) Тогда 

			Если ЗначениеЗаполнено(Объект.Работы[ИндСтр].Номенклатура) Тогда
				ОборудованиеУслуги = ПроцедурыСпециализацииПоставки.ПолучитьЗначенияОборудования(Объект.Работы[ИндСтр].Номенклатура, Объект.Филиал);
			Иначе
				ОборудованиеУслуги = Новый Структура("Оборудование1, Оборудование2, Оборудование3");
			КонецЕсли;

			Для Инд = 1 По 3 Цикл 
				Если СтруктураВидимостиКолонок["РаботыОборудование"+Инд] = Ложь					
					И ТипЗнч(ОборудованиеУслуги["Оборудование"+Инд]) = Тип("СправочникСсылка.МоделиОборудования") 
				Тогда
					СтруктураВидимостиКолонок["РаботыОборудование"+Инд] = Истина;
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Если ПерваяКолонкаКабинеты Тогда
		СтруктураВидимостиКолонок["РаботыОборудование3"] = СтруктураВидимостиКолонок["РаботыОборудование2"];
		СтруктураВидимостиКолонок["РаботыОборудование2"] = СтруктураВидимостиКолонок["РаботыОборудование1"];
		СтруктураВидимостиКолонок["РаботыОборудование1"] = Истина;
	КонецЕсли;
	Для Каждого КлючЗначение Из СтруктураВидимостиКолонок Цикл
		КолонкиРабот[КлючЗначение.Ключ].Видимость = КлючЗначение.Значение;
	КонецЦикла;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПолучитьСписокОборудования(Ном, НаимПоля, Филиал)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Структура = ПроцедурыСпециализацииПоставки.ПолучитьЗначенияОборудования(Ном, Филиал);	
	Если ЗначениеЗаполнено(Структура[НаимПоля]) И ТипЗнч(Структура[НаимПоля]) = тип("СправочникСсылка.МоделиОборудования") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Оборудование.Ссылка КАК Ссылка,
		|	Оборудование.Представление КАК Представление
		|ИЗ
		|	Справочник.Оборудование КАК Оборудование
		|ГДЕ
		|	Оборудование.ПометкаУдаления = ЛОЖЬ
		|	И Оборудование.Модель = &Модель";
		
		Запрос.УстановитьПараметр("Модель", Структура[НаимПоля]);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		СписокОборудования = Новый СписокЗначений;
		Пока Выборка.Следующий() Цикл
			СписокОборудования.Добавить(Выборка.Ссылка, Выборка.Представление);
		КонецЦикла;	
		
		Возврат СписокОборудования;
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура РаботыОборудованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботыОборудованиеВыбрать(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыОборудованиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		РаботыОборудованиеВыбрать(Элемент, СтандартнаяОбработка, ДанныеВыбора);
	КонецЕсли;
	
	Если Элемент.Имя = "РаботыОборудование1" Тогда
		Элементы.РаботыОборудование1.ИсторияВыбораПриВводе = ?(ДанныеВыбора = Неопределено, ИсторияВыбораПриВводе.Авто, ИсторияВыбораПриВводе.НеИспользовать);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыОборудованиеВыбрать(Элемент, СтандартнаяОбработка, ДанныеВыбора = "")
	
	ИндексКолонки = Число(СтрЗаменить(Элемент.Имя, "РаботыОборудование", ""));
	ЭтоКолонкаОборудование1 = Элемент.Имя = "РаботыОборудование1";
	
	Если Не (ИндексКолонки = 1 И ПерваяКолонкаКабинеты) Тогда // Это не первая колонка, когда первая колонка отвечает за кабинет в шапке.
		
		СтандартнаяОбработка = Ложь;
		
		ИмяПоляОборудования = "Оборудование" + ИндексКолонки;
		
		СписокОборудования = ПолучитьСписокОборудования(Элементы.Работы.ТекущиеДанные.Номенклатура, "Оборудование1", Объект.Филиал);
		Если ДанныеВыбора = "" Тогда
			Значение = ВыбратьИзСписка(списокОборудования,Элемент,списокОборудования.НайтиПоЗначению(Элементы.Работы.ТекущиеДанные.Оборудование1));
			
			Если Значение <> Неопределено Тогда
				Элементы.Работы.ТекущиеДанные[ИмяПоляОборудования] = Значение.Значение;
			КонецЕсли;
		Иначе
			ДанныеВыбора = СписокОборудования;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СШКНоменклатура(ДанныеНоменклатуры, СШК) Экспорт
	Номенклатура				= ДанныеНоменклатуры.Номенклатура;
	Количество					= ДанныеНоменклатуры.Количество;
	ХарактеристикаНоменклатуры	= ДанныеНоменклатуры.ХарактеристикаНоменклатуры;
	Единица						= ДанныеНоменклатуры.ЕдиницаИзмерения;
	Цена						= ДанныеНоменклатуры.Цена;
	
	Если ЗначениеЗаполнено(Единица) И
		 Единица.Коэффициент <> 0 
	Тогда
		Количество = Количество * Единица.Коэффициент;
	КонецЕсли;
	
	ОбработкаВводаНоменклатуры(Номенклатура, Количество);
	Возврат Истина;
	
КонецФункции // СШКНоменклатура()

&НаКлиенте
Функция СШККлиент(фКлиент, СШК) Экспорт
	
	Если Объект.Групповая Тогда
		мсСтр = Объект.Клиенты.НайтиСтроки(Новый Структура("Клиент", фКлиент));
		Если мсСтр.Количество() = 0 Тогда
			Объект.Клиенты.Добавить().Клиент = фКлиент;
		Иначе
			Элементы.Клиенты.ТекущаяСтрока = мсСтр[0].ПолучитьИдентификатор();
		КонецЕсли;
	Иначе
		Объект.Клиент = фКлиент;
	КонецЕсли;
	Модифицированность = Истина;
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция СШККарта(Карта, Клиент, СШК) Экспорт
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		Объект.Клиент = Клиент;
		Модифицированность = Истина;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция СШКСертификат(Сертификат, СШК) Экспорт
	
	ДанныеЗаполнения = ПолучитьДанныеЗаполненияПоСертификату(Сертификат);
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения.Клиент)
		И Не ЗначениеЗаполнено(Объект.Клиент)
	Тогда
		Объект.Клиент = ДанныеЗаполнения.Клиент;
		Модифицированность = Истина;
	КонецЕсли;
	
	Если Объект.Групповая Тогда
		Если ЗначениеЗаполнено(ДанныеЗаполнения.Клиент)
			И Объект.Клиенты.НайтиСтроки(Новый Структура("Клиент", ДанныеЗаполнения.Клиент)).Количество() = 0
		Тогда
			Объект.Клиенты.Добавить().Клиент = ДанныеЗаполнения.Клиент;
			Модифицированность = Истина;
		КонецЕсли;
	Иначе
		Если ДанныеЗаполнения.Свойство("Услуга") Тогда 
			
			Результат = Объект.Работы.НайтиСтроки(Новый Структура("Номенклатура",ДанныеЗаполнения.Услуга));
			
			Если Результат.Количество() = 1 Тогда
				
				Результат[0].Продолжительность = Результат[0].Продолжительность + ДанныеЗаполнения.Продолжительность;
				
			Иначе
				НоваяСтрока = Объект.Работы.Добавить();
				НоваяСтрока.Номенклатура = ДанныеЗаполнения.Услуга;
				НоваяСтрока.Продолжительность = НоваяСтрока.Продолжительность + ДанныеЗаполнения.Продолжительность;
			КонецЕсли;
			
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеЗаполненияПоСертификату(Сертификат)
	
	ДанныеЗаполнения = Новый Структура("Клиент",Сертификат.ВладелецКарты);
	
	ВидСертификата = Сертификат.ВидСертификата;
	Если Не ВидСертификата.КомплексныйСертификат 
		И ВидСертификата.ТипСертификата = Перечисления.ТипыСертификатов.НаУслуги
		И ВидСертификата.Услуги.Количество() = 1
	Тогда
		Услуга = ВидСертификата.Услуги.Получить(0).Фильтр;
		
		Если Не Услуга.ЭтоГруппа Тогда
			ДанныеЗаполнения.Вставить("Услуга",Услуга);
			ДанныеЗаполнения.Вставить("Продолжительность",Услуга.ПродолжительностьЧас * 3600 + Услуга.ПродолжительностьМин * 60);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

&НаКлиенте
Функция СШКСотрудник(Сотрудник, СШК) Экспорт
	
	Объект.Сотрудник = Сотрудник;
	Модифицированность = Истина;
	
	Возврат Истина;

КонецФункции

&НаКлиенте
Функция СМКНеизвестныйКод(Код, СМК) Экспорт

	Результат = Ложь;

	Возврат Результат;

КонецФункции // СМКНеизвестныйКод()

&НаКлиенте
Функция СМКМагнитнаяКарта(ВладелецМагнитногоКода, СМК) Экспорт

	Результат = Истина;

	Если ТипЗнч(ВладелецМагнитногоКода) = Тип("СправочникСсылка.Клиенты") Тогда

		Если Объект.Групповая Тогда
			мсСтр = Объект.Клиенты.НайтиСтроки(Новый Структура("Клиент", ВладелецМагнитногоКода));
			Если мсСтр.Количество() = 0 Тогда
				Объект.Клиенты.Добавить().Клиент = ВладелецМагнитногоКода;
			Иначе
				Элементы.Клиенты.ТекущаяСтрока = мсСтр[0].ПолучитьИдентификатор();
			КонецЕсли;
		Иначе
			Объект.Клиент = ВладелецМагнитногоКода;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ВладелецМагнитногоКода) = Тип("СправочникСсылка.КартыСкидок") Тогда
		ВладелецКарты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВладелецМагнитногоКода, "ВладелецКарты");
		Если ЗначениеЗаполнено(ВладелецКарты) Тогда
			
			Если Объект.Групповая Тогда
				мсСтр = Объект.Клиенты.НайтиСтроки(Новый Структура("Клиент", ВладелецМагнитногоКода));
				Если мсСтр.Количество() = 0 Тогда
					Объект.Клиенты.Добавить().Клиент = ВладелецКарты;
				Иначе
					Элементы.Клиенты.ТекущаяСтрока = мсСтр[0].ПолучитьИдентификатор();
				КонецЕсли;
			Иначе
				Объект.Клиент = ВладелецМагнитногоКода;
			КонецЕсли;
			
		Иначе
			Результат = Ложь;
		КонецЕсли;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	Модифицированность = Модифицированность Или Результат;
	
	Возврат Результат;

КонецФункции // СМКИнформационнаяКарта()

// Обработка считывания в форме штрихкода медицинской карты
&НаКлиенте
Функция СШКМедКарта(Карта, Клиент, СШК) Экспорт
	
	Объект.Клиент = Клиент;
	Модифицированность = Истина;
	Возврат Истина;
	
КонецФункции

#Область ОбработчикиДинамическиСоздаваемыхКоманд

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	// Добавлено Макеев (
	ОповещениеПослеВыбораФилиала = Новый ОписаниеОповещения("омг_ПослеВыбораФилиала", ЭтаФорма);
	// )
	// Изменено Макеев (
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма,, ОповещениеПослеВыбораФилиала);
	// )
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОчиститьОборудование()
	Для Каждого СтрокаРаботы Из Объект.Работы Цикл
	    ОборудованиеУслуги = ПроцедурыСпециализацииПоставки.ПолучитьЗначенияОборудования(СтрокаРаботы.Номенклатура,Объект.Филиал);
		Для Инд = 1 По ?(ПерваяКолонкаКабинеты,2,3) Цикл 
			ОборудованиеНоменклатуры = ОборудованиеУслуги["Оборудование" + Инд];
			Если	ТипЗнч(ОборудованиеНоменклатуры) <> Тип("СправочникСсылка.МоделиОборудования") 
				Или Не ЗначениеЗаполнено(ОборудованиеНоменклатуры)
			Тогда
				СтрокаРаботы["Оборудование" + (Инд + ?(ПерваяКолонкаКабинеты,1,0))] = Неопределено;
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВыпадающийСписокСотрудников()
	
	МассивСотрудников = ПолучитьМассивСотрудников(Объект.ДатаНачала, Объект.Филиал);
	Если МассивСотрудников.Количество() > 0 Тогда
		Элементы.Сотрудник.СписокВыбора.ЗагрузитьЗначения(МассивСотрудников);
		Элементы.Сотрудник.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСпискеИВПолеВвода;
		Элементы.Сотрудник.КнопкаВыпадающегоСписка = Истина;
	Иначе
		Элементы.Сотрудник.СписокВыбора.Очистить();
		Элементы.Сотрудник.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		Элементы.Сотрудник.КнопкаВыпадающегоСписка = Ложь;
	КонецЕсли;
	Элементы.Сотрудник.КнопкаОткрытия = Не Элементы.Сотрудник.КнопкаВыпадающегоСписка;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВыпадающийСписокСотрудниковСервер()
	
	МассивСотрудников = ПолучитьМассивСотрудников(Объект.ДатаНачала, Объект.Филиал);
	Если МассивСотрудников.Количество() > 0 Тогда
		Элементы.Сотрудник.СписокВыбора.ЗагрузитьЗначения(МассивСотрудников);
		Элементы.Сотрудник.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВВыпадающемСпискеИВПолеВвода;
		Элементы.Сотрудник.КнопкаВыпадающегоСписка = Истина;
	Иначе
		Элементы.Сотрудник.СписокВыбора.Очистить();
		Элементы.Сотрудник.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		Элементы.Сотрудник.КнопкаВыпадающегоСписка = Ложь;
	КонецЕсли;
	Элементы.Сотрудник.КнопкаОткрытия = Не Элементы.Сотрудник.КнопкаВыпадающегоСписка;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивСотрудников(Дата, Филиал)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГрафикиРаботы.Сотрудник КАК Ссылка
	               |ИЗ
	               |	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
	               |ГДЕ
	               |	ГрафикиРаботы.Дата = &ДатаНач
	               |	И ГрафикиРаботы.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	               |	И ГрафикиРаботы.Филиал = &Филиал
	               |	И ГрафикиРаботы.Сотрудник.УчаствуетВКалендарномПланировании
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ГрафикиРаботы.Сотрудник";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Дата));
	Запрос.УстановитьПараметр("Филиал", Филиал);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат Выборка;
КонецФункции

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	Если Объект.Работы.Количество() <> 0 Тогда
		ПересчитатьИндивидуальнуюПродолжительностьУслуг();
	КонецЕсли;
	
	Если мУчетнаяПолитика.ИспользоватьХочуРаньшеВЗаявках Тогда
		ОтборСотрудникПриИзменении(Элементы.ВидОтбораХочуРаньше);
	КонецЕсли; 
	
	/////////////////////////////////////////////////////////////
	// ОМГ
	Омг_НесколькоВрачей();  
	// ОМГ
    /////////////////////////////////////////////////////////////
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыСотрудникПриИзменении(Элемент)
	
	/////////////////////////////////////////////////////////////
	// ОМГ   
	Если Элементы.Работы.ТекущиеДанные.Сотрудник = мУчетнаяПолитика.омг_ВрачПоУмолчанию Тогда
	Элементы.Работы.ТекущиеДанные.ДатаНачала = НачалоДня(Элементы.Работы.ТекущиеДанные.ДатаНачала);	
	Элементы.Работы.ТекущиеДанные.ДатаОкончания = НачалоДня(Элементы.Работы.ТекущиеДанные.ДатаОкончания);
	Элементы.Работы.ТекущиеДанные.омг_БезЗаписиНесколькоВрачей = Истина; 
иначе
	Элементы.Работы.ТекущиеДанные.ДатаНачала = Объект.ДатаНачала;	
	Элементы.Работы.ТекущиеДанные.ДатаОкончания = НачалоДня(Объект.ДатаНачала) + ОбщегоНазначенияКлиентСервер.ВремяВСекунды(Объект.ВремяОкончания);
	Элементы.Работы.ТекущиеДанные.омг_БезЗаписиНесколькоВрачей = Ложь;
	КонецЕсли; 
	// ОМГ
    ////////////////////////////////////////////////////////////
	
	ТекущиеДанные = Элементы.Работы.ТекущиеДанные;

	ПересчитатьИндивидуальнуюПродолжительностьУслуги(ТекущиеДанные,
													 ПолучитьТекущегоСотрудникаРабот(ТекущиеДанные, Объект.Сотрудник, Объект.НесколькоСотрудников),
													 ДополнительныеСвойства);
	ПересчетВремениОкончания(Объект, Продолжительность); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИндивидуальнуюПродолжительностьУслуг()
	
	Для Каждого СтрокаРаботы Из Объект.Работы Цикл
		ПересчитатьИндивидуальнуюПродолжительностьУслуги(СтрокаРаботы,
													 	 ПолучитьТекущегоСотрудникаРабот(СтрокаРаботы, Объект.Сотрудник, Объект.НесколькоСотрудников),
														 ЭтаФорма.ДополнительныеСвойства);
	КонецЦикла;
	ПересчетВремениОкончания(Объект, Продолжительность);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИндивидуальнуюПродолжительностьУслуги(ТекущиеДанные, Сотрудник, ДополнительныеСвойства)
	
	Если ТекущиеДанные.ПродолжительностьИзмененаВручную Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьОсновнуюПродолжительностьРаботы = Истина;
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ОсновныеУслугиСотрудника = УправлениеЗаявкамиКлиент.ПолучитьОсновныеУслугиСотрудника(Сотрудник);
		Для Каждого СтрокаУслуги Из ОсновныеУслугиСотрудника Цикл
			Если СтрокаУслуги.Номенклатура = ТекущиеДанные.Номенклатура Тогда
				Если (СтрокаУслуги.Часы + СтрокаУслуги.Минуты) <> 0 Тогда
					ПродолжительностьУслугиЧас = СтрокаУслуги.Часы;	
					ПродолжительностьУслугиМин = СтрокаУслуги.Минуты;
					ИспользоватьОсновнуюПродолжительностьРаботы = Ложь;
				КонецЕсли;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ИспользоватьОсновнуюПродолжительностьРаботы Тогда
		#Если Клиент Тогда
		РеквизитыРаботы = ОбщегоНазначенияСервер.ПолучитьРеквизитыСсылки(ТекущиеДанные.Номенклатура);
		#Иначе
		РеквизитыРаботы = ТекущиеДанные.Номенклатура;
		#КонецЕсли
		ПродолжительностьУслугиЧас = РеквизитыРаботы.ПродолжительностьЧас;	
		ПродолжительностьУслугиМин = РеквизитыРаботы.ПродолжительностьМин;
	КонецЕсли;
	
	ПродолжительностьДт	= Дата(1,1,1)
						+ (ПродолжительностьУслугиЧас*60*60
						+  ПродолжительностьУслугиМин*60);

	Если ЗначениеЗаполнено(ПродолжительностьДт) Тогда
		ТекущиеДанные.Продолжительность	= ПродолжительностьДт;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Функция ПолучитьТекущегоСотрудникаРабот(ТекущиеДанные, Сотрудник, НесколькоСотрудников)
	
	Если НесколькоСотрудников Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.Сотрудник) Тогда
			ТекущийСотрудник = ТекущиеДанные.Сотрудник;
		Иначе
			ТекущийСотрудник = Сотрудник;
		КонецЕсли;
	Иначе
		ТекущийСотрудник = Сотрудник;
	КонецЕсли;
	
	Возврат ТекущийСотрудник;
	
КонецФункции

&НаКлиенте
Функция ПолучитьОсновныеРаботыСотрудника(Сотрудник)
	
	СписокВыбора = Новый СписокЗначений;
	ОсновныеУслугиСотрудника = УправлениеЗаявкамиКлиент.ПолучитьОсновныеУслугиСотрудника(Сотрудник);
	Для Каждого СтрокаУслуга Из ОсновныеУслугиСотрудника Цикл
		ЭлементСЗ = СписокВыбора.Добавить(СтрокаУслуга.Номенклатура,,,БиблиотекаКартинок.Пользователь);
	КонецЦикла;
	СписокВыбора.СортироватьПоЗначению();
	
	Возврат СписокВыбора;
	
КонецФункции

&НаКлиенте
Процедура РаботыРаботаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		
		ТекущиеДанные = Элемент.Родитель.ТекущиеДанные;
		ТекущийСотрудник = ПолучитьТекущегоСотрудникаРабот(ТекущиеДанные, Объект.Сотрудник, Объект.НесколькоСотрудников);
		СписокРабот = ПолучитьОсновныеРаботыСотрудника(ТекущийСотрудник);
		
		НачальноеЗначение = 0;
		
		Если  СписокРабот.Количество() <> 0 Тогда
			СтандартнаяОбработка = Ложь;
			Для Каждого ЭлементСЗ Из СписокРабот Цикл
				Если ЭлементСЗ.Значение = ТекущиеДанные.Номенклатура Тогда
					НачальноеЗначение = ЭлементСЗ;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ДанныеВыбора = СписокРабот;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСотрудникПриИзменении(Элемент)
	
	ОбновитьОграничениеТиповОтборовХочуРаньше();
	УстановитьВидимостьОтбораХочуРаньше(Элементы.ОтборыХочуРаньше, Элементы.ВидОтбораХочуРаньше.СписокВыбора, Объект.ОтборХочуРаньше);
	Объект.ОтборыХочуРаньше.Очистить();

	Если Объект.ОтборХочуРаньше = "К тому же врачу" Тогда
		
		Если Не Объект.НесколькоСотрудников Тогда
			НоваяСтрока = Объект.ОтборыХочуРаньше.Добавить();
			НоваяСтрока.Фильтр = Объект.Сотрудник;
		Иначе
			НоваяСтрока = Объект.ОтборыХочуРаньше.Добавить();
			НоваяСтрока.Фильтр = Объект.Сотрудник;
			мВрачи = ПолучитьВрачейУслуг(Объект.Работы);
			Для Каждого Врач Из мВрачи Цикл
				НоваяСтрока = Объект.ОтборыХочуРаньше.Добавить();
				НоваяСтрока.Фильтр = Врач;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли Объект.ОтборХочуРаньше = "К врачу, с теми же компетенциями" Тогда
		
		ЗаполнитьОтборХочуРаньшеСпециализациямиУслугДокумента();
		
	ИначеЕсли Объект.ОтборХочуРаньше = "К указанным врачам" Тогда
		
		Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
			НоваяСтрока = Объект.ОтборыХочуРаньше.Добавить();
			НоваяСтрока.Фильтр = Объект.Сотрудник;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОтборХочуРаньшеСпециализациямиУслугДокумента()
	
	Объект.ОтборыХочуРаньше.Очистить();
	
	мСпециализаций = ПолучитьСпециализацииУслуг(Объект.Работы);
	Для Каждого Специализация Из мСпециализаций Цикл
		НоваяСтрока = Объект.ОтборыХочуРаньше.Добавить();
		НоваяСтрока.Фильтр = Специализация;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСпециализацииУслуг(Знач Работы)
	БуферТЗ = Новый ТаблицаЗначений();
	БуферТЗ.Колонки.Добавить("Специализация");
	
	Для Каждого стрТЧ Из Работы Цикл
		нстр = БуферТЗ.Добавить();
		нстр.Специализация = стрТЧ.Номенклатура.КатегорияВыработки;
	КонецЦикла;
	БуферТЗ.Свернуть("Специализация");
	
	Результат = Новый Массив();
	Для Каждого стр из БуферТЗ Цикл 
		Если ЗначениеЗаполнено(стр.Специализация) Тогда
			Результат.Добавить(стр.Специализация);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВрачейУслуг(Знач Работы)
	
	БуферТЗ = Новый ТаблицаЗначений;
	БуферТЗ.Колонки.Добавить("Сотрудник");
	
	Для Каждого СтрокаТаблицы Из Работы Цикл
		НоваяСтрока = БуферТЗ.Добавить();
		НоваяСтрока.Сотрудник = СтрокаТаблицы.Сотрудник;
	КонецЦикла;
	БуферТЗ.Свернуть("Сотрудник");
	
	Результат = Новый Массив();
	Для Каждого СтрокаТаблицы Из БуферТЗ Цикл 
		Если ЗначениеЗаполнено(СтрокаТаблицы.Сотрудник) Тогда
			Результат.Добавить(СтрокаТаблицы.Сотрудник);	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОграничениеТиповОтборовХочуРаньше()
	
	МассивТипов = Новый Массив;
	Если	Объект.ОтборХочуРаньше = "К указанным врачам"
		Или	Объект.ОтборХочуРаньше = "К тому же врачу"
	Тогда
		МассивТипов.Добавить(Тип("СправочникСсылка.Сотрудники"));
		
	ИначеЕсли	Объект.ОтборХочуРаньше = "К врачу, с выбранными компетенциями"
			Или Объект.ОтборХочуРаньше = "К врачу, с теми же компетенциями"
	Тогда
		МассивТипов.Добавить(Тип("СправочникСсылка.КатегорииВыработки"));
	КонецЕсли;
	
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
	Элементы.ОтборыХочуРаньшеФильтр.ОграничениеТипа = ОписаниеТипов;
	
КонецПроцедуры

&НаКлиенте
Процедура ХочуРаньшеПриИзменении(Элемент)
	
	Если Объект.ХочуРаньше И Объект.НесколькоСотрудников Тогда
		ПоказатьПредупреждение(,ПолучитьТекстПредупрежденияОдновременноХочуРаньшеНесколькоСотрудников(), 30);
		Объект.ХочуРаньше = Ложь;
	КонецЕсли;
	
	Если Объект.ХочуРаньше Тогда
		Если Не ЗначениеЗаполнено(Объект.ОтборХочуРаньше) Тогда
			Объект.ОтборХочуРаньше = "К тому же врачу";
		КонецЕсли;
		УстановитьВидимостьОтбораХочуРаньше(Элементы.ОтборыХочуРаньше, Элементы.ВидОтбораХочуРаньше.СписокВыбора, Объект.ОтборХочуРаньше);
	КонецЕсли;
	
	ОтборСотрудникПриИзменении(Элементы.ВидОтбораХочуРаньше);
	
	Элементы.СтраницаХочуРаньше.Видимость = Объект.ХочуРаньше;
	ОбновитьВидимостьСтраницПанелиФормы(Элементы.Страницы);
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаХочуРаньше;
	ЭтаФорма.ТекущийЭлемент = Элементы.ПримечаниеХочуРаньше;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьКорректностьОтборовЗаявкиХочуРаньше(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ХочуРаньше Тогда
		Если Объект.ОтборыХочуРаньше.Количество() = 0 Тогда
			
			Если Объект.ОтборХочуРаньше = "К врачу, с теми же компетенциями" Тогда
				ТекстОшибки = НСтр("ru='В заявке нет услуг. Для функции оповещения о возможности записаться раньше нельзя использовать режим врача с требуемыми для услуг компетенциями!'");
			Иначе
				ТекстОшибки = НСтр("ru='Необходимо указать хотя бы одно условие отбора для переноса заявки на более раннее время.'");
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
			Отказ = Истина;
		Иначе
			Для Каждого СтрокаОтбора Из Объект.ОтборыХочуРаньше Цикл
				Если Не ЗначениеЗаполнено(СтрокаОтбора.Фильтр) Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нельзя оставлять незаполненными врача или специализацию в фильтре переноса заявки на более раннее время.'"));
					Отказ = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьЗаявку(ИмпортируемыеЗначенияЗаполнения)
	ИмпортируемыеЗначенияЗаполнения.Вставить("ДатаОкончания", ИмпортируемыеЗначенияЗаполнения.ДатаНачала + (Объект.ДатаОкончания - Объект.ДатаНачала));
	ИмпортируемыеЗначенияЗаполнения.Вставить("ВремяОкончания", ИмпортируемыеЗначенияЗаполнения.ДатаОкончания);
	ЗаполнитьЗначенияСвойств(Объект, ИмпортируемыеЗначенияЗаполнения);
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекстПредупрежденияОдновременноХочуРаньшеНесколькоСотрудников()
	
	Возврат НСтр("ru='Не допускается одновременное использование режима нескольких сотрудников заявки и поиска возможности более раннего посещения!'");
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьОтбораХочуРаньше(ЭлементОтбор, ВидыОтбора, ЗначениеОтбора)
	
	Видимость = (ЗначениеОтбора <> ВидыОтбора[0].Значение И ЗначениеОтбора <> ВидыОтбора[1].Значение);
	Элементы.ГруппаСтраницыОтбораХочуРаньше.ТекущаяСтраница = ?(Видимость, Элементы.ГруппаСтраницыОтбораХочуРаньшеВидимый, Элементы.ГруппаСтраницыОтбораХочуРаньшеНевидимый);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьСтраницПанелиФормы(ЭлементСтраницы)
	
	Сч = 0;
	Для Каждого Страница Из ЭлементСтраницы.ПодчиненныеЭлементы Цикл
		Если Страница.Видимость Тогда
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
	
	ЭлементСтраницы.ОтображениеСтраниц = ?(Сч < 2, ОтображениеСтраницФормы.Нет, ОтображениеСтраницФормы.ЗакладкиСверху);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр("ru = 'При подключении оборудования произошла ошибка:
				|""%ОписаниеОшибки%"".'" );
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// Процедура обновляет информацию в таблице свойств объекта.
//
&НаСервере
Процедура ОбновитьСвойства()
	
	Свойства.ОбъектОтбораЗначений   = Объект.Ссылка;
	Свойства.ОбъектОтбораНазначений = Объект.Ссылка;
	
	ОбъектОбработки = РеквизитФормыВЗначение("Свойства");
	ОбъектОбработки.ПрочитатьЗаполнитьСвойстваИЗначения();
	Если ОбъектОбработки.СвойстваИЗначения.Количество() = 0 Тогда
		РаботаСФормамиКлиентСервер.УстановитьВидимостьЭлементаФормы(Элементы, "Свойства", Ложь);
	Иначе
		ЗначениеВРеквизитФормы(ОбъектОбработки, "Свойства");
	КонецЕсли;
	
	Элементы.Свойства.Видимость = Свойства.СвойстваИЗначения.Количество() <> 0;
	
КонецПроцедуры

#Область ПодборРасписания // Автопоиск времени записи.

&НаКлиенте
Процедура ПодборВремени(Команда)
	
	УправлениеЗаявкамиКлиент.ОткрытьПодборВремениЗаписи(ЭтаФорма, Объект, мУчетнаяПолитика);
	
КонецПроцедуры

// Для вызова на клиенте и при создании формы.
&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьКнопкиПодбораРасписания(Объект, ЭлементКнопка, ТекущийРежимЗаписиНаПрием, УчетнаяПолитика)
	
	Видимость = Ложь;
	
	Если ТекущийРежимЗаписиНаПрием <> ПредопределенноеЗначение("Перечисление.РежимыЗаписиНаПрием.ВКабинет") Тогда
		СтрокНоменклатурыОжидания = Объект.Работы.НайтиСтроки(Новый Структура("Номенклатура", УчетнаяПолитика.НоменклатураОжиданияКлиента)).Количество();
		Видимость = 0 <> (Объект.Работы.Количество() - СтрокНоменклатурыОжидания);
	КонецЕсли;
		
	ЭлементКнопка.Видимость = Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимВводаПриИзменении(Элемент)
	
	Если Объект.РежимДлительностиЗаявки <> ПредопределенноеЗначение("Перечисление.РежимДлительностиЗаявки.Фиксированная") Тогда
		Элементы.НесколькоСотрудников.Доступность = Истина;
		ПересчитатьИндивидуальнуюПродолжительностьУслуг();
		ПересчетВремениОкончания(Объект, Продолжительность);
	Иначе
		Элементы.НесколькоСотрудников.Доступность = Ложь;
		ФиксированнаяПродолжительность(Объект, Продолжительность)
	КонецЕсли;
	ПересчитатьДоступностьВремениОкончания();
	
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)

	Если ЭтоГрупповаяЗаявка() Тогда
		Объект.Групповая = Истина;
	КонецЕсли; 
	
	фитОбновитьОтображениеЭлементовФормы(); 
	
	/////////////////////////////////////////////////
	// ОМГ
	ОМГ_ОтобразитьИИН(); 
	ОМГ_ПроверитьРиски();
	// ОМГ
    /////////////////////////////////////////////////
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоМодель(Ном, НаимПоля, Филиал)
	Структура = ПроцедурыСпециализацииПоставки.ПолучитьЗначенияОборудования(Ном, Филиал);
	Возврат ЗначениеЗаполнено(Структура[НаимПоля]) И ТипЗнч(Структура[НаимПоля]) = Тип("СправочникСсылка.МоделиОборудования");
КонецФункции

&НаКлиенте
Процедура ПрейскурантПодборПриИзменении(Элемент)
	РаботаСФормамиКлиент.УстановитьПараметрПрейскурантПодбора(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьНаличиеКнопкиСпискаВыбораНоменклатуры()
	
	КнопкаСписка = Ложь;
	
	Если глКэшОсновныхУслугСотрудников <> Неопределено Тогда
		ТекущиеДанные = Элементы.Работы.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ТекущийСотрудник = ПолучитьТекущегоСотрудникаРабот(ТекущиеДанные, Объект.Сотрудник, Объект.НесколькоСотрудников);
			Если ЗначениеЗаполнено(ТекущийСотрудник) Тогда
				СписокРабот = ПолучитьОсновныеРаботыСотрудника(ТекущийСотрудник);
				Если СписокРабот.Количество() <> 0 Тогда
					КнопкаСписка = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.РаботыРабота.КнопкаСпискаВыбора = КнопкаСписка;
	Элементы.РаботыРабота.КнопкаВыпадающегоСписка = КнопкаСписка;
	
КонецПроцедуры

#Область ГрупповаяЗапись

&НаКлиенте
Процедура ГрупповаяПриИзменении(Элемент)
	
	Если Объект.Групповая Тогда
		Объект.Клиент = ПредопределенноеЗначение("Справочник.Клиенты.Групповая_заявка");
	Иначе
		Объект.Клиент = ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка");
		Объект.Клиенты.Очистить();
	КонецЕсли; 
	
	фитОбновитьОтображениеЭлементовФормы();

КонецПроцедуры

&НаКлиенте
Процедура фитОбновитьОтображениеЭлементовФормы()
	
	ЭтоГрупповаяЗаявка = ЭтоГрупповаяЗаявка();
	
	Элементы.Групповая.Видимость = ЭтоГрупповаяЗаявка Или мУчетнаяПолитика.ИспользоватьГрупповыеПосещения;
	
	Элементы.ГруппаКлиенты.Видимость = ЭтоГрупповаяЗаявка;
	Элементы.Клиент.Доступность = Не ЭтоГрупповаяЗаявка;
	Если ЭтоГрупповаяЗаявка Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаКлиенты;
		ЗаполнитьСведенияОПосещенияхПоГрупповойЗаявке()
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура фитКлиентыПриИзменении(Элемент)
	фитОбновитьОтображениеЭлементовФормы(); 
КонецПроцедуры

&НаКлиенте
Процедура фитКлиентыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)	
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если Поле = Элементы.КлиентыПосещение
			И Не ЗначениеЗаполнено(ТекущиеДанные.Посещение)
			И ЗначениеЗаполнено(ТекущиеДанные.Клиент)
			И РаботаСДиалогамиКлиент.ЗаписатьНовыйОбъектВФорме(ЭтаФорма)
		Тогда
			СтандартнаяОбработка = Ложь;
			ПараметрыФормы		= Новый Структура("Основание", Объект.Ссылка);
			ЗначенияЗаполнения	= Новый Структура;
			
			ЗначенияЗаполнения.Вставить("Клиент", ТекущиеДанные.Клиент);
			
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
			ОткрытьФорму("Документ.ОказаниеУслуг.ФормаОбъекта", ПараметрыФормы);	
		КонецЕсли;
	КонецЕсли; 	

КонецПроцедуры

&НаКлиенте
Процедура фитКлиентыПередУдалением(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.Клиенты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
					
КонецПроцедуры

&НаКлиенте
Процедура фитКлиентыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Клиенты.ТекущиеДанные;
	Элементы.ОтметитьПрисутствие.Доступность = Ложь;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	Иначе
		Элементы.ОтметитьПрисутствие.Доступность = Не ЗначениеЗаполнено(ТекущиеДанные.Посещение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура фитКлиентыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Клиенты") Тогда		
		СтандартнаяОбработка = Ложь;		
		
		Отбор = Новый Структура("Клиент", ВыбранноеЗначение);	
		Строки = Объект.Клиенты.НайтиСтроки(Отбор);
		Если Строки.Количество() > 0 Тогда
			Возврат;
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура фитОтметитьПрисутствие(Команда)	
	
	Если РаботаСДиалогамиКлиент.ЗаписатьНовыйОбъектВФорме(ЭтаФорма) Тогда
		ТекущиеДанные = Элементы.Клиенты.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПараметрыФормы		= Новый Структура("Основание", Объект.Ссылка);
		ЗначенияЗаполнения	= Новый Структура;
		
		ЗначенияЗаполнения.Вставить("Клиент", ТекущиеДанные.Клиент);
		
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.ОказаниеУслуг.ФормаОбъекта", ПараметрыФормы);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСведенияОПосещенияхПоГрупповойЗаявке()
	
	Если Не Объект.Ссылка.Пустая() И ЭтоГрупповаяЗаявка() Тогда
		
		Для Каждого СтрокаТабЧасти Из Объект.Клиенты Цикл
			СтрокаТабЧасти.Посещение = Неопределено;
		КонецЦикла;
		
		ТаблицаПосещений = РаботаСКлиентамиПереопределяемый.ПолучитьПосещенияЗаявки(Объект.Ссылка);
		Отбор = Новый Структура("Клиент");
		Для Каждого СтрокаПосещения Из ТаблицаПосещений Цикл
			Отбор.Клиент = СтрокаПосещения.Клиент;
			СтрокиТабЧасти = Объект.Клиенты.НайтиСтроки(Отбор);
			Для Каждого СтрокаТабЧасти Из СтрокиТабЧасти Цикл
				СтрокаТабЧасти.Посещение = СтрокаПосещения.Документ;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоГрупповаяЗаявка()
	Возврат Объект.Клиент = ПредопределенноеЗначение("Справочник.Клиенты.Групповая_заявка");
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораКлиентаГрупповойЗаявки(Клиент)
	
	ТекущиеДанные = Элементы.Клиенты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Или ЗначениеЗаполнено(ТекущиеДанные.Клиент) Тогда
		Объект.Клиенты.Добавить().Клиент = Клиент;
	Иначе
		ТекущиеДанные.Клиент = Клиент;
	КонецЕсли;
	ЗаполнитьСведенияОПосещенияхПоГрупповойЗаявке()
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентыКлиентПриИзменении(Элемент)
	ЗаполнитьСведенияОПосещенияхПоГрупповойЗаявке();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСостояниеПришел()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВидыСостоянийЗаявок.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВидыСостоянийЗаявок КАК ВидыСостоянийЗаявок
	               |ГДЕ
	               |	ВидыСостоянийЗаявок.ТипСостояния = &ТипСостояния";
	Запрос.УстановитьПараметр("ТипСостояния", Перечисления.ТипыСостоянийЗаявок.Пришел);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура омг_Пришел(Команда)
	
	Объект.Состояние = ПолучитьСостояниеПришел();
	Элементы.омг_Пришел.ЦветФона = Новый Цвет(0,128,0);
	Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦветФона()
	
	Возврат ЦветаСтиля.ЦветФонаПоля;
	
КонецФункции

&НаКлиенте
Процедура омг_ПослеВыбораФилиала(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.РеквизитСписокПодбор.Параметры.УстановитьЗначениеПараметра("омг_Филиал", Объект.Филиал);
	
КонецПроцедуры

&НаКлиенте
Процедура омг_СостояниеПриИзменении(Элемент)

	Если Объект.Состояние = ПолучитьСостояниеПришел() Тогда
		Элементы.омг_Пришел.ЦветФона = Новый Цвет(0,128,0);
	Иначе
		Элементы.омг_Пришел.ЦветФона = ПолучитьЦветФона();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура омг_СтраховаяПрограммаПриИзменении(Элемент)
	
	Если омг_ДополнительныеАлгоритмы.ВернутьАктуальностьСоглашения(Объект.омг_СтраховаяПрограмма,Объект.Дата) Тогда
		
		Прейскурант = ?(Объект.омг_СтраховаяПрограмма.Пустая(), ЭтаФорма.РеквизитПрейскурант, Объект.омг_СтраховаяПрограмма);
		ЭтаФорма.РеквизитСписокПодбор.Параметры.УстановитьЗначениеПараметра("Прейскурант", Прейскурант);
		
	иначе     
		
		Объект.омг_СтраховаяПрограмма = ПредопределенноеЗначение("Справочник.СоглашенияСтрахования.ПустаяСсылка");
		Сообщить("Дата окончания программы меньше даты документа!",СтатусСообщения.ОченьВажное);
		
	КонецЕсли 
	
КонецПроцедуры


&НаКлиенте
Процедура ОмгБезЗаписиПриИзменении(Элемент)
	
	 ОмгПродолжительность();
		
КонецПроцедуры  


 &НаКлиенте
Процедура ОмгПродолжительность()
	
	Если Объект.омг_БезЗаписи Тогда 
		
		Продолжительность = 0;  
		Элементы.Продолжительность.ТолькоПросмотр = Истина;
		
		Для каждого строкаРаботы из Объект.Работы Цикл
			Попытка	
				строкаРаботы.Продолжительность = '00010101';
			исключение
				продолжить
			КонецПопытки
		КонецЦикла;	
		
	КонецЕсли;	
		
КонецПроцедуры  


#КонецОбласти

/////////////////////////////////////////////////////////////////////////////////
// ОМГ

&НаСервере
Процедура Омг_НесколькоВрачей()
	
	Элементы.Сотрудник.Доступность = Не Объект.НесколькоСотрудников;
		
	Элементы.омг_РаботыВремяНачала.Видимость = Объект.НесколькоСотрудников;
	Элементы.омг_РаботыДатаНачала.Видимость = Объект.НесколькоСотрудников; 
	Элементы.омг_РаботыВремяОкончания.Видимость = Объект.НесколькоСотрудников; 
	Элементы.Работыомг_БезЗаписиНесколькоВрачей.Видимость = Объект.НесколькоСотрудников;
	
	Для каждого строка из Объект.Работы Цикл
		
		Если не ЗначениеЗаполнено(строка.ДатаНачала) и не ЗначениеЗаполнено(строка.ДатаОкончания) Тогда
		ЗаполнитьЗначенияСвойств(строка,Объект,"ДатаНачала,ДатаОкончания");	
		строка.Продолжительность = Продолжительность * 60;	
		КонецЕсли;	
		
		Если (не ЗначениеЗаполнено(строка.Сотрудник) и Объект.НесколькоСотрудников) или не Объект.НесколькоСотрудников Тогда
		ЗаполнитьЗначенияСвойств(строка,Объект,"Сотрудник");		
		КонецЕсли;    
		
		Если строка.омг_БезЗаписиНесколькоВрачей Тогда
			строка.ДатаНачала = НачалоДня(строка.ДатаНачала) + Час(мУчетнаяПолитика.ВремяНачалаРаботы) *60*60;
			строка.ДатаОкончания = строка.ДатаНачала;
		КонецЕсли;	
	
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура омг_СтраховаяПрограммаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Организация  = омг_ВернутьОрганизациюПоФилиалу(Объект.Филиал);
	Если ЗначениеЗаполнено(Организация) Тогда
	СтандартнаяОбработка = Ложь;  
	ЗначОтбора = Новый Структура("Организация", Организация);
	СтрОтбора = Новый Структура("Отбор", ЗначОтбора); 
	ОписаниеОповещения = Новый ОписаниеОповещения("Омг_ПослеВыбораСоглашения",ЭтаФорма);
	ОткрытьФорму("Справочник.СоглашенияСтрахования.Форма.ФормаВыбора",СтрОтбора,,,,,ОписаниеОповещения);
    КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция омг_ВернутьОрганизациюПоФилиалу(Филиал)
	
	
	Возврат Филиал.Организация 


КонецФункции

&НаКлиенте
Процедура Омг_ПослеВыбораСоглашения(Значение,Параметры) Экспорт 
	
	Если не Значение = НЕопределено Тогда
	Объект.омг_СтраховаяПрограмма = Значение
	КонецЕсли;	

	Прейскурант = ?(Объект.омг_СтраховаяПрограмма.Пустая(), ЭтаФорма.РеквизитПрейскурант, Объект.омг_СтраховаяПрограмма);
	
	ЭтаФорма.РеквизитСписокПодбор.Параметры.УстановитьЗначениеПараметра("Прейскурант", Прейскурант);

	
КонецПроцедуры

&НаКлиенте
Процедура омг_РаботыДатаНачалаПриИзменении(Элемент)      
	
	ВремяОкончания = Элементы.Работы.ТекущиеДанные.ДатаОкончания - НачалоДня(Элементы.Работы.ТекущиеДанные.ДатаОкончания); 
	Элементы.Работы.ТекущиеДанные.ДатаОкончания = НАчалоДня(Элементы.Работы.ТекущиеДанные.ДатаНачала) + ВремяОкончания;
	ОМГ_ПересчитатьПРодолжительность();
	
КонецПроцедуры    

&НаКлиенте
Процедура ОМГ_ПересчитатьПРодолжительность()    
	
	Если Элементы.Работы.ТекущиеДанные.омг_БезЗаписиНесколькоВрачей Тогда
		Элементы.Работы.ТекущиеДанные.Продолжительность = '00010101'; 
		Элементы.Работы.ТекущиеДанные.ДатаНачала = НачалоДня(Элементы.Работы.ТекущиеДанные.ДатаНачала);
		Элементы.Работы.ТекущиеДанные.ДатаОкончания = НачалоДня(Элементы.Работы.ТекущиеДанные.ДатаОкончания);
	иначе	
		Элементы.Работы.ТекущиеДанные.Продолжительность = Дата(1,1,1) + (Элементы.Работы.ТекущиеДанные.ДатаОкончания - Элементы.Работы.ТекущиеДанные.ДатаНачала);	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура омг_РаботыВремяНачалаПриИзменении(Элемент)
	
	Если Элементы.Работы.ТекущиеДанные.ДатаНачала > Элементы.Работы.ТекущиеДанные.ДатаОкончания Тогда
	Элементы.Работы.ТекущиеДанные.ДатаОкончания = Элементы.Работы.ТекущиеДанные.ДатаНачала 
	КонецЕсли;
			
	ОМГ_ПересчитатьПРодолжительность();   
	
КонецПроцедуры

&НаКлиенте
Процедура омг_РаботыВремяОкончанияПриИзменении(Элемент)
	
	Если Элементы.Работы.ТекущиеДанные.ДатаНачала > Элементы.Работы.ТекущиеДанные.ДатаОкончания Тогда
	Элементы.Работы.ТекущиеДанные.ДатаОкончания = Элементы.Работы.ТекущиеДанные.ДатаНачала 
	КонецЕсли;
	
	ОМГ_ПересчитатьПРодолжительность(); 
	
КонецПроцедуры

&НаКлиенте
Процедура омг_РаботыВремяНачалаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	

    ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
	
	РаботаСФормамиКлиент.ОбработчикРегулированияКвантуемогоВремени(ТекущаяСтрока.ДатаНачала,Направление,мПериодичностьПланирования);
	
	Если Элементы.Работы.ТекущиеДанные.ДатаНачала > Элементы.Работы.ТекущиеДанные.ДатаОкончания Тогда
	Элементы.Работы.ТекущиеДанные.ДатаОкончания = Элементы.Работы.ТекущиеДанные.ДатаНачала 
	КонецЕсли; 

	ОМГ_ПересчитатьПРодолжительность();
	
КонецПроцедуры

 &НаСервере
Процедура омг_ПолучитьВсеНаборы(СоставИсходногоНабора,МассивНаборов,МассивКомплектующих)
		
	Для каждого строка из СоставИсходногоНабора Цикл
		Если строка.Комплектующая.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор Тогда
			МассивНаборов.добавить(строка.Комплектующая);
			СоставНабора = ОбщегоНазначенияСервер.ПолучитьСоставНабора(строка.Комплектующая);
			омг_ПолучитьВсеНаборы(СоставНабора,МассивНаборов,МассивКомплектующих);
		иначе
			МассивКомплектующих.добавить(строка)
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура Работыомг_БезЗаписиНесколькоВрачейПриИзменении(Элемент)
	Элементы.Работы.ТекущиеДанные.Продолжительность = '00010101'; 
	Элементы.Работы.ТекущиеДанные.ДатаНачала = НачалоДня(Элементы.Работы.ТекущиеДанные.ДатаНачала);
	Элементы.Работы.ТекущиеДанные.ДатаОкончания = НачалоДня(Элементы.Работы.ТекущиеДанные.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура омг_РаботыВремяОкончанияРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	
	ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;
	
	РаботаСФормамиКлиент.ОбработчикРегулированияКвантуемогоВремени(ТекущаяСтрока.ДатаОкончания,Направление,мПериодичностьПланирования);
	
	Если Элементы.Работы.ТекущиеДанные.ДатаНачала > Элементы.Работы.ТекущиеДанные.ДатаОкончания Тогда
	Элементы.Работы.ТекущиеДанные.ДатаОкончания = Элементы.Работы.ТекущиеДанные.ДатаНачала 
	КонецЕсли;

	ОМГ_ПересчитатьПРодолжительность();

КонецПроцедуры

&НаСервере
Процедура ОМГ_ОтобразитьИИН()  
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		 Элементы.омг_ИИНКлиент.Заголовок = "ИИН: "+Объект.Клиент.ИНН
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект); 
	ОМГ_ЗаполнитьПродажи(); 
	ОбновитьПредоплату();
	// )
КонецПроцедуры

&НаСервере
Процедура ОМГ_ПроверитьРиски()

	Если Объект.Клиент.омг_РискПадения = Перечисления.омг_РискиПадения.Высокий Тогда 
		Элементы.омг_Риск.Заголовок = "Риск падения: Высокий";
		Элементы.омг_Риск.ЦветТекста = Webцвета.ЛососьСветлый;
	иначе
		Элементы.омг_Риск.Заголовок = "Риск падения: Низкий";
		Элементы.омг_Риск.ЦветТекста = Webцвета.СветлоЗеленый; 
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьКомПанель()    
	
	//Элементы.Переместить(Элементы.Формаомг_Провести,ЭтаФорма.КоманднаяПанель,ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы[0]); 
	//Элементы.Переместить(Элементы.Формаомг_ПровестиИЗакрыть,ЭтаФорма.КоманднаяПанель,ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы[0]);    
	Элементы.ФормаПровестиИЗакрыть.Заголовок = "Записать и закрыть";
	Элементы.ФормаПровести.Заголовок = "Записать";
	Элементы.ФормаЗаписать.Заголовок = "Записать (без проведения)";
	Элементы.ФормаЗаписать.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ПерезаполнитьУслугиПриемы(Команда)   
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
	ЭтотОбъект,Истина);	
	
	ПоказатьВопрос(Оповещение,
	"Существующие услуги в документах приема будут очищены и заменены на услуги из текущей заявки, продолжить?",
	РежимДиалогаВопрос.ДаНетОтмена,
	0,         
	КодВозвратаДиалога.Да,    
	"Предупреждение");    
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		омг_ПерезаполнитьУслугиПерсоналПриемыНаСервере(Параметры)
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура омг_ПерезаполнитьУслугиПерсоналПриемыНаСервере(ЭтоУслуги)
	
	Табсотрудников = Объект.Работы.Выгрузить(,"Сотрудник"); 
	Табсотрудников.Свернуть("Сотрудник");
	
	Для каждого стрТабсотрудников из Табсотрудников Цикл 
      	Сотрудник = ?(ЗначениеЗаполнено(стрТабсотрудников.Сотрудник),стрТабсотрудников.Сотрудник,Объект.Сотрудник);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Прием.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	Прием.ДокументОснование = &ЭтаЗаявка
		|	И Прием.ПометкаУдаления = ЛОЖЬ
		|	И Прием.Врач = &Сотрудник
		|
		|СГРУППИРОВАТЬ ПО
		|	Прием.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Прием.Дата";
		
		Запрос.УстановитьПараметр("ЭтаЗаявка", Объект.Ссылка); 
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Сч = Ложь;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл        
			
			ПриемОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект(); 
			Если ЭтоУслуги Тогда
				ПриемОбъект.Работы.Очистить();
			Иначе
				ПриемОбъект.омг_МедПерсонал.Очистить();
			КонецЕсли;		
			
			Если Сч = Ложь и ЭтоУслуги Тогда 
				СтрПоиска = Новый Структура("Сотрудник",Сотрудник); 
				МассивНайденных =  Объект.Работы.Выгрузить().НайтиСтроки(СтрПоиска);
				Для каждого стрМассивНайденных из МассивНайденных Цикл 
					Если ЗначениеЗаполнено(стрМассивНайденных.Номенклатура) Тогда
						ЗаполнитьЗначенияСвойств(ПриемОбъект.Работы.Добавить(),стрМассивНайденных)
					КонецЕсли;
				КонецЦикла; 
			Если Сотрудник = Объект.Сотрудник Тогда	
				СтрПоиска = Новый Структура("Сотрудник",Справочники.Сотрудники.ПустаяСсылка()); 
				МассивНайденных =  Объект.Работы.Выгрузить().НайтиСтроки(СтрПоиска);
				Для каждого стрМассивНайденных из МассивНайденных Цикл 
					Если ЗначениеЗаполнено(стрМассивНайденных.Номенклатура) Тогда
						ЗаполнитьЗначенияСвойств(ПриемОбъект.Работы.Добавить(),стрМассивНайденных)
					КонецЕсли;
				КонецЦикла;
             КонецЕсли;
				Сч = Истина;
			ИначеЕсли не ЭтоУслуги Тогда 
				ПриемОбъект.омг_МедПерсонал.Загрузить(Объект.омг_МедПерсонал.Выгрузить());			
			КонецЕсли;
			
			Если ПриемОбъект.Проведен Тогда 
				ПриемОбъект.Записать(РежимЗаписиДокумента.Проведение);
			иначе
				ПриемОбъект.Записать();
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры   

&НаКлиенте
Процедура омг_БлокировкаМедПерсонала()
	
	Элементы.омг_ГруппаМедПерсонал.ТолькоПросмотр = Объект.НесколькоСотрудников;
	
КонецПроцедуры


&НаКлиенте
Процедура омг_ПерезаполнитьМедПерсоналПриемы(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
	ЭтотОбъект,Ложь);	
	
	ПоказатьВопрос(Оповещение,
	"Существующий мед.персонал в документах приема будет заменены на услуги из текущей заявки, продолжить?",
	РежимДиалогаВопрос.ДаНетОтмена,
	0,         
	КодВозвратаДиалога.Да,    
	"Предупреждение");
	
КонецПроцедуры

&НаСервере
Процедура ОМГ_ЗаполнитьПродажи()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_НоменклатураЗаявокДляОказаний.Номенклатура КАК Номенклатура,
		|	СУММА(ВЫБОР
		|			КОГДА омг_НоменклатураЗаявокДляОказаний.ВидДвижения = &Приход
		|				ТОГДА омг_НоменклатураЗаявокДляОказаний.Количество * -1
		|			ИНАЧЕ омг_НоменклатураЗаявокДляОказаний.Количество
		|		КОНЕЦ) КАК Продано,
		|	омг_НоменклатураЗаявокДляОказаний.Врач КАК Врач
		|ИЗ
		|	РегистрНакопления.омг_НоменклатураЗаявокДляОказаний КАК омг_НоменклатураЗаявокДляОказаний
		|ГДЕ
		|	омг_НоменклатураЗаявокДляОказаний.Оплачено
		|	И омг_НоменклатураЗаявокДляОказаний.Заявка = &Заявка
		|	И ТИПЗНАЧЕНИЯ(омг_НоменклатураЗаявокДляОказаний.Регистратор) = ТИП(Документ.ОказаниеУслуг)
		|
		|СГРУППИРОВАТЬ ПО
		|	омг_НоменклатураЗаявокДляОказаний.Номенклатура,
		|	омг_НоменклатураЗаявокДляОказаний.Врач";
	
	Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Приход", ВидДвиженияНакопления.Приход);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Для каждого строка из Объект.Работы Цикл
		СтрПоиска = Новый Структура();
		СтрПоиска.Вставить("Номенклатура",строка.Номенклатура);
		СотрудникДляПоиска = ?(ЗначениеЗаполнено(строка.Сотрудник),строка.Сотрудник,Объект.Сотрудник);
		СтрПоиска.Вставить("Врач",СотрудникДляПоиска);
		ВыборкаДетальныеЗаписи.Сбросить();
		Если ВыборкаДетальныеЗаписи.НайтиСледующий(СтрПоиска) Тогда
			 строка.омг_Продано = ВыборкаДетальныеЗаписи.Продано
		КонецЕсли;	
	КонецЦикла;	
		
КонецПроцедуры	

&НаКлиенте
Процедура РаботыПередНачаломИзменения(Элемент, Отказ) 
	
	Если Элемент.ТекущиеДанные.омг_Продано > 0 Тогда
		Если не Элемент.ТекущийЭлемент.Имя = "Количество" Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.омг_Продано > 0 Тогда
			Отказ = Истина;
			Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РаботыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если Элемент.ТекущиеДанные.омг_Продано > 0 Тогда
		Если Элемент.ТекущиеДанные.омг_Продано > Элемент.ТекущиеДанные.Количество Тогда
			Элемент.ТекущиеДанные.Количество = Элемент.ТекущиеДанные.омг_Продано
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция омг_ПроверкаНаПовторСтраховых()
	
	Номенклатуры = Объект.Работы.Выгрузить(,"Номенклатура").ВыгрузитьКолонку("Номенклатура");
	ТекстОшибки = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_НоменклатураИКлиентыПоСтраховым.Период КАК Период,
		|	омг_НоменклатураИКлиентыПоСтраховым.Регистратор КАК Регистратор,
		|	омг_НоменклатураИКлиентыПоСтраховым.НомерСтроки КАК НомерСтроки,
		|	омг_НоменклатураИКлиентыПоСтраховым.Активность КАК Активность,
		|	омг_НоменклатураИКлиентыПоСтраховым.Клиент КАК Клиент,
		|	омг_НоменклатураИКлиентыПоСтраховым.Номенклатура КАК Номенклатура,
		|	омг_НоменклатураИКлиентыПоСтраховым.СтраховаяПрограмма КАК СтраховаяПрограмма,
		|	омг_НоменклатураИКлиентыПоСтраховым.Заявка КАК Заявка
		|ИЗ
		|	РегистрСведений.омг_НоменклатураИКлиентыПоСтраховым КАК омг_НоменклатураИКлиентыПоСтраховым
		|ГДЕ
		|	омг_НоменклатураИКлиентыПоСтраховым.Период >= &НачалоМесяц
		|	И омг_НоменклатураИКлиентыПоСтраховым.Номенклатура В(&Номенклатуры)
		|	И омг_НоменклатураИКлиентыПоСтраховым.Клиент = &Клиент
		|	И омг_НоменклатураИКлиентыПоСтраховым.СтраховаяПрограмма = &СтраховаяПрограмма
		|	И омг_НоменклатураИКлиентыПоСтраховым.Период <= &КонецМесяца
		|	И омг_НоменклатураИКлиентыПоСтраховым.Регистратор.Состояние <> &Отменена
		|	И омг_НоменклатураИКлиентыПоСтраховым.Регистратор <> &ЭтаЗаявка";
	
	Запрос.УстановитьПараметр("Клиент", Объект.Клиент);
	Запрос.УстановитьПараметр("КонецМесяца", Объект.Дата);
	Запрос.УстановитьПараметр("НачалоМесяц", НачалоДня(НачалоМесяца(Объект.Дата)));           
	Запрос.УстановитьПараметр("Номенклатуры", Номенклатуры);
	Запрос.УстановитьПараметр("СтраховаяПрограмма", Объект.омг_СтраховаяПрограмма);
	Запрос.УстановитьПараметр("Отменена", Справочники.ВидыСостоянийЗаявок.Отменена);
	Запрос.УстановитьПараметр("ЭтаЗаявка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Номенклатура) Тогда
		ТекстОшибки = "" + ТекстОшибки + ВыборкаДетальныеЗаписи.Номенклатура +" в "+ВыборкаДетальныеЗаписи.Заявка + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекстОшибки; 
	
КонецФункции

&НаКлиенте
Процедура СостояниеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    СписокЭлемент = Новый СписокЗначений;
	МассивСостояний = ВернутьСостояния();
	Для каждого строка из МассивСостояний Цикл
    СписокЭлемент.Добавить(строка,строка);
    КонецЦикла;
    ВыбранныйЭлемент = ВыбратьИзСписка(СписокЭлемент);
    Если ВыбранныйЭлемент <> Неопределено Тогда
        Объект.Состояние = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	

КонецПроцедуры  


&НаСервере
Функция ВернутьСостояния()
		
	Запрос = Новый Запрос; 
	
	Если РольДоступна("ПолныеПрава") тогда 
		
		Условие = "";  
		
	иначе   
		
		Условие ="
		|
		|ГДЕ
		|	ВидыСостоянийЗаявок.Наименование В (&СписокНаименований)";  
		
		СписокНаименований = Новый Массив;
		СписокНаименований.Добавить("Запланирована");
		СписокНаименований.Добавить("Подтверждена");
		СписокНаименований.Добавить("Отменена");	
		Запрос.УстановитьПараметр("СписокНаименований", СписокНаименований); 
		
	КонецЕсли;
	
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ВидыСостоянийЗаявок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыСостоянийЗаявок КАК ВидыСостоянийЗаявок" + Условие;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат ВыборкаДетальныеЗаписи; 
	
КонецФункции	

&НаКлиенте
Процедура ПоказатьТаблицуРаботы(Команда)
	Элементы.ВсплывающаяГруппаРаботы.Показать();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьВкладкуРаботы(Команда)
	Элементы.ГруппаСтраниц.Скрыть();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПодвалНажатие(Элемент)
	//ГруппаРаскрыта = Элементы.ГруппаПодвал.Скрыта();
	//Если ГруппаРаскрыта Тогда
	//	Элементы.ГруппаПодвал.Заголовок = "Скрыть дополнительную информацию";
	//Иначе
	//	Элементы.ГруппаПодвал.Заголовок = "Раскрыть дополнительную информацию"; 
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнструкциюНаСервере()
	
	ПолноеИмяМетаданных = Объект.Ссылка.Метаданные().ПолноеИмя();
	
	Идентификатор = Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоРеквизиту("ПолноеИмя", ПолноеИмяМетаданных);
	
	Если Идентификатор.Пустая() Тогда
		Элементы.ГруппаОписания.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("ТипОбъекта", Идентификатор);
	ЗаписьРегистра = РегистрыСведений.ИнструкцииКОбъектам.Получить(Отбор);
	
	Если ЗначениеЗаполнено(ЗаписьРегистра.ТекстИнструкции) Тогда
		ТекстИнструкцииДляПользователя = ЗаписьРегистра.ТекстИнструкции.Получить();
	Иначе
		Элементы.ГруппаОписания.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьИнформациюОКорзине()
	
	ОбщееКоличествоУслуг = Объект.Работы.Итог("Количество");
	Если ОбщееКоличествоУслуг = 0 Тогда
    	КоличествоУслугВКорзине = "Корзина пуста";
	Иначе
	//КоличествоУслугВКорзине = "В корзине " + Количество + " услуг";
	

		Остаток10 = ОбщееКоличествоУслуг % 10;
		Остаток100 = ОбщееКоличествоУслуг % 100;
	
	Если Остаток10 = 1 И Остаток100 <> 11 Тогда
		Слово = "услуга";
	ИначеЕсли (Остаток10 >= 2 И Остаток10 <= 4) И (Остаток100 < 10 Или Остаток100 >= 20) Тогда
		Слово = "услуги";
	Иначе
		Слово = "услуг";
	КонецЕсли;
	
	КоличествоУслугВКорзине = СтрШаблон("В корзине %1 %2", ОбщееКоличествоУслуг, Слово);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьИнформациюОМедПерсонале()
	
	Если Объект.омг_МедПерсонал.Количество() > 0 Тогда
		ИнформацияОМедПерсонале = "Добавлен дополнительный медицинский персонал";
	Иначе
		ИнформацияОМедПерсонале = "Не указан дополнительный медицинский персонал"; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ОткрытьКорзину(Команда)
	Элементы.ГруппаСтраниц.Показать();
КонецПроцедуры

&НаКлиенте
Процедура РаботыПриИзменении(Элемент)
	 ОбновитьИнформациюОКорзине();
    
КонецПроцедуры

&НаКлиенте
Процедура омг_МедПерсоналПриИзменении(Элемент)
	 ОбновитьИнформациюОМедПерсонале();
КонецПроцедуры

&НаКлиенте
Процедура омг_МедПерсоналПослеУдаления(Элемент)
	 ОбновитьИнформациюОМедПерсонале();
КонецПроцедуры

&НаКлиенте
Процедура омг_ВзятьПредоплату(Команда) 
	
	Если Объект.Ссылка.Пустая() Тогда
		Записать()
	КонецЕсли;	
	
	Если омг_СтатусПредоплаты = "Оплата принята" Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораКнопки", ЭтотОбъект);
		
		ПоказатьВопрос(Оповещение, "Вернуть предоплату?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да); 
		
	иначе
		
		Кнопки = Новый СписокЗначений; 
		Кнопки.Добавить("БанковскаяКарта", "Банковская карта");
		Кнопки.Добавить("Наличные", "Наличные");
		Кнопки.Добавить("Отмена", "Отмена");
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораКнопки", ЭтотОбъект);
		
		ПоказатьВопрос(Оповещение, "Выберите тип оплаты:", Кнопки,,"Отмена"); 
		
	КонецЕсли;
	
КонецПроцедуры    
&НаКлиенте
Процедура ПослеВыбораКнопки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Объект.Ссылка.Пустая() Тогда	
		  Записать()
	КонецЕсли;
	
	Если Результат = "Наличные" Тогда
		
		ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
		ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.Форма.ФормаДокументаУпр", ПараметрыФормы);
		
	ИначеЕсли Результат = "БанковскаяКарта" Тогда
		
		ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
		ОткрытьФорму("Документ.ОплатаПлатежнойКартой.Форма.ФормаДокументаУпр", ПараметрыФормы);
		
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда	
		
		ПлатежныйДокумент = ВернутьПлатежныйДокумент();
		ПараметрыФормы = Новый Структура("Основание",ПлатежныйДокумент);
		
		Если ТипЗнч(ПлатежныйДокумент)   = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
			
			ОткрытьФорму("Документ.РасходныйКассовыйОрдер.Форма.ФормаДокументаУпр", ПараметрыФормы);
			
		иначе
			
			ОткрытьФорму("Документ.ВозвратПоПлатежнойКарте.Форма.ФормаДокументаУпр", ПараметрыФормы);
			
		КонецЕсли;
		
	КонецЕсли;    
	
	ОбновитьПредоплату();
	
КонецПроцедуры    

 &НаСервере
Функция ВернутьСтатусОплаты()  
	
	ВозЗначение = Ложь;
	
	Если не Объект.Ссылка.Пустая() Тогда
		Если ЗначениеЗаполнено(омг_Предоплата.ВернутьСтатусОплаты(Объект.Ссылка)) Тогда
			ВозЗначение = Истина
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВозЗначение
	
КонецФункции     

&НаСервере
Процедура ОбновитьПредоплату()   
	// Временно закомментить для отладки 8.5
	Элементы.ГруппаПредоплатыИОповещений.Видимость = Ложь; 
	Элементы.омг_СтатусПредоплаты.Видимость = Ложь; 
	Элементы.омг_Ссылка.Видимость = Ложь;
	Элементы.омг_ВзятьПредоплату.Видимость = Ложь; 
	Элементы.ОМГ_ПричинаОтсутствияПредоплаты.Видимость = Ложь;
	//Временно для отладки 8.5
	Организация  = омг_ДополнительныеАлгоритмы.омг_ВернутьОрганизациюПоФилиалу(Объект.Филиал);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		Если омг_Предоплата.омг_ИспользуетсяПредоплата(Организация) Тогда 
			
			Элементы.омг_ВзятьПредоплату.Видимость = Истина;
			Элементы.ОМГ_ПричинаОтсутствияПредоплаты.Видимость = Истина;
			
			Если не Объект.Ссылка.Пустая() Тогда
				
				СтатусОплаты = омг_Предоплата.ВернутьСтатусОплаты(Объект.Ссылка);
				
				Если ЗначениеЗаполнено(СтатусОплаты) Тогда
					омг_СтатусПредоплаты = СтатусОплаты.Статус;
					омг_Ссылка = СтатусОплаты.Ссылка;
					Элементы.омг_ВзятьПредоплату.Видимость = Ложь;
					Элементы.омг_СтатусПредоплаты.Видимость = Истина;  
					Элементы.омг_Ссылка.Видимость = Истина;
					Элементы.ОМГ_ПричинаОтсутствияПредоплаты.Видимость = Ложь; 
					
					Если СтатусОплаты.Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыПредоплаты.ОплатаПринята") Тогда
						Элементы.омг_ВзятьПредоплату.Видимость = Истина;
						Элементы.омг_ВзятьПредоплату.Заголовок = "Вернуть предоплату";
					иначе
						Элементы.омг_ВзятьПредоплату.Видимость = Ложь;
						Элементы.омг_ВзятьПредоплату.Заголовок = "Взять предоплату";
					КонецЕсли;	
				КонецЕсли;	
				
			КонецЕсли; 
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры  
 &НаСервере
Функция ВернутьПлатежныйДокумент()  
	
	Возврат омг_Предоплата.ВернутьСтатусОплаты(Объект.Ссылка).ПлатежныйДокумент;
	 
КонецФункции

// ОМГ
/////////////////////////////////////////////////////////////////////////////////
