
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСФормамиСервер.ДокументСписокПриСозданииНаСервере(ЭтаФорма);
	// Добавлено Макеев (
	Если Не РольДоступна("ПолныеПрава") И РольДоступна("омг_УстановкаЦенПоСтраховымПрограммам") Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидОперации");
		СписокОпераций = Новый СписокЗначений;
		СписокОпераций.Добавить(Перечисления.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограмма);
		СписокОпераций.Добавить(Перечисления.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограммаНаборы);
		ЭлементОтбора.ПравоеЗначение = СписокОпераций;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		Если РольДоступна("ПолныеПрава") Тогда
			ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
		КонецЕсли;
		
		ОрганизацияПоУмолчанию = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(Пользователи.ТекущийПользователь(),"омг_ОсновнаяОрганизация");;
		
		Если ЗначениеЗаполнено(ОрганизацияПоУмолчанию) Тогда
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("омг_Организация");
			ЭлементОтбора.ПравоеЗначение = ОрганизацияПоУмолчанию;
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;
	КонецЕсли;
	// )
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
КонецПроцедуры

#КонецОбласти