
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если Не ПараметрыВыполненияКоманды.Источник.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограмма")
		И Не ПараметрыВыполненияКоманды.Источник.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограммаНаборы") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Документ", ПараметрКоманды);
	ОткрытьФорму("Обработка.омг_ПроверкаИПерезаполнениеЦенПродажПоСтраховымПрограммам.Форма", 
		ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
