#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Справочники.Организации.ЕдинственнаяОрганизация();
		Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
			Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Пользователь) Тогда
		ТекущийЭлемент = Элементы.УИД;
	КонецЕсли;
	
	Если Объект.Полномочия.Количество() > 0 Тогда
		Полномочия = Объект.Полномочия[0].Полномочие;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Полномочия.Очистить();
	Если ЗначениеЗаполнено(Полномочия) Тогда
		НовыеПолномочия = Объект.Полномочия.Добавить();
		НовыеПолномочия.Полномочие = Полномочия;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура УИДПриИзменении(Элемент)
	
	Попытка
		УИД = Новый УникальныйИдентификатор(Объект.УИД);
	Исключение
		Объект.УИД = "";
		ПоказатьПредупреждение(, "Неверный формат идентификатора доверенности!
								 |Скопируйте идентификатор из доверенности и вставьте в поле ввода.");
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолномочияПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти