
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаВремяВыполнения",Параметры.ДатаВыполнения);
	Список.Параметры.УстановитьЗначениеПараметра("Ответственный",ПараметрыСеанса.ТекущийПользователь);
	Список.Параметры.УстановитьЗначениеПараметра("Филиал",УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя());
	РаботаСФормамиСервер.УстановитьОтборСписка("ИдентификаторЭлемента", Параметры.ИдентификаторЭлемента, Список);
	
	Элементы.СписокКонтекстноеМенюУдалитьВыполнение.Видимость = Не Параметры.СкрытьКомандуУдаления;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыполнение(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	УдалитьВыполнениеНаСервере(ТекущиеДанные.Регистратор, ТекущиеДанные.ДатаВремяВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьВыполнениеНаСервере(ДействияЗаСутки,ДатаВремяВыполнения)
	
	ДействиеЗаСутки = ДействияЗаСутки.ПолучитьОбъект();
	
	// Изменения Макеев 18-12-2025 (
	ЕстьСписание = Не ДействияЗаСутки.СписаниеТоваров.Пустая();
	Если ЕстьСписание Тогда
		ДокументСписания = ДействияЗаСутки.СписаниеТоваров.ПолучитьОбъект();
		СтруктураПоиска = Новый Структура("Номенклатура, СерияНоменклатуры, Количество");
	КонецЕсли;
	СтрокаКУдалению = ДействиеЗаСутки.ДействияСтационара.НайтиСтроки(Новый Структура("ИдентификаторЭлемента,ДатаВремяВыполнения", Параметры.ИдентификаторЭлемента,ДатаВремяВыполнения));
	
	Для Каждого стр Из СтрокаКУдалению Цикл 
		Если ЕстьСписание Тогда
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, стр);
			СтруктураПоиска.Номенклатура = стр.ДействиеСтационара;
			НайденныеСтрокиСписания = ДокументСписания.Товары.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтрокиСписания.Количество() > 0 Тогда
				ДокументСписания.Товары.Удалить(НайденныеСтрокиСписания[0]);
			КонецЕсли;
		КонецЕсли;
		ДействиеЗаСутки.ДействияСтационара.Удалить(стр);
	КонецЦикла;
	
	Попытка
		НачатьТранзакцию();
		ДействиеЗаСутки.Записать(РежимЗаписиДокумента.Проведение);
		Если ЕстьСписание Тогда
			ДокументСписания.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось удалить выполнение";
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
