
&НаКлиенте
Процедура КнВыборПериодаКонец(Период, ДопПараметры) Экспорт

    ВыборПериодаМесяц = ДопПараметры.ДиалогВыборПериода;

    Если ЗначениеЗаполнено(Период) Тогда
        ВыбранныйПериод = ВыборПериодаМесяц.Период;     
        Элементы.СоставШкалы.ТекущиеДанные.омг_Период = НачалоМесяца(ВыбранныйПериод.ДатаНачала);
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоставШкалыомг_ПериодАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыборПериодаМесяц = Новый ДиалогРедактированияСтандартногоПериода();
    ВыборПериодаМесяц.Период = Новый СтандартныйПериод;    
	ОповещениеВыбора = Новый ОписаниеОповещения("КнВыборПериодаКонец", ЭтаФорма,
    Новый Структура("ДиалогВыборПериода", ВыборПериодаМесяц));
    ВыборПериодаМесяц.Показать(ОповещениеВыбора); 

КонецПроцедуры

