

&НаСервере
Функция ПолучитьФилиалПользователя()
	НастройкаОрганизация = ПланыВидовХарактеристик.НастройкиПользователей.омг_ОсновнаяОрганизация;
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиПользователей.Значение КАК Организация
	               |ИЗ
	               |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	               |ГДЕ
	               |	НастройкиПользователей.Пользователь = &Пользователь
	               |	И НастройкиПользователей.Настройка = &НастройкаОрганизация";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("НастройкаОрганизация", НастройкаОрганизация);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
	    ОсновнаяОрганизация = Выборка.Организация
	КонецЕсли;
    Возврат ОсновнаяОрганизация;
		
КонецФункции


&НаСервере
Процедура ПриОткрытииНаСервере()

	Если Не РольДоступна("ПолныеПрава") Тогда
		Филиал = ПолучитьФилиалПользователя();
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Филиал");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	  //ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ; // Опционально
     	ЭлементОтбора.ПравоеЗначение = Филиал;
	КонецЕсли; 
 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
