
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВредныеФакторы = ?(Параметры.Свойство("ВредныеФакторы"), Параметры.ВредныеФакторы, Неопределено);
	ИнфекционныеЗаболеванияСФормы = ?(Параметры.Свойство("ИнфекционныеЗаболевания"), Параметры.ИнфекционныеЗаболевания, Неопределено);
	ПрофильРаботы = ?(Параметры.Свойство("ПрофильРаботы"), Параметры.ПрофильРаботы, Неопределено);
	
	Если ЗначениеЗаполнено(ВредныеФакторы) И ПрофильРаботы <> Неопределено Тогда
		ЗаполнитьПредопределенныеДиагнозы(ВредныеФакторы, ПрофильРаботы, ИнфекционныеЗаболеванияСФормы);
	Иначе
		Элементы.ПредопределенныеДиагнозы.Видимость = Ложь;
		ЗаполнитьИнфекционныеЗаболевания(ИнфекционныеЗаболеванияСФормы);
	КонецЕсли;
	ЗаполнитьСписокВыбораГод(Элементы.ТаблицаДиагнозовГод);
	ЗаполнитьСписокВыбораГод(Элементы.ПредопределенныеДиагнозыДата);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьТекстПредставления();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПередЗакрытиемМодифицированнойФормы", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Данные были изменены. Сохранить изменения?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	ИнфекционныеЗаболевания = Новый Массив;
	СообщениеОбОшибке = "";
	Для Каждого Эл Из ВременнаяТаблицаДиагнозов Цикл
		Если Не ЗначениеЗаполнено(Эл.Диагноз) Или Не ЗначениеЗаполнено(Эл.Дата) Тогда
			СообщениеОбОшибке = "Не заполнена дата инфекционного заболевания";
			Прервать; 
		КонецЕсли;
		ИнфекционныеЗаболевания.Добавить(Новый Структура("Диагноз, Дата", Эл.Диагноз, Эл.Дата));
	КонецЦикла;
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке);
	Иначе
		Модифицированность = Ложь;
		ЭтотОбъект.Закрыть(ИнфекционныеЗаболевания);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтотОбъект.Закрыть(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТаблицаДиагнозовПриИзменении(Элемент)
	УстановитьТекстПредставления();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПредопределенныеДиагнозыПриИзменении(Элемент)
	
	УстановитьТекстПредставления();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредопределенныеДиагнозыВыбранПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПредопределенныеДиагнозы.ТекущиеДанные;
	Если ТекущиеДанные.Выбран = 2 Тогда
		ТекущиеДанные.Выбран = 0;
	КонецЕсли;
	
	ПересчитатьВыбранностьГруппПредопределенныеДиагнозы(ПредопределенныеДиагнозы);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриИзменении(Элемент)
	УстановитьТекстПредставления();
КонецПроцедуры

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура УстановитьТекстПредставления()
	
	ЗаполнитьВременнуюТаблицуДиагнозов(ВременнаяТаблицаДиагнозов, ТаблицаДиагнозов, ПредопределенныеДиагнозы.ПолучитьЭлементы());
	Результат = МедосмотрыКлиент.ПолучитьПредставлениеИнфекционныеЗаболевания(ВременнаяТаблицаДиагнозов);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнфекционныеЗаболевания(ИнфекционныеЗаболеванияСФормы, ДеревоПредопрДиагнозы=Неопределено)
	
	Если ИнфекционныеЗаболеванияСФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Эл Из ИнфекционныеЗаболеванияСФормы Цикл
		
		Если ДеревоПредопрДиагнозы <> Неопределено Тогда
			Найденные = ДеревоПредопрДиагнозы.Строки.НайтиСтроки(Новый Структура("Диагноз", Эл.Диагноз), Истина);
			Если Найденные.Количество() > 0 Тогда
				Найденные[0].Выбран = 1;
				Найденные[0].Диагноз = Эл.Диагноз;
				Найденные[0].Дата = Эл.Дата;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаДиагнозов.Добавить();
		НоваяСтрока.Диагноз = Эл.Диагноз;
		НоваяСтрока.Дата = Эл.Дата;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредопределенныеДиагнозы(ВредныеФакторы, ПрофильРаботы, ИнфекционныеЗаболеванияСФормы)
	
	ДеревоПредопрДиагнозы = РеквизитФормыВЗначение("ПредопределенныеДиагнозы");  
	
	ТабПредопределенныеДиагнозы = СформироватьОтборыИнфекционныхЗаболеваний(ВредныеФакторы, ПрофильРаботы);
	
	Если ТабПредопределенныеДиагнозы.Количество() = 0 Тогда
		Элементы.ПредопределенныеДиагнозы.Видимость = Ложь;
	КонецЕсли;
	
	Для Каждого Эл Из ТабПредопределенныеДиагнозы Цикл
		
		Если ТабПредопределенныеДиагнозы.НайтиСтроки(Новый Структура("Родитель", Эл.Родитель)).Количество() > 1 Тогда
			СтрокиГруппДерева = ДеревоПредопрДиагнозы.Строки.НайтиСтроки(Новый Структура("Диагноз", Эл.Родитель));
			Если СтрокиГруппДерева.Количество() > 0 Тогда
				ГруппаДерева = СтрокиГруппДерева[0];
			Иначе
				ГруппаДерева = ДеревоПредопрДиагнозы.Строки.Добавить();
				ГруппаДерева.Диагноз = Эл.Родитель;
				ГруппаДерева.ЭтоГруппа = Истина;
			КонецЕсли;
			ДобавляемыйДиагноз = ГруппаДерева.Строки.Добавить();
			ДобавляемыйДиагноз.Диагноз = Эл.Ссылка;
		Иначе
			ДобавляемыйДиагноз = ДеревоПредопрДиагнозы.Строки.Добавить();
			ДобавляемыйДиагноз.Диагноз = Эл.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьИнфекционныеЗаболевания(ИнфекционныеЗаболеванияСФормы, ДеревоПредопрДиагнозы);
	
	ЗначениеВРеквизитФормы(ДеревоПредопрДиагнозы, "ПредопределенныеДиагнозы");
	
	ПересчитатьВыбранностьГруппПредопределенныеДиагнозы(ПредопределенныеДиагнозы);
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтборыИнфекционныхЗаболеваний(ВредныеФакторы, ПрофильРаботы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Диагнозы.Ссылка КАК Ссылка,
		|	Диагнозы.Родитель КАК Родитель
		|ИЗ
		|	Справочник.Диагнозы КАК Диагнозы
		|ГДЕ
		|	НЕ Диагнозы.ЭтоГруппа
		|	И Диагнозы.КодДиагноза В(&КодыДиагнозов)
		|	И НЕ Диагнозы.ПометкаУдаления
		|	И НЕ Диагнозы.Архив";
	
	КодыДиагнозов = ПолучитьМассивКодовОграничений(ВредныеФакторы, ПрофильРаботы);
	
	Запрос.УстановитьПараметр("КодыДиагнозов", КодыДиагнозов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьМассивКодовОграничений(ВредныеФакторы, ПрофильРаботы)
	
	МассивОграничений = Новый Массив;
	
	Для Каждого Эл Из ВредныеФакторы Цикл
		
		МассивОграниченийФактора = ПолучитьКодыДиагнозовПоВредномуФактору(Эл, ПрофильРаботы);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивОграничений, МассивОграниченийФактора, Истина); 
		
	КонецЦикла;
	
	Возврат МассивОграничений;
	
КонецФункции

&НаСервере
Функция ПолучитьКодыДиагнозовПоВредномуФактору(ВредныйФактор, ПрофильРаботы)
	
	Если ВредныйФактор = Неопределено Или ВредныйФактор = Справочники.ПереченьВредныхФакторовИРабот.ПустаяСсылка() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ДанныеВредногоФактора = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ВредныйФактор, "НомерПП, Приказ");
	
	Если ДанныеВредногоФактора.Приказ = Справочники.ПриказыМедосмотров.Приказ29н Тогда
		СтрокаОграничений = Неопределено;
		Если ДанныеВредногоФактора.НомерПП = "23" Тогда
			СтрокаОграничений = ИнтеграцияЕГИСЗ_СЭМД.МассивОграниченийДиагнозовФактор23_230(ПрофильРаботы); 
		ИначеЕсли ДанныеВредногоФактора.НомерПП = "24" Тогда
			СтрокаОграничений = ИнтеграцияЕГИСЗ_СЭМД.МассивОграниченийДиагнозовФактор24_230();
		ИначеЕсли ДанныеВредногоФактора.НомерПП = "25" Тогда
			СтрокаОграничений = ИнтеграцияЕГИСЗ_СЭМД.МассивОграниченийДиагнозовФактор25_230();
		ИначеЕсли ДанныеВредногоФактора.НомерПП = "26" Тогда
			СтрокаОграничений = ИнтеграцияЕГИСЗ_СЭМД.МассивОграниченийДиагнозовФактор26_230();
		КонецЕсли;
		
		Если СтрокаОграничений <> Неопределено Тогда
			Возврат СтрокаОграничений;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Новый Массив;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораГод(Элемент)
	
	ТекущийГод = НачалоГода(ТекущаяДата());
	Для Сч = 0 По КоличествоЛетВСписках() - 1 Цикл
		Год = ДобавитьМесяц(ТекущийГод, -12 * Сч);
		Элемент.СписокВыбора.Добавить(Год, Формат(Год, "ДФ=yyyy"));
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КоличествоЛетВСписках()

	Возврат 21;
	
КонецФункции

&НаКлиенте
Процедура ВопросПередЗакрытиемМодифицированнойФормы(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		Применить(Неопределено);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЗаполнитьВременнуюТаблицуДиагнозов(ВременнаяТаблицаДиагнозов, ТаблицаДиагнозов, ПредопределенныеДиагнозы)
	
	ВременнаяТаблицаДиагнозов.Очистить();
	ДополнитьТаблицуДиагнозов(ВременнаяТаблицаДиагнозов, ПредопределенныеДиагнозы);
	Для Каждого Эл Из ТаблицаДиагнозов Цикл
		ЗаполнитьЗначенияСвойств(ВременнаяТаблицаДиагнозов.Добавить(), Эл);
	КонецЦикла;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ДополнитьТаблицуДиагнозов(ВременнаяТаблицаДиагнозов, ПредопределенныеДиагнозы)
	
	Для Каждого Эл Из ПредопределенныеДиагнозы Цикл
		Если Эл.ЭтоГруппа Тогда
			Если ТипЗнч(Эл) = Тип("ДанныеФормыЭлементДерева") Тогда
				ПодчиенныеЭлементы = Эл.ПолучитьЭлементы();
			Иначе
				ПодчиенныеЭлементы = Эл.Строки;
			КонецЕсли;
			ДополнитьТаблицуДиагнозов(ВременнаяТаблицаДиагнозов, ПодчиенныеЭлементы);
		Иначе
			Если Эл.Выбран = 1 Тогда
				ЗаполнитьЗначенияСвойств(ВременнаяТаблицаДиагнозов.Добавить(), Эл);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьВыбранностьГруппПредопределенныеДиагнозы(ДеревоФормы)
	
	Для Каждого СтрокаУровня1 Из ДеревоФормы.ПолучитьЭлементы() Цикл
		
		СтрокаУровня1Элементы = СтрокаУровня1.ПолучитьЭлементы();
		
		Если СтрокаУровня1.ПолучитьЭлементы().Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Выбран = 0;
		ЕстьВыбранные = Ложь;
		ЕстьНеВыбранные = Ложь;
		Для Каждого СтрокаУровня2 Из СтрокаУровня1Элементы Цикл
			
			Если СтрокаУровня2.Выбран = 0 Тогда
				ЕстьНеВыбранные = Истина;
			Иначе
				ЕстьВыбранные = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьВыбранные И ЕстьНеВыбранные Тогда
			СтрокаУровня1.Выбран = 2;
		ИначеЕсли ЕстьВыбранные Тогда;
			СтрокаУровня1.Выбран = 1;
		Иначе
			СтрокаУровня1.Выбран = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

