// Заполнить используемую версию
//
Процедура ЗаполнитьИспользуемуюВерсиюСервераЛицензирования() Экспорт
	
	Если ПустаяСтрока(Константы.ИспользуемаяВерсияСистемыЛицензирования.Получить()) Тогда
		
		Док = Документы.Заявка.СоздатьДокумент();
		Док.мНеДелатьПроверокПриЗаписи = Истина;
		
		Константы.ИспользуемаяВерсияСистемыЛицензирования.Установить("1.6");
		Попытка
			Отказ = Ложь;
			РаботаСДокументамиСервер.ОбработкаПроведенияДокументов(Док,Отказ,РежимПроведенияДокумента.Неоперативный);
			Есть1 = Не Отказ;
		Исключение
			А = ОписаниеОшибки();
		КонецПопытки;
		
		Константы.ИспользуемаяВерсияСистемыЛицензирования.Установить("2.0");
		Попытка
			Отказ = Ложь;
			РаботаСДокументамиСервер.ОбработкаПроведенияДокументов(Док,Отказ,РежимПроведенияДокумента.Неоперативный);
			Есть2 = Не Отказ;
		Исключение
		КонецПопытки;
		
		Если Есть2 Тогда
			Константы.ИспользуемаяВерсияСистемыЛицензирования.Установить("2.0");
		Иначе
			Константы.ИспользуемаяВерсияСистемыЛицензирования.Установить("1.6");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
