#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Формирует табличный документ журнала.
// 
// Возвращаемое значение:
//  ТабличныйДокумент - сформированный журнал.
//
Функция СформироватьОтчет() Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Автомасштаб = Истина;
	ТабДок.КлючПараметровПечати = "ЖурналВрачебныхКомиссий";

	РезультатЗапроса = ВыполнитьЗапросПоВрачебнымКомиссиям();
	Если РезультатЗапроса.Количество() = 0 Тогда
		Возврат ТабДок;	
	КонецЕсли;
	
	Макет = ПолучитьМакет("ЖурналВрачебныхКомиссий");
	
	РеквизитыОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(РезультатЗапроса[0].Ссылка);
	
	МассивДляПроверки = Новый Массив();
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.ПредставлениеОрганизации = РеквизитыОрганизации.НазваниеОрганизации;
	Область.Параметры.ПериодНачала = Формат(ПериодНачало,"ДФ=dd.MM.yyyy");
	Область.Параметры.ПериодОкончание = Формат(ПериодОкончание,"ДФ=dd.MM.yyyy");
	МассивДляПроверки.Добавить(Область);
	
	Если ЗначениеЗаполнено(Ответственный) Тогда
		ТекстОтвественный = "";
		Область = Макет.ПолучитьОбласть("Ответственный");
		Если ЗначениеЗаполнено(Должность) Тогда
			ТекстОтвественный = Должность + ", ";	
		КонецЕсли; 
		ТекстОтвественный = ТекстОтвественный + ОбщегоНазначения.ФамилияИнициалыФизЛица(Ответственный);
		Область.Параметры.Ответственный = ТекстОтвественный;
		МассивДляПроверки.Добавить(Область);
	КонецЕсли; 
		
	Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
	МассивДляПроверки.Добавить(Область);
	
	Для Каждого СтрокаЗапроса Из РезультатЗапроса Цикл
		Если Не ТабДок.ПроверитьВывод(МассивДляПроверки) Тогда
			ИндексПоследнего = МассивДляПроверки.Количество()-1;
			ПоследняяОбласть = МассивДляПроверки[ИндексПоследнего];
			МассивДляПроверки.Удалить(ИндексПоследнего);
			Для Каждого Область Из МассивДляПроверки Цикл
				ТабДок.Вывести(Область);	
			КонецЦикла; 
			МассивДляПроверки.Очистить();
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
			МассивДляПроверки.Добавить(Область);
			МассивДляПроверки.Добавить(ПоследняяОбласть);
		КонецЕсли; 	
		Область = Макет.ПолучитьОбласть("СтрокаТаблицы");
		Область.Параметры.Дата = Формат(СтрокаЗапроса.Дата, "ДФ='dd.MM.yyyy HH:mm'");
		Сотрудник = ОбщегоНазначения.ФамилияИнициалыФизЛица(СтрокаЗапроса.ПредседательКомиссии);
		ТекстСоставКомиссии = Сотрудник + " (председатель)";
		Для Каждого СтрокаСоставаКомиссии Из СтрокаЗапроса.СоставКомиссии Цикл
			Сотрудник = ОбщегоНазначения.ФамилияИнициалыФизЛица(СтрокаСоставаКомиссии.Сотрудник);
			ТекстСоставКомиссии = ТекстСоставКомиссии + ", " + Сотрудник;	
		КонецЦикла; 
		Область.Параметры.СоставКомиссии = ТекстСоставКомиссии;
		
		Если ЗначениеЗаполнено(СтрокаЗапроса.РассмотренныеВопросы) Тогда
			Область.Параметры.Вопросы = СтрокаЗапроса.РассмотренныеВопросы;
		ИначеЕсли ЗначениеЗаполнено(СтрокаЗапроса.ЦельПредставление) Тогда
			Область.Параметры.Вопросы = "Комиссия собрана с целью: " + СтрокаЗапроса.ЦельПредставление;
		КонецЕсли;
		Область.Параметры.Заключение = СтрокаЗапроса.Заключение;
		Область.Параметры.Документ = СтрокаЗапроса.Ссылка;
		МассивДляПроверки.Добавить(Область);
	КонецЦикла; 
	
	Для Каждого Область Из МассивДляПроверки Цикл
		ТабДок.Вывести(Область);	
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Функция ВыполнитьЗапросПоВрачебнымКомиссиям()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВрачебнаяКомиссия.Дата КАК Дата,
		|	ВрачебнаяКомиссия.РассмотренныеВопросы КАК РассмотренныеВопросы,
		|	ВрачебнаяКомиссия.Цель.Представление КАК ЦельПредставление,
		|	ВрачебнаяКомиссия.Заключение КАК Заключение,
		|	ВрачебнаяКомиссия.ПредседательКомиссии КАК ПредседательКомиссии,
		|	ВрачебнаяКомиссия.СоставКомиссии.(
		|		Сотрудник КАК Сотрудник
		|	) КАК СоставКомиссии,
		|	ВрачебнаяКомиссия.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВрачебнаяКомиссия КАК ВрачебнаяКомиссия
		|ГДЕ
		|	(ВрачебнаяКомиссия.Дата МЕЖДУ &ПериодНачало И &ПериодОкончание
		|				И &ЕстьОтборПоФилиалу = ЛОЖЬ
		|			ИЛИ ВрачебнаяКомиссия.Филиал В ИЕРАРХИИ (&Филиал))";
	Запрос.УстановитьПараметр("ПериодНачало",ПериодНачало);
	Запрос.УстановитьПараметр("ПериодОкончание",КонецДня(ПериодОкончание));
	Запрос.УстановитьПараметр("Филиал", Филиалы);
	Запрос.УстановитьПараметр("ЕстьОтборПоФилиалу", Филиалы.Количество() > 0);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
		
КонецФункции

#КонецОбласти

#КонецЕсли