&НаКлиенте
Перем КэшСообщений;

&НаКлиенте
Перем КэшКонтента;

&НаКлиенте
Процедура СписокЧатовПриАктивацииСтроки(Элемент)
    ОтключитьОбработчикОжидания("ОбновитьОкноДиалога");
    ПодключитьОбработчикОжидания("ОбновитьОкноДиалога", 0.2, Истина);
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьHTMLДиалогаНаСервере(ЧатСсылка, КэшКонтента, УникальныйИдентификаторФормы)
    Возврат iga_РаспределениеСервер.СформироватьHTMLДиалога(ЧатСсылка, КэшКонтента, УникальныйИдентификаторФормы);
КонецФункции

&НаКлиенте
Процедура ОбновитьОкноДиалога()
	
	ТекущиеДанные = ПолучитьТекущиеДанные();
	
	ПерваяВременнаяМетка = 0;
	
	Если ТекущиеДанные <> Неопределено Тогда
        Результат = СформироватьHTMLДиалогаНаСервере(ТекущиеДанные.Чат, КэшКонтента, УникальныйИдентификатор);
        ТекстДиалогаHTML = Результат.HTML;
        ТекущаяВременнаяМетка = Макс(ТекущаяВременнаяМетка, Результат.ТекущаяВременнаяМетка);
		
		Элементы.ТекстДиалогаHTML.Документ.defaultView.clearMessages();
		
		
		ВывестиСообщенияПриОткрытии(Результат.МассивДанных);
		

		
        КэшСообщений = Новый Соответствие;
		Для Каждого СтрИзМассива Из Результат.МассивДанных Цикл
			Если ПерваяВременнаяМетка = 0 Тогда
				ПерваяВременнаяМетка = СтрИзМассива.ВременнаяМетка;
			КонецЕсли;
            КэшСообщений.Вставить(СтрИзМассива.IDСообщения, СтрИзМассива);
			Если ЗначениеЗаполнено(СтрИзМассива.IDЦитируемогоСообщения) Тогда
				СтруктураЦитируемогоСообщения = iga_ОбщегоНазначенияКлиентСервер.СкопироватьПоляСтруктуры(СтрИзМассива);
				СтруктураЦитируемогоСообщения.Текст = СтрИзМассива.ТекстЦитирования;
				СтруктураЦитируемогоСообщения.Автор = СтрИзМассива.АвторЦитирования;
				СтруктураЦитируемогоСообщения.ПрочитаноОператором = СтрИзМассива.ПрочитаноОператором;
				КэшСообщений.Вставить(СтрИзМассива.IDЦитируемогоСообщения, СтруктураЦитируемогоСообщения);
			КонецЕсли;
        КонецЦикла;
		
		ОтправкаДоступна = Элементы.Отправить.Доступность;
		
        ПрочитатьСообщенияНаСервере(ТекущиеДанные.Чат, КэшСообщений, ТекущиеДанные.ИДЧата, ОтправкаДоступна);
	Иначе
		
		Элементы.ТекстДиалогаHTML.Документ.defaultView.clearMessages();
	
	КонецЕсли;
	
	ЦитируемоеСообщениеИд = "";
	
	Элементы.ТекстДиалогаHTML.Документ.defaultView.scrollEnd();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущийПользователь()
	
	Возврат Пользователи.ТекущийПользователь();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущиеНастройкиОператора(ТекущийОператор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_НастройкиОператоров.Оператор КАК Оператор,
	               |	iga_НастройкиОператоров.Статус КАК Статус,
	               |	iga_НастройкиОператоров.ПриниматьНовыеЧаты КАК ПриниматьНовыеЧаты,
	               |	iga_НастройкиОператоров.ПростойОператор КАК ПростойОператор
	               |ИЗ
	               |	РегистрСведений.iga_НастройкиОператоров КАК iga_НастройкиОператоров
	               |ГДЕ
	               |	iga_НастройкиОператоров.Оператор = &Оператор";
	Запрос.УстановитьПараметр("Оператор", ТекущийОператор);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураНастроек = Новый Структура("Статус, ПриниматьНовыеЧаты, ПростойОператор");
		ЗаполнитьЗначенияСвойств(СтруктураНастроек, Выборка);
		Возврат СтруктураНастроек;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УстановитьПараметрыОператора(Форма)
	
	СтруктураНастроек = ПолучитьТекущиеНастройкиОператора(Форма.ТекущийОператор);;
	
	Если СтруктураНастроек = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Форма.ОператорСписков = Форма.ТекущийОператор;

	Форма.ТекущийСтатусОператора = СтруктураНастроек.Статус;
	Форма.ПредыдущийСтатусОператора = СтруктураНастроек.Статус;
	Форма.ПриниматьНовыеЧаты = СтруктураНастроек.ПриниматьНовыеЧаты;
	
	Форма.СписокЧатов.Параметры.УстановитьЗначениеПараметра("ТекущийОператор", Форма.ТекущийОператор);
	Форма.СписокЧатовТребуютУточнения.Параметры.УстановитьЗначениеПараметра("ТекущийОператор", Форма.ТекущийОператор);
	Форма.СписокОжидающих.Параметры.УстановитьЗначениеПараметра("ТекущийОператор", Форма.ТекущийОператор);
	Форма.Элементы.ОператорСписков.Видимость = Не СтруктураНастроек.ПростойОператор;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущийОператор = ТекущийПользователь();
	ПредыдущийОператор = ТекущийОператор;
	
	Отказ = Не УстановитьПараметрыОператора(ЭтаФорма);
	Если Отказ Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Данный пользователь не настроен для работы с АРМ оператора.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если Не РольДоступна("iga_ПолныеПрава") Тогда
		Элементы.ТекущийОператор.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	СписокЧатов.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	
	ВремяАктивности = Константы.iga_ВремяМаксимальнойАктивностиЧата.Получить();
	СписокЧатов.Параметры.УстановитьЗначениеПараметра("ВремяАктивностиМин", ?(ЗначениеЗаполнено(ВремяАктивности), ВремяАктивности, 60));
	ВремяОжиданияСоединения = Константы.iga_ВремяОжиданияПодтвержденияСоединения.Получить();
	СписокЧатов.Параметры.УстановитьЗначениеПараметра("ВремяОжиданияСоединения", ?(ЗначениеЗаполнено(ВремяОжиданияСоединения), ВремяОжиданияСоединения, 10));
	СписокЧатовОтмененныхПереносовЗаписей.Параметры.УстановитьЗначениеПараметра("ТекущийОператор", ТекущийОператор);
	
	ДатаОчисткиКэша = ТекущаяДата();
	
	Если Не Константы.iga_ЧатБотИспользуется.Получить() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Чат бот не запущен. Проверьте запуск чат бота.";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Если РольДоступна("iga_ОператорВацап") Тогда
		Элементы.ТекущийОператор.Видимость = Ложь;
	КонецЕсли;
	
	Если Не Константы.iga_ВключеноОповещениеОЗаписи.Получить() Тогда
		Элементы.СтраницаЗаписиЧатов.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтправитьНаСервере(ТекущийЧат, ИдЧата, ТекстовоеСообщение, ТекущийОператор, КэшСообщений, ЦитируемоеСообщениеИд = "")

	Бот = Обработки.iga_ChatBot.Создать();
    Бот.ИнициализацияОсновныхПараметров();
    Результат = Бот.ОтправитьТекст(ИдЧата, ТекстовоеСообщение, ЦитируемоеСообщениеИд);
	
	РезультатСервера = Новый Структура("ТекущаяВременнаяМетка, IDСообщения");
	
	Если Результат <> Неопределено Тогда
		РезультатСервера.IDСообщения = Результат.idMessage;
		
		ТекстЦитирования = "";
		АвторЦитирования = "";
		Если Не ЦитируемоеСообщениеИд = "" Тогда
			ДанныеСообщения = КэшСообщений.Получить(ЦитируемоеСообщениеИд);
			ТекстЦитирования = ДанныеСообщения.Текст;
			АвторЦитирования = ДанныеСообщения.Автор;
		КонецЕсли;
		
		Попытка
			ДанныеСообщения = Бот.ПолучитьИнформациюОСообщении(ИдЧата, РезультатСервера.IDСообщения);
			ВременнаяМетка = ДанныеСообщения.timestamp;
		Исключение
			ВременнаяМетка = ПолучитьПоследнююВременнуюМетку(ТекущийЧат); 
		КонецПопытки;
		
		СтруктураСообщения = Новый Структура;
		СтруктураСообщения.Вставить("ЧатСсылка", ТекущийЧат);
		СтруктураСообщения.Вставить("ИДЧата", ИДЧата);
		СтруктураСообщения.Вставить("IDСообщения", Результат.idMessage);
		СтруктураСообщения.Вставить("Текст", ТекстовоеСообщение);
		СтруктураСообщения.Вставить("Тип", "textMessage");
		СтруктураСообщения.Вставить("ВходящееСообщение", Ложь);
		СтруктураСообщения.Вставить("IDЦитируемогоСобщения", ЦитируемоеСообщениеИд);
		СтруктураСообщения.Вставить("ТекстЦитирования", ТекстЦитирования);
		СтруктураСообщения.Вставить("АвторЦитирования", АвторЦитирования);
		СтруктураСообщения.Вставить("СсылкаОператор", ТекущийОператор);
		СтруктураСообщения.Вставить("Прочитано", Истина);
		
        РезультатСервера.ТекущаяВременнаяМетка = Бот.ЗаписатьВИсторию(СтруктураСообщения);
	КонецЕсли;
	
	Возврат РезультатСервера;
КонецФункции

&НаКлиенте
Процедура Обработчик_ПослеОтправкиФайла(Результат, ДопПараметры) Экспорт
	
	Если Результат = Истина Тогда
		ОбновитьОкноДиалога();
		ПутьКПрикрепленномуФайлу = "";
		Элементы.ОткрепитьФайл.Видимость = Ложь;
		ТекстовоеСообщение = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеСПрикрепленнымФайлом(ИдЧата)
	
	ПараметрыОткрытия = Новый Структура("ПутьКФайлу, ИмяФайла, Расширение, Сообщение", 
		ПутьКПрикрепленномуФайлу, ИмяПрикрепляемогоФайла, РасширениеПрикрепляемогоФайла, ТекстовоеСообщение);
		
	ПараметрыОткрытия.Вставить("ИдЧата", ИдЧата);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтправкиФайла", ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.iga_ФормаДлительнойОперации", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор,,,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	ПолеОтправкиСообщения = Элементы.ТекстовоеСообщение.Документ;
	Если ПолеОтправкиСообщения <> Неопределено Тогда
		ТекстовоеСообщение = ПолеОтправкиСообщения.defaultView.getText();
	Иначе
		Возврат;
	КонецЕсли;
	
	ТекстовоеСообщение = СокрЛП(ТекстовоеСообщение);
	
	Если ПустаяСтрока(ТекстовоеСообщение) И ПутьКПрикрепленномуФайлу = "" Тогда 
		Возврат; 
	КонецЕсли;
	
    
	ТекущиеДанные = ПолучитьТекущиеДанные();

	ДатаОтправки = ТекущаяДата();
	
	ДатаПоследнегоСообщения = ПолучитьДатуПоследнегоСообщения(ТекущиеДанные.Чат);
	
	Если iga_ОбщегоНазначенияКлиентСервер.РазностьДат(ДатаПоследнегоСообщения, ДатаОтправки, "ЧАС") >= 24 Тогда
		ПоказатьПредупреждение(, "Прошло более чем 24 часа с момента последнего сообщений. Отправьте шаблон через ""Начать диалог""", 60, "ВНИМАНИЕ!");
		УстановитьДоступностьЭлементов();
		Возврат;
	КонецЕсли;
	
	Если ПутьКПрикрепленномуФайлу = "" Тогда
		
		РезультатСервера = ОтправитьНаСервере(ТекущиеДанные.Чат, ТекущиеДанные.ИдЧата, ТекстовоеСообщение, ТекущийОператор, КэшСообщений, ЦитируемоеСообщениеИд);
		ТекущаяВременнаяМетка = Макс(ТекущаяВременнаяМетка, РезультатСервера.ТекущаяВременнаяМетка);
		
	Иначе
		ОтправитьСообщениеСПрикрепленнымФайлом(ТекущиеДанные.ИдЧата);
		Возврат;
	КонецЕсли;
	
    ИмяОператора = Строка(ТекущийОператор); 
	
	Сообщение = Новый Структура;
	Сообщение.Вставить("IDСообщения",   РезультатСервера.IDСообщения);
	Сообщение.Вставить("Текст",         ТекстовоеСообщение);
	Сообщение.Вставить("ЭтоВходящее",   Ложь);
	Сообщение.Вставить("Дата",         	ТекущаяДата());
	Сообщение.Вставить("IDЦитируемогоСообщения",    ЦитируемоеСообщениеИд);
	Сообщение.Вставить("ОператорИмя",  	Строка(ТекущийОператор));
	
    ДобавитьСообщениеВИнтерфейс(Сообщение);
	
    ЦитируемоеСообщениеИд = "";
    
    ДокументHTML = Элементы.ТекстДиалогаHTML.Документ;
    Если ДокументHTML <> Неопределено Тогда
        ДокументHTML.defaultView.clearQuote();
    КонецЕсли;
	
    ТекстовоеСообщение = "";
	
	ПолеОтправкиСообщения.defaultView.setText("");
	
	Элементы.СписокЧатов.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоследнююВременнуюМетку(ЧатСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	iga_ИсторияСообщений.IDСообщения КАК IDСообщения,
	               |	iga_ИсторияСообщений.ВременнаяМетка КАК ВременнаяМетка
	               |ИЗ
	               |	РегистрСведений.iga_ИсторияСообщений КАК iga_ИсторияСообщений
	               |ГДЕ
	               |	iga_ИсторияСообщений.Чат = &Чат
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВременнаяМетка УБЫВ,
	               |	iga_ИсторияСообщений.ВременнаяМетка УБЫВ";
	Запрос.УстановитьПараметр("Чат", ЧатСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВременнаяМетка;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Асинх Процедура ПродлитьБронь(Команда)
	
	Если Не Ждать ПодтверждениеОперации("Продлить бронь") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.СписокЧатов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда Возврат; КонецЕсли;
	
	Результат = ПродлитьБроньНаСервере(ТекущиеДанные.Чат, ТекущийОператор);
	Если Результат Тогда
		Элементы.СписокЧатов.Обновить();
	Иначе
		ПоказатьПредупреждение(, "Продление невозможно (уже продлевалось или чат не в статусе подключения).");
	КонецЕсли;
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПродлитьБроньНаСервере(ЧатСсылка, ТекущийОператор)
	Возврат iga_РаспределениеСервер.ПродлитьВремяОжидания(ЧатСсылка, ТекущийОператор);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекстШаблона(Идентификатор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ШаблоныСообщений.ТекстСообщения КАК ТекстСообщения
	               |ИЗ
	               |	Справочник.iga_ШаблоныСообщений КАК iga_ШаблоныСообщений
	               |ГДЕ
	               |	iga_ШаблоныСообщений.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ТекстСообщения;
	
КонецФункции

&НаСервереБезКонтекста
Функция НачатьДиалогНаСервере(ЧатСсылка, ТекущийСтатус, ТекущийОператор, ИДЧата, ПрошлоБолее24Часа, ИдентификаторШаблона, УточняющийЧат)
	
	НачатьТранзакцию();
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.iga_ОчередьРаспределения");
	ЭлементБлокировки.УстановитьЗначение("Чат", ЧатСсылка);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	БлокировкаДанных.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	iga_ОчередьРаспределения.Чат КАК Чат,
	               |	iga_ОчередьРаспределения.Оператор КАК Оператор,
	               |	iga_ОчередьРаспределения.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |ГДЕ
	               |	(iga_ОчередьРаспределения.Статус = ЗНАЧЕНИЕ(Перечисление.iga_СтатусыОчереди.ЗапросСоединения)
	               |			ИЛИ iga_ОчередьРаспределения.Статус = ЗНАЧЕНИЕ(Перечисление.iga_СтатусыОчереди.ВРаботе)
	               |			ИЛИ iga_ОчередьРаспределения.Статус = ЗНАЧЕНИЕ(Перечисление.iga_СтатусыОчереди.ВнеОчереди))
	               |	И НЕ iga_ОчередьРаспределения.Оператор = &ТекущийОператор
	               |	И iga_ОчередьРаспределения.Чат = &ЧатСсылка";
	Запрос.УстановитьПараметр("ТекущийОператор", ТекущийОператор);
	Запрос.УстановитьПараметр("ЧатСсылка", ЧатСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	ЕстьСуществующиеЗапросы = Не РезультатЗапроса.Пустой();
	
	Если ЕстьСуществующиеЗапросы И Не УточняющийЧат Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Новый Структура("СтатусДругихОператоров", Выборка.Статус);
	КонецЕсли;
	
	РезультатИнфо = Новый Структура("IDСообщения, Текст, Дата, ТекущаяВременнаяМетка", "", "", ТекущаяДата(), 0);
	
	ДатаПоступления = ТекущаяДата();
	Если ТекущийСтатус = Перечисления.iga_СтатусыОчереди.Ожидание Тогда
		Менеджер = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
		Менеджер.Чат = ЧатСсылка;
		Менеджер.Прочитать();
		Если Менеджер.Выбран() Тогда
			ДатаПоступления = Менеджер.ДатаПоступления;
			Менеджер.Удалить();
		КонецЕсли;

	Иначе
		Менеджер = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
		Менеджер.Чат = ЧатСсылка;
		Менеджер.Оператор = ТекущийОператор;
		Менеджер.Прочитать();
		ДатаПоступления = Менеджер.ДатаПоступления;
	КонецЕсли;
	
	БезОповещения = iga_МетодыРаботыСБотом.ПолучитьЗначениеПараметраОбщения(ЧатСсылка, "БезОповещения");
	
	Если ТекущийСтатус = Перечисления.iga_СтатусыОчереди.Подключение
		Или ТекущийСтатус = Перечисления.iga_СтатусыОчереди.Ожидание Тогда
		Если Не Менеджер.Выбран() Тогда
			Менеджер = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
			Менеджер.Чат = ЧатСсылка;
			Менеджер.Оператор = ТекущийОператор;
		КонецЕсли;
		Менеджер.Статус = Перечисления.iga_СтатусыОчереди.ВРаботе;
		Менеджер.ДатаПоступления = ДатаПоступления;
		Менеджер.ДатаПоследнейАктивности = ТекущаяДата();
		Менеджер.Записать();
		
		Если Не Менеджер.ОсобыйЧат И Не БезОповещения = Истина Тогда
			
			ПредставлениеОператора = ПолучитьПредставлениеОператора(ТекущийОператор);
			
			КодЯзыка = iga_МетодыРаботыСБотом.ПолучитьЗначениеПараметраОбщения(ЧатСсылка, "Язык");
			
			ТекстПриветствия = iga_ШаблоныСообщений.ПолучитьТекстСообщения(Перечисления.iga_ТипыТекстовСообщений.ТекстПриветствияОператора, КодЯзыка);
			
			Данные = Новый Структура("ИмяОператора", ПредставлениеОператора);
			ТекстПриветствия = iga_ОбщегоНазначенияКлиентСервер.СтрШаблонПоСтруктуре(ТекстПриветствия, Данные);
			
			РезультатИнфо = ОтправитьПростоеСообщение(ТекущийОператор, ЧатСсылка, ИДЧата, ТекстПриветствия);
		КонецЕсли;
		
		МенеджерПоследнийСтатус = РегистрыСведений.iga_ПоследниеСтатусыЧатов.СоздатьМенеджерЗаписи();
		МенеджерПоследнийСтатус.Чат = ЧатСсылка;
		МенеджерПоследнийСтатус.СтатусОчереди = Перечисления.iga_СтатусыОчереди.ВРаботе;
		МенеджерПоследнийСтатус.Записать();

	Иначе
		
		Если ПрошлоБолее24Часа Тогда
			
			Если Менеджер.Выбран() И Не УточняющийЧат Тогда
				
				Менеджер.Статус = Перечисления.iga_СтатусыОчереди.ВРаботе;
				Менеджер.Чат = ЧатСсылка;
				Менеджер.Оператор = ТекущийОператор;
				Менеджер.ДатаПоступления = ТекущаяДата();
				Менеджер.ДатаПоследнейАктивности = ТекущаяДата();
				Менеджер.Записать();
				
				МенеджерПоследнийСтатус = РегистрыСведений.iga_ПоследниеСтатусыЧатов.СоздатьМенеджерЗаписи();
				МенеджерПоследнийСтатус.Чат = ЧатСсылка;
				МенеджерПоследнийСтатус.СтатусОчереди = Перечисления.iga_СтатусыОчереди.ВРаботе;
				МенеджерПоследнийСтатус.Записать();
				
			ИначеЕсли Не УточняющийЧат Тогда
				
				Менеджер = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
				Менеджер.Чат = ЧатСсылка;
				Менеджер.Оператор = ТекущийОператор; 
				Менеджер.Статус = Перечисления.iga_СтатусыОчереди.ВРаботе;
				Менеджер.ДатаПоступления = ТекущаяДата();
				Менеджер.ДатаПоследнейАктивности = ТекущаяДата();
				Менеджер.Записать();
				
				МенеджерПоследнийСтатус = РегистрыСведений.iga_ПоследниеСтатусыЧатов.СоздатьМенеджерЗаписи();
				МенеджерПоследнийСтатус.Чат = ЧатСсылка;
				МенеджерПоследнийСтатус.СтатусОчереди = Перечисления.iga_СтатусыОчереди.ВРаботе;
				МенеджерПоследнийСтатус.Записать();
				
			КонецЕсли;
			
			РезультатИнфо = Справочники.iga_ШаблоныСообщений.ОтправитьСообщение(ЧатСсылка, ИДЧата, ИдентификаторШаблона);
			
		Иначе
			Менеджер.Статус = Перечисления.iga_СтатусыОчереди.ВРаботе;
			Менеджер.Чат = ЧатСсылка;
			Менеджер.Оператор = ТекущийОператор;
			Менеджер.ДатаПоступления = ТекущаяДата();
			Менеджер.ДатаПоследнейАктивности = ТекущаяДата();
			Менеджер.Записать();
			
			ЗаписьОжидания = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
			ЗаписьОжидания.Чат = ЧатСсылка;
			ЗаписьОжидания.Прочитать();
			Если ЗаписьОжидания.Выбран() Тогда
				ЗаписьОжидания.Удалить();
			КонецЕсли;
			
			МенеджерПоследнийСтатус = РегистрыСведений.iga_ПоследниеСтатусыЧатов.СоздатьМенеджерЗаписи();
			МенеджерПоследнийСтатус.Чат = ЧатСсылка;
			МенеджерПоследнийСтатус.СтатусОчереди = Перечисления.iga_СтатусыОчереди.ЗапросСоединения;
			МенеджерПоследнийСтатус.Записать();

		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ОчередьРаспределения.Чат КАК Чат,
	               |	iga_ОчередьРаспределения.Оператор КАК Оператор
	               |ИЗ
	               |	РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |ГДЕ
	               |	iga_ОчередьРаспределения.Чат = &Чат
	               |	И iga_ОчередьРаспределения.Оператор <> &Оператор
	               |	И iga_ОчередьРаспределения.Статус = ЗНАЧЕНИЕ(Перечисление.iga_СтатусыОчереди.Подключение)";
	Запрос.УстановитьПараметр("Чат", ЧатСсылка);
	Запрос.УстановитьПараметр("Оператор", ТекущийОператор);
	ВыборкаПодключений = Запрос.Выполнить().Выбрать();
	Пока ВыборкаПодключений.Следующий() Цикл
		ЗаписьПодключения = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
		ЗаписьПодключения.Чат = ЧатСсылка;
		ЗаписьПодключения.Оператор = ВыборкаПодключений.Оператор;
		ЗаписьПодключения.Прочитать();
		Если ЗаписьПодключения.Выбран() Тогда
			ЗаписьПодключения.Удалить();
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(РезультатИнфо) И Не РезультатИнфо.IDСообщения = "" Тогда
		iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ЧатСсылка, "БезОповещения", Истина);
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
    Возврат РезультатИнфо;
КонецФункции

&НаКлиенте
Процедура ИнициализироватьДобавлениеСообщения(ДанныеСообщения)
	
	Если ДанныеСообщения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяВременнаяМетка = Макс(ДанныеСообщения.ТекущаяВременнаяМетка, ТекущаяВременнаяМетка);
	
	ИмяОператора = Строка(ТекущийОператор);
	
	Если Не ДанныеСообщения.IDСообщения = "" Тогда
		Сообщение = Новый Структура;
		Сообщение.Вставить("IDСообщения",   ДанныеСообщения.IDСообщения);
		Сообщение.Вставить("Текст",         ДанныеСообщения.Текст);
		Сообщение.Вставить("ЭтоВходящее",   Ложь);
		Сообщение.Вставить("Дата",         	ДанныеСообщения.Дата);
		Сообщение.Вставить("IDЦитируемогоСообщения",    "");
		Сообщение.Вставить("ОператорИмя",  	ИмяОператора);
		
		ДобавитьСообщениеВИнтерфейс(Сообщение);
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьНачалоДиалога(ЧатСсылка, Статус, ИДЧата, ПрошлоБолее24Часа, ИдентификаторШаблона)
	
	УточняющийЧат = Элементы.СтраницыСпискиЧатов.ТекущаяСтраница = Элементы.СтраницаУточняющиеЧаты;
	
	ДанныеСообщения = НачатьДиалогНаСервере(ЧатСсылка, Статус, ТекущийОператор, ИДЧата, ПрошлоБолее24Часа, ИдентификаторШаблона, УточняющийЧат);
	
	Элементы.СписокЧатов.Обновить();
	
	Если ДанныеСообщения = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось отправить шаблонное сообщение!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если ДанныеСообщения.Свойство("СтатусДругихОператоров") Тогда
		
		ТекстПредупреждения = "";
		
		Если ДанныеСообщения.СтатусДругихОператоров = ПредопределенноеЗначение("Перечисление.iga_СтатусыОчереди.ЗапросСоединения") Тогда
			ТекстПредупреждения = "В данный момент уже подан запрос соединения другим оператором.";
		ИначеЕсли ДанныеСообщения.СтатусДругихОператоров = ПредопределенноеЗначение("Перечисление.iga_СтатусыОчереди.ВнеОчереди") Тогда
			ТекстПредупреждения = "Чат находится в статусе уточнения!";
		ИначеЕсли ДанныеСообщения.СтатусДругихОператоров = ПредопределенноеЗначение("Перечисление.iga_СтатусыОчереди.ВРаботе") Тогда
			ТекстПредупреждения = "Данный пользователь уже в работе с другим оператором.";
		ИначеЕсли ДанныеСообщения.СтатусДругихОператоров = ПредопределенноеЗначение("Перечисление.iga_СтатусыОчереди.Подключение") Тогда
			ТекстПредупреждения = "Для данного пользователя уже подобран оператор, ожидание принятия заявки оператором.";
		КонецЕсли;
		ПоказатьПредупреждение(, "Не удалось начать диалог. " + ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
    ИнициализироватьДобавлениеСообщения(ДанныеСообщения);
	
	Если Не ТекущаяСтраницаЧатов = СтраницаУточнение() Тогда
		Элементы.СтраницыСпискиЧатов.ТекущаяСтраница = Элементы.СтраницаАктивныеОбщая;
		Элементы.СтраницыАктивные.ТекущаяСтраница = Элементы.СтраницаАктивныеЧаты;
		Элементы.СписокЧатов.ТекущаяСтрока = ЧатСсылка;
		ТекущаяСтраницаЧатов = СтраницаАктивные();
	КонецЕсли;

	УстановитьДоступностьЭлементов(); 
	
	ЗаполнитьКоличествоЧатов();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтправкаШаблонногоСообщения(ДанныеОтправки, ИдентификаторШаблона)
	
	Возврат Справочники.iga_ШаблоныСообщений.ОтправитьСообщение(ДанныеОтправки.ЧатСсылка, ДанныеОтправки.ИДЧата, ИдентификаторШаблона);
	
КонецФункции

&НаКлиенте
Процедура Обработчик_ПослеВыбораШаблона(ИдентификаторШаблона, ДопПараметры) Экспорт
	
	Если ИдентификаторШаблона = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры.ПростаяОтправкаШаблона Тогда
		
		ДанныеСообщения = ОтправкаШаблонногоСообщения(ДопПараметры, ИдентификаторШаблона);
		
		ИнициализироватьДобавлениеСообщения(ДанныеСообщения);

	Иначе
		ПродолжитьНачалоДиалога(ДопПараметры.ЧатСсылка, ДопПараметры.Статус, ДопПараметры.ИДЧата, ДопПараметры.ПрошлоБолее24Часа, ИдентификаторШаблона);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокШаблоновСообщений(Оператор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ШаблоныСообщенийПодразделения.Ссылка.Наименование КАК Наименование,
	               |	iga_ШаблоныСообщенийПодразделения.Ссылка.Идентификатор КАК Идентификатор
	               |ИЗ
	               |	Справочник.iga_ШаблоныСообщений.Подразделения КАК iga_ШаблоныСообщенийПодразделения
	               |ГДЕ
	               |	iga_ШаблоныСообщенийПодразделения.Ссылка.ДоступенДляВыбора
	               |	И НЕ iga_ШаблоныСообщенийПодразделения.Ссылка.ПометкаУдаления
	               |	И (iga_ШаблоныСообщенийПодразделения.Подразделение В
	               |				(ВЫБРАТЬ
	               |					iga_НастройкиОператоров.Подразделение КАК Подразделение
	               |				ИЗ
	               |					РегистрСведений.iga_НастройкиОператоров КАК iga_НастройкиОператоров
	               |				ГДЕ
	               |					iga_НастройкиОператоров.Оператор = &Оператор)
	               |			ИЛИ iga_ШаблоныСообщенийПодразделения.Подразделение = ЗНАЧЕНИЕ(Справочник.iga_ПодразделенияОператоров.КоллЦентр)
				   |			ИЛИ iga_ШаблоныСообщенийПодразделения.Подразделение = ЗНАЧЕНИЕ(Справочник.iga_ПодразделенияОператоров.ПустаяСсылка))";
	Запрос.УстановитьПараметр("Оператор", Оператор);
	Выборка = Запрос.Выполнить().Выбрать();
	СписокВыбора = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокВыбора.Добавить(Выборка.Идентификатор, Выборка.Наименование);
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеДляОбработкиЧатовЧерез24Часа(ТекущийОператор, ТребуетсяВыборПодразделения)
	
	СписокШаблонов = ПолучитьСписокШаблоновСообщений(ТекущийОператор);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПодразделенияОператоров.Ссылка КАК Ссылка,
	               |	iga_ПодразделенияОператоров.Наименование КАК Наименование
	               |ИЗ
	               |	РегистрСведений.iga_НастройкиОператоров КАК iga_НастройкиОператоров,
	               |	Справочник.iga_ПодразделенияОператоров КАК iga_ПодразделенияОператоров
	               |ГДЕ
	               |	iga_НастройкиОператоров.Оператор = &Оператор
	               |	И (НЕ iga_НастройкиОператоров.ПростойОператор
	               |			ИЛИ iga_НастройкиОператоров.Подразделение = ЗНАЧЕНИЕ(Справочник.iga_ПОдразделенияОператоров.КоллЦентр) 
				   |			ИЛИ &ТребуетсяВыборПодразделения)
	               |	И НЕ iga_ПодразделенияОператоров.ПометкаУдаления
	               |	И iga_ПодразделенияОператоров.Активное";
	Запрос.УстановитьПараметр("Оператор", ТекущийОператор);
	Запрос.УстановитьПараметр("ТребуетсяВыборПодразделения", ТребуетсяВыборПодразделения);
	Выборка = Запрос.Выполнить().Выбрать();
	СписокПодразделений = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокПодразделений.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("СписокШаблонов", СписокШаблонов);
	СтруктураДанных.Вставить("СписокПодразделений", СписокПодразделений);
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьВыборШаблонногоСообщения(СтруктураДанных, ЧатСсылка, ТекущиеДанные, ПрошлоБолее24Часа, ВыбПодразделение, ПростаяОтправкаШаблона = Ложь)
	
	СписокШаблонов = СтруктураДанных.СписокШаблонов;
	
	Если СписокШаблонов.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Нет доступных шаблонов инициации диалога!");
		Возврат;
	КонецЕсли;
	
	ПараметрыЗакрытия = Новый Структура("ЧатСсылка, Статус, ИДЧата, ПрошлоБолее24Часа, ПростаяОтправкаШаблона", 
		ЧатСсылка, ТекущиеДанные.Статус, ТекущиеДанные.ИДЧата, ПрошлоБолее24Часа, ПростаяОтправкаШаблона);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВыбораШаблона", ЭтаФорма, ПараметрыЗакрытия);
	
	ПараметрыОткрытия = Новый Структура("Оператор, ВыбПодразделение", ТекущийОператор, ВыбПодразделение);
	
	ОткрытьФорму("ОбщаяФорма.iga_ФормаВыбораШаблонногоСообщения", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор,,,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПодразделениеЧата(ЧатСсылка, Подразделение)
	
	iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ЧатСсылка, "ВыбранноеПодразделение", Подразделение);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеВыбораПодразделения(ВыбПодразделение, ДопПараметры) Экспорт
	
	Если ВыбПодразделение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПодразделениеЧата(ДопПараметры.ЧатСсылка, ВыбПодразделение);
	
	ОткрытьВыборШаблонногоСообщения(ДопПараметры.СтруктураДанных, ДопПараметры.ЧатСсылка, 
		ДопПараметры.ТекущиеДанные, ДопПараметры.ПрошлоБолее24Часа, ВыбПодразделение)
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТребуетсяВыборПодразделения(ЧатСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_Чаты.Ссылка КАК Ссылка,
	               |	iga_ПараметрыОбщенияСБотом.Значение КАК Значение
	               |ИЗ
	               |	Справочник.iga_Чаты КАК iga_Чаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.iga_ПараметрыОбщения КАК iga_ПараметрыОбщения
	               |		ПО (iga_ПараметрыОбщения.ИмяПараметра = ""ВыбранноеПодразделение"")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПараметрыОбщенияСБотом КАК iga_ПараметрыОбщенияСБотом
	               |		ПО (iga_ПараметрыОбщенияСБотом.Чат = iga_Чаты.Ссылка
	               |				И iga_ПараметрыОбщения.Ссылка = iga_ПараметрыОбщенияСБотом.Параметр)
	               |ГДЕ
	               |	iga_Чаты.Ссылка = &ЧатСсылка
	               |	И НЕ iga_ПараметрыОбщенияСБотом.Значение ЕСТЬ NULL";
	Запрос.УстановитьПараметр("ЧатСсылка", ЧатСсылка);
	
	Возврат Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиенте
Процедура ИнициализацияВыбораПосле24Часа(ТекущиеДанные, ЧатСсылка, ПростаяОтправкаШаблона = Ложь)
	
	ТребуетсяВыборПодразделения = ТребуетсяВыборПодразделения(ЧатСсылка);
	
	СтруктураДанных = ПолучитьДанныеДляОбработкиЧатовЧерез24Часа(ТекущийОператор, ТребуетсяВыборПодразделения);
	
	СписокПодразделений = СтруктураДанных.СписокПодразделений;

	Если Не СписокПодразделений.Количество() = 0 Тогда
		
		
		ПараметрыЗакрытия = Новый Структура("СтруктураДанных, ЧатСсылка, ТекущиеДанные, ПрошлоБолее24Часа", 
			СтруктураДанных, ЧатСсылка, ТекущиеДанные, Истина);
			
		ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВыбораПодразделения", ЭтаФорма, ПараметрыЗакрытия);
		ПараметрыОткрытия = Новый Структура("Отбор", Новый Структура("ПометкаУдаления, Активное", Ложь, Истина));
		ОткрытьФорму("Справочник.iga_ПодразделенияОператоров.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор,,, 
			ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
		Возврат;
	КонецЕсли;
	
	
	
	ОткрытьВыборШаблонногоСообщения(СтруктураДанных, ЧатСсылка, ТекущиеДанные, Истина, Неопределено, ПростаяОтправкаШаблона);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущийСтатусЧата(ЧатСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ОчередьРаспределения.Чат КАК Чат,
	               |	iga_ОчередьРаспределения.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |ГДЕ
	               |	iga_ОчередьРаспределения.Статус <> &СтатусЗавершен
	               |	И iga_ОчередьРаспределения.Чат = &ЧатСсылка";
	Запрос.УстановитьПараметр("ЧатСсылка", ЧатСсылка);
	Запрос.УстановитьПараметр("СтатусЗавершен", Перечисления.iga_СтатусыОчереди.Завершен);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Статус;
	Иначе
		Возврат Перечисления.iga_СтатусыОчереди.Завершен;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Асинх Процедура НачатьДиалог(Команда)

	Если Не Ждать ПодтверждениеОперации("Начать диалог") Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ПолучитьТекущиеДанные();
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат; 
	КонецЕсли; 
	
	ЧатСсылка = ТекущиеДанные.Чат;
	
	
	ДатаПоследнегоСообщения = ПолучитьДатуПоследнегоСообщения(ЧатСсылка);
	
	ПрошлоБолее24Часа = iga_ОбщегоНазначенияКлиентСервер.РазностьДат(ДатаПоследнегоСообщения, ТекущаяДата(), "ЧАС") > 24;
	
	
	Если ТекущаяСтраницаЧатов = СтраницаАктивные() Тогда
		ПрошлоБолее24Часа = ПрошлоБолее24Часа И Не ТекущиеДанные.ОсобыйЧат;
	КонецЕсли;
	
	Если ПрошлоБолее24Часа Тогда
		
		ИнициализацияВыбораПосле24Часа(ТекущиеДанные, ЧатСсылка);
		
		Возврат;
	Иначе
		ИдентификаторШаблона = Неопределено;
	КонецЕсли;
	
	ТекущийСтатус = ПолучитьТекущийСтатусЧата(ЧатСсылка);
	
	ПродолжитьНачалоДиалога(ЧатСсылка, ТекущийСтатус, ТекущиеДанные.ИДЧата, ПрошлоБолее24Часа, ИдентификаторШаблона);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗавершитьДиалогНаСервере(ЧатСсылка, ТекущийОператор, ИДЧата, ВыбраныйРежимЗавершение)

    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ОчередьРаспределения.Чат КАК Чат,
	               |	iga_ОчередьРаспределения.Оператор КАК Оператор,
	               |	iga_ОчередьРаспределения.Статус КАК Статус,
	               |	iga_ОчередьРаспределения.ДатаПоступления КАК ДатаПоступления,
	               |	iga_ОчередьРаспределения.ДатаКонцаБронирования КАК ДатаКонцаБронирования,
	               |	iga_ОчередьРаспределения.ВремяПродлено КАК ВремяПродлено,
	               |	iga_ОчередьРаспределения.ДатаПоследнейАктивности КАК ДатаПоследнейАктивности,
	               |	iga_ОчередьРаспределения.БезОповещения КАК БезОповещения,
	               |	iga_ОчередьРаспределения.ПоследнимПисалОператор КАК ПоследнимПисалОператор,
	               |	iga_ОчередьРаспределения.ОсобыйЧат КАК ОсобыйЧат
	               |ИЗ
	               |	РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |ГДЕ
	               |	(iga_ОчередьРаспределения.Оператор = &Оператор
	               |			ИЛИ iga_ОчередьРаспределения.Оператор = &ПустойОператор
	               |				И iga_ОчередьРаспределения.Статус = &СтатусВнеОчереди)
	               |	И iga_ОчередьРаспределения.Чат = &ЧатСсылка";
	Запрос.УстановитьПараметр("ЧатСсылка", ЧатСсылка);
	Запрос.УстановитьПараметр("Оператор", ТекущийОператор);
	Запрос.УстановитьПараметр("ПустойОператор", Справочники.Пользователи.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтатусВнеОчереди", Перечисления.iga_СтатусыОчереди.ВнеОчереди);
	Выборка = Запрос.Выполнить().Выбрать();
    
	Пока Выборка.Следующий() Цикл
		Если Не Выборка.Оператор.Пустая() Тогда
			МенеджерОчереди = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерОчереди, Выборка);
			МенеджерОчереди.Статус = Перечисления.iga_СтатусыОчереди.Завершен;
			МенеджерОчереди.БезОповещения = Ложь;
			МенеджерОчереди.Записать();   
		Иначе
			МенеджерОчереди = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
			МенеджерОчереди.Чат = ЧатСсылка;
			МенеджерОчереди.Удалить();   
		КонецЕсли;
	КонецЦикла;
	
	Менеджер = РегистрыСведений.iga_ПоследниеСтатусыЧатов.СоздатьМенеджерЗаписи();
	Менеджер.Чат = ЧатСсылка;                                         
	
	Если ВыбраныйРежимЗавершение = "Завершить" Или ВыбраныйРежимЗавершение = "БезОтвета" Тогда
		Менеджер.СтатусОчереди = Перечисления.iga_СтатусыОчереди.Завершен;
	Иначе
		Менеджер.СтатусОчереди = Перечисления.iga_СтатусыОчереди.ВнеОчереди;
	КонецЕсли;
	Менеджер.Записать();
	
	Если ВыбраныйРежимЗавершение = "Завершить" Тогда 
		iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ЧатСсылка, "БезОповещения", Ложь);
	Иначе
		iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ЧатСсылка, "БезОповещения", Истина);
	КонецЕсли;
	
	Если ВыбраныйРежимЗавершение = "БезОтвета" Тогда
		iga_РаспределениеСервер.ЗафиксироватьОтказОператора(ЧатСсылка, ТекущийОператор, Справочники.iga_ПричиныОтклоненияОжидающихЧатов.НетОтвета, 
			"Нет ответа от пользователя");
	КонецЕсли;
	
	СтруктураВозврата = Неопределено;

	Если ВыбраныйРежимЗавершение = "ТребуетсяУточнение" Тогда
		
		МенеджерОчереди = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
		МенеджерОчереди.Чат = ЧатСсылка;
		МенеджерОчереди.Оператор = Неопределено;
		МенеджерОчереди.Статус = Перечисления.iga_СтатусыОчереди.ВнеОчереди;
		МенеджерОчереди.БезОповещения = Ложь;
		МенеджерОчереди.ДатаПоступления = ТекущаяДата();
		МенеджерОчереди.ДатаПоследнейАктивности = ТекущаяДата();
		МенеджерОчереди.Записать(); 
		
	ИначеЕсли Не ВыбраныйРежимЗавершение = "БезОтвета" Тогда 
		
		КодЯзыка = iga_МетодыРаботыСБотом.ПолучитьЗначениеПараметраОбщения(ЧатСсылка, "Язык");
		
		ТекстПрощания = iga_ШаблоныСообщений.ПолучитьТекстСообщения(Перечисления.iga_ТипыТекстовСообщений.ТекстПослеЗавершенияДиалогаОператором, КодЯзыка);
		
		СтруктураВозврата = ОтправитьПростоеСообщение(ТекущийОператор, ЧатСсылка, ИДЧата, ТекстПрощания);
		
	КонецЕсли;
	
    Возврат СтруктураВозврата;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверкаНаОтработкуНеподтвержденныхЗаявок(Чат)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_Чаты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.iga_Чаты КАК iga_Чаты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.iga_СтатусыПодтвержденияСтрокЗаявок КАК iga_СтатусыПодтвержденияСтрокЗаявок
	               |		ПО iga_Чаты.Клиент = iga_СтатусыПодтвержденияСтрокЗаявок.Заявка.Клиент
	               |ГДЕ
	               |	iga_Чаты.Ссылка = &Ссылка
	               |	И НЕ iga_СтатусыПодтвержденияСтрокЗаявок.Обработано
	               |	И НЕ iga_СтатусыПодтвержденияСтрокЗаявок.Статус = &СтатусПодтверждено
	               |			И НЕ iga_СтатусыПодтвержденияСтрокЗаявок.Статус = &СтатусПусто";
	Запрос.УстановитьПараметр("Ссылка", Чат);
	Запрос.УстановитьПараметр("СтатусПодтверждено", Перечисления.iga_СтатусыПодтвержденияЗаявок.Подтверждено);
	Запрос.УстановитьПараметр("СтатусПусто", Перечисления.iga_СтатусыПодтвержденияЗаявок.ПустаяСсылка());
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиенте
Асинх Процедура ПродолжитьЗавершитьДиалог(ВыбЗначение)
	
	ТекущиеДанные = ПолучитьТекущиеДанные();
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	ДанныеСообщения = ЗавершитьДиалогНаСервере(ТекущиеДанные.Чат, ТекущийОператор, ТекущиеДанные.ИДЧата, ВыбЗначение.Значение);
	
	Если Не ДанныеСообщения = Неопределено Тогда
		
		ТекущаяВременнаяМетка = Макс(ДанныеСообщения.ТекущаяВременнаяМетка, ТекущаяВременнаяМетка);
		
		ИмяОператора = Строка(ТекущийОператор);
		
		Сообщение = Новый Структура;
		Сообщение.Вставить("IDСообщения",   ДанныеСообщения.IDСообщения);
		Сообщение.Вставить("Текст",         ДанныеСообщения.Текст);
		Сообщение.Вставить("ЭтоВходящее",   Ложь);
		Сообщение.Вставить("Дата",         	ДанныеСообщения.Дата);
		Сообщение.Вставить("IDЦитируемогоСообщения",    "");
		Сообщение.Вставить("ОператорИмя",  	ИмяОператора);
		
		ДобавитьСообщениеВИнтерфейс(Сообщение); 
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементов();

	Если ТекущаяСтраницаЧатов = СтраницаАктивные() Тогда
		Элементы.СписокЧатов.Обновить();
	Иначе
		Элементы.СписокЧатовТребуютУточнения.Обновить();
	КонецЕсли;
	
	ЗаполнитьКоличествоЧатов();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗавершитьДиалог(Команда)
	
	Если ТекущаяСтраницаЧатов = СтраницаАктивные() Тогда
		СписокВыбораЗавершения = Новый СписокЗначений;
		СписокВыбораЗавершения.Добавить("Завершить", "Вопрос решен");
		СписокВыбораЗавершения.Добавить("БезОтвета", "Пациент не отвечает");
		СписокВыбораЗавершения.Добавить("ТребуетсяУточнение", "Требуется уточнение информации");
		
		ВыбЗначение = Ждать ВыбратьИзМеню(СписокВыбораЗавершения, Элементы.ЗавершитьДиалог);
		
		Если ВыбЗначение = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		ВыбЗначение = Новый Структура("Значение", "Завершить");
	КонецЕсли;
	
	Если ВыбЗначение.Значение = "ТребуетсяУточнение" Тогда
		ТекстПодсказки = "Перевести в уточняющие";
	ИНачеЕсли ВыбЗначение.Значение = "Завершить" Тогда
		ТекстПодсказки = "Завершить диалог";
	КонецЕсли;
	
	ЕстьНеотработанные = ПроверкаНаОтработкуНеподтвержденныхЗаявок(Элементы.СписокЧатов.ТекущиеДанные.Чат);
	
	Если ЕстьНеотработанные Тогда
		Ответ = Ждать ВопросАсинх("Есть неотработанные просроченные/отмененные/требующие перенос заявки. 
		|Продолжить завершение диалога?",
			РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет, ВыбЗначение.Значение, КодВозвратаДиалога.Нет);
			
		Если Не Ответ = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Ждать ПодтверждениеОперации(ТекстПодсказки) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВключеныСобытия() Тогда
		СоздатьНовоеСобытие(ВыбЗначение);
	ИНаче
		ПродолжитьЗавершитьДиалог(ВыбЗначение);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура Обработчик_ПослеЗакрытияСобытия(Результат, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ПолучитьИзВременногоХранилища(ДопПараметры.ХранилищеСсылки)) Тогда
		ПродолжитьЗавершитьДиалог(ДопПараметры.ВыбЗначение);
	Иначе
		ПоказатьПредупреждение(, "Событие не создано. Операция отменена.");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовоеСобытие(ВыбЗначение)
	
	ТекущиеДанные = ПолучитьТекущиеДанные();
	
	ХранилищеСсылки = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ПараметрыОткрытия = Новый Структура("Основание", 
		Новый Структура("Клиент, СобытиеЧата, ХранилищеСсылки", 
		iga_ОбработкаДанныхПоЧатамСервер.ПолучитьКлиентаПоЧату(ТекущиеДанные.Чат), ,ХранилищеСсылки));
		
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеЗакрытияСобытия", ЭтаФорма, 
		Новый Структура("ХранилищеСсылки, ВыбЗначение", ХранилищеСсылки, ВыбЗначение));
		
	ОткрытьФорму("Документ.Событие.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор,,,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПредставлениеОператора(Оператор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА iga_НастройкиОператоров.ПредставлениеОператора = """"
	|			ТОГДА iga_НастройкиОператоров.Оператор.Наименование
	|		ИНАЧЕ iga_НастройкиОператоров.ПредставлениеОператора
	|	КОНЕЦ КАК ПредставлениеОператора
	|ИЗ
	|	РегистрСведений.iga_НастройкиОператоров КАК iga_НастройкиОператоров
	|ГДЕ
	|	iga_НастройкиОператоров.Оператор = &Оператор";
	Запрос.УстановитьПараметр("Оператор", Оператор);
	ВыборкаПредставлениеОператора = Запрос.Выполнить().Выбрать();
	ВыборкаПредставлениеОператора.Следующий();

	Возврат ВыборкаПредставлениеОператора.ПредставлениеОператора;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуПоследнегоСообщения(ЧатСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПоследниеСообщенияЧатов.Чат КАК Чат,
	               |	МАКСИМУМ(iga_ПоследниеСообщенияЧатов.ДатаСообщения) КАК ДатаСообщения
	               |ИЗ
	               |	РегистрСведений.iga_ПоследниеСообщенияЧатов КАК iga_ПоследниеСообщенияЧатов
	               |ГДЕ
	               |	iga_ПоследниеСообщенияЧатов.Чат = &Чат
	               |	И iga_ПоследниеСообщенияЧатов.ЭтоВходящее
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	iga_ПоследниеСообщенияЧатов.Чат";
	Запрос.УстановитьПараметр("Чат", ЧатСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаСообщения;
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОтправитьПростоеСообщение(ТекущийОператор, ЧатСсылка, ИдЧата, ТекстСообщения, Результат = Неопределено)
	
	Бот = Обработки.iga_ChatBot.Создать();
	
	Если Результат = Неопределено Тогда
		Бот.ИнициализацияОсновныхПараметров();
		
		Результат = Бот.ОтправитьТекст(ИдЧата, ТекстСообщения);
		
		Бот.ОтметитьЧатПрочитанным(ИДЧата);
	КонецЕсли;
	
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("ЧатСсылка", ЧатСсылка);
	СтруктураСообщения.Вставить("ИДЧата", ИДЧата);
	СтруктураСообщения.Вставить("IDСообщения", Результат.idMessage);
	СтруктураСообщения.Вставить("Текст", ТекстСообщения);
	СтруктураСообщения.Вставить("Тип", "textMessage");
	СтруктураСообщения.Вставить("ВходящееСообщение", Ложь);
	СтруктураСообщения.Вставить("IDЦитируемогоСобщения", "");
	СтруктураСообщения.Вставить("ТекстЦитирования", "");
	СтруктураСообщения.Вставить("АвторЦитирования", "");
	СтруктураСообщения.Вставить("СсылкаОператор", ТекущийОператор);
	СтруктураСообщения.Вставить("Прочитано", Истина);
	
	ТекущаяВременнаяМетка = Бот.ЗаписатьВИсторию(СтруктураСообщения);
	
	
	СтруктураВозврата = Новый Структура("IDСообщения, Текст, Дата, ТекущаяВременнаяМетка",
		Результат.idMessage, ТекстСообщения, ТекущаяДата(), ТекущаяВременнаяМетка);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ВывестиСообщенияПриОткрытии(МассивСообщений)
	
	ДокументHTML = Элементы.ТекстДиалогаHTML.Документ;
	
	Счетчик = 0;
	Для Каждого Сообщение Из МассивСообщений Цикл
		
        СтрJSON = ЗаписатьЗначениеJSON(Сообщение.ПараметрыJS);

		ДокументHTML.defaultView.appendMessage(СтрJSON);
	КонецЦикла;
	ДокументHTML.defaultView.scrollEnd();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ТекущаяСтраницаЧатов = СтраницаАктивные();
	
	КэшСообщений = Новый Соответствие;
	КэшКонтента = Новый Соответствие;
	
	Результат = СформироватьHTMLДиалогаНаСервере(Неопределено, КэшКонтента, УникальныйИдентификатор);
	ТекстДиалогаHTML = Результат.HTML;
	ТекущаяВременнаяМетка = Результат.ТекущаяВременнаяМетка;
	
	ЗаполнитьКоличествоЧатов();
	
    ПодключитьОбработчикОжидания("ПроверитьНовыеСообщения", 5);
	
	СписокЧатовИстория.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Элементы.Очистить();
	
	ЭлементПорядка = СписокЧатовИстория.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("ДатаСообщения");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	
	ЭлементПорядка = СписокЧатовТребуютУточнения.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[1].Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
	ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("ДатаСообщения");
	ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
	
	ТекстовоеСообщениеHTML = iga_HTMLКлиент.ПолучитьИзначальныйТексСтраницы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПочиститьКэшКонтентаНаСервере(АдресаУдаляемыхДанных)
	
	Для Каждого Адрес Из АдресаУдаляемыхДанных Цикл
		УдалитьИзВременногоХранилища(Адрес);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПочиститьКэшКонтента()
	
	АдресаУдаляемыхДанных = Новый Массив;
	
	ЕстьУдаляемыеДанные = Ложь;
	
	УдаляемыеКлючи = Новый Массив;
	
	ПустыеЧаты = Новый Массив;
	
	Для Каждого КэшЧата Из КэшКонтента Цикл
		
		Если Не ТипЗнч(КэшЧата.Значение) = Тип("Соответствие") Тогда
			Продолжить;
		КонецЕсли;
		
		УдаляемыеКлючи.Очистить();
		
		Для Каждого КэшСообщения Из КэшЧата.Значение Цикл
			КоличествоМинут = iga_ОбщегоНазначенияКлиентСервер.РазностьДат(КэшСообщения.Значение.ДатаКэша, ТекущаяДата(), "МИНУТА");
			Если КоличествоМинут > 30 Тогда
				АдресаУдаляемыхДанных.Добавить(КэшСообщения.Значение.Адрес);
				УдаляемыеКлючи.Добавить(КэшСообщения.Ключ);
				ЕстьУдаляемыеДанные = Истина;
			КонецЕсли;
		КонецЦикла;
		Для Каждого КлючКэша Из УдаляемыеКлючи Цикл
			КэшЧата.Значение.Удалить(КлючКэша)
		КонецЦикла;
		
		Если КэшЧата.Значение.Количество() = 0 Тогда
			ПустыеЧаты.Добавить(КэшЧата.Ключ);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого КлючЧата Из ПустыеЧаты Цикл
		КэшКонтента.Удалить(КлючЧата);
	КонецЦикла;
	
	Если ЕстьУдаляемыеДанные Тогда
		ПочиститьКэшКонтентаНаСервере(АдресаУдаляемыхДанных);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоЧатов(Оператор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_НастройкиОператоров.Оператор КАК Оператор
	               |ПОМЕСТИТЬ ВТ_ПропускОператоров
	               |ИЗ
	               |	РегистрСведений.iga_НастройкиОператоров КАК iga_НастройкиОператоров
	               |ГДЕ
	               |	(НЕ iga_НастройкиОператоров.ПростойОператор
	               |			ИЛИ iga_НастройкиОператоров.Подразделение = &ПодразделениеКоллЦентр)
	               |	И iga_НастройкиОператоров.Оператор = &Оператор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	iga_НастройкиОператоров.Подразделение КАК Подразделение
	               |ПОМЕСТИТЬ ВТ_ПодразделенияОператора
	               |ИЗ
	               |	РегистрСведений.iga_НастройкиОператоров КАК iga_НастройкиОператоров
	               |ГДЕ
	               |	iga_НастройкиОператоров.Оператор = &Оператор
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	iga_СвязиПодразделенийСОператорами.Подразделение
	               |ИЗ
	               |	РегистрСведений.iga_СвязиПодразделенийСОператорами КАК iga_СвязиПодразделенийСОператорами
	               |ГДЕ
	               |	iga_СвязиПодразделенийСОператорами.Оператор = &Оператор
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	&ПодразделениеКоллЦентр
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	iga_ОчередьРаспределения.Чат КАК Чат,
	               |	iga_ОчередьРаспределения.Статус КАК Статус
	               |ПОМЕСТИТЬ ВТ_ВсеЧатыОператора
	               |ИЗ
	               |	РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |ГДЕ
	               |	iga_ОчередьРаспределения.Оператор = &Оператор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВложенныйЗапрос.КоличествоИстория) КАК КоличествоИстория,
	               |	СУММА(ВложенныйЗапрос.КоличествоАктивные) КАК КоличествоАктивные,
	               |	СУММА(ВложенныйЗапрос.КоличествоУточнение) КАК КоличествоУточнение,
	               |	СУММА(ВложенныйЗапрос.КоличествоНеподтвержденных) КАК КоличествоНеподтвержденных,
	               |	СУММА(ВложенныйЗапрос.КоличествоОжидающих) КАК КоличествоОжидающих
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВсеЧатыОператора.Чат) КАК КоличествоИстория,
	               |		0 КАК КоличествоАктивные,
	               |		0 КАК КоличествоУточнение,
	               |		0 КАК КоличествоНеподтвержденных,
	               |		0 КАК КоличествоОжидающих
	               |	ИЗ
	               |		ВТ_ВсеЧатыОператора КАК ВТ_ВсеЧатыОператора
	               |	ГДЕ
	               |		ВТ_ВсеЧатыОператора.Статус = &СтатусЗавершен
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		0,
	               |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВсеЧатыОператора.Чат),
	               |		0,
	               |		0,
	               |		0
	               |	ИЗ
	               |		ВТ_ВсеЧатыОператора КАК ВТ_ВсеЧатыОператора
	               |	ГДЕ
	               |		ВТ_ВсеЧатыОператора.Статус <> &СтатусЗавершен
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		СУММА(0),
	               |		СУММА(0),
	               |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ iga_ОчередьРаспределения.Чат),
	               |		0,
	               |		0
	               |	ИЗ
	               |		РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПараметрыОбщенияСБотом КАК iga_ПараметрыОбщенияСБотом
	               |			ПО iga_ОчередьРаспределения.Чат = iga_ПараметрыОбщенияСБотом.Чат
	               |				И (iga_ПараметрыОбщенияСБотом.Параметр.ИмяПараметра = ""ВыбранноеПодразделение"")
	               |	ГДЕ
	               |		iga_ОчередьРаспределения.Статус = &СтатусВнеОчереди
	               |		И (iga_ПараметрыОбщенияСБотом.Значение В
	               |					(ВЫБРАТЬ
	               |						iga_НастройкиОператоров.Подразделение КАК Подразделение
	               |					ИЗ
	               |						РегистрСведений.iga_НастройкиОператоров КАК iga_НастройкиОператоров
	               |					ГДЕ
	               |						iga_НастройкиОператоров.Оператор = &Оператор)
	               |				ИЛИ 1 В
	               |					(ВЫБРАТЬ
	               |						1
	               |					ИЗ
	               |						РегистрСведений.iga_НастройкиОператоров КАК iga_НастройкиОператоров
	               |					ГДЕ
	               |						iga_НастройкиОператоров.Оператор = &Оператор
	               |						И НЕ iga_НастройкиОператоров.ПростойОператор)
	               |				ИЛИ iga_ПараметрыОбщенияСБотом.Значение В
	               |					(ВЫБРАТЬ
	               |						ВТ_ПодразделенияОператора.Подразделение КАК Подразделение
	               |					ИЗ
	               |						ВТ_ПодразделенияОператора КАК ВТ_ПодразделенияОператора))
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		0,
	               |		0,
	               |		0,
	               |		1,
	               |		0
	               |	ИЗ
	               |		РегистрСведений.iga_СтатусыПодтвержденияСтрокЗаявок КАК iga_СтатусыПодтвержденияСтрокЗаявок
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.iga_ЧатыКлиентов КАК iga_ЧатыКлиентов
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПараметрыОбщенияСБотом КАК iga_ПараметрыОбщенияСБотом
	               |				ПО (iga_ПараметрыОбщенияСБотом.Чат = iga_ЧатыКлиентов.Чат)
	               |					И (iga_ПараметрыОбщенияСБотом.Параметр.ИмяПараметра = ""ВыбранноеПодразделение"")
	               |			ПО iga_СтатусыПодтвержденияСтрокЗаявок.Заявка.Клиент = iga_ЧатыКлиентов.Клиент
	               |	ГДЕ
	               |		iga_СтатусыПодтвержденияСтрокЗаявок.Заявка.Проведен
	               |		И НЕ iga_СтатусыПодтвержденияСтрокЗаявок.Обработано
	               |		И iga_СтатусыПодтвержденияСтрокЗаявок.Статус В(&СтатусыОтмены)
	               |		И (ЕСТЬNULL(iga_ПараметрыОбщенияСБотом.Значение, НЕОПРЕДЕЛЕНО) В
	               |					(ВЫБРАТЬ
	               |						iga_НастройкиОператоров.Подразделение КАК Подразделение
	               |					ИЗ
	               |						РегистрСведений.iga_НастройкиОператоров КАК iga_НастройкиОператоров
	               |					ГДЕ
	               |						iga_НастройкиОператоров.Оператор = &Оператор
	               |			
	               |					ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |					ВЫБРАТЬ
	               |						iga_СвязиПодразделенийСОператорами.Подразделение
	               |					ИЗ
	               |						РегистрСведений.iga_СвязиПодразделенийСОператорами КАК iga_СвязиПодразделенийСОператорами
	               |					ГДЕ
	               |						iga_СвязиПодразделенийСОператорами.Оператор = &Оператор)
	               |				ИЛИ &Оператор В
	               |					(ВЫБРАТЬ
	               |						iga_НастройкиОператоров.Оператор КАК Оператор
	               |					ИЗ
	               |						РегистрСведений.iga_НастройкиОператоров КАК iga_НастройкиОператоров
	               |					ГДЕ
	               |						(iga_НастройкиОператоров.Подразделение = &ПодразделениеКоллЦентр
	               |							ИЛИ НЕ iga_НастройкиОператоров.ПростойОператор)))
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		0,
	               |		0,
	               |		0,
	               |		0,
	               |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ iga_ОчередьРаспределения.Чат)
	               |	ИЗ
	               |		РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.iga_ПараметрыОбщения КАК iga_ПараметрыОбщения
	               |			ПО (iga_ПараметрыОбщения.ИмяПараметра = ""ВыбранноеПодразделение"")
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПараметрыОбщенияСБотом КАК iga_ПараметрыОбщенияСБотом
	               |			ПО iga_ОчередьРаспределения.Чат = iga_ПараметрыОбщенияСБотом.Чат
	               |				И (iga_ПараметрыОбщения.Ссылка = iga_ПараметрыОбщенияСБотом.Параметр)
	               |	ГДЕ
	               |		iga_ОчередьРаспределения.Оператор = &ПустойОператор
	               |		И iga_ОчередьРаспределения.Статус = &СтатусОжидание
	               |		И НЕ iga_ОчередьРаспределения.ОсобыйЧат
	               |		И (&Оператор В
	               |					(ВЫБРАТЬ
	               |						ВТ_ПропускОператоров.Оператор КАК Оператор
	               |					ИЗ
	               |						ВТ_ПропускОператоров КАК ВТ_ПропускОператоров)
	               |				ИЛИ iga_ПараметрыОбщенияСБотом.Значение В
	               |					(ВЫБРАТЬ
	               |						ВТ_ПодразделенияОператора.Подразделение КАК Подразделение
	               |					ИЗ
	               |						ВТ_ПодразделенияОператора КАК ВТ_ПодразделенияОператора))) КАК ВложенныйЗапрос";
	Запрос.УстановитьПараметр("Оператор", Оператор);
	Запрос.УстановитьПараметр("СтатусЗавершен", Перечисления.iga_СтатусыОчереди.Завершен);
	Запрос.УстановитьПараметр("СтатусВнеОчереди", Перечисления.iga_СтатусыОчереди.ВнеОчереди);
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.iga_СтатусыПодтвержденияЗаявок.Отменено);
	МассивСтатусов.Добавить(Перечисления.iga_СтатусыПодтвержденияЗаявок.Просрочено);
	МассивСтатусов.Добавить(Перечисления.iga_СтатусыПодтвержденияЗаявок.ТребуетсяПеренос);
	Запрос.УстановитьПараметр("ПустойОператор", Справочники.Пользователи.ПустаяСсылка());
	Запрос.УстановитьПараметр("СостояниеЗапланирована", Справочники.ВидыСостоянийЗаявок.Запланирована);
	Запрос.УстановитьПараметр("СтатусОжидание", Перечисления.iga_СтатусыОчереди.Ожидание);
	Запрос.УстановитьПараметр("СтатусыОтмены", МассивСтатусов);
	Запрос.УстановитьПараметр("ПодразделениеКоллЦентр", Справочники.iga_ПодразделенияОператоров.КоллЦентр);
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураВозврата = Новый Структура("КоличествоИстория, КоличествоАктивные, КоличествоУточнение, КоличествоНеподтвержденных, КоличествоОжидающих", 0, 0, 0, 0, 0);
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, Выборка);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьКоличествоЧатов()
	
	КоличестваЧатов = ПолучитьКоличествоЧатов(ОператорСписков);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, КоличестваЧатов);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьНовыеСообщенияНаСервере(ОбщаяВременнаяМетка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_КонтрольНовыхСообщений.ВременнаяМеткаНовыхСообщений КАК ВременнаяМеткаНовыхСообщений
	               |ИЗ
	               |	РегистрСведений.iga_КонтрольНовыхСообщений КАК iga_КонтрольНовыхСообщений
	               |ГДЕ
	               |	iga_КонтрольНовыхСообщений.ВременнаяМеткаНовыхСообщений > &ОбщаяВременнаяМетка";
	Запрос.УстановитьПараметр("ОбщаяВременнаяМетка", ОбщаяВременнаяМетка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОбщаяВременнаяМетка = Выборка.ВременнаяМеткаНовыхСообщений;
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтраницаАктивные()
	
	Возврат "Активные";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтраницаОжидающие()
	
	Возврат "Ожидающие";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтраницаИстория()
	
	Возврат "История";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтраницаУточнение()
	
	Возврат "ТребуютУточнения";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтраницаЗаписи()
	
	Возврат "Записи";
	
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьОтмененныеБрони(Оператор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_НастройкиОператоров.Подразделение КАК Подразделение,
	               |	iga_НастройкиОператоров.Оператор КАК Оператор
	               |ПОМЕСТИТЬ ВТ_НастройкиОператора
	               |ИЗ
	               |	РегистрСведений.iga_НастройкиОператоров КАК iga_НастройкиОператоров
	               |ГДЕ
	               |	iga_НастройкиОператоров.Оператор = &Оператор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Заявка КАК Заявка,
	               |	iga_ЧатыКлиентов.Чат КАК Чат
	               |ПОМЕСТИТЬ ВТ_ОтмененныеЗаявки
	               |ИЗ
	               |	РегистрСведений.iga_СтатусыПодтвержденияСтрокЗаявок КАК iga_СтатусыПодтвержденияСтрокЗаявок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Заявка КАК ЗаявкаДок
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ЧатыКлиентов КАК iga_ЧатыКлиентов
	               |			ПО ЗаявкаДок.Клиент = iga_ЧатыКлиентов.Клиент
	               |		ПО iga_СтатусыПодтвержденияСтрокЗаявок.Заявка = ЗаявкаДок.Ссылка
	               |ГДЕ
	               |	iga_СтатусыПодтвержденияСтрокЗаявок.Статус В(&СтатусыОтмены)
	               |	И iga_СтатусыПодтвержденияСтрокЗаявок.ДатаЗаписи >= &ТекущаяДата
	               |	И iga_СтатусыПодтвержденияСтрокЗаявок.Заявка.Филиал В
	               |			(ВЫБРАТЬ
	               |				iga_ПодразделенияОператоровФилиалы.Филиал КАК Филиал
	               |			ИЗ
	               |				ВТ_НастройкиОператора КАК ВТ_НастройкиОператора
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.iga_ПодразделенияОператоров.Филиалы КАК iga_ПодразделенияОператоровФилиалы
	               |					ПО
	               |						ВТ_НастройкиОператора.Подразделение = iga_ПодразделенияОператоровФилиалы.Ссылка
	               |		
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |			ВЫБРАТЬ
	               |				iga_ПодразделенияОператоровФилиалы.Филиал
	               |			ИЗ
	               |				ВТ_НастройкиОператора КАК ВТ_НастройкиОператора
	               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.iga_СвязиПодразделенийСОператорами КАК iga_СвязиПодразделенийСОператорами
	               |						ЛЕВОЕ СОЕДИНЕНИЕ Справочник.iga_ПодразделенияОператоров.Филиалы КАК iga_ПодразделенияОператоровФилиалы
	               |						ПО
	               |							iga_СвязиПодразделенийСОператорами.Подразделение = iga_ПодразделенияОператоровФилиалы.Ссылка
	               |					ПО
	               |						ВТ_НастройкиОператора.Оператор = iga_СвязиПодразделенийСОператорами.Оператор)
	               |	И НЕ iga_СтатусыПодтвержденияСтрокЗаявок.Обработано
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОтмененныеЗаявки.Заявка КАК Заявка,
	               |	iga_ОчередьРаспределения.Оператор КАК Оператор,
	               |	iga_ОчередьРаспределения.Статус КАК Статус
	               |ПОМЕСТИТЬ ВТ_ВсеОчередиЗаявок
	               |ИЗ
	               |	ВТ_ОтмененныеЗаявки КАК ВТ_ОтмененныеЗаявки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |		ПО ВТ_ОтмененныеЗаявки.Чат = iga_ОчередьРаспределения.Чат
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ОтмененныеЗаявки.Заявка КАК Заявка
	               |ИЗ
	               |	ВТ_ОтмененныеЗаявки КАК ВТ_ОтмененныеЗаявки
	               |ГДЕ
	               |	НЕ ВТ_ОтмененныеЗаявки.Заявка В
	               |				(ВЫБРАТЬ
	               |					ВТ_ВсеОчередиЗаявок.Заявка КАК Заявка
	               |				ИЗ
	               |					ВТ_ВсеОчередиЗаявок КАК ВТ_ВсеОчередиЗаявок
	               |				ГДЕ
	               |					ВТ_ВсеОчередиЗаявок.Статус В (&СтатусыОчереди))";
	СтатусыОтмены = Новый Массив;
	СтатусыОтмены.Добавить(Перечисления.iga_СтатусыПодтвержденияЗаявок.Отменено);
	СтатусыОтмены.Добавить(Перечисления.iga_СтатусыПодтвержденияЗаявок.ТребуетсяПеренос);
	Запрос.УстановитьПараметр("СтатусыОтмены", СтатусыОтмены);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Оператор", Оператор);
	СтатусыОчереди = Новый Массив;
	СтатусыОчереди.Добавить(Перечисления.iga_СтатусыОчереди.ВРаботе);
	СтатусыОчереди.Добавить(Перечисления.iga_СтатусыОчереди.ВнеОчереди);
	СтатусыОчереди.Добавить(Перечисления.iga_СтатусыОчереди.Подключение);
	Запрос.УстановитьПараметр("СтатусыОчереди", СтатусыОчереди);
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

&НаСервереБезКонтекста
Функция ВключеныСобытия()
	
	Возврат Константы.iga_СобытияИзАРМ.Получить();
	
КонецФункции       

&НаСервереБезКонтекста
Функция ВключеноОповещениеОбОтмененных()
	
	Возврат Константы.iga_ОповещенияОтмененныхЗаписей.Получить();
	
КонецФункции       

&НаКлиенте
Процедура ПроверитьНовыеСообщения()
	
	СчетчикСекунд = СчетчикСекунд + 5;

	Если ТекущаяСтраницаЧатов = СтраницаАктивные() Тогда
		
		СписокЧатов.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
		Элементы.СписокЧатов.Обновить();
		
	ИначеЕсли ТекущаяСтраницаЧатов = СтраницаОжидающие() Тогда
		Элементы.СписокОжидающих.Обновить();
	КонецЕсли;
	
	Если (ТекущаяСтраницаЧатов = СтраницаЗаписи() 
		Или ТекущаяСтраницаЧатов = СтраницаИстория()
		Или ТекущаяСтраницаЧатов = СтраницаУточнение())
		И СчетчикСекунд >= 60 Тогда
		
		Элементы.СписокЧатовОтмененныхПереносовЗаписей.Обновить();
		Элементы.СписокЧатовИстория.Обновить();
		Элементы.СписокЧатовТребуютУточнения.Обновить();
		
	КонецЕсли;
	
	ЗаполнитьКоличествоЧатов();
	
	ТекущиеДанные = ПолучитьТекущиеДанные();
	
	Если ЕстьНовыеСообщенияНаСервере(ОбщаяВременнаяМетка) И Не ТекущиеДанные = Неопределено Тогда
		
		НовыеСообщения = ПолучитьНовыеСообщенияДляИнтерфейса(ТекущиеДанные.Чат, ТекущаяВременнаяМетка);
		
		Для Каждого Сообщение Из НовыеСообщения Цикл
			
			ДобавитьСообщениеВИнтерфейс(Сообщение);
			
			ТекущаяВременнаяМетка = Макс(ТекущаяВременнаяМетка, Сообщение.ВременнаяМетка);
			Если ПерваяВременнаяМетка = 0 Тогда
				ПерваяВременнаяМетка = ТекущаяВременнаяМетка;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	УстановитьДоступностьЭлементов();
	
	КоличествоМинутПослеОчисткиКэша = iga_ОбщегоНазначенияКлиентСервер.РазностьДат(ДатаОчисткиКэша, ТекущаяДата(), "МИНУТА");
	
	Если КоличествоМинутПослеОчисткиКэша > 30 Тогда
		ПочиститьКэшКонтента()
	КонецЕсли;
	
	Если СчетчикСекунд >= 60 Тогда
		СчетчикСекунд = 0;
	КонецЕсли;
	
	Если ВключеноОповещениеОбОтмененных() Тогда
		Если Не ЕстьОповещение И Не ТекущаяСтраницаЧатов = СтраницаЗаписи() И (Не ЗначениеЗаполнено(ДатаОповещенияОбОтмене) 
			Или ТекущаяДата() > ДатаОповещенияОбОтмене) Тогда           
			Если ЕстьОтмененныеБрони(ТекущийОператор) Тогда
				ЕстьОповещение = Истина;
				ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОповещенияОбОтмене", ЭтаФорма);
				СписокКнопок = Новый СписокЗначений;
				СписокКнопок.Добавить(0, "Напомнить позже");
				СписокКнопок.Добавить(1, "Взять в работу");
				ПоказатьВопрос(ОписаниеОповещения, "Есть отмененные записи!", СписокКнопок,, 0);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеОповещенияОбОтмене(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = 1 Тогда
		ЕстьОповещение = Ложь;
		ДатаОповещенияОбОтмене = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(ТекущаяДата(),
			"МИНУТА", 10);
		
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыСпискиЧатов.ТекущаяСтраница = Элементы.СтраницаЗаписиЧатов;
	ТекущаяСтраницаЧатов = СтраницаЗаписи();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСообщениеВИнтерфейс(Сообщение, История = Ложь)
	
    ТекстЦитаты = "";
    АвторЦитаты = "";
    
	Если ЗначениеЗаполнено(Сообщение.IDЦитируемогоСообщения) Тогда
        ДанныеЦитаты = КэшСообщений.Получить(Сообщение.IDЦитируемогоСообщения);
        Если ДанныеЦитаты <> Неопределено Тогда
            ТекстЦитаты = ДанныеЦитаты.Текст;
            АвторЦитаты = ДанныеЦитаты.Автор;
        КонецЕсли;
    КонецЕсли;
    
    ДанныеТекущего = Новый Структура("ID, Текст, Автор", Сообщение.IDСообщения, Сообщение.Текст, ?(Сообщение.ЭтоВходящее, "Клиент", "Вы"));
    КэшСообщений.Вставить(Сообщение.IDСообщения, ДанныеТекущего);
	
	
	ТекстСообщения = Сообщение.Текст;
    ПараметрыJS = Новый Структура;
    ПараметрыJS.Вставить("id",           Сообщение.IDСообщения);
    ПараметрыJS.Вставить("isIncoming",   Сообщение.ЭтоВходящее);
    ПараметрыJS.Вставить("time",         Формат(Сообщение.Дата, "ДЛФ=DT"));
    ПараметрыJS.Вставить("quoteText",    ТекстЦитаты);
	ПараметрыJS.Вставить("quoteAuthor",  АвторЦитаты);
	ПараметрыJS.Вставить("operatorName", Сообщение.ОператорИмя);
	Если Сообщение.Свойство("ЕстьФайл") И Сообщение.ЕстьФайл Тогда
		ПараметрыJS.Вставить("hasFile",      Сообщение.ЕстьФайл);
		ПараметрыJS.Вставить("fileStatus",   Строка(Сообщение.Статус));
		ПараметрыJS.Вставить("fileName",     Сообщение.ИмяФайла);
		ПараметрыJS.Вставить("fileSize",     Сообщение.РазмерФайла);
		ПараметрыJS.Вставить("thumbnail",    Сообщение.КартинкаФайла);
		КлассИконки = "icon-save";
		Если Сообщение.ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Картинка") Тогда
			КлассИконки = "icon-zoom";
			ТекстСообщения = ?(ТекстСообщения = "", "Изображение", ТекстСообщения);
		ИначеЕсли Сообщение.ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Видео") 
			ИЛИ Сообщение.ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Аудио") Тогда
			КлассИконки = "icon-play";
			Если Сообщение.ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Видео") Тогда 
				ТекстСообщения = ?(ТекстСообщения = "", "Видеозапись", ТекстСообщения);
			Иначе
				ТекстСообщения = ?(ТекстСообщения = "", "Аудиозапись", ТекстСообщения);
			КонецЕсли;
		Иначе
			ТекстСообщения = ?(ТекстСообщения = "", "Документ", ТекстСообщения);
		КонецЕсли;
		ПараметрыJS.Вставить("iconClass",    КлассИконки);
	Иначе
		ПараметрыJS.Вставить("hasFile",      Ложь);
	КонецЕсли;
    ПараметрыJS.Вставить("text",         ТекстСообщения);
    
    СтрJSON = ЗаписатьЗначениеJSON(ПараметрыJS);
    
    ДокументHTML = Элементы.ТекстДиалогаHTML.Документ;
	Если ДокументHTML <> Неопределено Тогда
		Если История Тогда
			ДокументHTML.defaultView.appendMessage(СтрJSON, Истина);
		Иначе
			ДокументHTML.defaultView.appendMessage(СтрJSON);
		КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПрочитатьСообщенияНаСервере(ЧатСсылка, КэшСообщений, ИДЧата, АктивныйЧат)
	
	ЕстьНепрочитанные = Ложь;
	Для Каждого ДанныеСообщения Из КэшСообщений Цикл
		Если Не ДанныеСообщения.Значение.ПрочитаноОператором Тогда
			ЕстьНепрочитанные = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьНепрочитанные Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.iga_ИсторияСообщений КАК iga_ИсторияСообщений
	               |ГДЕ
	               |	iga_ИсторияСообщений.Чат = &Чат
	               |	И iga_ИсторияСообщений.IDСообщения В(&IDСообщений)";
	Запрос.УстановитьПараметр("Чат", ЧатСсылка);
	IDСообщений = Новый Массив;
	Для Каждого ДанныеСообщения Из КэшСообщений Цикл
		Если Не ДанныеСообщения.Значение.ПрочитаноОператором Тогда
			IDСообщений.Добавить(ДанныеСообщения.Значение.IDСообщения);
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("IDСообщений", IDСообщений);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.iga_ИсторияСообщений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.ПрочитаноОператором = Истина;
		Запись.Записать();
	КонецЦикла;
	
	Если АктивныйЧат Тогда
		Бот = Обработки.iga_ChatBot.Создать();
		Бот.ИнициализацияОсновныхПараметров();
		Бот.ОтметитьЧатПрочитанным(ИДЧата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНовыеСообщенияДляИнтерфейса(ЧатСсылка, ТекущаяВременнаяМетка)
    СписокНовых = Новый Массив;
    
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
                   |	История.Текст КАК Текст,
                   |	История.ДатаСообщения КАК Дата,
                   |	История.ЭтоВходящее КАК ЭтоВходящее,
                   |	ЕСТЬNULL(История.Оператор.Наименование, """") КАК ОператорИмя,
                   |	История.ТекстЦитирования КАК ТекстЦитирования,
                   |	История.АвторЦитирования КАК АвторЦитирования,
                   |	История.IDСообщения КАК IDСообщения,
                   |	История.IDЦитируемогоСообщения КАК IDЦитируемогоСообщения,
                   |	История.ВременнаяМетка КАК ВременнаяМетка,
                   |	История.ЕстьФайл КАК ЕстьФайл,
                   |	iga_ПрикрепленныеФайлы.ДанныеФайла КАК ДанныеФайла,
                   |	iga_ПрикрепленныеФайлы.ПутьКФайлу КАК ПутьКФайлу,
                   |	iga_ПрикрепленныеФайлы.ТипМедиа КАК ТипМедиа,
                   |	iga_ПрикрепленныеФайлы.Статус КАК Статус,
                   |	iga_ПрикрепленныеФайлы.ТекстОшибки КАК ТекстОшибки,
                   |	iga_ПрикрепленныеФайлы.URLЗагрузки КАК URLЗагрузки,
                   |	iga_ПрикрепленныеФайлы.КартинкаФайла КАК КартинкаФайла,
                   |	iga_ПрикрепленныеФайлы.РазмерФайла КАК РазмерФайла,
                   |	iga_ПрикрепленныеФайлы.ИмяФайла КАК ИмяФайла
                   |ИЗ
                   |	РегистрСведений.iga_ИсторияСообщений КАК История
                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПрикрепленныеФайлы КАК iga_ПрикрепленныеФайлы
                   |		ПО История.IDСообщения = iga_ПрикрепленныеФайлы.IDСообщения
                   |ГДЕ
                   |	История.Чат = &Чат
                   |	И История.ВременнаяМетка > &ТекущаяВременнаяМетка
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |	ВременнаяМетка";
    Запрос.УстановитьПараметр("ТекущаяВременнаяМетка", ТекущаяВременнаяМетка);
    Запрос.УстановитьПараметр("Чат", ЧатСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
    Выборка = РезультатЗапроса.Выбрать();
    Пока Выборка.Следующий() Цикл
        Стр = Новый Структура;
		Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
			Стр.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла;
		
        СписокНовых.Добавить(Стр);
    КонецЦикла;
    
    Возврат СписокНовых;
КонецФункции

&НаСервере
Функция ВыполнитьОтклонениеНаСервере(ПараметрыОтклонения, ТекстПричины)
	Возврат iga_РаспределениеСервер.ОтклонитьЧатНаСервере(ПараметрыОтклонения, ТекущийОператор, ТекстПричины);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекстСообщения(Тип, ЧатСсылка)
	
	КодЯзыка = iga_МетодыРаботыСБотом.ПолучитьЗначениеПараметраОбщения(ЧатСсылка, "Язык");
	
	Возврат iga_ШаблоныСообщений.ПолучитьТекстСообщения(Тип, КодЯзыка);
	
КонецФункции

&НаКлиенте
Процедура ПослеВводаПричиныОтказа(Результат, ДопПарамеры) Экспорт
	Если Результат = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	ПричиныБезОповещения = Новый Массив;
	ПричиныБезОповещения.Добавить(ПредопределенноеЗначение("Справочник.iga_ПричиныОтклоненияОжидающихЧатов.ТребуетсяВмешательствоРуководства"));
	ПричиныБезОповещения.Добавить(ПредопределенноеЗначение("Справочник.iga_ПричиныОтклоненияОжидающихЧатов.ПереводНаДругойФилиал"));
	
	Если ПричиныБезОповещения.Найти(ДопПарамеры.Причина) = Неопределено Тогда
	
		//ТекстСообщения = ПолучитьТекстСообщения(ПредопределенноеЗначение("Перечисление.iga_ТипыТекстовСообщений.ТекстПриОтказеОтПриемаДиалога"), ДопПарамеры.ЧатСсылка);
		
		//ОтправитьПростоеСообщение(ТекущийОператор, ДопПарамеры.ЧатСсылка, ДопПарамеры.ИдЧата, ТекстСообщения);
		
	КонецЕсли;
	
	ТекстПричины = СокрЛП(Результат);
	
	РезультатОтказа = ВыполнитьОтклонениеНаСервере(ДопПарамеры, ТекстПричины);
	
	Если РезультатОтказа Тогда
		Элементы.СписокЧатов.Обновить();
		ОбновитьОкноДиалога();
	Иначе
		ПоказатьПредупреждение(, "Чат уже ушел в просрочку или был принят другим оператором и не может быть отклонен вручную!");
		Элементы.СписокЧатов.Обновить();
	КонецЕсли;
	УстановитьДоступностьЭлементов();  
	ЗаполнитьКоличествоЧатов();
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФилиалаПеревода(ВыбранноеПодразделение, ДопПараметры) Экспорт
	
	Если ВыбранноеПодразделение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры.Вставить("ВыбранноеПодразделение", ВыбранноеПодразделение);
	
	ПослеВводаПричиныОтказа("", ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеВыбораПричиныОтлонения(ВыбЗначение, ДопПарамеры) Экспорт
	
	Если ВыбЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПарамеры.Вставить("Причина", ВыбЗначение.Значение.Причина);
	ДопПарамеры.Вставить("СвойстваПричины", ВыбЗначение.Значение);
	
	Если ДопПарамеры.Причина = ПредопределенноеЗначение("Справочник.iga_ПричиныОтклоненияОжидающихЧатов.ТребуетсяВмешательствоРуководства") Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаПричиныОтказа", ЭтотОбъект, ДопПарамеры);
		ПоказатьВводСтроки(ОписаниеОповещения, "", "Подробности (необязательно):", 1000, Истина);
	ИначеЕсли ДопПарамеры.Причина = ПредопределенноеЗначение("Справочник.iga_ПричиныОтклоненияОжидающихЧатов.ПереводНаДругойФилиал") Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораФилиалаПеревода", ЭтотОбъект, ДопПарамеры);
		СтруктураОтбора = Новый Структура("ПометкаУдаления", Ложь);
		ПараметрыОткрытия = Новый Структура("Отбор", СтруктураОтбора);
		ОткрытьФорму("Справочник.iga_ПодразделенияОператоров.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор,,,
			ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ПослеВводаПричиныОтказа("", ДопПарамеры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокПричинОтлонения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПричиныОтклоненияОжидающихЧатов.Ссылка КАК Причина, ЗавершитьЧат
	               |ИЗ
	               |	Справочник.iga_ПричиныОтклоненияОжидающихЧатов КАК iga_ПричиныОтклоненияОжидающихЧатов
	               |ГДЕ
	               |	НЕ iga_ПричиныОтклоненияОжидающихЧатов.Ссылка = ЗНАЧЕНИЕ(Справочник.iga_ПричиныОтклоненияОжидающихЧатов.Просрочено)
				   | И НЕ ПричинаЗавершения И Не ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	СписокПричин = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		
		СтруктураПричины = Новый Структура("Причина, БезОповещения, ЗавершитьЧат");
		
		ЗаполнитьЗначенияСвойств(СтруктураПричины, Выборка);
		
		СписокПричин.Добавить(СтруктураПричины, Выборка.Причина);
	КонецЦикла;
	
	Возврат СписокПричин;
	
КонецФункции

&НаКлиенте
Процедура ОтклонитьДиалог(Команда)
	ТекущиеДанные = Элементы.СписокЧатов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура("ЧатСсылка, ИдЧата", ТекущиеДанные.Чат, ТекущиеДанные.ИдЧата);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВыбораПричиныОтлонения", ЭтаФорма, СтруктураПараметров);
	
	СписокПричин = ПолучитьСписокПричинОтлонения();
	
	ПоказатьВыборИзМеню(ОписаниеОповещения, СписокПричин, Элементы.ОтклонитьДиалог);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	УточняющийЧат = ТекущаяСтраницаЧатов = СтраницаУточнение();
	ОтменаПеренос = ТекущаяСтраницаЧатов = СтраницаЗаписи();
	
	АктивныеЧаты = ТекущаяСтраницаЧатов = СтраницаАктивные();
	
	Ожидающие = ТекущаяСтраницаЧатов = СтраницаОжидающие();
	
	ТекущиеДанные = ПолучитьТекущиеДанные();
	
	ОператорОнлайн = ТекущийСтатусОператора = ПредопределенноеЗначение("Перечисление.iga_СтатусыОператоров.Онлайн");
	
	Если Не ОператорОнлайн Или ТекущиеДанные = Неопределено Тогда
		Элементы.ГруппаКоманды.Доступность = Ложь;
		Элементы.ТекстовоеСообщение.Доступность = Ложь;
		Элементы.Отправить.Доступность = Ложь;
		Элементы.ПрикрепитьФайл.Доступность      = Ложь;
		Возврат;
	Иначе
		Элементы.ГруппаКоманды.Доступность = Истина;
		Элементы.ТекстовоеСообщение.Доступность = Истина;
	КонецЕсли;
	
	ТекущийСтатусОчереди = ПолучитьТекущийСтатусЧата(ТекущиеДанные.Чат);;
	Если ОтменаПеренос Тогда
		ТекущийСтатусОчереди = ПредопределенноеЗначение("Перечисление.iga_СтатусыОчереди.Завершен");
	КонецЕсли;
	
	Если Не ОтменаПеренос Тогда
		ПрошлоБолее24Часа = iga_ОбщегоНазначенияКлиентСервер.РазностьДат(ТекущиеДанные.ДатаСообщения, ТекущаяДата(), "ЧАС") >= 24;
	Иначе
		ПрошлоБолее24Часа = Ложь;
	КонецЕсли;
	
	Если АктивныеЧаты И iga_ОбщегоНазначенияКлиентСервер.РазностьДат(ТекущиеДанные.ДатаСообщения, ТекущаяДата(), "ЧАС") >= 24 Тогда
		ОжиданиеОтвета = Истина;
	Иначе
		ОжиданиеОтвета = Ложь;
	КонецЕсли;
	
	Элементы.НачатьДиалог.Видимость = ((ТекущийСтатусОчереди = ПредопределенноеЗначение("Перечисление.iga_СтатусыОчереди.Подключение") И (АктивныеЧаты)) 
	                                ИЛИ ТекущийСтатусОчереди = ПредопределенноеЗначение("Перечисление.iga_СтатусыОчереди.Завершен"))
									Или ПрошлоБолее24Часа Или Ожидающие;
	
	Элементы.ЗавершитьДиалог.Видимость = (ТекущийСтатусОчереди = ПредопределенноеЗначение("Перечисление.iga_СтатусыОчереди.ВРаботе")) И (АктивныеЧаты или УточняющийЧат);
	
	Элементы.ОтклонитьДиалог.Видимость = (ТекущийСтатусОчереди = ПредопределенноеЗначение("Перечисление.iga_СтатусыОчереди.Подключение")
									ИЛИ ТекущийСтатусОчереди = ПредопределенноеЗначение("Перечисление.iga_СтатусыОчереди.ВРаботе")) И АктивныеЧаты;
	Элементы.ПродлитьБронь.Видимость   = (ТекущийСтатусОчереди = ПредопределенноеЗначение("Перечисление.iga_СтатусыОчереди.Подключение")) И (АктивныеЧаты или УточняющийЧат);
	
	Элементы.ПродлитьБронь.Доступность = Не ТекущиеДанные.ВремяПродлено И (АктивныеЧаты);
	
	ДоступностьВвода = (ТекущийСтатусОчереди = ПредопределенноеЗначение("Перечисление.iga_СтатусыОчереди.ВРаботе") И Не ПрошлоБолее24Часа И Не ОжиданиеОтвета 
		и АктивныеЧаты) или (УточняющийЧат И Не ОжиданиеОтвета И Не ПрошлоБолее24Часа);
	Элементы.Отправить.Доступность      = ДоступностьВвода;
	Элементы.ПрикрепитьФайл.Доступность      = ДоступностьВвода;
	Элементы.НеподтвержденныеЗаписи.Доступность = ДоступностьВвода;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьСтатусОператораНаСервере(Оператор, Статус, ПриниматьНовыеЧаты, ИзменитьПринятиеНовых)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_НастройкиОператоров.Оператор КАК Оператор,
	               |	iga_НастройкиОператоров.Статус КАК Статус,
	               |	iga_НастройкиОператоров.ЛимитЧатов КАК ЛимитЧатов,
	               |	iga_НастройкиОператоров.ПростойОператор КАК ПростойОператор
	               |ИЗ
	               |	РегистрСведений.iga_НастройкиОператоров КАК iga_НастройкиОператоров
	               |ГДЕ
	               |	iga_НастройкиОператоров.Оператор = &Оператор";
	Запрос.УстановитьПараметр("Оператор", Оператор);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ЗаписьНастроек = РегистрыСведений.iga_НастройкиОператоров.СоздатьМенеджерЗаписи();
	ЗаписьНастроек.Оператор = Оператор;
	ЗаписьНастроек.Прочитать();
	
	ЗаписьНастроек.Статус = Статус;
	
	Выборка.Следующий();
	
	Если ИзменитьПринятиеНовых И Статус = Перечисления.iga_СтатусыОператоров.Онлайн Тогда
		ЗаписьНастроек.ПриниматьНовыеЧаты = Истина;
		ПриниматьНовыеЧаты = Истина;
	КонецЕсли;
	ЗаписьНастроек.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьПриниматьНовыеЧаты(Оператор, ПриниматьНовыеЧаты)
	
	ЗаписьНастроек = РегистрыСведений.iga_НастройкиОператоров.СоздатьМенеджерЗаписи();
	ЗаписьНастроек.Оператор = Оператор;
	ЗаписьНастроек.Прочитать();
	
	ЗаписьНастроек.ПриниматьНовыеЧаты = ПриниматьНовыеЧаты;
	ЗаписьНастроек.Записать();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ТекущийСтатусОператораПриИзменении(Элемент)
	
	НовыйСтатус = ТекущийСтатусОператора;
	
	ТекущийСтатусОператора = ПредыдущийСтатусОператора;
	
	Если Не Ждать ПодтверждениеОперации("Изменение статуса") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не НовыйСтатус = ПредопределенноеЗначение("Перечисление.iga_СтатусыОператоров.Оффлайн") Тогда	
		ИзменитьПринятиеНовых = Ждать ПодтверждениеОперации("Принимать новые чаты?");
	Иначе
		ИзменитьПринятиеНовых = Истина;
	КонецЕсли;
	
	ТекущийСтатусОператора = НовыйСтатус;
	ПредыдущийСтатусОператора = ТекущийСтатусОператора;
	
	ИзменитьСтатусОператораНаСервере(ТекущийОператор, ТекущийСтатусОператора, ПриниматьНовыеЧаты, ИзменитьПринятиеНовых); 
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийОператорПриИзменении(Элемент)
	Если Не ТекущийОператор = ПредыдущийОператор Тогда
		Элементы.ТекстДиалогаHTML.Документ.defaultView.clearMessages();
		КэшСообщений.Очистить();
		ПредыдущийОператор = ТекущийОператор;
		ЗаполнитьКоличествоЧатов();
	КонецЕсли;
	ОператорСписков = ТекущийОператор;
	УстановитьПараметрыОператора(ЭтаФорма);
	УстановитьДоступностьЭлементов();
	ЗаполнитьКоличествоЧатов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЧатовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокЧатовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИсториюСообщений(ЧатСсылка, ТекущаяВременнаяМетка)
    СписокНовых = Новый Массив;
    
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 20
                   |	История.Текст КАК Текст,
                   |	История.ДатаСообщения КАК Дата,
                   |	История.ЭтоВходящее КАК ЭтоВходящее,
                   |	ЕСТЬNULL(История.Оператор.Наименование, """") КАК ОператорИмя,
                   |	История.ТекстЦитирования КАК ТекстЦитирования,
                   |	История.АвторЦитирования КАК АвторЦитирования,
                   |	История.IDСообщения КАК IDСообщения,
                   |	История.IDЦитируемогоСообщения КАК IDЦитируемогоСообщения,
                   |	История.ВременнаяМетка КАК ВременнаяМетка,
                   |	История.ЕстьФайл КАК ЕстьФайл,
                   |	iga_ПрикрепленныеФайлы.ДанныеФайла КАК ДанныеФайла,
                   |	iga_ПрикрепленныеФайлы.ПутьКФайлу КАК ПутьКФайлу,
                   |	iga_ПрикрепленныеФайлы.ТипМедиа КАК ТипМедиа,
                   |	iga_ПрикрепленныеФайлы.Статус КАК Статус,
                   |	iga_ПрикрепленныеФайлы.ТекстОшибки КАК ТекстОшибки,
                   |	iga_ПрикрепленныеФайлы.URLЗагрузки КАК URLЗагрузки,
                   |	iga_ПрикрепленныеФайлы.КартинкаФайла КАК КартинкаФайла,
                   |	iga_ПрикрепленныеФайлы.РазмерФайла КАК РазмерФайла,
                   |	iga_ПрикрепленныеФайлы.ИмяФайла КАК ИмяФайла
                   |ИЗ
                   |	РегистрСведений.iga_ИсторияСообщений КАК История
                   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПрикрепленныеФайлы КАК iga_ПрикрепленныеФайлы
                   |		ПО История.IDСообщения = iga_ПрикрепленныеФайлы.IDСообщения
                   |ГДЕ
                   |	История.Чат = &Чат
                   |	И История.ВременнаяМетка < &ТекущаяВременнаяМетка
                   |
                   |УПОРЯДОЧИТЬ ПО
                   |	ВременнаяМетка УБЫВ";
    Запрос.УстановитьПараметр("ТекущаяВременнаяМетка", ТекущаяВременнаяМетка);
    Запрос.УстановитьПараметр("Чат", ЧатСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
    Выборка = РезультатЗапроса.Выбрать();
    Пока Выборка.Следующий() Цикл
        Стр = Новый Структура;
		Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
			Стр.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла;
		
        СписокНовых.Добавить(Стр);
    КонецЦикла;
    
    Возврат СписокНовых;
КонецФункции

&НаКлиенте
Процедура ВывестиИсториюСообщений()
	
	ТекущиеДанные = ПолучитьТекущиеДанные();
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИсторияСообщений = ПолучитьИсториюСообщений(ТекущиеДанные.Чат, ПерваяВременнаяМетка);

	Для Каждого Сообщение Из ИсторияСообщений Цикл
		
		ДобавитьСообщениеВИнтерфейс(Сообщение, Истина);
		
		ПерваяВременнаяМетка = Сообщение.ВременнаяМетка;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТекстДиалогаHTMLПриНажатии(Элемент)
	
	Если Не ВводДоступен() Тогда
		Возврат;
	КонецЕсли;
	
	НовыйЗаголовок = Элементы.ТекстДиалогаHTML.Документ.title;
	
	Если ПустаяСтрока(НовыйЗаголовок) ИЛИ НовыйЗаголовок = "about:blank" Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(НовыйЗаголовок, "v8:setQuoteId:") > 0 Тогда
		
		ЦитируемоеСообщениеИд = СтрЗаменить(НовыйЗаголовок, "v8:setQuoteId:", "");
		
	ИначеЕсли НовыйЗаголовок = "v8:cancelQuote" Тогда
		
		ЦитируемоеСообщениеИд = "";
		
	ИначеЕсли СтрНайти(НовыйЗаголовок, "v8:viewMedia:") > 0 Тогда
		
		ИдСообщения = СтрЗаменить(НовыйЗаголовок, "v8:viewMedia:", "");
        ОбработатьОткрытиеФайла(ИдСообщения);
        
	ИначеЕсли СтрНайти(НовыйЗаголовок, "v8:loadMoreHistory:") > 0 Тогда
		
		ВывестиИсториюСообщений();
	        
    КонецЕсли;
	
	Элементы.ТекстДиалогаHTML.Документ.title = "";
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВоспроизведениеКонтентаВнутри()
	
	Возврат Константы.iga_ВоспроизведениеКонтентаВнутри.Получить();
	
КонецФункции

&НаКлиенте
Асинх Процедура ОбработатьОткрытиеФайла(ИдСообщения)
	
	#Если ВебКлиент Тогда
	Подключено = Ждать ПодключитьРасширениеРаботыСФайламиАсинх();
	
	Если Не Подключено Тогда
		Установлено = Ждать УстановитьРасширениеРаботыСФайламиАсинх();
		Если Не Установлено Тогда
			Возврат;
		КонецЕсли;           
		Подключено = Ждать ПодключитьРасширениеРаботыСФайламиАсинх();
		Если Не Подключено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	#КонецЕсли
	
	ТекущиеДанные = ПолучитьТекущиеДанные();
	
	ИдЧата = ТекущиеДанные.ИдЧата;
	ЧатСсылка = ТекущиеДанные.Чат;
	
    ДанныеФайла = ПолучитьДанныеФайлаДляОткрытия(ЧатСсылка, ИдЧата, ИдСообщения, КэшКонтента, УникальныйИдентификатор);
    
    Если ДанныеФайла = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
    Если ДанныеФайла.ТипМедиа = ПредопределенноеЗначение("Перечисление.iga_ТипыМедиаФайлов.Документ") Тогда
        ПараметрыФайла = Новый ОписаниеПередаваемогоФайла(ДанныеФайла.ИмяФайла, ДанныеФайла.АдресХранилища);
        МассивФайлов = Новый Массив;
        МассивФайлов.Добавить(ПараметрыФайла);
		
        НачатьПолучениеФайловССервера(МассивФайлов);
    Иначе
		КаталогВременных = Ждать КаталогВременныхФайловАсинх();
		ПутьКПапке = iga_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(КаталогВременных, "iga_Bot_Media");
		
		Ждать СоздатьКаталогАсинх(ПутьКПапке); 
		
		ЧистоеИмя = iga_ОбщегоНазначенияКлиентСервер.ИдеальноеИмяФайла(ДанныеФайла.ИмяФайла);
		ИмяДляСохранения = ИдСообщения + "_" + ЧистоеИмя;
		
		ПутьКФайлу = iga_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(ПутьКПапке, ИмяДляСохранения);
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ДанныеФайла.АдресХранилища);
		
		Попытка
			Ждать ДвоичныеДанные.ЗаписатьАсинх(ПутьКФайлу);
			
			Если ВоспроизведениеКонтентаВнутри() Тогда
		        ПараметрыФормы = Новый Структура;
		        ПараметрыФормы.Вставить("АдресМедиа", ДанныеФайла.АдресХранилища);
		        ПараметрыФормы.Вставить("ТипМедиа",   ДанныеФайла.ТипМедиа);
		        ПараметрыФормы.Вставить("ИмяФайла",   ДанныеФайла.ИмяФайла);
		        
		        ОткрытьФорму("Обработка.iga_ChatBot.Форма.ПросмотрМедиа", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе
				ЗапуститьПриложениеАсинх(ПутьКФайлу, КаталогВременных);
			КонецЕсли;
			
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось открыть файл: " + ОписаниеОшибки();
			Сообщение.Сообщить();
		КонецПопытки;    
	КонецЕсли;
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайлаДляОткрытия(ЧатСсылка, ИдЧата, ИдСообщения, КэшКонтента, УникальныйИдентификаторФормы)
	
	КэшЧата = КэшКонтента.Получить(ЧатСсылка);
	Если КэшЧата = Неопределено Тогда
		КэшЧата = Новый Соответствие;
		КэшКонтента.Вставить(ЧатСсылка, КэшЧата);
	КонецЕсли;
	
	ДанныеКонтента = КэшЧата.Получить(ИдСообщения);
	
	Если ДанныеКонтента = Неопределено Или ДанныеКонтента.Адрес = "" Тогда
		
		Бот = Обработки.iga_ChatBot.Создать();
		Бот.ИнициализацияОсновныхПараметров();
		
		Бот.ВыполнитьПервичнуюЗагрузкуФайла(ИдЧата, ИдСообщения);
		
		ДанныеФайла = iga_РаспределениеСервер.ПолучитьДвоичныеДанныеФайла(ИдСообщения);
		
		Если ДанныеФайла = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ДвоичныеДанные = ДанныеФайла.ДвоичныеДанные;
		
		ДанныеРегистра = РегистрыСведений.iga_ПрикрепленныеФайлы.Получить(Новый Структура("IDСообщения", ИдСообщения));
		
		АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификаторФормы);
		Инфо = Новый Структура("ТипМедиа, ИмяФайла, URLЗагрузки");
		ЗаполнитьЗначенияСвойств(Инфо, ДанныеРегистра);
		КэшЧата.Вставить(ИдСообщения, Новый Структура("Адрес, Инфо, ДатаКэша, URLЗагрузки", 
			АдресХранилища, Инфо, ТекущаяДата(), ДанныеРегистра.URLЗагрузки));
		
	Иначе
		АдресХранилища = ДанныеКонтента.Адрес;
		Инфо = ДанныеКонтента.Инфо;		
	КонецЕсли;
    Результат = Новый Структура;
    Результат.Вставить("АдресХранилища", АдресХранилища);
    Результат.Вставить("ТипМедиа",      Инфо.ТипМедиа);
    Результат.Вставить("ИмяФайла",      Инфо.ИмяФайла);
    Результат.Вставить("URLЗагрузки",      Инфо.URLЗагрузки);
    
    Возврат Результат;
    
КонецФункции

&НаКлиенте
Асинх Процедура ОчиститьВременнуюПапкуМедиа()
	
	КаталогФайлов = Ждать КаталогВременныхФайловАсинх();
	
	ПутьКПапке = iga_ОбщегоНазначенияКлиентСервер.ОбъединитьПути(КаталогФайлов, "iga_Bot_Media");
	МассивФайлов = Ждать НайтиФайлыАсинх(ПутьКПапке, "*.*");
	
	Для Каждого Файл Из МассивФайлов Цикл
		Попытка
			УдалитьФайлыАсинх(Файл.ПолноеИмя);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ОчиститьВременнуюПапкуМедиа();
КонецПроцедуры

&НаКлиенте
Процедура СписокЧатовИсторияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокЧатовИсторияПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокЧатовИсторияПриАктивизацииСтроки(Элемент)
	
    ОбновитьОкноДиалога();
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеСтраницыЧатов()
	
	ТекущаяСтраницаОбщие = Элементы.СтраницыСпискиЧатов.ТекущаяСтраница;
	ТекущаяСтраницаАктивные = Элементы.СтраницыАктивные.ТекущаяСтраница;
	
	СчетчикСекунд = 0;
	
	Если ТекущаяСтраницаОбщие = Элементы.СтраницаАктивныеОбщая Тогда
		
		Если ТекущаяСтраницаАктивные = Элементы.СтраницаАктивныеЧаты Тогда
			ТекущаяСтраницаЧатов = СтраницаАктивные();
			Элементы.СписокЧатов.Обновить();
		Иначе
			ТекущаяСтраницаЧатов = СтраницаОжидающие();
			Элементы.СписокОжидающих.Обновить();
		КонецЕсли;
	ИначеЕсли ТекущаяСтраницаОбщие = Элементы.СтраницаИсторияЧатов Тогда
		ТекущаяСтраницаЧатов = СтраницаИстория();
		Элементы.СписокЧатовИстория.Обновить();
	ИначеЕсли ТекущаяСтраницаОбщие = Элементы.СтраницаУточняющиеЧаты Тогда
		ТекущаяСтраницаЧатов = СтраницаУточнение();
		Элементы.СписокЧатовТребуютУточнения.Обновить();
	Иначе
		ТекущаяСтраницаЧатов = СтраницаЗаписи();
		Элементы.СписокЧатовОтмененныхПереносовЗаписей.Обновить();
		ЕстьОповещение = Ложь;
	КонецЕсли; 
	
	Если Не ТекущаяСтраницаЧатов = СтраницаЗаписи() Тогда
		ЕстьОповещение = Ложь;
	КонецЕсли;
	
	Элементы.ТекстДиалогаHTML.Документ.defaultView.clearMessages();
	ОбновитьОкноДиалога();
	УстановитьДоступностьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура СтраницыЧатовПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПриСменеСтраницыЧатов();
КонецПроцедуры

&НаКлиенте
Процедура ПриниматьНовыеЧатыПриИзменении(Элемент)
	ИзменитьПриниматьНовыеЧаты(ТекущийОператор, ПриниматьНовыеЧаты);
КонецПроцедуры

&НаКлиенте
Процедура ОператорСписковПриИзменении(Элемент)
	
	СписокЧатов.Параметры.УстановитьЗначениеПараметра("ТекущийОператор", ОператорСписков);
	ОбновитьОкноДиалога();
	УстановитьДоступностьЭлементов(); 
	ЗаполнитьКоличествоЧатов();

КонецПроцедуры

&НаКлиенте
Асинх Функция ПодтверждениеОперации(НазваниеОперации)
	
	Ответ = Ждать ВопросАсинх("Продолжить выполнение операции?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, НазваниеОперации, КодВозвратаДиалога.Нет);
	
	Возврат ?(Ответ = КодВозвратаДиалога.Да, Истина, Ложь);
	
КонецФункции

&НаКлиенте
Процедура СписокЧатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокЧатовИсторияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПрикрепитьФайл(Команда)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок = "Выберите прикрепляемый файл";
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Каталог = Ждать КаталогДокументовАсинх();
	МассивФайлов = Ждать ДиалогВыбораФайла.ВыбратьАсинх();
	
	Если МассивФайлов = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ПутьКПрикрепленномуФайлу = МассивФайлов[0];
	
	Файл = Новый Файл(ПутьКПрикрепленномуФайлу);
	РасширениеПрикрепляемогоФайла = Файл.Расширение;
	ИмяПрикрепляемогоФайла = Файл.ИмяБезРасширения;
	
	Элементы.ОткрепитьФайл.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрепитьФайл(Команда)
	
	ПутьКПрикрепленномуФайлу = "";
	РасширениеПрикрепляемогоФайла = "";
	Элементы.ОткрепитьФайл.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЧатовТребуютУточненияПриАктивизацииСтроки(Элемент)
	
    ОбновитьОкноДиалога();
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЧатовТребуютУточненияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЧатПоНомеруТелефона(НомерТелефона)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_Чаты.Ссылка КАК Ссылка,
	               |	ЕСТЬNULL(iga_ОчередьРаспределения.Статус, &СтатусЗавершен) КАК Статус
	               |ИЗ
	               |	Справочник.iga_Чаты КАК iga_Чаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |		ПО (iga_ОчередьРаспределения.Чат = iga_Чаты.Ссылка)
	               |ГДЕ
	               |	iga_Чаты.Идентификатор ПОДОБНО ""%"" + &Идентификатор + ""%""";
	Запрос.УстановитьПараметр("Идентификатор", НомерТелефона);
	Запрос.УстановитьПараметр("СтатусЗавершен", Перечисления.iga_СтатусыОчереди.Завершен);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Если Не Выборка.Статус = Перечисления.iga_СтатусыОчереди.Завершен Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Чат в работе!";
			Сообщение.Сообщить();
			Возврат Неопределено;
		КонецЕсли;
		
		ЧатСсылка = Выборка.Ссылка;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		Чат = Справочники.iga_Чаты.СоздатьЭлемент();
		Чат.Идентификатор = НомерТелефона + "@c.us";
		Чат.Наименование = Чат.Идентификатор;
		Чат.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		ЧатСсылка = Чат.Ссылка;
	КонецЕсли;
	
	Возврат ЧатСсылка;
	
КонецФункции

&НаКлиенте
Процедура СоздатьЧатИИнициализироватьНовыйДиалог(НомерТелефона)
	
	ЧатСсылка = ПолучитьЧатПоНомеруТелефона(НомерТелефона);
	
	Если ЧатСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Новый Структура("ИдЧата, Чат, Статус", 
		НомерТелефона + "@c.us", ЧатСсылка, ПредопределенноеЗначение("Перечисление.iga_СтатусыОчереди.Завершен"));
		
	ИнициализацияВыбораПосле24Часа(ТекущиеДанные, ЧатСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура iga_ПослеВводаНомераТелефона(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомерТелефона = РезультатЗакрытия;
	
	СоздатьЧатИИнициализироватьНовыйДиалог(НомерТелефона);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьДиалогПоНомеру(Команда)
	
	Оповещение = Новый ОписаниеОповещения("iga_ПослеВводаНомераТелефона", ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.iga_ФормаВводаНомераТелефона", , ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекстИзБуфераОбмена()
	Текст = "";
	Попытка
		// Используем системный COM-объект Windows для доступа к буферу
		ОбъектHTML = Новый COMОбъект("htmlfile");
		Текст = ОбъектHTML.parentWindow.clipboardData.getData("text");
	Исключение
		// Если что-то пошло не так (например, запуск на Linux или Mac), 
		// молча возвращаем пустоту, чтобы не вызывать ошибку
		Текст = "";
	КонецПопытки;
	
	Возврат Текст;
КонецФункции

&НаКлиенте
Процедура ВставитьТекст(Команда)
	
	// 1. Читаем текст из буфера ОС
	ТекстБуфера = ПолучитьТекстИзБуфераОбмена();
	
	// 2. Если в буфере действительно есть текст, прокидываем его в наш HTML
	Если ЗначениеЗаполнено(ТекстБуфера) Тогда
		ДокументHTML = Элементы.ТекстовоеСообщение.Документ;
		
		Если ДокументHTML <> Неопределено Тогда
			// Функция insertTextAtCaret сама вернет фокус редактору и вставит текст куда нужно
			ДокументHTML.defaultView.insertTextAtCaret(ТекстБуфера);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЧатовОтмененныхПереносовЗаписейПриАктивизацииСтроки(Элемент)
	
    ОбновитьОкноДиалога();
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтработатьЗаписьНаСервере(Чат, Оператор, Заявка, Работа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ОчередьРаспределения.Чат КАК Чат
	               |ИЗ
	               |	РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |ГДЕ
	               |	iga_ОчередьРаспределения.Оператор = &Оператор
	               |	И iga_ОчередьРаспределения.Чат = &Чат
	               |	И iga_ОчередьРаспределения.Статус = &Статус";
	Запрос.УстановитьПараметр("Чат", Чат);
	Запрос.УстановитьПараметр("Оператор", Оператор);
	Запрос.УстановитьПараметр("Статус", Перечисления.iga_СтатусыОчереди.ВРаботе);
	Если Запрос.Выполнить().Пустой() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Перед отработкой необходимо взять чат в работу!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.iga_СтатусыПодтвержденияСтрокЗаявок.СоздатьМенеджерЗаписи();
	Запись.Заявка = Заявка;
	Запись.Работа = Работа;
	Запись.Прочитать();
	Запись.Обработано = Истина;
	Запись.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеЗакрытияФормыОтработки(Результат, ДопПараметры) Экспорт
	
	Элементы.СписокЧатовОтмененныхПереносовЗаписей.Обновить();
	
КонецПроцедуры
	
&НаКлиенте
Процедура НеподтвержденныеЗаписи(Команда)

	ТекущийЧат = Элементы.СписокЧатов.ТекущиеДанные.Чат;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеЗакрытияФормыОтработки", ЭтаФорма);
	
	ОткрытьФорму("Обработка.iga_ChatBot.Форма.ПереченьОтменыПереноса", Новый Структура("Чат", ТекущийЧат), ЭтаФорма,,,,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЧатовОтмененныхПереносовЗаписейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.СписокЧатовОтмененныхПереносовЗаписей.ТекущиеДанные;
	
	ПоказатьЗначение(, ТекущаяСтрока.Заявка);

КонецПроцедуры

&НаКлиенте
Асинх Процедура ОтправитьШаблон(Команда)
	
	ТекущиеДанные = ПолучитьТекущиеДанные();
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат; 
	КонецЕсли; 
	
	Если Не ТекущаяСтраницаЧатов = СтраницаАктивные()
		И Не ТекущаяСтраницаЧатов = СтраницаУточнение() Тогда
		Ответ = Ждать ВопросАсинх("Диалог не начат. Если пользователь ответит на шаблон, то попадет в общую очередь. Продолжить отправку шаблона?",
			РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "Отправка шаблона", КодВозвратаДиалога.Нет);
			
		Если Не Ответ = КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЧатСсылка = ТекущиеДанные.Чат;
	
	
	ИнициализацияВыбораПосле24Часа(ТекущиеДанные, ЧатСсылка, Истина); 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОжидающихПриАктивизацииСтроки(Элемент)
	
	ОбновитьОкноДиалога();
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОжидающихВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СтраницыАктивныеПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПриСменеСтраницыЧатов();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЯзыкЧата(ЧатСсылка)
	
	Возврат iga_МетодыРаботыСБотом.ПолучитьЗначениеПараметраОбщения(ЧатСсылка, "Язык", Неопределено);
	
КонецФункции

&НаСервереБезКонтекста
Процедура СменитьЯзыкНаСервере(ЧатСсылка, ЯзыкЧата)
	
	iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ЧатСсылка, "Язык", ЯзыкЧата);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеВыбораЯзыка(ЯзыкЧата, ДопПараметры) Экспорт 
	
	Если ЯзыкЧата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СменитьЯзыкНаСервере(ДопПараметры.ЧатСсылка, ЯзыкЧата);
	
	ПоказатьПредупреждение(, "Язык сменен на """ + ЯзыкЧата + """
							|Все автоматические сообщения пользователю будут отправляться на выбранном языке.");

КонецПроцедуры


&НаКлиенте
Функция ПолучитьТекущиеДанные()
	
	Если ТекущаяСтраницаЧатов = СтраницаАктивные() Тогда
		ТекущаяСтрока = Элементы.СписокЧатов.ТекущиеДанные;
	ИначеЕсли ТекущаяСтраницаЧатов = СтраницаИстория() Тогда
		ТекущаяСтрока = Элементы.СписокЧатовИстория.ТекущиеДанные;
	ИначеЕсли ТекущаяСтраницаЧатов = СтраницаОжидающие() Тогда
		ТекущаяСтрока = Элементы.СписокОжидающих.ТекущиеДанные;
	ИначеЕсли ТекущаяСтраницаЧатов = СтраницаУточнение() Тогда
		ТекущаяСтрока = Элементы.СписокЧатовТребуютУточнения.ТекущиеДанные;
	Иначе
		ТекущаяСтрока = Элементы.СписокЧатовОтмененныхПереносовЗаписей.ТекущиеДанные;
	КонецЕсли;	
	
	Возврат ТекущаяСтрока;
	
КонецФункции

&НаКлиенте
Процедура СменитьЯзыкДиалога(Команда)
	
	ТекущаяСтрока = ПолучитьТекущиеДанные();
	
	Если ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЧатСсылка = ТекущаяСтрока.Чат;
	
	ЯзыкЧата = ПолучитьЯзыкЧата(ЧатСсылка);
	
	ПараметрыЗакрытия = Новый Структура("ЧатСсылка",
		ЧатСсылка);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВыбораЯзыка", ЭтаФорма, ПараметрыЗакрытия);
	
	ОткрытьФорму("ОбщаяФорма.iga_ФормаВыбораЯзыка", Новый Структура("ТекущийЯзык", ЯзыкЧата), ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКлиента(Чат)
	
	Возврат iga_ОбработкаДанныхПоЧатамСервер.ПолучитьКлиентаПоЧату(Чат);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьКарточкуПациента(Команда)
	
	ТекущиеДанные =  ПолучитьТекущиеДанные();
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КлиентСсылка = ПолучитьКлиента(ТекущиеДанные.Чат);
	
	Если КлиентСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Клиенты.ФормаОбъекта", Новый Структура("Ключ", КлиентСсылка));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиЧатПоСообщениямНаСервере(Знач СтрокаПоиска)
	
	// 1. Очищаем строку от спецсимволов
	СимволыДляУдаления = "()[]{}\/|<>,.:;?!+-=""'*~_";
	Для Индекс = 1 По СтрДлина(СимволыДляУдаления) Цикл
		СтрокаПоиска = СтрЗаменить(СтрокаПоиска, Сред(СимволыДляУдаления, Индекс, 1), " ");
	КонецЦикла;
	
	СтрокаПоиска = СокрЛП(СтрокаПоиска);
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// 2. Разбиваем на слова и отбираем только ЗНАЧИМЫЕ (> 2 символов)
	МассивСлов = СтрРазделить(СтрокаПоиска, " ", Ложь);
	МассивЗначимыхСлов = Новый Массив;
	
	Для Каждого Слово Из МассивСлов Цикл
		Если СтрДлина(Слово) > 2 Тогда
			МассивЗначимыхСлов.Добавить(Слово);
		КонецЕсли;
		
		// Нам хватит 7 длинных слов для точного поиска, остальное отбрасываем
		Если МассивЗначимыхСлов.Количество() = 7 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Если пользователь ввел только предлоги или цифры (например, "в 2")
	Если МассивЗначимыхСлов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// 3. Формируем чистую строку для точного поиска
	// Получится: "Маммография проекциях снимка Ажибаев"
	СтрокаПоискаОчищенная = СтрСоединить(МассивЗначимыхСлов, " ");
	
	Попытка
		СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоискаОчищенная, 100);
		СписокПоиска.ОбластьПоиска.Добавить(Метаданные.РегистрыСведений.iga_ИсторияСообщений);
		СписокПоиска.ПерваяЧасть();
		
		// 4. Если точный поиск ничего не дал, ищем по маске (со звездочками)
		Если СписокПоиска.Количество() = 0 Тогда
			// Так как коротких слов в массиве больше нет, смело лепим звездочки ко всем!
			// Получится: "Маммография* проекциях* снимка* Ажибаев*"
			СтрокаПоискаСЗвездочкой = СтрСоединить(МассивЗначимыхСлов, "* ") + "*";
			
			СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоискаСЗвездочкой, 100);
			СписокПоиска.ОбластьПоиска.Добавить(Метаданные.РегистрыСведений.iga_ИсторияСообщений);
			СписокПоиска.ПерваяЧасть();
		КонецЕсли;
		
		НайденныеЧаты = Новый СписокЗначений;
		
		Для Каждого Результат Из СписокПоиска Цикл
			НайденныеЧаты.Добавить(Результат.Значение.Чат);
		КонецЦикла;                                       
		
		Возврат НайденныеЧаты;
		
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Асинх Процедура НайтиЧатПоСообщениям(Команда)
	
	СтрокаПоиска = Ждать ВвестиСтрокуАсинх(, "Введите слово для поиска", 100);
	
	Если Не ЗначениеЗаполнено(СтрокаПоиска) Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеЧаты = НайтиЧатПоСообщениямНаСервере(СтрокаПоиска);
	
	Если НайденныеЧаты = Неопределено Или НайденныеЧаты.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Чаты с таким содержанием не найдены.");
	Иначе
		СписокЧатовИстория.Отбор.Элементы.Очистить();
		ЭлементОтбора = СписокЧатовИстория.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Чат");
		ЭлементОтбора.ПравоеЗначение = НайденныеЧаты;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СбросПоиска(Команда)
	СписокЧатовИстория.Отбор.Элементы.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСобытие(Команда)
	
	ТекущиеДанные = ПолучитьТекущиеДанные();
	
	ПараметрыОткрытия = Новый Структура("Основание", 
		Новый Структура("Клиент", 
		iga_ОбработкаДанныхПоЧатамСервер.ПолучитьКлиентаПоЧату(ТекущиеДанные.Чат)));
		
	ОткрытьФорму("Документ.Событие.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор,,,
		, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	
КонецПроцедуры



