#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Старый режим 2016, требующий настройки оборудования в форме Номенклатуры
	ИспользуетсяDCMTK = DICOMОбщий.ИспользуетсяСтараяВерсия();
	
	Если ИспользуетсяDCMTK Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаDCMTKОборудование;
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаОборудованиеРегистр;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновлениеФормыНоменклатуры", Объект.Ссылка);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура DICOMModalityНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("РежимВыбора, ТекущаяСтрока", Истина, Объект.DICOMModality);
	ОткрытьФорму("Справочник.AETitles.Форма.ВыборМетодаИсследования", ПараметрыФормы, Элемент,
					ЭтотОбъект.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
						
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеDICOMПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		Элемент.ТекущаяСтрока.Оборудование = ПредопределенноеЗначение("Справочник.МедицинскоеОборудование.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеDICOMОборудованиеОчистка(Элемент, СтандартнаяОбработка)
	Элементы.ОборудованиеDICOM.ТекущиеДанные.Оборудование = ПредопределенноеЗначение("Справочник.МедицинскоеОборудование.ПустаяСсылка");
КонецПроцедуры

#КонецОбласти
