
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Параметры.ПрохождениеМедосмотра) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Открытие формы без ссылки на прохождение медосмотра невозможно.'"));
		Возврат;
	КонецЕсли;
	
	ПрохождениеМедосмотра = Параметры.ПрохождениеМедосмотра;
	ЗаполнитьТаблицыПроверок();
	
КонецПроцедуры

&НаСервере
Функция ТаблицаИнфекцийПоФактору230(ПМО, ВредныйФактор)
	
	Если ВредныйФактор.УИДЕГИСЗ = 211 Тогда
		МассивОграниченийФактора = ИнтеграцияЕГИСЗ_СЭМД.МассивОграниченийДиагнозовФактор23_230(ПМО.ПрофильРаботы);
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 212 Тогда
		МассивОграниченийФактора = ИнтеграцияЕГИСЗ_СЭМД.МассивОграниченийДиагнозовФактор24_230();
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 213 Тогда
		МассивОграниченийФактора = ИнтеграцияЕГИСЗ_СЭМД.МассивОграниченийДиагнозовФактор25_230();
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 214 Тогда
		МассивОграниченийФактора = ИнтеграцияЕГИСЗ_СЭМД.МассивОграниченийДиагнозовФактор26_230();
	КонецЕсли;
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("Диагноз");
	ТаблицаРезультат.Колонки.Добавить("Дата");
	
	Для Каждого ИнфекционноеЗаболевание Из ПМО.ИнфекционныеЗаболевания Цикл
		
		Если Не ЗначениеЗаполнено(ИнфекционноеЗаболевание.Диагноз) 
			Или МассивОграниченийФактора.Найти(ИнфекционноеЗаболевание.Диагноз.КодДиагноза) = Неопределено 
		Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРез = ТаблицаРезультат.Добавить();
		СтрокаРез.Диагноз = ИнфекционноеЗаболевание.Диагноз;
		СтрокаРез.Дата = ИнфекционноеЗаболевание.Дата;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

&НаСервере
Функция ТаблицаВакцинацийПоФактору230(ПМО, ВредныйФактор, ЕстьПрививкаОтКори)
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("ГруппаЗаболеваний");
	ТаблицаРезультат.Колонки.Добавить("ДатаВакцинации");
	ТаблицаРезультат.Колонки.Добавить("НаименованиеПрививки");
	ТаблицаРезультат.Колонки.Добавить("Повторная");
	ТаблицаРезультат.Колонки.Добавить("ПорядковыйНомер");
	
	ЕстьЗаполненнаяСтрока = Ложь;
	
	Если ВредныйФактор.УИДЕГИСЗ = 211 Тогда
		СтрокаОграничений = ИнтеграцияЕГИСЗ_СЭМД.СтрокаОграниченийВакцинацииФактор23_230(ПМО.ПрофильРаботы);
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 212 Тогда
		СтрокаОграничений = ИнтеграцияЕГИСЗ_СЭМД.СтрокаОграниченийВакцинацииФактор24_230();
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 213 Тогда
		СтрокаОграничений = ИнтеграцияЕГИСЗ_СЭМД.СтрокаОграниченийВакцинацииФактор25_230();
	ИначеЕсли ВредныйФактор.УИДЕГИСЗ = 214 Тогда
		СтрокаОграничений = ИнтеграцияЕГИСЗ_СЭМД.СтрокаОграниченийВакцинацииФактор26_230();
	КонецЕсли;
	
	СтрокаОграничений = СтрЗаменить(СтрокаОграничений, " ", "");
	СтрокаОграничений = СтрЗаменить(СтрокаОграничений, Символы.ПС, "");
	МассивОграничений = СтрРазделить(СтрокаОграничений, ",", Ложь);
	ОграниченияВакцинацииУИДЕГИСЗ = Новый Массив;
	Для Каждого Ограничение Из МассивОграничений Цикл
		Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Ограничение) Тогда
			ОграниченияВакцинацииУИДЕГИСЗ.Добавить(Число(Ограничение));
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ПрофПрививка Из ПМО.ПрофилактическиеПрививки Цикл
		
		Если Не ЗначениеЗаполнено(ПрофПрививка.ГруппаЗаболеваний) 
			Или ОграниченияВакцинацииУИДЕГИСЗ.Найти(ПрофПрививка.ГруппаЗаболеваний.УИДЕГИСЗ) = Неопределено 
		Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРез = ТаблицаРезультат.Добавить();
		СтрокаРез.ГруппаЗаболеваний = ПрофПрививка.ГруппаЗаболеваний;
		СтрокаРез.ДатаВакцинации = ПрофПрививка.ДатаВакцинации;
		СтрокаРез.НаименованиеПрививки = ПрофПрививка.НаименованиеПрививки;
		СтрокаРез.Повторная = ПрофПрививка.Повторная;
		СтрокаРез.ПорядковыйНомер = ПрофПрививка.ПорядковыйНомер;
		
		Если ПрофПрививка.ГруппаЗаболеваний.УИДЕГИСЗ = 18 Тогда
			ЕстьПрививкаОтКори = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаРезультат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицыПроверок()
	
	ВредныеФакторыДокумента = ИнтеграцияЕГИСЗ_СЭМД.ВредныеФакторыДокумента(ПрохождениеМедосмотра);
	
	ЕстьФактор211 = Ложь;
	ЕстьФактор212 = Ложь;
	ЕстьФактор213 = Ложь;
	ЕстьФактор214 = Ложь;
	Для Каждого ВредныйФакторДокумента Из ВредныеФакторыДокумента Цикл
		
		Если ВредныйФакторДокумента.УИДЕГИСЗ = 211 Тогда
			ЕстьФактор211 = Истина;
			Фактор211 = ВредныйФакторДокумента;
		ИначеЕсли ВредныйФакторДокумента.УИДЕГИСЗ = 212 Тогда
			ЕстьФактор212 = Истина;
			Фактор212 = ВредныйФакторДокумента;
		ИначеЕсли ВредныйФакторДокумента.УИДЕГИСЗ = 213 Тогда
			ЕстьФактор213 = Истина;
			Фактор213 = ВредныйФакторДокумента;
		ИначеЕсли ВредныйФакторДокумента.УИДЕГИСЗ = 214 Тогда
			ЕстьФактор214 = Истина;
			Фактор214 = ВредныйФакторДокумента;
		КонецЕсли;
	КонецЦикла;
	
	ТипМедосмотра = ПрохождениеМедосмотра.ТипМедосмотра;
	
	Если ЕстьФактор211 Тогда
		ЕстьКритичныеОшибки = Ложь;
		ЗаполнитьФактор211(Фактор211, ЕстьКритичныеОшибки);
		УстановитьУсловноеОформление211();
		
		// Убираем картинку ошибки с фактора
		Если Не ЕстьКритичныеОшибки Тогда 
			Элементы.Фактор23.Картинка = Новый Картинка;
		КонецЕсли;
	Иначе
		Элементы.Фактор23.Видимость = Ложь;
	КонецЕсли;
	
	Если ЕстьФактор212 Тогда
		ЕстьКритичныеОшибки = Ложь;
		ЗаполнитьФактор212(Фактор212, ЕстьКритичныеОшибки);
		УстановитьУсловноеОформление212();
		
		// Убираем картинку ошибки с фактора
		Если Не ЕстьКритичныеОшибки Тогда 
			Элементы.Фактор24.Картинка = Новый Картинка;
		КонецЕсли;
	Иначе
		Элементы.Фактор24.Видимость = Ложь;
	КонецЕсли;
	
	Если ЕстьФактор213 Тогда
		ЕстьКритичныеОшибки = Ложь;
		ЗаполнитьФактор213(Фактор213, ЕстьКритичныеОшибки);
		УстановитьУсловноеОформление213();
		
		// Убираем картинку ошибки с фактора
		Если Не ЕстьКритичныеОшибки Тогда 
			Элементы.Фактор25.Картинка = Новый Картинка;
		КонецЕсли;
	Иначе
		Элементы.Фактор25.Видимость = Ложь;
	КонецЕсли;
	
	Если ЕстьФактор214 Тогда
		ЕстьКритичныеОшибки = Ложь;
		ЗаполнитьФактор214(Фактор214, ЕстьКритичныеОшибки);
		УстановитьУсловноеОформление214();
		
		// Убираем картинку ошибки с фактора
		Если Не ЕстьКритичныеОшибки Тогда 
			Элементы.Фактор26.Картинка = Новый Картинка;
		КонецЕсли;
	Иначе
		Элементы.Фактор26.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФактор211(Фактор211, ЕстьКритичныеОшибки)
	
	Если ЗначениеЗаполнено(ПрохождениеМедосмотра.ПрофильРаботы) Тогда 
		ПрофильРаботы = ПрохождениеМедосмотра.ПрофильРаботы;
		Элементы.НетПрофиляРаботы23.Видимость = Ложь;
	Иначе
		Элементы.ПрофильРаботы.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	ТаблицаИнфекцийПоФактору = ТаблицаИнфекцийПоФактору230(ПрохождениеМедосмотра, Фактор211);
	Если ТаблицаИнфекцийПоФактору.Количество() > 0 Тогда
		ЗначениеВРеквизитФормы(ТаблицаИнфекцийПоФактору, "ИнфекционныеЗаболевания23");
		Элементы.ОтсутствиеСведенийИнфекции23.Видимость = Ложь;
	Иначе
		Элементы.ОтсутствиеСведенийИнфекции23.Видимость = Истина;
		Элементы.ИнфекционныеЗаболевания23.Видимость = Ложь;
	КонецЕсли;
	
	ЕстьПрививкаОтКори211 = Ложь;
	
	ТаблицаВакцинацийПоФактору = ТаблицаВакцинацийПоФактору230(ПрохождениеМедосмотра, Фактор211, ЕстьПрививкаОтКори211);
	Если ТаблицаВакцинацийПоФактору.Количество() > 0 Тогда
		ЗначениеВРеквизитФормы(ТаблицаВакцинацийПоФактору, "Вакцинации23");
		Элементы.ОтсутствиеСведенийВакцинации23.Видимость = Ложь;
	Иначе
		Элементы.ОтсутствиеСведенийВакцинации23.Видимость = Истина;
		Элементы.Вакцинации23.Видимость = Ложь;
	КонецЕсли;
	
	ЗаключениеПоФактору23 = ИнтеграцияЕГИСЗ_СЭМД.ЗаключениеПоФакторуПМО(Фактор211, ПрохождениеМедосмотра);
	Если ЗначениеЗаполнено(ЗаключениеПоФактору23) Тогда
		Если ЗаключениеПоФактору23.УИДЕГИСЗ = 71 Тогда
			Элементы.НетЗаключения23.Видимость = Ложь;
			Элементы.ТекстЗаключенияНеВыявлено23.Видимость = Ложь;
			Элементы.ТекстЗаключенияВыявлено23.Видимость = Истина;
		Иначе
			Элементы.НетЗаключения23.Видимость = Ложь;
			Элементы.ТекстЗаключенияНеВыявлено23.Видимость = Истина;
			Элементы.ТекстЗаключенияВыявлено23.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.НетЗаключения23.Видимость = Истина;
		Элементы.ТекстЗаключенияНеВыявлено23.Видимость = Ложь;
		Элементы.ТекстЗаключенияВыявлено23.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	ДанныеКонсультаций = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьДанныеСвязанныхОсмотровВрачейСпециалистов230(ПрохождениеМедосмотра);
	Если ДанныеКонсультаций.Количество() = 0 Тогда
		Элементы.Консультации23.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	Консультации23.Очистить();
	Для Каждого Консультация Из ДанныеКонсультаций Цикл
		СтрокаКонс = Консультации23.Добавить();
		СтрокаКонс.Врач = Консультация.Сотрудник;
		СтрокаКонс.Должность = Консультация.СвязьСКлассификатором;
		СтрокаКонс.ДатаВыполнения = Консультация.ДатаВыполненияДействияМедосмотра;
		СтрокаКонс.ВыявленыПротивопоказания = Консультация.ВыявленыПротивопоказания;
		СтрокаКонс.Заключение = Консультация.Заключение;
		СтрокаКонс.СНИЛС = СтроковыеФункцииКлиентСервер.ПолучитьЦифрыСтроки(Консультация.Сотрудник.СНИЛС);
		СтрокаКонс.Прием = Консультация.ПриемСсылка;
		
		Если ЗначениеЗаполнено(Консультация.Сотрудник)
			И ЗначениеЗаполнено(Консультация.СвязьСКлассификатором)
			И ЗначениеЗаполнено(Консультация.ДатаВыполненияДействияМедосмотра)
			И ИнтеграцияЕГИСЗ_СЭМД.ДатаВ20Или21Веке(Консультация.ДатаВыполненияДействияМедосмотра)
		Тогда 
			СтрокаКонс.СтрокаЗаполненаКорректно = 2;
		Иначе
			СтрокаКонс.СтрокаЗаполненаКорректно = 1;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
		
		// Убираем видимость предупреждений у заполненных строк
		Если ЗначениеЗаполнено(Консультация.СвязьСКлассификатором) Тогда
			Если Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 24 Тогда
				Элементы.НетДерматовенеролога23.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведениядерматовенеролога23.Видимость = Истина;
				КонецЕсли;
			ИначеЕсли Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 53 Тогда
				Элементы.НетОториноларинголога23.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведенияоториноларинголога23.Видимость = Истина;
				КонецЕсли;
			ИначеЕсли Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 100 Тогда
				Элементы.НетСтоматолога23.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведенияСтоматолога23.Видимость = Истина;
				КонецЕсли;
			ИначеЕсли Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 109 Тогда
				Элементы.НетТерапевта23.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведенияТерапевта23.Видимость = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// Должно быть ровно 4 осмотра
	Если Консультации23.Количество() <> 4 Тогда
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	// Лабораторные исследования
	ТаблицаДляПроверки = Неопределено;
	ДанныеЛабИсследований = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьДанныеЛабораторныхИсследований230(ПрохождениеМедосмотра, Фактор211, ЕстьПрививкаОтКори211, ТаблицаДляПроверки);
	Если ДанныеЛабИсследований.Количество() = 0 Тогда
		Элементы.ЛабИсследования23.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	Для Каждого ЛабИсследование Из ТаблицаДляПроверки Цикл
		Если ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10268 Тогда
			Элементы.НетГельминтов23.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10479 Тогда
			Элементы.НетКишИнфекций23.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10506 Тогда
			Элементы.НетСифилиса23.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10507 Тогда
			Элементы.НетБрюшногоТифа23.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10508 Тогда
			Элементы.НетСтафилококка23.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10509 Тогда
			Элементы.НетГонореи23.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10510 Тогда
			Элементы.НетКори23.Видимость = Истина;
			Элементы.ПримечаниеКорь23.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ЛабИсследования23.Очистить();
	Для Каждого ЛабИсследование Из ДанныеЛабИсследований Цикл
		СтрокаЛабИссл = ЛабИсследования23.Добавить();
		СтрокаЛабИссл.ИсследованиеПоКлассификатору = ЛабИсследование.СвязьСКлассификатором;
		СтрокаЛабИссл.ДатаВыполнения = ЛабИсследование.ДатаВыполненияДействияМедосмотра;
		СтрокаЛабИссл.ВыявленыПротивопоказания = ЛабИсследование.ВыявленыПротивопоказания;
		СтрокаЛабИссл.Заключение = ЛабИсследование.Заключение;
		СтрокаЛабИссл.Прием = ЛабИсследование.ПриемСсылка;
		СтрокаЛабИссл.ТитрСерологическогоОбследования = ЛабИсследование.ТитрСерологическогоОбследования;
		
		Если ЗначениеЗаполнено(ЛабИсследование.СвязьСКлассификатором) 
			И ЗначениеЗаполнено(ЛабИсследование.ДатаВыполненияДействияМедосмотра)
			И ИнтеграцияЕГИСЗ_СЭМД.ДатаВ20Или21Веке(ЛабИсследование.ДатаВыполненияДействияМедосмотра)
		Тогда 
			СтрокаЛабИссл.СтрокаЗаполненаКорректно = 2;
		Иначе
			СтрокаЛабИссл.СтрокаЗаполненаКорректно = 1;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// Инструментальные исследования (только одна строка)
	ДанныеИнстрИсследований = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьДанныеИнструментальногоИсследования230(ПрохождениеМедосмотра, Фактор211);
	Если ДанныеИнстрИсследований.Количество() = 0 Тогда
		Элементы.ИнстрИсследования23.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	Иначе
		Элементы.НетИнстрИсследований23.Видимость = Ложь;
	КонецЕсли;
	
	ИнстрИсследования23.Очистить();
	Для Каждого ИнстрИсследование Из ДанныеИнстрИсследований Цикл
		СтрокаИнстрИссл = ИнстрИсследования23.Добавить();
		СтрокаИнстрИссл.ИсследованиеПоКлассификатору = ИнстрИсследование.СвязьСКлассификатором;
		СтрокаИнстрИссл.ДатаВыполнения = ИнстрИсследование.ДатаВыполненияДействияМедосмотра;
		СтрокаИнстрИссл.ВыявленыПротивопоказания = ИнстрИсследование.ВыявленыПротивопоказания;
		СтрокаИнстрИссл.Заключение = ИнстрИсследование.Заключение;
		СтрокаИнстрИссл.Прием = ИнстрИсследование.ПриемСсылка;
		
		Если ЗначениеЗаполнено(ИнстрИсследование.СвязьСКлассификатором) 
			И ЗначениеЗаполнено(ИнстрИсследование.ДатаВыполненияДействияМедосмотра)
			И ИнтеграцияЕГИСЗ_СЭМД.ДатаВ20Или21Веке(ИнстрИсследование.ДатаВыполненияДействияМедосмотра)
		Тогда 
			СтрокаИнстрИссл.СтрокаЗаполненаКорректно = 2;
		Иначе
			СтрокаИнстрИссл.СтрокаЗаполненаКорректно = 1;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФактор212(Фактор212, ЕстьКритичныеОшибки)
	
	ТаблицаИнфекцийПоФактору = ТаблицаИнфекцийПоФактору230(ПрохождениеМедосмотра, Фактор212);
	Если ТаблицаИнфекцийПоФактору.Количество() > 0 Тогда
		ЗначениеВРеквизитФормы(ТаблицаИнфекцийПоФактору, "ИнфекционныеЗаболевания24");
		Элементы.ОтсутствиеСведенийИнфекции24.Видимость = Ложь;
	Иначе
		Элементы.ОтсутствиеСведенийИнфекции24.Видимость = Истина;
		Элементы.ИнфекционныеЗаболевания24.Видимость = Ложь;
	КонецЕсли;
	
	ЕстьПрививкаОтКори212 = Ложь;
	
	ТаблицаВакцинацийПоФактору = ТаблицаВакцинацийПоФактору230(ПрохождениеМедосмотра, Фактор212, ЕстьПрививкаОтКори212);
	Если ТаблицаВакцинацийПоФактору.Количество() > 0 Тогда
		ЗначениеВРеквизитФормы(ТаблицаВакцинацийПоФактору, "Вакцинации24");
		Элементы.ОтсутствиеСведенийВакцинации24.Видимость = Ложь;
	Иначе
		Элементы.ОтсутствиеСведенийВакцинации24.Видимость = Истина;
		Элементы.Вакцинации24.Видимость = Ложь;
	КонецЕсли;
	
	ЗаключениеПоФактору24 = ИнтеграцияЕГИСЗ_СЭМД.ЗаключениеПоФакторуПМО(Фактор212, ПрохождениеМедосмотра);
	Если ЗначениеЗаполнено(ЗаключениеПоФактору24) Тогда
		Если ЗаключениеПоФактору24.УИДЕГИСЗ = 71 Тогда
			Элементы.НетЗаключения24.Видимость = Ложь;
			Элементы.ТекстЗаключенияНеВыявлено24.Видимость = Ложь;
			Элементы.ТекстЗаключенияВыявлено24.Видимость = Истина;
		Иначе
			Элементы.НетЗаключения24.Видимость = Ложь;
			Элементы.ТекстЗаключенияНеВыявлено24.Видимость = Истина;
			Элементы.ТекстЗаключенияВыявлено24.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.НетЗаключения24.Видимость = Истина;
		Элементы.ТекстЗаключенияНеВыявлено24.Видимость = Ложь;
		Элементы.ТекстЗаключенияВыявлено24.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	ДанныеКонсультаций = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьДанныеСвязанныхОсмотровВрачейСпециалистов230(ПрохождениеМедосмотра);
	Если ДанныеКонсультаций.Количество() = 0 Тогда
		Элементы.Консультации24.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	Консультации24.Очистить();
	Для Каждого Консультация Из ДанныеКонсультаций Цикл
		СтрокаКонс = Консультации24.Добавить();
		СтрокаКонс.Врач = Консультация.Сотрудник;
		СтрокаКонс.Должность = Консультация.СвязьСКлассификатором;
		СтрокаКонс.ДатаВыполнения = Консультация.ДатаВыполненияДействияМедосмотра;
		СтрокаКонс.ВыявленыПротивопоказания = Консультация.ВыявленыПротивопоказания;
		СтрокаКонс.Заключение = Консультация.Заключение;
		СтрокаКонс.СНИЛС = СтроковыеФункцииКлиентСервер.ПолучитьЦифрыСтроки(Консультация.Сотрудник.СНИЛС);
		СтрокаКонс.Прием = Консультация.ПриемСсылка;
		
		Если ЗначениеЗаполнено(Консультация.Сотрудник) 
			И ЗначениеЗаполнено(Консультация.СвязьСКлассификатором) 
			И ЗначениеЗаполнено(Консультация.ДатаВыполненияДействияМедосмотра)
			И ИнтеграцияЕГИСЗ_СЭМД.ДатаВ20Или21Веке(Консультация.ДатаВыполненияДействияМедосмотра)
		Тогда 
			СтрокаКонс.СтрокаЗаполненаКорректно = 2;
		Иначе
			СтрокаКонс.СтрокаЗаполненаКорректно = 1;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
		
		// Убираем видимость предупреждений у заполненных строк
		Если ЗначениеЗаполнено(Консультация.СвязьСКлассификатором) Тогда
			Если Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 24 Тогда
				Элементы.НетДерматовенеролога24.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведениядерматовенеролога24.Видимость = Истина;
				КонецЕсли;
			ИначеЕсли Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 53 Тогда
				Элементы.НетОториноларинголога24.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведенияоториноларинголога24.Видимость = Истина;
				КонецЕсли;
			ИначеЕсли Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 100 Тогда
				Элементы.НетСтоматолога24.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведенияСтоматолога24.Видимость = Истина;
				КонецЕсли;
			ИначеЕсли Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 109 Тогда
				Элементы.НетТерапевта24.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведенияТерапевта24.Видимость = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли
	КонецЦикла;
	
	// Должно быть ровно 4 осмотра
	Если Консультации24.Количество() <> 4 Тогда
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	// Лабораторные исследования
	ТаблицаДляПроверки = Неопределено;
	ДанныеЛабИсследований = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьДанныеЛабораторныхИсследований230(ПрохождениеМедосмотра, Фактор212, ЕстьПрививкаОтКори212, ТаблицаДляПроверки);
	Если ДанныеЛабИсследований.Количество() = 0 Тогда
		Элементы.ЛабИсследования24.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	Для Каждого ЛабИсследование Из ТаблицаДляПроверки Цикл
		Если ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10268 Тогда
			Элементы.НетГельминтов24.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10479 Тогда
			Элементы.НетКишИнфекций24.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10506 Тогда
			Элементы.НетСифилиса24.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10507 Тогда
			Элементы.НетБрюшногоТифа24.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10508 Тогда
			Элементы.НетСтафилококка24.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10509 Тогда
			Элементы.НетГонореи24.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10510 Тогда
			Элементы.НетКори24.Видимость = Истина;
			Элементы.ПримечаниеКорь24.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ЛабИсследования24.Очистить();
	Для Каждого ЛабИсследование Из ДанныеЛабИсследований Цикл
		СтрокаЛабИссл = ЛабИсследования24.Добавить();
		СтрокаЛабИссл.ИсследованиеПоКлассификатору = ЛабИсследование.СвязьСКлассификатором;
		СтрокаЛабИссл.ДатаВыполнения = ЛабИсследование.ДатаВыполненияДействияМедосмотра;
		СтрокаЛабИссл.ВыявленыПротивопоказания = ЛабИсследование.ВыявленыПротивопоказания;
		СтрокаЛабИссл.Заключение = ЛабИсследование.Заключение;
		СтрокаЛабИссл.Прием = ЛабИсследование.ПриемСсылка;
		СтрокаЛабИссл.ТитрСерологическогоОбследования = ЛабИсследование.ТитрСерологическогоОбследования;
		
		Если ЗначениеЗаполнено(ЛабИсследование.СвязьСКлассификатором) 
			И ЗначениеЗаполнено(ЛабИсследование.ДатаВыполненияДействияМедосмотра)
			И ИнтеграцияЕГИСЗ_СЭМД.ДатаВ20Или21Веке(ЛабИсследование.ДатаВыполненияДействияМедосмотра)
		Тогда 
			СтрокаЛабИссл.СтрокаЗаполненаКорректно = 2;
		Иначе
			СтрокаЛабИссл.СтрокаЗаполненаКорректно = 1;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// Инструментальные исследования (только одна строка)
	ДанныеИнстрИсследований = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьДанныеИнструментальногоИсследования230(ПрохождениеМедосмотра, Фактор212);
	Если ДанныеИнстрИсследований.Количество() = 0 Тогда
		Элементы.ИнстрИсследования24.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	Иначе
		Элементы.НетИнстрИсследований24.Видимость = Ложь;
	КонецЕсли;
	
	ИнстрИсследования24.Очистить();
	Для Каждого ИнстрИсследование Из ДанныеИнстрИсследований Цикл
		СтрокаИнстрИссл = ИнстрИсследования24.Добавить();
		СтрокаИнстрИссл.ИсследованиеПоКлассификатору = ИнстрИсследование.СвязьСКлассификатором;
		СтрокаИнстрИссл.ДатаВыполнения = ИнстрИсследование.ДатаВыполненияДействияМедосмотра;
		СтрокаИнстрИссл.ВыявленыПротивопоказания = ИнстрИсследование.ВыявленыПротивопоказания;
		СтрокаИнстрИссл.Заключение = ИнстрИсследование.Заключение;
		СтрокаИнстрИссл.Прием = ИнстрИсследование.ПриемСсылка;
		
		Если ЗначениеЗаполнено(ИнстрИсследование.СвязьСКлассификатором) 
			И ЗначениеЗаполнено(ИнстрИсследование.ДатаВыполненияДействияМедосмотра)
			И ИнтеграцияЕГИСЗ_СЭМД.ДатаВ20Или21Веке(ИнстрИсследование.ДатаВыполненияДействияМедосмотра)
		Тогда 
			СтрокаИнстрИссл.СтрокаЗаполненаКорректно = 2;
		Иначе
			СтрокаИнстрИссл.СтрокаЗаполненаКорректно = 1;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФактор213(Фактор213, ЕстьКритичныеОшибки)
	
	ТаблицаИнфекцийПоФактору = ТаблицаИнфекцийПоФактору230(ПрохождениеМедосмотра, Фактор213);
	Если ТаблицаИнфекцийПоФактору.Количество() > 0 Тогда
		ЗначениеВРеквизитФормы(ТаблицаИнфекцийПоФактору, "ИнфекционныеЗаболевания25");
		Элементы.ОтсутствиеСведенийИнфекции25.Видимость = Ложь;
	Иначе
		Элементы.ОтсутствиеСведенийИнфекции25.Видимость = Истина;
		Элементы.ИнфекционныеЗаболевания25.Видимость = Ложь;
	КонецЕсли;
	
	ЕстьПрививкаОтКори213 = Ложь;
	
	ТаблицаВакцинацийПоФактору = ТаблицаВакцинацийПоФактору230(ПрохождениеМедосмотра, Фактор213, ЕстьПрививкаОтКори213);
	Если ТаблицаВакцинацийПоФактору.Количество() > 0 Тогда
		ЗначениеВРеквизитФормы(ТаблицаВакцинацийПоФактору, "Вакцинации25");
		Элементы.ОтсутствиеСведенийВакцинации25.Видимость = Ложь;
	Иначе
		Элементы.ОтсутствиеСведенийВакцинации25.Видимость = Истина;
		Элементы.Вакцинации25.Видимость = Ложь;
	КонецЕсли;
	
	ЗаключениеПоФактору25 = ИнтеграцияЕГИСЗ_СЭМД.ЗаключениеПоФакторуПМО(Фактор213, ПрохождениеМедосмотра);
	Если ЗначениеЗаполнено(ЗаключениеПоФактору25) Тогда
		Если ЗаключениеПоФактору25.УИДЕГИСЗ = 71 Тогда
			Элементы.НетЗаключения25.Видимость = Ложь;
			Элементы.ТекстЗаключенияНеВыявлено25.Видимость = Ложь;
			Элементы.ТекстЗаключенияВыявлено25.Видимость = Истина;
		Иначе
			Элементы.НетЗаключения25.Видимость = Ложь;
			Элементы.ТекстЗаключенияНеВыявлено25.Видимость = Истина;
			Элементы.ТекстЗаключенияВыявлено25.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.НетЗаключения25.Видимость = Истина;
		Элементы.ТекстЗаключенияНеВыявлено25.Видимость = Ложь;
		Элементы.ТекстЗаключенияВыявлено25.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	ДанныеКонсультаций = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьДанныеСвязанныхОсмотровВрачейСпециалистов230(ПрохождениеМедосмотра);
	Если ДанныеКонсультаций.Количество() = 0 Тогда
		Элементы.Консультации25.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	Консультации25.Очистить();
	Для Каждого Консультация Из ДанныеКонсультаций Цикл
		СтрокаКонс = Консультации25.Добавить();
		СтрокаКонс.Врач = Консультация.Сотрудник;
		СтрокаКонс.Должность = Консультация.СвязьСКлассификатором;
		СтрокаКонс.ДатаВыполнения = Консультация.ДатаВыполненияДействияМедосмотра;
		СтрокаКонс.ВыявленыПротивопоказания = Консультация.ВыявленыПротивопоказания;
		СтрокаКонс.Заключение = Консультация.Заключение;
		СтрокаКонс.СНИЛС = СтроковыеФункцииКлиентСервер.ПолучитьЦифрыСтроки(Консультация.Сотрудник.СНИЛС);
		СтрокаКонс.Прием = Консультация.ПриемСсылка;
		
		Если ЗначениеЗаполнено(Консультация.Сотрудник) 
			И ЗначениеЗаполнено(Консультация.СвязьСКлассификатором) 
			И ЗначениеЗаполнено(Консультация.ДатаВыполненияДействияМедосмотра)
			И ИнтеграцияЕГИСЗ_СЭМД.ДатаВ20Или21Веке(Консультация.ДатаВыполненияДействияМедосмотра)
		Тогда 
			СтрокаКонс.СтрокаЗаполненаКорректно = 2;
		Иначе
			СтрокаКонс.СтрокаЗаполненаКорректно = 1;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
		
		// Убираем видимость предупреждений у заполненных строк
		Если ЗначениеЗаполнено(Консультация.СвязьСКлассификатором) Тогда
			Если Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 24 Тогда
				Элементы.НетДерматовенеролога25.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведениядерматовенеролога25.Видимость = Истина;
				КонецЕсли;
			ИначеЕсли Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 53 Тогда
				Элементы.НетОториноларинголога25.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведенияоториноларинголога25.Видимость = Истина;
				КонецЕсли;
			ИначеЕсли Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 100 Тогда
				Элементы.НетСтоматолога25.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведенияСтоматолога25.Видимость = Истина;
				КонецЕсли;
			ИначеЕсли Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 109 Тогда
				Элементы.НетТерапевта25.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведенияТерапевта25.Видимость = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли
	КонецЦикла;
	
	// Должно быть ровно 4 осмотра
	Если Консультации25.Количество() <> 4 Тогда
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	// Лабораторные исследования
	ТаблицаДляПроверки = Неопределено;
	ДанныеЛабИсследований = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьДанныеЛабораторныхИсследований230(ПрохождениеМедосмотра, Фактор213, ЕстьПрививкаОтКори213, ТаблицаДляПроверки);
	Если ДанныеЛабИсследований.Количество() = 0 Тогда
		Элементы.ЛабИсследования25.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	Для Каждого ЛабИсследование Из ТаблицаДляПроверки Цикл
		Если ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10268 Тогда
			Элементы.НетГельминтов25.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10479 Тогда
			Элементы.НетКишИнфекций25.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10506 Тогда
			Элементы.НетСифилиса25.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10507 Тогда
			Элементы.НетБрюшногоТифа25.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10508 Тогда
			Элементы.НетСтафилококка25.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10509 Тогда
			Элементы.НетГонореи25.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10510 Тогда
			Элементы.НетКори25.Видимость = Истина;
			Элементы.ПримечаниеКорь25.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ЛабИсследования25.Очистить();
	Для Каждого ЛабИсследование Из ДанныеЛабИсследований Цикл
		СтрокаЛабИссл = ЛабИсследования25.Добавить();
		СтрокаЛабИссл.ИсследованиеПоКлассификатору = ЛабИсследование.СвязьСКлассификатором;
		СтрокаЛабИссл.ДатаВыполнения = ЛабИсследование.ДатаВыполненияДействияМедосмотра;
		СтрокаЛабИссл.ВыявленыПротивопоказания = ЛабИсследование.ВыявленыПротивопоказания;
		СтрокаЛабИссл.Заключение = ЛабИсследование.Заключение;
		СтрокаЛабИссл.Прием = ЛабИсследование.ПриемСсылка;
		СтрокаЛабИссл.ТитрСерологическогоОбследования = ЛабИсследование.ТитрСерологическогоОбследования;
		
		Если ЗначениеЗаполнено(ЛабИсследование.СвязьСКлассификатором) 
			И ЗначениеЗаполнено(ЛабИсследование.ДатаВыполненияДействияМедосмотра)
			И ИнтеграцияЕГИСЗ_СЭМД.ДатаВ20Или21Веке(ЛабИсследование.ДатаВыполненияДействияМедосмотра)
		Тогда 
			СтрокаЛабИссл.СтрокаЗаполненаКорректно = 2;
		Иначе
			СтрокаЛабИссл.СтрокаЗаполненаКорректно = 1;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// Инструментальные исследования (только одна строка)
	ДанныеИнстрИсследований = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьДанныеИнструментальногоИсследования230(ПрохождениеМедосмотра, Фактор213);
	Если ДанныеИнстрИсследований.Количество() = 0 Тогда
		Элементы.ИнстрИсследования25.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	Иначе
		Элементы.НетИнстрИсследований25.Видимость = Ложь;
	КонецЕсли;
	
	ИнстрИсследования25.Очистить();
	Для Каждого ИнстрИсследование Из ДанныеИнстрИсследований Цикл
		СтрокаИнстрИссл = ИнстрИсследования25.Добавить();
		СтрокаИнстрИссл.ИсследованиеПоКлассификатору = ИнстрИсследование.СвязьСКлассификатором;
		СтрокаИнстрИссл.ДатаВыполнения = ИнстрИсследование.ДатаВыполненияДействияМедосмотра;
		СтрокаИнстрИссл.ВыявленыПротивопоказания = ИнстрИсследование.ВыявленыПротивопоказания;
		СтрокаИнстрИссл.Заключение = ИнстрИсследование.Заключение;
		СтрокаИнстрИссл.Прием = ИнстрИсследование.ПриемСсылка;
		
		Если ЗначениеЗаполнено(ИнстрИсследование.СвязьСКлассификатором) 
			И ЗначениеЗаполнено(ИнстрИсследование.ДатаВыполненияДействияМедосмотра)
			И ИнтеграцияЕГИСЗ_СЭМД.ДатаВ20Или21Веке(ИнстрИсследование.ДатаВыполненияДействияМедосмотра)
		Тогда 
			СтрокаИнстрИссл.СтрокаЗаполненаКорректно = 2;
		Иначе
			СтрокаИнстрИссл.СтрокаЗаполненаКорректно = 1;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФактор214(Фактор214, ЕстьКритичныеОшибки)
	
	ТаблицаИнфекцийПоФактору = ТаблицаИнфекцийПоФактору230(ПрохождениеМедосмотра, Фактор214);
	Если ТаблицаИнфекцийПоФактору.Количество() > 0 Тогда
		ЗначениеВРеквизитФормы(ТаблицаИнфекцийПоФактору, "ИнфекционныеЗаболевания26");
		Элементы.ОтсутствиеСведенийИнфекции26.Видимость = Ложь;
	Иначе
		Элементы.ОтсутствиеСведенийИнфекции26.Видимость = Истина;
		Элементы.ИнфекционныеЗаболевания26.Видимость = Ложь;
	КонецЕсли;
	
	ЕстьПрививкаОтКори214 = Ложь;
	
	ТаблицаВакцинацийПоФактору = ТаблицаВакцинацийПоФактору230(ПрохождениеМедосмотра, Фактор214, ЕстьПрививкаОтКори214);
	Если ТаблицаВакцинацийПоФактору.Количество() > 0 Тогда
		ЗначениеВРеквизитФормы(ТаблицаВакцинацийПоФактору, "Вакцинации26");
		Элементы.ОтсутствиеСведенийВакцинации26.Видимость = Ложь;
	Иначе
		Элементы.ОтсутствиеСведенийВакцинации26.Видимость = Истина;
		Элементы.Вакцинации26.Видимость = Ложь;
	КонецЕсли;
	
	ЗаключениеПоФактору26 = ИнтеграцияЕГИСЗ_СЭМД.ЗаключениеПоФакторуПМО(Фактор214, ПрохождениеМедосмотра);
	Если ЗначениеЗаполнено(ЗаключениеПоФактору26) Тогда
		Если ЗаключениеПоФактору26.УИДЕГИСЗ = 71 Тогда
			Элементы.НетЗаключения26.Видимость = Ложь;
			Элементы.ТекстЗаключенияНеВыявлено26.Видимость = Ложь;
			Элементы.ТекстЗаключенияВыявлено26.Видимость = Истина;
		Иначе
			Элементы.НетЗаключения26.Видимость = Ложь;
			Элементы.ТекстЗаключенияНеВыявлено26.Видимость = Истина;
			Элементы.ТекстЗаключенияВыявлено26.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.НетЗаключения26.Видимость = Истина;
		Элементы.ТекстЗаключенияНеВыявлено26.Видимость = Ложь;
		Элементы.ТекстЗаключенияВыявлено26.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	ДанныеКонсультаций = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьДанныеСвязанныхОсмотровВрачейСпециалистов230(ПрохождениеМедосмотра);
	Если ДанныеКонсультаций.Количество() = 0 Тогда
		Элементы.Консультации26.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	Консультации26.Очистить();
	Для Каждого Консультация Из ДанныеКонсультаций Цикл
		СтрокаКонс = Консультации26.Добавить();
		СтрокаКонс.Врач = Консультация.Сотрудник;
		СтрокаКонс.Должность = Консультация.СвязьСКлассификатором;
		СтрокаКонс.ДатаВыполнения = Консультация.ДатаВыполненияДействияМедосмотра;
		СтрокаКонс.ВыявленыПротивопоказания = Консультация.ВыявленыПротивопоказания;
		СтрокаКонс.Заключение = Консультация.Заключение;
		СтрокаКонс.СНИЛС = СтроковыеФункцииКлиентСервер.ПолучитьЦифрыСтроки(Консультация.Сотрудник.СНИЛС);
		СтрокаКонс.Прием = Консультация.ПриемСсылка;
		
		Если ЗначениеЗаполнено(Консультация.Сотрудник) 
			И ЗначениеЗаполнено(Консультация.СвязьСКлассификатором) 
			И ЗначениеЗаполнено(Консультация.ДатаВыполненияДействияМедосмотра)
			И ИнтеграцияЕГИСЗ_СЭМД.ДатаВ20Или21Веке(Консультация.ДатаВыполненияДействияМедосмотра)
		Тогда 
			СтрокаКонс.СтрокаЗаполненаКорректно = 2;
		Иначе
			СтрокаКонс.СтрокаЗаполненаКорректно = 1;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
		
		// Убираем видимость предупреждений у заполненных строк
		Если ЗначениеЗаполнено(Консультация.СвязьСКлассификатором) Тогда
			Если Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 24 Тогда
				Элементы.НетДерматовенеролога26.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведениядерматовенеролога26.Видимость = Истина;
				КонецЕсли;
			ИначеЕсли Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 53 Тогда
				Элементы.НетОториноларинголога26.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведенияоториноларинголога26.Видимость = Истина;
				КонецЕсли;
			ИначеЕсли Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 100 Тогда
				Элементы.НетСтоматолога26.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведенияСтоматолога26.Видимость = Истина;
				КонецЕсли;
			ИначеЕсли Консультация.СвязьСКлассификатором.УИДЕГИСЗ = 109 Тогда
				Элементы.НетТерапевта26.Видимость = Ложь;
				Если Не ЗначениеЗаполнено(СтрокаКонс.СНИЛС) 
					Или Не ИнтеграцияЕГИСЗ_СЭМД.УСотрудникаЕстьДолжностьДействияМедосмотра230(Консультация.Сотрудник, Консультация.ДействиеМедосмотра)
				Тогда 
					Элементы.НеВсеСведенияТерапевта26.Видимость = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли
	КонецЦикла;
	
	// Должно быть ровно 4 осмотра
	Если Консультации26.Количество() <> 4 Тогда
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	// Лабораторные исследования
	ТаблицаДляПроверки = Неопределено;
	ДанныеЛабИсследований = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьДанныеЛабораторныхИсследований230(ПрохождениеМедосмотра, Фактор214, ЕстьПрививкаОтКори214, ТаблицаДляПроверки);
	Если ДанныеЛабИсследований.Количество() = 0 Тогда
		Элементы.ЛабИсследования26.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	КонецЕсли;
	
	Для Каждого ЛабИсследование Из ТаблицаДляПроверки Цикл
		Если ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10268 Тогда
			Элементы.НетГельминтов26.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10479 Тогда
			Элементы.НетКишИнфекций26.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10506 Тогда
			Элементы.НетСифилиса26.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10507 Тогда
			Элементы.НетБрюшногоТифа26.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10508 Тогда
			Элементы.НетСтафилококка26.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10509 Тогда
			Элементы.НетГонореи26.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		ИначеЕсли ЛабИсследование.ИсследованиеУИДЕГИСЗ = 10510 Тогда
			Элементы.НетКори26.Видимость = Истина;
			Элементы.ПримечаниеКорь26.Видимость = Истина;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	ЛабИсследования26.Очистить();
	Для Каждого ЛабИсследование Из ДанныеЛабИсследований Цикл
		СтрокаЛабИссл = ЛабИсследования26.Добавить();
		СтрокаЛабИссл.ИсследованиеПоКлассификатору = ЛабИсследование.СвязьСКлассификатором;
		СтрокаЛабИссл.ДатаВыполнения = ЛабИсследование.ДатаВыполненияДействияМедосмотра;
		СтрокаЛабИссл.ВыявленыПротивопоказания = ЛабИсследование.ВыявленыПротивопоказания;
		СтрокаЛабИссл.Заключение = ЛабИсследование.Заключение;
		СтрокаЛабИссл.Прием = ЛабИсследование.ПриемСсылка;
		СтрокаЛабИссл.ТитрСерологическогоОбследования = ЛабИсследование.ТитрСерологическогоОбследования;
		
		Если ЗначениеЗаполнено(ЛабИсследование.СвязьСКлассификатором) 
			И ЗначениеЗаполнено(ЛабИсследование.ДатаВыполненияДействияМедосмотра)
			И ИнтеграцияЕГИСЗ_СЭМД.ДатаВ20Или21Веке(ЛабИсследование.ДатаВыполненияДействияМедосмотра)
		Тогда 
			СтрокаЛабИссл.СтрокаЗаполненаКорректно = 2;
		Иначе
			СтрокаЛабИссл.СтрокаЗаполненаКорректно = 1;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// Инструментальные исследования (только одна строка)
	ДанныеИнстрИсследований = ИнтеграцияЕГИСЗ_СЭМД.ПолучитьДанныеИнструментальногоИсследования230(ПрохождениеМедосмотра, Фактор214);
	Если ДанныеИнстрИсследований.Количество() = 0 Тогда
		Элементы.ИнстрИсследования26.Видимость = Ложь;
		ЕстьКритичныеОшибки = Истина;
	Иначе
		Элементы.НетИнстрИсследований26.Видимость = Ложь;
	КонецЕсли;
	
	ИнстрИсследования26.Очистить();
	Для Каждого ИнстрИсследование Из ДанныеИнстрИсследований Цикл
		СтрокаИнстрИссл = ИнстрИсследования26.Добавить();
		СтрокаИнстрИссл.ИсследованиеПоКлассификатору = ИнстрИсследование.СвязьСКлассификатором;
		СтрокаИнстрИссл.ДатаВыполнения = ИнстрИсследование.ДатаВыполненияДействияМедосмотра;
		СтрокаИнстрИссл.ВыявленыПротивопоказания = ИнстрИсследование.ВыявленыПротивопоказания;
		СтрокаИнстрИссл.Заключение = ИнстрИсследование.Заключение;
		СтрокаИнстрИссл.Прием = ИнстрИсследование.ПриемСсылка;
		
		Если ЗначениеЗаполнено(ИнстрИсследование.СвязьСКлассификатором) 
			И ЗначениеЗаполнено(ИнстрИсследование.ДатаВыполненияДействияМедосмотра)
			И ИнтеграцияЕГИСЗ_СЭМД.ДатаВ20Или21Веке(ИнстрИсследование.ДатаВыполненияДействияМедосмотра)
		Тогда 
			СтрокаИнстрИссл.СтрокаЗаполненаКорректно = 2;
		Иначе
			СтрокаИнстрИссл.СтрокаЗаполненаКорректно = 1;
			ЕстьКритичныеОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление211()
	
	// Инфекционные заболевания
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ИнфекционныеЗаболевания23Дата");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнфекционныеЗаболевания23.Дата");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнфекционныеЗаболевания23.Дата");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Профилактические прививки
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Вакцинации23ДатаВакцинации");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Вакцинации23.ДатаВакцинации");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Вакцинации23.ДатаВакцинации");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Результаты осмотров (Дата)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Консультации23ДатаВыполнения");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации23.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации23.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Результаты осмотров (СНИЛС)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Консультации23СНИЛС");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации23.СНИЛС");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;     
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Оранжевый);
	
	// Результаты осмотров (Сотрудник)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Консультации23Врач");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации23.Врач");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;     
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Лабораторные исследования (Дата)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЛабИсследования23ДатаВыполнения");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЛабИсследования23.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЛабИсследования23.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Инструментальные исследования (Дата)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ИнстрИсследования23ДатаВыполнения");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнстрИсследования23.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнстрИсследования23.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление212()
	
	// Инфекционные заболевания
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ИнфекционныеЗаболевания24Дата");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнфекционныеЗаболевания24.Дата");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнфекционныеЗаболевания24.Дата");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Профилактические прививки
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Вакцинации24ДатаВакцинации");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Вакцинации24.ДатаВакцинации");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Вакцинации24.ДатаВакцинации");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Результаты осмотров (Дата)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Консультации24ДатаВыполнения");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации24.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации24.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Результаты осмотров (СНИЛС)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Консультации24СНИЛС");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации24.СНИЛС");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;     
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Оранжевый);
	
	// Результаты осмотров (Сотрудник)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Консультации24Врач");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации24.Врач");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;     
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Лабораторные исследования (Дата)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЛабИсследования24ДатаВыполнения");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЛабИсследования24.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЛабИсследования24.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Инструментальные исследования (Дата)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ИнстрИсследования24ДатаВыполнения");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнстрИсследования24.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнстрИсследования24.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление213()
	
	// Инфекционные заболевания
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ИнфекционныеЗаболевания25Дата");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнфекционныеЗаболевания25.Дата");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнфекционныеЗаболевания25.Дата");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Профилактические прививки
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Вакцинации25ДатаВакцинации");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Вакцинации25.ДатаВакцинации");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Вакцинации25.ДатаВакцинации");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Результаты осмотров (Дата)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Консультации25ДатаВыполнения");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации25.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации25.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Результаты осмотров (СНИЛС)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Консультации25СНИЛС");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации25.СНИЛС");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;     
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Оранжевый);
	
	// Результаты осмотров (Сотрудник)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Консультации25Врач");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации25.Врач");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;     
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Лабораторные исследования (Дата)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЛабИсследования25ДатаВыполнения");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЛабИсследования25.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЛабИсследования25.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Инструментальные исследования (Дата)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ИнстрИсследования25ДатаВыполнения");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнстрИсследования25.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнстрИсследования25.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление214()
	
	// Инфекционные заболевания
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ИнфекционныеЗаболевания26Дата");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнфекционныеЗаболевания26.Дата");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнфекционныеЗаболевания26.Дата");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Профилактические прививки
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Вакцинации26ДатаВакцинации");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Вакцинации26.ДатаВакцинации");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Вакцинации26.ДатаВакцинации");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Результаты осмотров (Дата)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Консультации26ДатаВыполнения");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации26.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации26.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Результаты осмотров (СНИЛС)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Консультации26СНИЛС");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации26.СНИЛС");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;     
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Оранжевый);
	
	// Результаты осмотров (Сотрудник)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Консультации26Врач");
	
	ЭлементОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Консультации26.Врач");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;     
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Лабораторные исследования (Дата)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ЛабИсследования26ДатаВыполнения");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЛабИсследования26.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЛабИсследования26.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
	// Инструментальные исследования (Дата)
	ЭлементУО = УсловноеОформление.Элементы.Добавить(); 
	
	ПолеЭлемента = ЭлементУО.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ИнстрИсследования26ДатаВыполнения");
	
	ГруппаЭлементовОтбора = ЭлементУО.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаЭлементовОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ГруппаЭлементовОтбора.Использование = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнстрИсследования26.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Меньше;   
	ЭлементОтбора.ПравоеЗначение = Дата("18991231");   
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ИнстрИсследования26.ДатаВыполнения");  
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;   
	ЭлементОтбора.ПравоеЗначение = Дата("21000101");      
	ЭлементОтбора.Использование  = Истина;
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьКолонкиТаблицы(Колонки, ПодчиненныеЭлементы)
	
	Для Каждого ПодчиненныйЭлемент Из ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ПодчиненныйЭлемент) = Тип("ПолеФормы") Тогда
			Колонки.Добавить(ПодчиненныйЭлемент);
		ИначеЕсли ТипЗнч(ПодчиненныйЭлемент) = Тип("ГруппаФормы") Тогда
			ДополнитьКолонкиТаблицы(Колонки, ПодчиненныйЭлемент.ПодчиненныеЭлементы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	ЗаполнитьТаблицыПроверок();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ПараметрыФормы = Новый Структура("ПрохождениеМедосмотра", ПрохождениеМедосмотра);
	ЭтаФорма.Закрыть();
	ОткрытьФорму("Документ.ПрохождениеМедосмотра.Форма.ФормаПроверкиКорректностиЗаполненияСЭМД230", ПараметрыФормы, ЭтаФорма.ВладелецФормы);
	//ОбновитьНаСервере();
КонецПроцедуры
