#Область СтандартныеПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Результат = Параметры.НачальноеЗначение; 
	ВычислитьПоляПоРезультату(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры
	
#КонецОбласти

#Область СтандартныеСобытия

&НаКлиенте
Процедура АллергическиеРеакцииПереченьПриИзменении(Элемент)	
	АллергическиеРеакции = ЗначениеЗаполнено(Элемент.ТекстРедактирования);
КонецПроцедуры

	
#КонецОбласти

#Область ЗаполнениеРезультата

&НаКлиенте
Процедура Принять(Команда)
	Закрыть(ВычислитьРезультатПоПолям());
КонецПроцедуры

// Заполняем все отмеченные значения заголовками выбранных элементов
// Все разделяем символом ";"
// Для "Прочие" будет "Прочие: <Значение строки Прочие>"
// Для Аллергических реакций проверяется значение галочки (она изменяется только посредство ввода текста)
// И будет "Аллергические реакции: <Значение Строки АллергическиеРеакцииПеречень>"
&НаКлиенте
Функция ВычислитьРезультатПоПолям()
	                         
	Результат = "";
	
	Для каждого ЭлементФормыБокс Из ЭтаФорма.ПодчиненныеЭлементы.ПеречислениеВсехБулевых.ПодчиненныеЭлементы Цикл
		
		ИмяРеквизита = СтрЗаменить(ЭлементФормыБокс.Имя, "1", "");
		ЗначениеЗаголовкаРеквизита = ЭлементФормыБокс.Заголовок;
		
		Если ЭтаФорма[ИмяРеквизита] = Истина Тогда
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Результат, ЗначениеЗаголовкаРеквизита,"; ");		
		КонецЕсли;
			
	КонецЦикла; 
	
	// Отдельно проверяем Аллергию
	Если АллергическиеРеакции Тогда	
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Результат,СтрШаблон("Аллергические реакции: %1", АллергическиеРеакцииПеречень),"; ");	
	КонецЕсли;
	
	// Отдельно проверяем Прочие
	Если ЗначениеЗаполнено(Прочие) Тогда	                                                 
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Результат,СтрШаблон("Прочие: %1", Прочие),"; ");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = "Нет";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ВычислитьПоляПоРезультату(РезультатСтрокой)
	
	// Получаем предыдущее значение параметра, которое было для этой обработки
	Если Не ЗначениеЗаполнено(РезультатСтрокой) Тогда
		Возврат;
	КонецЕсли;
	
	// Получим массив строк по разделителю - символу ";"
	МассивСтрок = СтрРазделить(РезультатСтрокой,";");
	
	// Параметры-боксы записываются чисто по своему названию (кроме исключений)
	Для каждого ЭлементСтрока Из МассивСтрок Цикл
		         
		// Прочие ВСЕГДА имеют начало "Прочие:"
		Если СтрНачинаетсяС(СокрЛП(ЭлементСтрока),"Прочие: ") Тогда
			Прочие = Сред(СокрЛП(ЭлементСтрока),9);
			Продолжить;
		ИначеЕсли СтрНачинаетсяС(СокрЛП(ЭлементСтрока),"Аллергические реакции: ") Тогда
			АллергическиеРеакцииПеречень = Сред(СокрЛП(ЭлементСтрока),24);
			АллергическиеРеакции = Истина;
			Продолжить;
		КонецЕсли;
		
		// Остальные проверяем - их значение должно совпадает с именем поля формы 
		// Уберём пробелы, и особые знаки, что не могут быть использованы
		ЭлементСтрока = СтрЗаменить(ЭлементСтрока," ","");
		ЭлементСтрока = СтрЗаменить(ЭлементСтрока,"-","");
		ЭлементСтрока = СтрЗаменить(ЭлементСтрока,",","");
		
		Попытка
			ЭтаФорма[ЭлементСтрока] = Истина;
		Исключение
			//НайденныйЭлементФормы = Элементы.Найти(ЭлементСтрока);
		КонецПопытки;

	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
