
Функция ПолучитьИзначальныйТексСтраницы(БезКоманднойПанелиСмайлов = Ложь) Экспорт
	
	Если БезКоманднойПанелиСмайлов Тогда
		// Формируем легкий HTML только для просмотра
		ТекстHTML = iga_HTMLВызовСервера.ПолучитьМакетДляЧтения();
	ИНаче	
		// Формируем HTML прямо на клиенте и помещаем в реквизит формы
		ТекстHTML = iga_HTMLВызовСервера.ПолучитьМакетДляРедактирования();
		
	КонецЕсли;
	
	ПутьКСкриптуПоУмолчанию = iga_HTMLВызовСервера.ПутьКСкриптуЭмодзи();
	                            
	Если ПутьКСкриптуПоУмолчанию = "" Тогда
		ПутьКСкриптуПоУмолчанию = "https://cdn.jsdelivr.net/npm/@twemoji/api@latest/dist/twemoji.min.js";
	КонецЕсли;
	
	ТекстHTML = СтрЗаменить(ТекстHTML, "{ПутьКСкрипутЭмодзи}", ПутьКСкриптуПоУмолчанию);

	Возврат ТекстHTML;
	
КонецФункции

Процедура ПрименитьТекстКПолюHTML(ВходящийТекст, ПолеHTML) Экспорт
	
	Если ЗначениеЗаполнено(ВходящийТекст) Тогда
		ДокументHTML = ПолеHTML.Документ;
		Если ДокументHTML <> Неопределено Тогда
			ДокументHTML.defaultView.setText(ВходящийТекст);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

