
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.омг_НастройкиИнтеграцииСЛИС КАК омг_НастройкиИнтеграцииСЛИС";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, Выборка);

		ДанныеПароля = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ИнтеграцияСЛИС", "Пароль");

		Пароль = ?(ДанныеПароля = Неопределено, "", Новый УникальныйИдентификатор);
		
		ДанныеПароля = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ИнтеграцияСЛИС", "ПарольFTP");

		ПарольFTP = ?(ДанныеПароля = Неопределено, "", Новый УникальныйИдентификатор);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Поля = Метаданные.РегистрыСведений.омг_НастройкиИнтеграцииСЛИС.Ресурсы;
	СтруктураНастроек = Новый Структура;
	Для Каждого Поле Из Поля Цикл
		СтруктураНастроек.Вставить(Поле.Имя, ЗаписьРегистра[Поле.Имя]);
	КонецЦикла;
	
	Запись = РегистрыСведений.омг_НастройкиИнтеграцииСЛИС.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ЗаписьРегистра);
	Запись.Записать();
	
	Если ПарольИзменен Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("омг_ИнтеграцияСЛИС", Новый ХранилищеЗначения(Пароль), "Пароль");
		УстановитьПривилегированныйРежим(Ложь);
		
		Пароль = Новый УникальныйИдентификатор;
		ПарольИзменен = Ложь;
		
	КонецЕсли;
	Если ПарольFTPИзменен Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("омг_ИнтеграцияСЛИС", Новый ХранилищеЗначения(ПарольFTP), "ПарольFTP");
		УстановитьПривилегированныйРежим(Ложь);
		
		ПарольFTP = Новый УникальныйИдентификатор;
		ПарольFTPИзменен = Ложь;
		
	КонецЕсли;
	
	РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.омг_СинхронизацияДанныхСЛИС);
	РеглЗадание.Параметры.Очистить();
	
	Ключи = Новый Массив;
	
	Если Запись.ОбновлениеАнализов Тогда
		Ключи.Добавить(Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеАнализовЛИС);
	КонецЕсли;
	Если Запись.ОбновлениеЦен Тогда
		Ключи.Добавить(Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеЦенЛИС);
	КонецЕсли;
	Если Запись.ОбновлениеБиоматериалов Тогда
		Ключи.Добавить(Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеБиоматериаловЛИС);
	КонецЕсли;
	
	РеглЗадание.Параметры.Добавить(Ключи);
	РеглЗадание.Использование = ?(Ключи.Количество() > 0, Истина, Ложь);
	РеглЗадание.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПарольFTPПриИзменении(Элемент)
	
	ПарольFTPИзменен = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРасписание()
	
	РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.омг_СинхронизацияДанныхСЛИС);
	Возврат РеглЗадание.Расписание;
	
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьРасписание(Расписание)
	
	РеглЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.омг_СинхронизацияДанныхСЛИС);
	РеглЗадание.Расписание = Расписание;
	РеглЗадание.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеИзмененияРасписания(Расписание, ДопПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьРасписание(Расписание);
	
КонецПроцедуры

&НаКлиенте
Процедура Расписание(Команда)
	
	Расписание = ПолучитьРасписание();
	
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеИзмененияРасписания", ЭтаФорма);
	
	Диалог.Показать(ОписаниеОповещения);
	
КонецПроцедуры
