Функция ПолучитьСписокСотрудниковПоОтборам(ПостроительОтчета) Экспорт 
	
	СхемаКомпоновкиДанных = Документы.НачислениеЗарплаты.ПолучитьМакет("СхемаКомпоновкиДанных");	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, ПостроительОтчета.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	Запрос = Новый Запрос(МакетКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос);	
	Для Каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл	
		Запрос.Параметры.Вставить(Параметр.Имя, Параметр.Значение);	
	КонецЦикла;
	
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабРезультат.ВыгрузитьКолонку("Сотрудник");
	
	
КонецФункции