#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТекстДляРедактирования") Тогда
		ВходящийТекст = Параметры.ТекстДляРедактирования;
	КонецЕсли;
	Просмотр = Параметры.Свойство("Просмотр");
	Если Просмотр Тогда
		Элементы.ВставитьПараметр.Видимость = Ложь;
		
	КонецЕсли;
КонецПроцедуры

// 1. При открытии формы (это происходит на КЛИЕНТЕ)
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстHTML = iga_HTMLКлиент.ПолучитьИзначальныйТексСтраницы(Просмотр);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	ДокументHTML = Элементы.ТекстHTML.Документ;
	Если ДокументHTML <> Неопределено Тогда
		ИтоговыйТекст = ДокументHTML.defaultView.getText();
		Закрыть(ИтоговыйТекст);
	Иначе
		Закрыть(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ТекстHTMLДокументСформирован(Элемент)
	
	iga_HTMLКлиент.ПрименитьТекстКПолюHTML(ВходящийТекст, Элементы.ТекстHTML);
	ВходящийТекст = "";
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВставитьПараметр(Команда)
	
	Параметр = Ждать ВвестиСтрокуАсинх("Параметр", "Введите параметр", 50);
	
	Если Не ЗначениеЗаполнено(Параметр) Тогда
		Возврат;
	КонецЕсли;
	
	ИдеальноеИмя = НРег(iga_ОбщегоНазначенияКлиентСервер.ИдеальноеИмяФайла(Параметр, Истина));
	
	Если ИдеальноеИмя = "" Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ТекстHTML.Документ.defaultView.insertTextAtCaret("{" + ИдеальноеИмя + "}");
	
КонецПроцедуры

#КонецОбласти