
&НаКлиенте
Перем iga_РазрешитьЗакрытие;

&НаКлиенте
Процедура iga_ПослеЗаписиПосле(ПараметрыЗаписи)
	
	Если Не ПараметрыЗаписи.iga_Модифицированность Или Не ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение 
		Или Не (Объект.Состояние = ПредопределенноеЗначение("Справочник.ВидыСостоянийЗаявок.Запланирована")
		Или Объект.Состояние = ПредопределенноеЗначение("Справочник.ВидыСостоянийЗаявок.Отменена"))
		Или ПараметрыЗаписи.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	iga_ОповещенияКлиент.ОтправитьОповещениеОЗаписи(Объект.Ссылка, ЭтаФорма, iga_УниверсальныеОбработчикиНаКлиенте);
	
КонецПроцедуры

&НаКлиенте
Процедура iga_ВыполнитьОтправкуОповещения(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	iga_ОповещенияКлиент.ОтправитьОповещениеОЗаписи(Объект.Ссылка, ЭтаФорма, iga_УниверсальныеОбработчикиНаКлиенте);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура iga_УдалитьОповещенияНаСервере(Заявка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаписиОповещений = РегистрыСведений.iga_ОповещенияПоВремени.СоздатьНаборЗаписей();
	ЗаписиОповещений.Отбор.Заявка.Установить(Заявка);
	ЗаписиОповещений.Записать();
	
	ЗаписиПодтверждений = РегистрыСведений.iga_СтатусыПодтвержденияСтрокЗаявок.СоздатьНаборЗаписей();
	ЗаписиПодтверждений.Отбор.Заявка.Установить(Заявка);
	ЗаписиПодтверждений.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура iga_УдалитьОповещения(Команда)
	
	Ответ = Ждать ВопросАсинх("Очистить текущие уведомления по заявке?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет, "Уведомления о записях", КодВозвратаДиалога.Нет);
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	iga_УдалитьОповещенияНаСервере(Объект.Ссылка)
	
КонецПроцедуры

&НаСервере
Процедура iga_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если iga_УниверсальныеОбработчикиВызовСервера.ВключеноОповещениеОЗаписи() Тогда
		
		Команда = Команды.Добавить("iga_УдалитьОповещения");
		Команда.Действие = "iga_УдалитьОповещения";
		Команда.Заголовок = "Очистить план оповещений";
		Команда.Картинка = БиблиотекаКартинок.УдалитьНепосредственно;
		Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;
		
		Элемент = Элементы.Добавить("iga_УдалитьОповещения", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
		Элемент.ИмяКоманды = "iga_УдалитьОповещения";

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура iga_ПередЗаписьюПосле(Отказ, ПараметрыЗаписи)
	
	ПараметрыЗаписи.Вставить("iga_Модифицированность", Модифицированность Или Объект.Ссылка.Пустая());
	ПараметрыЗаписи.Вставить("Отказ", Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура iga_ОбработкаОповещенияПосле(ИмяСобытия, Параметр, Источник)
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция iga_ТребуетсяОповещениеОбОплате(Заявка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ЗаявкиКОповещениюПоПредоплате.Заявка КАК Заявка
	               |ИЗ
	               |	РегистрСведений.iga_ЗаявкиКОповещениюПоПредоплате КАК iga_ЗаявкиКОповещениюПоПредоплате
	               |ГДЕ
	               |	iga_ЗаявкиКОповещениюПоПредоплате.Заявка = &Заявка";
	Запрос.УстановитьПараметр("Заявка", Заявка); 
	
	СтатусОплаты = омг_Предоплата.ВернутьСтатусОплаты(Заявка);

	НетЗаписей = Запрос.Выполнить().Пустой();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НетЗаписей И ЗначениеЗаполнено(СтатусОплаты) И СтатусОплаты.Статус = Перечисления.омг_СтатусыПредоплаты.ОжиданиеОплаты;
	
КонецФункции

&НаКлиенте
Асинх Процедура iga_ЗадатьВопросыОПропускеОповещенияОплаты()
	
	Ответ = Ждать ВопросАсинх("Не было отправлено оповещение об оплате. Продолжить закрытие?", 
		РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, "Закрытие заявки");
		
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Ответ = Ждать ВопросАсинх("Вы уверены, что не нужно отправлять оповещение?", 
			РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, "Закрытие заявки");
			
		Если Ответ = КодВозвратаДиалога.Да Тогда
			iga_РазрешитьЗакрытие = Истина;
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура iga_ПередЗакрытиемПеред(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;         
	
	Если iga_ТребуетсяОповещениеОбОплате(Объект.Ссылка) И Не iga_РазрешитьЗакрытие
		И Объект.Состояние = ПредопределенноеЗначение("Справочник.ВидыСостоянийЗаявок.Забронирована") Тогда
		
		iga_ЗадатьВопросыОПропускеОповещенияОплаты();
		
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура iga_ПриОткрытииПосле(Отказ)
	iga_РазрешитьЗакрытие = Ложь;
КонецПроцедуры
