
#Область ИнтерактивнаяРаботаСЗубнойКартой

Функция УстановитьВариант(СтруктураАдресЗК, МассивЗубовИд, ВариантЗуба, Область = Неопределено) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	МассивЗубов = МассивЗубовИд;
	Если ТипЗнч(МассивЗубовИд) <> Тип("Массив") Тогда
		МассивЗубов = Новый Массив;
		МассивЗубов.Добавить(МассивЗубовИд);
	КонецЕсли;
	
	Для Каждого ЗубВКартеИд Из МассивЗубов Цикл
		
		СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ЗубВКартеИд);
		Если СтруктураЗуб = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураВариант = СтруктураЗуб.Варианты.Получить(ВариантЗуба);
		Если СтруктураВариант = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Нужно снять все основные варианты
		Если СтруктураВариант.Основной Тогда
			Для Каждого кзВариант Из СтруктураЗуб.Варианты Цикл
				СнимаемыйВариант = кзВариант.Значение;
				Если СнимаемыйВариант.Основной И СнимаемыйВариант.Выбран И СнимаемыйВариант <> СтруктураВариант Тогда
					СнятьВариант(СтруктураЗК, ЗубВКартеИд, СнимаемыйВариант.ВариантЗуба);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		СтруктураВариант.Выбран = Истина;
		Для Каждого кзОбласть Из СтруктураВариант.Области Цикл
			СтруктураОбласть = кзОбласть.Значение;
			Если Область = Неопределено Или СтруктураОбласть.Область = Область Тогда
				
				СтруктураОбласть.Выбран = Истина;
				
				// Обновляем состав текущих сегментов
				Для Каждого кзСегмент Из СтруктураОбласть.СегментыПоИд Цикл
					
					ИдСегмента = кзСегмент.Ключ;
					СтруктураСегмент = кзСегмент.Значение;
					СтруктураТекСегмент = СтруктураЗуб.ТекущиеСегменты.Получить(ИдСегмента);
					Если СтруктураТекСегмент = Неопределено Тогда
						СтруктураТекСегмент = стомЗубнаяКартаИнициализация.СоздатьТекущийСегмент(СтруктураЗуб, СтруктураСегмент);
					КонецЕсли;
					СтруктураТекСегмент.Варианты.Вставить(ВариантЗуба, СтруктураОбласть.Область);
					
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
		Если СтруктураВариант.Основной Тогда
			СтруктураЗуб.Обозначение = СтруктураВариант.Нумерация;
		КонецЕсли;
		
		ОбновитьОбозначениеВариантовЗуба(СтруктураЗК, ЗубВКартеИд);
		ОбновитьОбозначенияСегментовЗуба(СтруктураЗК, ЗубВКартеИд);
		
	КонецЦикла;
	
	УдалитьНедопустимыеЗубыСегментыИзВыделенных(СтруктураЗК);
	СохранитьСтруктуруЗК(СтруктураЗК, СтруктураАдресЗК);
	
	Возврат СтруктураЗК.ВыделенныеЗубыСегменты;
	
КонецФункции

Функция СнятьВариант(СтруктураАдресЗК, МассивЗубовИд, ВариантЗуба, Область = Неопределено) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	МассивЗубов = МассивЗубовИд;
	Если ТипЗнч(МассивЗубовИд) <> Тип("Массив") Тогда
		МассивЗубов = Новый Массив;
		МассивЗубов.Добавить(МассивЗубовИд);
	КонецЕсли;
	
	Для Каждого ЗубВКартеИд Из МассивЗубов Цикл
	
		СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ЗубВКартеИд);
		Если СтруктураЗуб = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		СтруктураВариант = СтруктураЗуб.Варианты.Получить(ВариантЗуба);
		Если СтруктураВариант = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ЕстьВыделенныеОбласти = Ложь;
		Для Каждого кзОбласть Из СтруктураВариант.Области Цикл
			СтруктураОбласть = кзОбласть.Значение;
			Если Область = Неопределено Или СтруктураОбласть.Область = Область Тогда
				
				СтруктураОбласть.Выбран = Ложь;
				// Обновляем состав текущих сегментов
				СегментыОбласти = ?(СтруктураОбласть.Конструкция,
					СтруктураОбласть.ВыбраннаяЧастьКонструкции.СегментыПоИд, СтруктураОбласть.СегментыПоИд);
				Для Каждого кзСегмент Из СегментыОбласти Цикл
					
					ИдСегмента = кзСегмент.Ключ;
					СтруктураТекСегмент = СтруктураЗуб.ТекущиеСегменты.Получить(ИдСегмента);
					Если СтруктураТекСегмент = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					СтруктураТекСегмент.Варианты.Удалить(ВариантЗуба);
					
					// Если сегмент не включен ни одним вариантом - удаляем его из текущих
					Если СтруктураТекСегмент.Варианты.Количество() = 0 Тогда
						СтруктураЗуб.ТекущиеСегменты.Удалить(ИдСегмента);
					КонецЕсли;
					
				КонецЦикла;
				
			Иначе
				ЕстьВыделенныеОбласти = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если СтруктураВариант.Основной Тогда
			СтруктураЗуб.Обозначение = Строка(СтруктураЗуб.ЗубВКарте);
		КонецЕсли;
		
		Если Область = Неопределено Или Не ЕстьВыделенныеОбласти Тогда
			СтруктураВариант.Выбран = Ложь;
		КонецЕсли;
		
		ОбновитьОбозначениеВариантовЗуба(СтруктураЗК, ЗубВКартеИд);
		ОбновитьОбозначенияСегментовЗуба(СтруктураЗК, ЗубВКартеИд);
		
	КонецЦикла;
	
	УдалитьНедопустимыеЗубыСегментыИзВыделенных(СтруктураЗК);
	СохранитьСтруктуруЗК(СтруктураЗК, СтруктураАдресЗК);
	
	Возврат СтруктураЗК.ВыделенныеЗубыСегменты;
	
КонецФункции

Функция УстановитьСостояниеЗубам(СтруктураАдресЗК, ЗубыСегменты, СостояниеИдентификатор) Экспорт
	
	Для Каждого СтруктураЗуб Из ЗубыСегменты Цикл
		ВыделенныеЗубыСегменты = стомЗубнаяКартаМетоды.УстановитьСостояние(СтруктураАдресЗК, СтруктураЗуб.ЗубВКарте, СтруктураЗуб.Сегменты, СостояниеИдентификатор);
	КонецЦикла;
	
	Возврат ВыделенныеЗубыСегменты;
	
КонецФункции

Функция СнятьСостояниеЗубам(СтруктураАдресЗК, ЗубыСегменты, СостояниеИдентификатор) Экспорт
	
	Для Каждого СтруктураЗуб Из ЗубыСегменты Цикл
		ВыделенныеЗубыСегменты = стомЗубнаяКартаМетоды.СнятьСостояние(СтруктураАдресЗК, СтруктураЗуб.ЗубВКарте, СтруктураЗуб.Сегменты, СостояниеИдентификатор);
	КонецЦикла;
	
	Возврат ВыделенныеЗубыСегменты;
	
КонецФункции

Функция УстановитьСостояние(СтруктураАдресЗК, ЗубВКартеИд, МассивСегментовИд = Неопределено, СостояниеИдентификатор) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
		
	СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ЗубВКартеИд);
	Если СтруктураЗуб = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИдСостояния = СостояниеИдентификатор;
	Если ТипЗнч(СостояниеИдентификатор) = Тип("СправочникСсылка.стомСостоянияЗубов") Тогда
		ИдСостояния = СостояниеИдентификатор.УникальныйИдентификатор();
	КонецЕсли;
	
	СтруктураСостояние = СтруктураЗК.ДанныеСостояний.СостоянияПоИд.Получить(ИдСостояния);
	Если СтруктураСостояние = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Если нет сегментов - устанавливаем всем, каким можно
	Если МассивСегментовИд = Неопределено Тогда
		МассивСегментовИд = ПолучитьСегментыЗубаИмеющиеСостояние(СтруктураАдресЗК, СтруктураЗуб, СостояниеИдентификатор);
	КонецЕсли;
	
	Для Каждого СегментВЗубеИд Из МассивСегментовИд Цикл
		
		СтруктураТекСегмент = НайтиСегментВЗубе(СтруктураЗуб, СегментВЗубеИд);
		Если СтруктураТекСегмент = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураТекСегмент.Состояния.Вставить(ИдСостояния, СтруктураСостояние);
		ОбновитьОбозначениеСегментаЗуба(СтруктураЗуб, СегментВЗубеИд);
		
	КонецЦикла;
	
	ОбновитьОбозначенияСегментовЗуба(СтруктураЗК, ЗубВКартеИд);
	СохранитьСтруктуруЗК(СтруктураЗК, СтруктураАдресЗК);
	
	Возврат СтруктураЗК.ВыделенныеЗубыСегменты;
	
КонецФункции

Функция СнятьСостояние(СтруктураАдресЗК, ЗубВКартеИд, МассивСегментовИд, СостояниеИдентификатор) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
		
	СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ЗубВКартеИд);
	Если СтруктураЗуб = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИдСостояния = СостояниеИдентификатор;
	Если ТипЗнч(СостояниеИдентификатор) = Тип("СправочникСсылка.стомСостоянияЗубов") Тогда
		ИдСостояния = СостояниеИдентификатор.УникальныйИдентификатор();
	КонецЕсли;
	
	СтруктураСостояние = СтруктураЗК.ДанныеСостояний.СостоянияПоИд.Получить(ИдСостояния);
	Если СтруктураСостояние = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Если нет сегментов - устанавливаем всем, каким можно
	Если МассивСегментовИд = Неопределено Тогда
		МассивСегментовИд = ПолучитьСегментыЗубаИмеющиеСостояние(СтруктураАдресЗК, СтруктураЗуб, СостояниеИдентификатор);
	КонецЕсли;
	
	Для Каждого СегментВЗубеИд Из МассивСегментовИд Цикл
		
		СтруктураТекСегмент = НайтиСегментВЗубе(СтруктураЗуб, СегментВЗубеИд);
		Если СтруктураТекСегмент = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураТекСегмент.Состояния.Удалить(ИдСостояния);
		ОбновитьОбозначениеСегментаЗуба(СтруктураЗуб, СегментВЗубеИд);
		
	КонецЦикла;
	
	ОбновитьОбозначенияСегментовЗуба(СтруктураЗК, ЗубВКартеИд);
	СохранитьСтруктуруЗК(СтруктураЗК, СтруктураАдресЗК);
	
	Возврат СтруктураЗК.ВыделенныеЗубыСегменты;
	
КонецФункции

Функция УстановитьКонструкцию(СтруктураАдресЗК, МассивЗубовИд, ВариантЗуба, Область, Конструкция = Неопределено) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	ДиапазонЗубов = ПолучитьДиапазонЗубовПоВыделенным(СтруктураЗК, МассивЗубовИд, "челюсть");
	Если ДиапазонЗубов.Количество() = 0 Тогда
		Возврат Новый Структура("ОписаниеОшибки", "Не удалось вычислить диапазон зубов для установки конструкции");
	КонецЕсли;
	
	КонструкцииНаДобавление = Новый Массив;
	СтруктураЗК.ВыделенныеЗубыСегменты = Новый Массив;
	
	ПервыйЗуб = ДиапазонЗубов[0];
	ПоследнийЗуб = ДиапазонЗубов[ДиапазонЗубов.Количество() - 1];
	Для Каждого СтруктураЗуб Из ДиапазонЗубов Цикл
		
		СущКонструкция = НайтиКонструкциюПоВариантуОбластиЗубу(СтруктураЗК, СтруктураЗуб.ЗубВКарте);
		Если СущКонструкция <> Неопределено Тогда
			Возврат Новый Структура("ОписаниеОшибки", "Зуб " + СтруктураЗуб.Обозначение + " уже содержит конструкцию");
		КонецЕсли;
		
		СтруктураВариант = СтруктураЗуб.Варианты.Получить(ВариантЗуба);
		Если СтруктураВариант = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИнвертироватьКонструкцию = (СтруктураЗуб.ПараметрыРасположения.sX < 0);
		СтруктураВариант.Выбран = Истина;
		Для Каждого кзОбласть Из СтруктураВариант.Области Цикл
			СтруктураОбласть = кзОбласть.Значение;
			Если СтруктураОбласть.Область = Область Тогда
				
				СтруктураОбласть.Выбран = Истина;
				Если ПервыйЗуб = ПоследнийЗуб Тогда
					СтруктураОбласть.ВыбраннаяЧастьКонструкции = СтруктураОбласть.Середина;
				ИначеЕсли СтруктураЗуб = ПервыйЗуб Тогда
					СтруктураОбласть.ВыбраннаяЧастьКонструкции = ?(ИнвертироватьКонструкцию, СтруктураОбласть.Конец, СтруктураОбласть.Начало);
				ИначеЕсли СтруктураЗуб = ПоследнийЗуб Тогда
					СтруктураОбласть.ВыбраннаяЧастьКонструкции = ?(ИнвертироватьКонструкцию, СтруктураОбласть.Начало, СтруктураОбласть.Конец);
				Иначе
					СтруктураОбласть.ВыбраннаяЧастьКонструкции = СтруктураОбласть.Середина;
				КонецЕсли;
				
				// Обновляем состав текущих сегментов
				Для Каждого кзСегмент Из СтруктураОбласть.ВыбраннаяЧастьКонструкции.СегментыПоИд Цикл
					
					ИдСегмента = кзСегмент.Ключ;
					СтруктураСегмент = кзСегмент.Значение;
					СтруктураТекСегмент = СтруктураЗуб.ТекущиеСегменты.Получить(ИдСегмента);
					Если СтруктураТекСегмент = Неопределено Тогда
						СтруктураТекСегмент = стомЗубнаяКартаИнициализация.СоздатьТекущийСегмент(СтруктураЗуб, СтруктураСегмент);
					КонецЕсли;
					СтруктураТекСегмент.Варианты.Вставить(ВариантЗуба, СтруктураОбласть.Область);
					
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;
		
		СтруктураЗК.ВыделенныеЗубыСегменты.Добавить(Новый Структура("ЗубВКарте, Сегменты", СтруктураЗуб.ЗубВКарте, Новый Массив));
		
	КонецЦикла;
	
	СтруктураКонструкция = стомЗубнаяКартаИнициализация.СоздатьКонструкцию(СтруктураЗК, ВариантЗуба, Область, Конструкция);
	Для Каждого СтруктураЗуб Из ДиапазонЗубов Цикл
		СтруктураКонструкция.СоставЗубов.Добавить(СтруктураЗуб.ЗубВКарте);
	КонецЦикла;
	ОбновитьОбозначениеКонструкции(СтруктураЗК, СтруктураКонструкция.Идентификатор);
	КонструкцииНаДобавление.Добавить(СтруктураКонструкция);
	
	УдалитьНедопустимыеЗубыСегментыИзВыделенных(СтруктураЗК);
	СохранитьСтруктуруЗК(СтруктураЗК, СтруктураАдресЗК);
	
	Возврат Новый Структура("Конструкции, ВыделенныеЗубыСегменты", КонструкцииНаДобавление, СтруктураЗК.ВыделенныеЗубыСегменты);
	
КонецФункции

Функция СнятьКонструкцию(СтруктураАдресЗК, МассивЗубовИд, ВариантЗуба, Область) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	КонструкцииНаУдаление = Новый Массив;
	ОбновляемыеЗубы = Новый Массив;
	СтруктураЗК.ВыделенныеЗубыСегменты = Новый Массив;
	
	Для Каждого ЗубВКартеИд Из МассивЗубовИд Цикл
		Конструкция = НайтиКонструкциюПоВариантуОбластиЗубу(СтруктураЗК, ЗубВКартеИд, ВариантЗуба, Область);
		Если Конструкция <> Неопределено И КонструкцииНаУдаление.Найти(Конструкция) = Неопределено Тогда
			КонструкцииНаУдаление.Добавить(Конструкция);
		КонецЕсли;
	КонецЦикла;
	
	Если КонструкцииНаУдаление.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого СтруктураКонструкция Из КонструкцииНаУдаление Цикл
		
		Для Каждого ЗубВКарте Из СтруктураКонструкция.СоставЗубов Цикл
			СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ЗубВКарте);
			Если ОбновляемыеЗубы.Найти(СтруктураЗуб.ЗубВКарте) = Неопределено Тогда
				ОбновляемыеЗубы.Добавить(СтруктураЗуб.ЗубВКарте);
			КонецЕсли;
		КонецЦикла;
		СтруктураКонструкция.Удалена = Истина;
		
	КонецЦикла;
	СнятьВариант(СтруктураЗК, ОбновляемыеЗубы, ВариантЗуба, Область);
	
	Для Каждого ЗубВКарте Из ОбновляемыеЗубы Цикл
		СтруктураЗК.ВыделенныеЗубыСегменты.Добавить(Новый Структура("ЗубВКарте, Сегменты", ЗубВКарте, Новый Массив));
	КонецЦикла;
	УдалитьНедопустимыеЗубыСегментыИзВыделенных(СтруктураЗК);
	СохранитьСтруктуруЗК(СтруктураЗК, СтруктураАдресЗК);
	
	Возврат Новый Структура("Конструкции, ВыделенныеЗубыСегменты", КонструкцииНаУдаление, СтруктураЗК.ВыделенныеЗубыСегменты);
	
КонецФункции

Процедура УдалитьНедопустимыеЗубыСегментыИзВыделенных(СтруктураАдресЗК, ВыделенныеЗубыСегменты = Неопределено) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	Если ВыделенныеЗубыСегменты = Неопределено Тогда
		ВыделенныеЗубыСегменты = СтруктураЗК.ВыделенныеЗубыСегменты;
	КонецЕсли;
	
	ВыделенныеЗубыНаУдаление = Новый Массив;
	Для Каждого ВыделенныйЗуб Из ВыделенныеЗубыСегменты Цикл
		
		СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ВыделенныйЗуб.ЗубВКарте);
		Если СтруктураЗуб = Неопределено Тогда
			ВыделенныеЗубыНаУдаление.Удалить(ВыделенныйЗуб.ЗубВКарте);
			Продолжить;
		КонецЕсли;
		
		Сч = ВыделенныйЗуб.Сегменты.Количество() - 1;
		Пока Сч >= 0 Цикл
			СегментВЗубе = ВыделенныйЗуб.Сегменты[Сч];
			СтруктураТекСегмент = НайтиСегментВЗубе(СтруктураЗуб, СегментВЗубе);
			Если СтруктураТекСегмент = Неопределено Тогда
				ВыделенныйЗуб.Сегменты.Удалить(Сч);
			КонецЕсли;
			Сч = Сч - 1;
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ВыделенныйЗуб Из ВыделенныеЗубыНаУдаление Цикл
		ВыделенныеЗубыСегменты.Удалить(ВыделенныйЗуб);
	КонецЦикла;
	
	СтруктураЗК.ВыделенныеЗубыСегменты = ВыделенныеЗубыСегменты;
	СохранитьСтруктуруЗК(СтруктураЗК);
	
КонецПроцедуры

Функция ВыделитьЗубыСегменты(СтруктураАдресЗК, ВыделенныеЗубыСегменты) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	СтруктураЗК.ВыделенныеЗубыСегменты = СформироватьСтруктуруВыделенныхЗубовСегментов(СтруктураЗК, ВыделенныеЗубыСегменты);
	СохранитьСтруктуруЗК(СтруктураЗК);
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("selectedElements", СформироватьСтруктуруВыделенияЗубовСегментовJSON(СтруктураЗК));
	
	Возврат СтруктураJSON;
	
КонецФункции

#КонецОбласти

#Область ПрочаяРаботаСЗубнойКартой

Функция ПолучитьЗначениеСвойстваЗубнойКарты(СтруктураАдресЗК, ИменаСвойств) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	СтруктураИмен = Новый Структура(ИменаСвойств);
	СтруктураСвойств = Новый Структура;
	
	Для Каждого кзСвойство Из СтруктураИмен Цикл
		СтруктураСвойств.Вставить(кзСвойство.Имя, СтруктураЗК[кзСвойство.Имя]);
	КонецЦикла;
	
	Возврат СтруктураСвойств;
	
КонецФункции

Функция ОбновитьОбозначениеСегментаЗуба(СтруктураЗуб, СегментВЗубеИд) Экспорт
	
	СтруктураТекСегмент = НайтиСегментВЗубе(СтруктураЗуб, СегментВЗубеИд);
	Если СтруктураТекСегмент = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ОбозначениеСостояний = "";
	Для Каждого кзСостояние Из СтруктураТекСегмент.Состояния Цикл
		
		СтруктураСостояние = кзСостояние.Значение;
		Если Не ПустаяСтрока(СтруктураСостояние.Обозначение) Тогда
			ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(ОбозначениеСостояний, СтруктураСостояние.Обозначение, ", ");
		КонецЕсли;
		
	КонецЦикла;
	СтруктураТекСегмент.ОбозначениеСостояний = ОбозначениеСостояний;
	
	Возврат ОбозначениеСостояний;
	
КонецФункции

Функция ОбновитьОбозначениеВариантовЗуба(СтруктураАдресЗК, ЗубВКартеИд) Экспорт
	
	СтруктураОписание = Новый Структура("ОсновнойВариант, Варианты", "", "");
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ЗубВКартеИд);
	
	Для Каждого кзВариант Из СтруктураЗуб.Варианты Цикл
		СтруктураВариант = кзВариант.Значение;
		Если СтруктураВариант.Выбран Тогда
			
			Если СтруктураВариант.Основной Тогда
				СтруктураОписание.ОсновнойВариант = СтруктураВариант.Обозначение;
			Иначе
				ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(СтруктураОписание.Варианты, СтруктураВариант.Обозначение, ", ");
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	СтруктураЗуб.ОбозначениеОсновнойВариант = СтруктураОписание.ОсновнойВариант;
	СтруктураЗуб.ОбозначениеВарианты = СтруктураОписание.Варианты;
	
	Возврат СтруктураОписание;
	
КонецФункции

Функция ОбновитьОбозначенияСегментовЗуба(СтруктураАдресЗК, ЗубВКартеИд) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ЗубВКартеИд);
	
	ОбозначениеСостояний = "";
	Состояния = Новый Массив;
	
	Для Каждого кзТекСегмент Из СтруктураЗуб.ТекущиеСегменты Цикл
		СтруктураТекСегмент = кзТекСегмент.Значение;
		Для Каждого кзСостояние Из СтруктураТекСегмент.Состояния Цикл
			
			СтруктураСостояние = кзСостояние.Значение;
			Если Не ПустаяСтрока(СтруктураСостояние.Обозначение) И Состояния.Найти(СтруктураСостояние.Состояние) = Неопределено Тогда
				ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(ОбозначениеСостояний, СтруктураСостояние.Обозначение, ", ");
				Состояния.Добавить(СтруктураСостояние.Состояние);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	СтруктураЗуб.ОбозначениеСостояния = ОбозначениеСостояний;
	
	Возврат ОбозначениеСостояний;
	
КонецФункции

Функция ОбновитьОбозначениеКонструкции(СтруктураАдресЗК, КонструкцияИд) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	СтруктураКонструкция = НайтиКонструкциюВКарте(СтруктураАдресЗК, КонструкцияИд);
	
	СтруктураКонструкция.СоставЗубовСтрокой = "";
	Для Каждого ЗубВКарте Из СтруктураКонструкция.СоставЗубов Цикл
		СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ЗубВКарте);
		ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(СтруктураКонструкция.СоставЗубовСтрокой, СтруктураЗуб.Обозначение, ", ");
	КонецЦикла;
	
	Если Не СтруктураКонструкция.НеСоздана И ЗначениеЗаполнено(СтруктураКонструкция.Конструкция) Тогда
		СтруктураКонструкция.Обозначение = Строка(СтруктураКонструкция.Конструкция);
	Иначе
		СтруктураКонструкция.Обозначение = Строка(СтруктураКонструкция.Область) +
			?(ЗначениеЗаполнено(СтруктураКонструкция.СоставЗубовСтрокой),
				" (" + СтруктураКонструкция.СоставЗубовСтрокой + ")", "");
	КонецЕсли;
	
	Возврат СтруктураКонструкция.Обозначение;
	
КонецФункции

Функция ПолучитьСегментыЗубаИмеющиеСостояние(СтруктураАдресЗК, СтруктураЗуб, СостояниеИдентификатор) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	Сегменты = Новый Массив;
	
	ИдСостояния = СостояниеИдентификатор;
	Если ТипЗнч(СостояниеИдентификатор) = Тип("СправочникСсылка.стомСостоянияЗубов") Тогда
		ИдСостояния = СостояниеИдентификатор.УникальныйИдентификатор();
	КонецЕсли;
	
	// Находим области, содержащие состояние
	СтруктураСостояние = СтруктураЗК.ДанныеСостояний.СостоянияПоИд.Получить(ИдСостояния);
	Если СтруктураСостояние = Неопределено Тогда
		Возврат Сегменты;
	КонецЕсли;
	
	Области = Новый Массив;
	Для Каждого кзОбласть Из СтруктураЗК.ДанныеСостояний.МаскиОбластей Цикл
		Область = кзОбласть.Ключ;
		МаскаОбласти = кзОбласть.Значение;
		Если МаскаОбласти[СтруктураСостояние.ПозицияВМаске] = Истина И 
			Области.Найти(Область) = Неопределено 
		Тогда
			Области.Добавить(Область);
		КонецЕсли;
	КонецЦикла;
	
	// Ищем сегменты по областям
	Для Каждого кзСегмент Из СтруктураЗуб.ТекущиеСегменты Цикл
		СтруктураТекСегмент = кзСегмент.Значение;
		Если Области.Найти(СтруктураТекСегмент.СтруктураСегмент.Область) <> Неопределено Тогда
			Сегменты.Добавить(СтруктураТекСегмент.СегментВЗубе);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Сегменты;
	
КонецФункции

Функция ПолучитьОбозначениеЗуба(СтруктураАдресЗК, ЗубВКартеИд, 
	ВыводитьНомер = Истина, ВыводитьОсновнойВариант = Истина, ВыводитьВарианты = Истина) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ЗубВКартеИд);
	
	ОбозначениеЗуба = ?(ВыводитьНомер, СтруктураЗуб.Обозначение, "");
	Если ВыводитьОсновнойВариант И Не ПустаяСтрока(СтруктураЗуб.ОбозначениеОсновнойВариант) Тогда
		ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(ОбозначениеЗуба, "[" + СтруктураЗуб.ОбозначениеОсновнойВариант + "]", " ");
	КонецЕсли;
	Если ВыводитьВарианты И Не ПустаяСтрока(СтруктураЗуб.ОбозначениеВарианты) Тогда
		ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(ОбозначениеЗуба, "(" + СтруктураЗуб.ОбозначениеВарианты + ")", " ");
	КонецЕсли;
	
	Возврат СокрЛП(ОбозначениеЗуба);
	
КонецФункции

Функция ПолучитьОписаниеОбозначений(СтруктураАдресЗК, ВключатьСостояния = Истина, ВключатьВарианты = Истина) Экспорт
	
	Описание = "";
	Варианты = Новый Соответствие;
	Состояния = Новый Соответствие;
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	Для Каждого кзЗуб Из СтруктураЗК.Зубы Цикл
		СтруктураЗуб = кзЗуб.Значение;
		Если ВключатьВарианты Тогда
			Для Каждого кзВариант Из СтруктураЗуб.Варианты Цикл
				СтруктураВариант = кзВариант.Значение;
				Если СтруктураВариант.Выбран И ЗначениеЗаполнено(СтруктураВариант.Обозначение) Тогда
					Варианты.Вставить(СтруктураВариант.ВариантЗуба, СтруктураВариант.Обозначение);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Для Каждого кзТекСегмент Из СтруктураЗуб.ТекущиеСегменты Цикл
			СтруктураТекСегмент = кзТекСегмент.Значение;
			Для Каждого кзСостояние Из СтруктураТекСегмент.Состояния Цикл
				СтруктураСостояние = кзСостояние.Значение;
				Если ЗначениеЗаполнено(СтруктураСостояние.Обозначение) Тогда
					Состояния.Вставить(СтруктураСостояние.Состояние, СтруктураСостояние.Обозначение);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого кзВариант Из Варианты Цикл
		ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(Описание, кзВариант.Значение + " - " + Строка(кзВариант.Ключ), ", ");
	КонецЦикла;
	
	Для Каждого кзСостояние Из Состояния Цикл
		ОбщегоНазначенияБИТКлиентСервер.КонкатенацияСтрок(Описание, кзСостояние.Значение + " - " + Строка(кзСостояние.Ключ), ", ");
	КонецЦикла;
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти

#Область ФормированиеДанныхДляПриложенияJS

Функция СформироватьСтруктуруЗубнойКартыJSON(СтруктураАдресЗК, ОчищатьКарту = Истина, ОтборЗубов = Неопределено, ПреобразоватьВСтроку = Истина) Экспорт
	
	СтруктураЗК = стомЗубнаяКартаМетоды.ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	СтруктураJSON = Новый Структура("width, height, elements, selectWithCTRL", СтруктураЗК.ШиринаКанвы, СтруктураЗК.ВысотаКанвы, Новый Массив, Не СтруктураЗК.СбросВыделенияПоCtrl);
	
	Если ОчищатьКарту Тогда
		СтруктураJSON.elements.Добавить(Новый Структура("operation", "-"));
	КонецЕсли;
	
	ЗубыКарты = Неопределено;
	Если ОтборЗубов <> Неопределено Тогда
		ЗубыКарты = НайтиЗубыВКарте(СтруктураЗК, ОтборЗубов);
	Иначе
		ЗубыКарты = Новый Массив;
		Для Каждого кзЗуб Из СтруктураЗК.Зубы Цикл
			ЗубыКарты.Добавить(кзЗуб.Значение);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого СтруктураЗуб Из ЗубыКарты Цикл
		
		СтруктураЗубJSON = Новый Структура("operation, id, width, height, transform, elements", 
			"+", Строка(СтруктураЗуб.Идентификатор), СтруктураЗуб.ШиринаКанвы, СтруктураЗуб.ВысотаКанвы, СтруктураЗуб.ПараметрыРасположения, Новый Массив);
		СтруктураJSON.elements.Добавить(СтруктураЗубJSON);
		
		// Составляем список значений для сортировки сегментов по их Z-индексу
		ПорядокСтруктурСегментов = Новый СписокЗначений;
		Для Каждого кзСегмент Из СтруктураЗуб.ТекущиеСегменты Цикл
			ПорядокСтруктурСегментов.Добавить(кзСегмент, Формат(кзСегмент.Значение.СегментВЗубе.ZIndex,"ЧЦ=4; ЧВН=; ЧГ="));
		КонецЦикла;
		
		ПорядокСтруктурСегментов.СортироватьПоПредставлению(); 

		Для каждого ЭлСтруктурыСегментов Из ПорядокСтруктурСегментов Цикл
			
			кзСегмент=ЭлСтруктурыСегментов.Значение;
			
			СтруктураТекСегмент = кзСегмент.Значение;
			СтруктураСегмент = СтруктураТекСегмент.СтруктураСегмент;
			
			СтруктураФигура = Новый Структура("silverlight, fill", СтруктураСегмент.Фигура, СтруктураСегмент.ЦветПоУмолчанию, 6);
			
			СтруктураСегментJSON = Новый Структура("operation, id, transform, shape, isDecoration", 
				"+", Строка(СтруктураСегмент.Идентификатор), СтруктураСегмент.ПараметрыРасположения, СтруктураФигура, СтруктураСегмент.Декоративный);
			
			Если СтруктураТекСегмент.Состояния.Количество() > 0 Тогда
				ЦветаСостояний = Новый Массив;
				Для Каждого кзСостояние Из СтруктураТекСегмент.Состояния Цикл
					ЦветаСостояний.Добавить(кзСостояние.Значение.ЦветHex);
				КонецЦикла;
				СтруктураСегментJSON.Вставить("statements", ЦветаСостояний);
			КонецЕсли;
			
			СтруктураЗубJSON.elements.Добавить(СтруктураСегментJSON);
			
		КонецЦикла;
		
	КонецЦикла;
	
	СтруктураJSON.Вставить("selectedElements", СформироватьСтруктуруВыделенияЗубовСегментовJSON(СтруктураЗК));
	
	Если ПреобразоватьВСтроку Тогда
		Возврат ОбщегоНазначенияКлиентСерверПереопределяемый.СформироватьСтрокуJSON(СтруктураJSON);
	Иначе
		Возврат СтруктураJSON;
	КонецЕсли;
	
КонецФункции

Функция СформироватьСтруктуруОбновленияВариантовJSON(СтруктураАдресЗК, ПреобразоватьВСтроку = Истина) Экспорт
	
	СтруктураЗК = стомЗубнаяКартаМетоды.ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	СтруктураJSON = Новый Структура("elements", Новый Массив);
	Для Каждого ВыделенныйЗуб Из СтруктураЗК.ВыделенныеЗубыСегменты Цикл
		
		СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ВыделенныйЗуб.ЗубВКарте);
		Если СтруктураЗуб = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураЗубJSON = Новый Структура("operation, id, elements", 
			"", Строка(СтруктураЗуб.Идентификатор), Новый Массив);
		СтруктураJSON.elements.Добавить(СтруктураЗубJSON);
		
		// Очистка всех сегментов
		СтруктураЗубJSON.elements.Добавить(Новый Структура("operation", "-"));
		
		// Составляем список значений для сортировки сегментов по их Z-индексу
		ПорядокСтруктурСегментов = Новый СписокЗначений;
		Для Каждого кзСегмент Из СтруктураЗуб.ТекущиеСегменты Цикл
			ПорядокСтруктурСегментов.Добавить(кзСегмент, Формат(кзСегмент.Значение.СегментВЗубе.ZIndex,"ЧЦ=4; ЧВН=; ЧГ="));
		КонецЦикла;
		
		ПорядокСтруктурСегментов.СортироватьПоПредставлению(); 
		
		Для каждого ЭлСтруктурыСегментов Из ПорядокСтруктурСегментов Цикл
			
			кзСегмент=ЭлСтруктурыСегментов.Значение;
			
			СтруктураТекСегмент = кзСегмент.Значение;
			СтруктураСегмент = СтруктураТекСегмент.СтруктураСегмент;
			
			СтруктураФигура = Новый Структура("silverlight, fill", СтруктураСегмент.Фигура, СтруктураСегмент.ЦветПоУмолчанию, 6);
			
			СтруктураСегментJSON = Новый Структура("operation, id, transform, shape, isDecoration", 
				"+", Строка(СтруктураСегмент.Идентификатор), СтруктураСегмент.ПараметрыРасположения, СтруктураФигура, СтруктураСегмент.Декоративный);
			
			Если СтруктураТекСегмент.Состояния.Количество() > 0 Тогда
				ЦветаСостояний = Новый Массив;
				Для Каждого кзСостояние Из СтруктураТекСегмент.Состояния Цикл
					ЦветаСостояний.Добавить(кзСостояние.Значение.ЦветHex);
				КонецЦикла;
				СтруктураСегментJSON.Вставить("statements", ЦветаСостояний);
			КонецЕсли;
			
			СтруктураЗубJSON.elements.Добавить(СтруктураСегментJSON);
			
		КонецЦикла;
		
	КонецЦикла;
	
	СтруктураJSON.Вставить("selectedElements", СформироватьСтруктуруВыделенияЗубовСегментовJSON(СтруктураЗК));
	
	Если ПреобразоватьВСтроку Тогда
		Возврат ОбщегоНазначенияКлиентСерверПереопределяемый.СформироватьСтрокуJSON(СтруктураJSON);
	Иначе
		Возврат СтруктураJSON;
	КонецЕсли;
	
КонецФункции

Функция СформироватьСтруктуруОбновленияСостоянийJSON(ДанныеДляОбновления, ПреобразоватьВСтроку = Истина) Экспорт
	
	СтруктураЗК = стомЗубнаяКартаМетоды.ПолучитьСтруктуруЗК(ДанныеДляОбновления.СтруктураАдресЗК);
	
	СтруктураJSON = Новый Структура("elements", Новый Массив);
	Для Каждого ВыделенныйЗуб Из ДанныеДляОбновления.ЗубыСегменты Цикл
		
		СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ВыделенныйЗуб.ЗубВКарте);
		Если СтруктураЗуб = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураЗубJSON = Новый Структура("operation, id, elements", "", Строка(СтруктураЗуб.Идентификатор), Новый Массив);
		СтруктураJSON.elements.Добавить(СтруктураЗубJSON);
		
		СегментыЗуба = ВыделенныйЗуб.Сегменты;
		Если СегментыЗуба.Количество() = 0 Тогда// Обновлем состояния всех сегментов зуба
			СегментыЗуба = Новый Массив;
			Для Каждого кзСегмент Из СтруктураЗуб.ТекущиеСегменты Цикл
				СегментыЗуба.Добавить(кзСегмент.Ключ);
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого СегментВЗубе Из СегментыЗуба Цикл
			
			СтруктураТекСегмент = НайтиСегментВЗубе(СтруктураЗуб, СегментВЗубе);
			Если СтруктураТекСегмент = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтруктураСегментJSON = Новый Структура("operation, id", "", Строка(СтруктураТекСегмент.Идентификатор));
			СтруктураЗубJSON.elements.Добавить(СтруктураСегментJSON);
			
			ЦветаСостояний = Новый Массив;
			Для Каждого кзСостояние Из СтруктураТекСегмент.Состояния Цикл
				ЦветаСостояний.Добавить(кзСостояние.Значение.ЦветHex);
			КонецЦикла;
			СтруктураСегментJSON.Вставить("statements", ЦветаСостояний);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ПреобразоватьВСтроку Тогда
		Возврат ОбщегоНазначенияКлиентСерверПереопределяемый.СформироватьСтрокуJSON(СтруктураJSON);
	Иначе
		Возврат СтруктураJSON;
	КонецЕсли;
	
КонецФункции

Функция СформироватьСтруктуруВыделенияЗубовСегментовJSON(СтруктураАдресЗК, ПреобразоватьВСтроку = Ложь) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	ВыделенныеЗубы = Новый Соответствие;
	Для Каждого ВыделенныйЗуб Из СтруктураЗК.ВыделенныеЗубыСегменты Цикл
		
		ВыделенныеСегменты = Новый Соответствие;
		ВыделенныеЗубы.Вставить(Строка(ВыделенныйЗуб.ЗубВКарте.УникальныйИдентификатор()), ВыделенныеСегменты);
		
		Для Каждого СегментВЗубе Из ВыделенныйЗуб.Сегменты Цикл
			ВыделенныеСегменты.Вставить(Строка(СегментВЗубе.УникальныйИдентификатор()));
		КонецЦикла;
	
	КонецЦикла;
	
	Если ПреобразоватьВСтроку Тогда
		Возврат ОбщегоНазначенияКлиентСерверПереопределяемый.СформироватьСтрокуJSON(ВыделенныеЗубы);
	Иначе
		Возврат ВыделенныеЗубы;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ФормированиеТабличногоДокумента

Функция СформироватьТабличныйДокументЗК(СтруктураАдресЗК) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	ТабДокЗК = Новый ТабличныйДокумент;
	ТабДокШаблонЗК = Справочники.стомВидыЗубныхКарт.ПолучитьМакет("ЗубнаяКартаТабДок");
	ОбластьЗК = ТабДокШаблонЗК.ПолучитьОбласть("ОбластьЗК");
	
	Для Каждого кзЗуб Из СтруктураЗК.Зубы Цикл
		
		СтруктураЗуб = кзЗуб.Значение;
		
		Если СтруктураЗуб.Расположение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПоляЗуб = "З" + СтруктураЗуб.Расположение.Номер;
		ИмяПоляВарианты = "З" + СтруктураЗуб.Расположение.Номер + "В";
		ИмяПоляСостояния = "З" + СтруктураЗуб.Расположение.Номер + "С";
		ИмяПоляКонструкция = "З" + СтруктураЗуб.Расположение.Номер + "К";
		ИмяПоляРасшифровка = "З" + СтруктураЗуб.Расположение.Номер + "Р";
		
		ОбластьЗК.Параметры[ИмяПоляЗуб] = СтруктураЗуб.Обозначение;
		ОбластьЗК.Параметры[ИмяПоляВарианты] = СтруктураЗуб.ОбозначениеВарианты;
		ОбластьЗК.Параметры[ИмяПоляСостояния] = СтруктураЗуб.ОбозначениеСостояния;
		ОбластьЗК.Параметры[ИмяПоляРасшифровка] = СтруктураЗуб.ЗубВКарте;
		
	КонецЦикла;
	
	ТабДокЗК.Вывести(ОбластьЗК);
	
	Возврат ТабДокЗК;
	
КонецФункции

#КонецОбласти

#Область РаботаСКоллекциями

Функция НайтиЗубыВКарте(СтруктураАдресЗК, МассивЗубовИд) Экспорт
	
	МассивЗубов = Новый Массив;
	Для Каждого ЗубВКартеИдНомер Из МассивЗубовИд Цикл
		СтруктураЗуб = НайтиЗубВКарте(СтруктураАдресЗК, ЗубВКартеИдНомер);
		Если СтруктураЗуб <> Неопределено Тогда
			МассивЗубов.Добавить(СтруктураЗуб);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивЗубов;
	
КонецФункции

Функция НайтиЗубВКарте(СтруктураАдресЗК, Знач ЗубВКартеИдНомер) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	ТипЭлемента = ТипЗнч(ЗубВКартеИдНомер);
	Если ТипЭлемента = Тип("КлючИЗначение") Тогда
		ЗубВКартеИдНомер = ЗубВКартеИдНомер.Ключ;
		ТипЭлемента = ТипЗнч(ЗубВКартеИдНомер);
	КонецЕсли;
	
	Если ТипЭлемента = Тип("Структура") Тогда
		
		// Если передали структуру (возможно сам объект зуба), ищем идентификаторы для поиска в карте
		РеквизитПоиска = Неопределено;
		Если ЗубВКартеИдНомер.Свойство("ЗубВКарте") Тогда
			РеквизитПоиска = ЗубВКартеИдНомер.ЗубВКарте;
		ИначеЕсли ЗубВКартеИдНомер.Свойство("Идентификатор") Тогда
			РеквизитПоиска = ЗубВКартеИдНомер.Идентификатор;
		КонецЕсли;
		
		Если РеквизитПоиска <> Неопределено Тогда
			Возврат НайтиЗубВКарте(СтруктураЗК, РеквизитПоиска);
		КонецЕсли;
		
		Возврат Неопределено;
		
	ИначеЕсли ТипЭлемента = Тип("СправочникСсылка.стомЗубыКарты") Тогда
		Возврат СтруктураЗК.Зубы.Получить(ЗубВКартеИдНомер);
	ИначеЕсли ТипЭлемента = Тип("УникальныйИдентификатор") Тогда
		Возврат СтруктураЗК.ЗубыПоИд.Получить(ЗубВКартеИдНомер);
	ИначеЕсли ТипЭлемента = Тип("Строка") Тогда
		Если СтрДлина(ЗубВКартеИдНомер) = 36 Тогда
			Возврат СтруктураЗК.ЗубыПоИд.Получить(Новый УникальныйИдентификатор(ЗубВКартеИдНомер));
		КонецЕсли;
		Возврат СтруктураЗК.ЗубыПоНомеру.Получить(ЗубВКартеИдНомер);
	КонецЕсли;
	
КонецФункции

Функция НайтиСегментыВЗубе(СтруктураЗуб, МассивСегментовИд, ИсключатьДекоративные = Истина) Экспорт
	
	МассивСегментов = Новый Массив;
	Для Каждого СегментВЗубеИд Из МассивСегментовИд Цикл
		СтруктураТекСегмент = НайтиСегментВЗубе(СтруктураЗуб, СегментВЗубеИд);
		Если СтруктураТекСегмент <> Неопределено И Не (ИсключатьДекоративные И СтруктураТекСегмент.СтруктураСегмент.Декоративный) Тогда
			МассивСегментов.Добавить(СтруктураТекСегмент);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивСегментов;
	
КонецФункции 

Функция НайтиСегментВЗубе(СтруктураЗуб, СегментВЗубеИд) Экспорт

	ТипЭлемента = ТипЗнч(СегментВЗубеИд);
	ИдСегмента = СегментВЗубеИд;
	Если ТипЭлемента = Тип("Структура") Тогда
		Если СегментВЗубеИд.Свойство("СегментВЗубе") Тогда
			ИдСегмента = СегментВЗубеИд.СегментВЗубе.УникальныйИдентификатор();
		ИначеЕсли СегментВЗубеИд.Свойство("Идентификатор") Тогда
			ИдСегмента = СегментВЗубеИд.Идентификатор;
		КонецЕсли;
	ИначеЕсли ТипЭлемента = Тип("СправочникСсылка.стомСегментыЗубов") Тогда
		ИдСегмента = СегментВЗубеИд.УникальныйИдентификатор();
	ИначеЕсли ТипЭлемента = Тип("Строка") И СтрДлина(СегментВЗубеИд) = 36 Тогда
		ИдСегмента = Новый УникальныйИдентификатор(СегментВЗубеИд);
	КонецЕсли;
	
	Возврат СтруктураЗуб.ТекущиеСегменты.Получить(ИдСегмента);
	
КонецФункции

Функция КоллекциюЗубовВМассивИдентификаторов(СтруктураАдресЗК, Коллекция) Экспорт
	
	МассивИдентификаторов = Новый Массив;
	Если Коллекция.Количество() = 0 Тогда
		Возврат МассивИдентификаторов;
	КонецЕсли;
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	ТипКоллекции = ТипЗнч(Коллекция);
	Если ТипКоллекции = Тип("Массив") Тогда
		Возврат НайтиЗубыВКарте(СтруктураЗК, Коллекция);
	ИначеЕсли ТипКоллекции = Тип("Соответствие") Тогда
		Для Каждого кзЗуб Из Коллекция Цикл
			СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, кзЗуб.Ключ);
			Если СтруктураЗуб = Неопределено Тогда
				СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, кзЗуб.Значение);
			КонецЕсли;
			Если СтруктураЗуб <> Неопределено Тогда
				МассивИдентификаторов.Добавить(СтруктураЗуб);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивИдентификаторов;
	
КонецФункции

Функция КоллекциюСегментовВМассивИдентификаторов(СтруктураЗуб, Коллекция, ИсключатьДекоративные = Истина) Экспорт
	
	МассивИдентификаторов = Новый Массив;
	Если Коллекция.Количество() = 0 Тогда
		Возврат МассивИдентификаторов;
	КонецЕсли;
		
	ТипКоллекции = ТипЗнч(Коллекция);
	Если ТипКоллекции = Тип("Массив") Тогда
		Возврат НайтиСегментыВЗубе(СтруктураЗуб, Коллекция, ИсключатьДекоративные);
	ИначеЕсли ТипКоллекции = Тип("Соответствие") Тогда
		Для Каждого кзСегмент Из Коллекция Цикл
			СтруктураТекСегмент = НайтиСегментВЗубе(СтруктураЗуб, кзСегмент.Ключ);
			Если СтруктураТекСегмент = Неопределено Тогда
				СтруктураТекСегмент = НайтиСегментВЗубе(СтруктураЗуб, кзСегмент.Значение);
			КонецЕсли;
			Если СтруктураТекСегмент <> Неопределено И Не (ИсключатьДекоративные И СтруктураТекСегмент.СтруктураСегмент.Декоративный) Тогда
				МассивИдентификаторов.Добавить(СтруктураТекСегмент);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивИдентификаторов;
	
КонецФункции

Функция НайтиКонструкциюВКарте(СтруктураАдресЗК, КонструкцияИд) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	ИдКонструкции = КонструкцияИд;
	Если ТипЗнч(КонструкцияИд) = Тип("СправочникСсылка.стомКонструкцииЗубовКлиентов") Тогда
		ИдКонструкции = КонструкцияИд.УникальныйИдентифиатор();
	КонецЕсли;
	
	Возврат СтруктураЗК.Конструкции.Получить(ИдКонструкции);
	
КонецФункции

Функция НайтиКонструкциюПоВариантуОбластиЗубу(СтруктураАдресЗК, ЗубВКартеИд, Вариант = Неопределено, Область = Неопределено, ИскатьУдаленные = Ложь) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ЗубВКартеИд);
	
	Для Каждого кзКонструкция Из СтруктураЗК.Конструкции Цикл
		СтруктураКонструкция = кзКонструкция.Значение;
		Если (Вариант = Неопределено Или СтруктураКонструкция.Вариант = Вариант) И
			(Область = Неопределено Или СтруктураКонструкция.Область = Область) И
			СтруктураКонструкция.СоставЗубов.Найти(СтруктураЗуб.ЗубВКарте) <> Неопределено
			И (ИскатьУдаленные Или Не СтруктураКонструкция.Удалена)
		Тогда 
			Возврат СтруктураКонструкция;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьЗубыПоЧелюстиКвадрантуНомеру(СтруктураАдресЗК, ЧелюстьКвадрантНомер, ВернутьИдентификаторы = Истина) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	Зубы = Новый Соответствие;
	
	ЧелюстиКвадрантыНомера = ЧелюстьКвадрантНомер;
	Если ТипЗнч(ЧелюстьКвадрантНомер) <> Тип("Массив") Тогда
		ЧелюстиКвадрантыНомера = Новый Массив;
		ЧелюстиКвадрантыНомера.Добавить(ЧелюстьКвадрантНомер);
	КонецЕсли;
	
	Для Каждого кзЗуб Из СтруктураЗК.Зубы Цикл
		СтруктураЗуб = кзЗуб.Значение;
		Если СтруктураЗуб.Расположение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ЧелюстиКвадрантыНомера.Найти(СтруктураЗуб.Расположение.Квадрант) <> Неопределено Или
			 ЧелюстиКвадрантыНомера.Найти(СтруктураЗуб.Расположение.Челюсть) <> Неопределено Или
			 ЧелюстиКвадрантыНомера.Найти(СтруктураЗуб.Расположение.Номер) <> Неопределено
		Тогда 
			Если ВернутьИдентификаторы Тогда
				Зубы.Вставить(СтруктураЗуб.Идентификатор);
			Иначе
				Зубы.Вставить(СтруктураЗуб);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Зубы;
	
КонецФункции

Функция ПолучитьДиапазонЗубовПоВыделенным(СтруктураАдресЗК, МассивЗубовИд, ПоЧелюстиКвадранту = Неопределено) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	Если МассивЗубовИд.Количество() = 0 Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	ПолныйДиапазонЗубов = ДополнитьДиапазонЗубов(СтруктураЗК, МассивЗубовИд);
	
	Если ПоЧелюстиКвадранту = Неопределено Тогда
		Возврат ПолныйДиапазонЗубов;
	КонецЕсли;
	
	Если НРег(ПоЧелюстиКвадранту) = "челюсть" Тогда
		Поддиапазоны = Новый Структура("в, н", Новый Массив, Новый Массив);
		Для Каждого СтруктураЗуб Из ПолныйДиапазонЗубов Цикл
			Поддиапазоны[СтруктураЗуб.Расположение.Челюсть].Добавить(СтруктураЗуб);
		КонецЦикла;
	ИначеЕсли НРег(ПоЧелюстиКвадранту) = "квадрант" Тогда
		Поддиапазоны = Новый Структура("к1, к2, к3, к4", Новый Массив, Новый Массив, Новый Массив, Новый Массив);
		Для Каждого СтруктураЗуб Из ПолныйДиапазонЗубов Цикл
			Поддиапазоны["к" + СтруктураЗуб.Расположение.Квадрант].Добавить(СтруктураЗуб);
		КонецЦикла;
	Иначе	
		Возврат ПолныйДиапазонЗубов;
	КонецЕсли;
	
	// Возвращается максимальный диапазон
	МаксимальныйДиапазон = Новый Массив;
	Для Каждого кзДиапазон Из Поддиапазоны Цикл
		Если кзДиапазон.Значение.Количество() > МаксимальныйДиапазон.Количество() Тогда
			МаксимальныйДиапазон = кзДиапазон.Значение;
		КонецЕсли;
	КонецЦикла;
		
	Возврат МаксимальныйДиапазон;
	
КонецФункции

Функция ДополнитьДиапазонЗубов(СтруктураАдресЗК, МассивЗубовИд) Экспорт
	
	Если МассивЗубовИд.Количество() = 0 Тогда
		Возврат МассивЗубовИд;
	КонецЕсли;
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	МассивЗубов = Новый Массив;
	
	// Ищем минимальный и максимальный индекс в диапазоне
	МаксИндекс = 0;
	МинИндекс = СтруктураЗК.ДиапазонЗубов.Количество() - 1;
	Для Каждого ЗубВКартеИд Из МассивЗубовИд Цикл
		СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ЗубВКартеИд);
		МаксИндекс = Макс(МаксИндекс, СтруктураЗуб.Расположение.Порядок);
		МинИндекс = Мин(МинИндекс, СтруктураЗуб.Расположение.Порядок);
	КонецЦикла;
	
	Для Сч = МинИндекс По МаксИндекс Цикл
		МассивЗубов.Добавить(НайтиЗубВКарте(СтруктураЗК, СтруктураЗК.ДиапазонЗубов[Сч]));
	КонецЦикла;
	
	Возврат МассивЗубов;
	
КонецФункции

#КонецОбласти

#Область СохранениеЗагрузкаЗубнойКарты

Функция ПолучитьСтруктуруЗК(СтруктураАдресЗК) Экспорт
	
	СтруктураЗК = СтруктураАдресЗК;
	Если ЭтоАдресВременногоХранилища(СтруктураАдресЗК) Тогда
		СтруктураЗК = ПолучитьИзВременногоХранилища(СтруктураАдресЗК);
	КонецЕсли;
	
	Возврат СтруктураЗК;
	
КонецФункции

Процедура СохранитьСтруктуруЗК(СтруктураЗК, СтруктураАдресЗК = Неопределено) Экспорт
	
	Если СтруктураАдресЗК = Неопределено
		Или ЭтоАдресВременногоХранилища(СтруктураАдресЗК)
	Тогда
		ПоместитьВоВременноеХранилище(СтруктураЗК, СтруктураАдресЗК);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаВФорме

#Область Инициализация

Процедура ИнициализироватьЗубнуюКарту(Форма) Экспорт
	
	Объект = Форма.Объект;
	
	ОчиститьРеквизитыЗубнойКартыФормы(Форма);
	
	ДанныеЗК = Форма.стомДанныеЗубныхКарт;
	
	Если Не ЗначениеЗаполнено(Объект.Клиент) Или Не ЗначениеЗаполнено(Объект.ЗубнаяКарта) Или Не ЗначениеЗаполнено(Объект.ВариантЗубнойКарты) Тогда
		Возврат;
	КонецЕсли;
	
	// Инициализируем структуру зубной карты
	ДанныеЗК.Адрес = стомЗубнаяКартаИнициализация.ИнициализироватьЗубнуюКарту(
		Объект.ЗубнаяКарта, Объект.Клиент, Форма.УникальныйИдентификатор, Объект.Дата, Объект.ВариантЗубнойКарты, Объект.Ссылка);
	ДанныеЗК.СтруктураЗагружена = (ЗначениеЗаполнено(ДанныеЗК.Адрес) И ЭтоАдресВременногоХранилища(ДанныеЗК.Адрес));
	
	Если Не ДанныеЗК.СтруктураЗагружена Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитыЗубнойКартыФормы(Форма);
	
КонецПроцедуры

Процедура ОчиститьРеквизитыЗубнойКартыФормы(Форма)
	
	ЭтоФормаПриема = (ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.Прием"));
	
	// Очистка данных о приложении и структуре зубной карты
	ДанныеЗК = Форма.стомДанныеЗубныхКарт;
	Если ДанныеЗК <> Неопределено Тогда
		ОчиститьИсториюЗубов(ДанныеЗК.ИсторияЗубов);
		Если ЗначениеЗаполнено(ДанныеЗК.Адрес) И ЭтоАдресВременногоХранилища(ДанныеЗК.Адрес) Тогда
			УдалитьИзВременногоХранилища(ДанныеЗК.Адрес);
		КонецЕсли;
	КонецЕсли;
	Форма.стомДанныеЗубныхКарт = стомЗубнаяКартаМетодыКлиентСервер.ПолучитьСтруктуруДанныхЗК();
	
	// Очистка реквизитов формы
	Форма.стомДоступныеВарианты.ПолучитьЭлементы().Очистить();
	Форма.стомУстановленныеКонструкции.Очистить();
	Если ЭтоФормаПриема Тогда
		Форма.стомДоступныеСостояния.ПолучитьЭлементы().Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьИсториюЗубов(ИсторияЗубов) Экспорт
	
	ИсторияЗубов.Загружена = Ложь;
	ИсторияЗубов.СтруктураЗагружена = Ложь;
	Для Каждого кзДоступнаяДата Из ИсторияЗубов.ДоступныеДаты Цикл
		Если ЗначениеЗаполнено(кзДоступнаяДата.Значение) И ЭтоАдресВременногоХранилища(кзДоступнаяДата.Значение) Тогда
			УдалитьИзВременногоХранилища(кзДоступнаяДата.Значение);
		КонецЕсли;
	КонецЦикла;
	ИсторияЗубов.Адрес = "";
	ИсторияЗубов.ВыбраннаяДата = Неопределено;
	ИсторияЗубов.ДоступныеДаты.Очистить();
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыЗубнойКартыФормы(Форма)
	
	ДанныеЗК = Форма.стомДанныеЗубныхКарт;
	Если Не ДанныеЗК.СтруктураЗагружена Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоФормаПриема = (ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.Прием"));
	
	// Заполнение списка конструкций
	СтруктураЗК = стомЗубнаяКартаМетоды.ПолучитьСтруктуруЗК(ДанныеЗК.Адрес);
	Конструкции = Новый Массив;
	Для Каждого кзКонструкция Из СтруктураЗК.Конструкции Цикл
		Конструкции.Добавить(кзКонструкция.Значение);
	КонецЦикла;
	стомЗубнаяКартаМетодыКлиентСервер.ОбновитьСписокКонструкций(Форма.стомУстановленныеКонструкции, Конструкции);
	
	// Обновление условного оформления
	ДанныеЗК.СписокВыбораЗубов = стомЗубнаяКартаМетоды.ПолучитьСписокВыбораЗубов(ДанныеЗК.Адрес);
	УстановитьУсловноеОформлениеЗубов(Форма);
	УстановитьУсловноеОформлениеСостояний(Форма);
	
	Если ЭтоФормаПриема Тогда
		ОбновитьДанныеАктуализацииЗубнойКарты(Форма);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеЗубов(Форма) Экспорт
	
	ДанныеЗК = Форма.стомДанныеЗубныхКарт;
	Если Не ДанныеЗК.СтруктураЗагружена Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	ЭтоФормаПриема = (ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка.Прием"));
	
	НазванияПолейОформления = Новый Массив;
	Если ЭтоФормаПриема Тогда
		НазванияПолейОформления.Добавить("НазначенияНазначение");
		НазванияПолейОформления.Добавить("ДиагнозыЗубВКарте");
		НазванияПолейОформления.Добавить("РаботыЗубВКарте");
		НазванияПолейОформления.Добавить("стомДоступныеСостоянияЗубВКарте");
	Иначе
		НазванияПолейОформления.Добавить("КонструкцияЗуб");
	КонецЕсли;
	
	стомСтоматология.УстановитьУсловноеОформлениеЗубов(Форма, НазванияПолейОформления, ДанныеЗК.СписокВыбораЗубов);
	
	// Обновление списков выбора
	Для Каждого ИмяПоля Из НазванияПолейОформления Цикл
		Если ИмяПоля <> "НазначенияНазначение" Тогда
			Элементы[ИмяПоля].СписокВыбора.Очистить();
		КонецЕсли;
		Если ИмяПоля = "КонструкцияЗуб" Тогда
			Элементы[ИмяПоля].ТолькоПросмотр = (ДанныеЗК.СписокВыбораЗубов.Количество() = 0);
		КонецЕсли;
		Для Каждого ЭлементЗуб Из ДанныеЗК.СписокВыбораЗубов Цикл
			Элементы[ИмяПоля].СписокВыбора.Добавить(ЭлементЗуб.Значение, ЭлементЗуб.Представление);
		КонецЦикла;
	КонецЦикла;
	
	Если ЭтоФормаПриема Тогда
		Форма.стомЗубнаяКартаУпрощенная = стомЗубнаяКартаИнициализация.СформироватьТекстПоляУпрощеннойЗубнойКарты(ДанныеЗК.Адрес);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьУсловноеОформлениеСостояний(Форма)
	
	УсловноеОформление = Форма.УсловноеОформление;
	
	Для Каждого СтруктураСостояние Из ПараметрыСеанса.стомКешированныеДанныеЗК.Состояния.Состояния Цикл
		
		ЦветФона = ПолучитьИзВременногоХранилища(СтруктураСостояние.Цвет);
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "СостоянияЗубов";
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("стомДоступныеСостоянияСостояниеУстановлено");
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("стомДоступныеСостояния.СостояниеСегмент");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = СтруктураСостояние.Состояние;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "СостоянияЗубов";
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("стомИсторияЗубовОбластьЦвет");
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("стомИсторияЗубов.Элемент");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = СтруктураСостояние.Состояние;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьДанныеАктуализацииЗубнойКарты(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	ДанныеЗК = Форма.стомДанныеЗубныхКарт;
	
	Если Не (ЗначениеЗаполнено(Объект.Клиент) И ЗначениеЗаполнено(Объект.ЗубнаяКарта)) Тогда
		Элементы.ГруппаАктуализацияЗубнойКарты.Видимость = Ложь;
		Возврат;
	Иначе
		Элементы.ГруппаАктуализацияЗубнойКарты.Видимость = Истина;
	КонецЕсли;
	
	ДатаИзменений = стомСтоматология.ПолучитьДатуПоследнихИзмененийЗубнойКарты(Объект.ЗубнаяКарта, Объект.Клиент, Объект.Ссылка);
	Если ДатаИзменений = Неопределено Тогда
		Элементы.ДекорацияАктуальностьЗубнойКарты.Заголовок = "Последний раз актуализация зубной карты производилась:";
		Элементы.ДекорацияАктуальностьЗубнойКартыПериод.Заголовок = "никогда";
		Элементы.ДекорацияАктуальностьЗубнойКартыПериод.ЦветТекста = WebЦвета.Красный;
		Элементы.стомДокументПоследнейАктуализацииЗубнойКарты.Видимость = Ложь;
		ДанныеЗК.ДатаПоследнейАкутализации = Неопределено;
	Иначе
		Элементы.ДекорацияАктуальностьЗубнойКарты.Заголовок = "Последний раз актуализация зубной карты производилась:";
		Элементы.стомДокументПоследнейАктуализацииЗубнойКарты.Видимость = Истина;
		Форма.стомДокументПоследнейАктуализацииЗубнойКарты = ДатаИзменений.Документ;
		ДанныеЗК.ДатаПоследнейАкутализации = НачалоДня(ДатаИзменений.Период);
		ДатаОтсчета = НачалоДня(ТекущаяДата());
		ПериодСтрокой = ОбщегоНазначенияКлиентСерверПереопределяемый.ПолучитьПредставлениеИнтервалаМесяцГод(ДанныеЗК.ДатаПоследнейАкутализации, ДатаОтсчета);
		Элементы.ДекорацияАктуальностьЗубнойКартыПериод.Заголовок = "";
		Если Не ПустаяСтрока(ПериодСтрокой) Тогда
			Элементы.ДекорацияАктуальностьЗубнойКартыПериод.Заголовок = ПериодСтрокой + " назад";
		КонецЕсли;
		
		Если ДобавитьМесяц(НачалоМесяца(ДанныеЗК.ДатаПоследнейАкутализации), 5) < НачалоМесяца(ДатаОтсчета) Тогда
			Элементы.ДекорацияАктуальностьЗубнойКартыПериод.ЦветТекста = WebЦвета.Красный;
		Иначе
			Элементы.ДекорацияАктуальностьЗубнойКартыПериод.ЦветТекста = ДопСерверныеФункцииПовтИсп.ЦветСтиля("ПоясняющийТекст");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ВернутьСостояниеЗубнойКартыПоДиагнозу(СтруктураАдресЗК, ДиагнозСсылка) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	ПозицияДиагнозаВМаске = Неопределено;
	
	Для каждого СтруктураДиагноза Из СтруктураЗК.ДанныеДиагнозов.Диагнозы Цикл
		
		Если СтруктураДиагноза.Диагноз = ДиагнозСсылка Тогда
			// Позиция в маске - это индекс в массиве масок состояний
			ПозицияДиагнозаВМаске = СтруктураДиагноза.ПозицияВМаске;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПозицияДиагнозаВМаске = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Проходим по элементам фиксированного соответствия, внутри находится массив с значениями масок
	Для каждого МаскаСостояния Из СтруктураЗК.ДанныеДиагнозов.МаскиСостояний Цикл
		
		// При соответствии будет возвращено "Истина"
		Если МаскаСостояния.Значение.Получить(ПозицияДиагнозаВМаске) Тогда
			Возврат МаскаСостояния.Ключ;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции 

Функция ПолучитьСегментыЗубаИмеющиеСостояниенаМоментПоиска(СтруктураЗуб, СостояниеИдентификатор) Экспорт
	
	Сегменты = Новый Массив;
	ИдСостояния = СостояниеИдентификатор;
	Если ТипЗнч(СостояниеИдентификатор) = Тип("СправочникСсылка.стомСостоянияЗубов") Тогда
		ИдСостояния = СостояниеИдентификатор.УникальныйИдентификатор();
	КонецЕсли;
	
	// Ищем сегменты по областям
	Для Каждого кзСегмент Из СтруктураЗуб.ТекущиеСегменты Цикл
		СтруктураТекСегмент = кзСегмент.Значение;
		Если СтруктураТекСегмент.Состояния.Получить(ИдСостояния) <> Неопределено Тогда
			Сегменты.Добавить(СтруктураТекСегмент.СегментВЗубе);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Сегменты;
	
КонецФункции

#КонецОбласти

#Область ВзаимодействиеСЭлементами

Функция ПолучитьДоступныеСостоянияСегментов(СтруктураАдресЗК, ВыделенныеЗубыСегменты, ТолькоПересекающиеся = Истина, ВыделятьВсеСегментыЗубаЕслиСписокПустой = Истина)
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	МассивСостояний = Новый Массив;
	МассивУстановленныхСостояний = Новый Массив;
	СтруктураВозврат = Новый Структура("Состояния, УстановленныеСостояния", МассивСостояний, МассивУстановленныхСостояний);
	
	ВыделенныеСегментыЗубы = Новый Массив;
	Для Каждого ВыделенныйЗуб Из ВыделенныеЗубыСегменты Цикл
		ВыделенныеСегменты = ВыделенныйЗуб.Сегменты;
		СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ВыделенныйЗуб.ЗубВКарте);
		Если ВыделенныеСегменты.Количество() = 0 И ВыделятьВсеСегментыЗубаЕслиСписокПустой Тогда
			Для Каждого кзСегмент Из СтруктураЗуб.ТекущиеСегменты Цикл
				СтруктураТекСегмент = кзСегмент.Значение;
				Если СтруктураТекСегмент.СтруктураСегмент.Декоративный Тогда
					Продолжить;
				КонецЕсли;
				ВыделенныеСегментыЗубы.Добавить(
					Новый Структура("СтруктураТекСегмент, СтруктураЗуб", СтруктураТекСегмент, СтруктураЗуб));
			КонецЦикла;
		Иначе
			Для Каждого СегментВЗубе Из ВыделенныеСегменты Цикл
				ИдСегмента = СегментВЗубе.УникальныйИдентификатор();
				СтруктураТекСегмент = СтруктураЗуб.ТекущиеСегменты.Получить(ИдСегмента);
				Если СтруктураТекСегмент = Неопределено Тогда// Такого сегмента в зубе нет - невозможно установить пересечение состояний
					Возврат СтруктураВозврат;
				КонецЕсли;
				ВыделенныеСегментыЗубы.Добавить(
					Новый Структура("СтруктураТекСегмент, СтруктураЗуб", СтруктураТекСегмент, СтруктураЗуб));
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	// Собираем побитовые маски состояний областей выделенных сегментов
	МаскиСостояний = Новый Массив;
	Для Каждого ВыделенныйСегментЗуб Из ВыделенныеСегментыЗубы Цикл
		
		СтруктураЗуб = ВыделенныйСегментЗуб.СтруктураЗуб;
		СтруктураТекСегмент = ВыделенныйСегментЗуб.СтруктураТекСегмент;
		
		МаскаОбласти = СтруктураЗК.ДанныеСостояний.МаскиОбластей.Получить(СтруктураТекСегмент.СтруктураСегмент.Область);
		Если МаскаОбласти = Неопределено Тогда// Не найдена маска - пересекающихся состояний нет
			Если ТолькоПересекающиеся Тогда
				Возврат СтруктураВозврат;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		МаскиСостояний.Добавить(МаскаОбласти);
		
	КонецЦикла;
	
	Если МаскиСостояний.Количество() = 0 Тогда
		Возврат СтруктураВозврат;
	КонецЕсли;
	
	Если МаскиСостояний.Количество() > 1 Тогда
		Если ТолькоПересекающиеся Тогда
			МаскаПересечения = ПобитовыеОперацииКлиентСервер.ПобитовоеИМассив(МаскиСостояний);
		Иначе
			МаскаПересечения = ПобитовыеОперацииКлиентСервер.ПобитовоеИлиМассив(МаскиСостояний);
		КонецЕсли;
	Иначе
		МаскаПересечения = МаскиСостояний[0];
	КонецЕсли;
	
	// Получаем полный список состояний для вывода
	ПересекающиесяСостояния = ПобитовыеОперацииКлиентСервер.ПолучитьЭлементыМаски(СтруктураЗК.ДанныеСостояний.Состояния, МаскаПересечения);
	
	КешСостоянийОбласти = Новый Соответствие;
	Для Каждого СтруктураСостояние Из ПересекающиесяСостояния Цикл
		
		// Добавляем состояниям сами сегменты и отмечаем те, у которых состояние установлено
		ВыделенныеСегменты = Новый Массив;
		ВыбраноСегментов = 0;
		Для Каждого ВыделенныйСегментЗуб Из ВыделенныеСегментыЗубы Цикл
			
			СтруктураЗуб = ВыделенныйСегментЗуб.СтруктураЗуб;
			СтруктураТекСегмент = ВыделенныйСегментЗуб.СтруктураТекСегмент;
		
			СостоянияОбласти = КешСостоянийОбласти.Получить(СтруктураТекСегмент.СтруктураСегмент.Область);
			Если СостоянияОбласти = Неопределено Тогда
				МаскаОбласти = СтруктураЗК.ДанныеСостояний.МаскиОбластей.Получить(СтруктураТекСегмент.СтруктураСегмент.Область);
				Если МаскаОбласти = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				СостоянияОбласти = ПобитовыеОперацииКлиентСервер.ПолучитьЭлементыМаски(СтруктураЗК.ДанныеСостояний.Состояния, МаскаОбласти);
				КешСостоянийОбласти.Вставить(СтруктураТекСегмент.СтруктураСегмент.Область, СостоянияОбласти);
			КонецЕсли;
			
			Если СостоянияОбласти.Найти(СтруктураСостояние) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИдСостояния = СтруктураСостояние.Состояние.УникальныйИдентификатор();
			ВыделенныйСегмент = Новый Структура("ЗубВКарте, СегментВЗубе, Выбран",
				СтруктураЗуб.ЗубВКарте, СтруктураТекСегмент.СегментВЗубе, Ложь);
			Если СтруктураТекСегмент.Состояния.Получить(ИдСостояния) <> Неопределено Тогда
				ВыделенныйСегмент.Выбран = Истина;
				ВыбраноСегментов = ВыбраноСегментов + 1;
				МассивУстановленныхСостояний.Добавить(
					Новый Структура("Состояние, СегментВЗубе", 
					СтруктураСостояние.Состояние, СтруктураТекСегмент.СегментВЗубе));
			КонецЕсли;
			ВыделенныеСегменты.Добавить(ВыделенныйСегмент);
			
		КонецЦикла;
		
		СтруктураСостояние = Новый Структура("Состояние, КоличествоСегментов, ВыбраноСегментов, Сегменты",
			СтруктураСостояние.Состояние, ВыделенныеСегменты.Количество(), ВыбраноСегментов, ВыделенныеСегменты);
		МассивСостояний.Добавить(СтруктураСостояние);
		
	КонецЦикла;
	
	Возврат СтруктураВозврат;
	
КонецФункции

Функция ПолучитьДоступныеВариантыЗубов(СтруктураАдресЗК, ВыделенныеЗубыСегменты)
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	МассивВариантов = Новый Массив;
	МассивУстановленныхВариантов = Новый Массив;
	СтруктураВозврат = Новый Структура("Варианты, УстановленныеВарианты", МассивВариантов, МассивУстановленныхВариантов);
	
	Если ВыделенныеЗубыСегменты.Количество() = 0 Тогда
		Возврат СтруктураВозврат;
	КонецЕсли;
	
	// Собираем побитовые маски состояний областей выделенных сегментов
	МассивСтруктурЗубов = Новый Массив;
	МаскиВариантов = Новый Массив;
	Для Каждого ВыделенныйЗуб Из ВыделенныеЗубыСегменты Цикл
		
		СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ВыделенныйЗуб.ЗубВКарте);
		Если СтруктураЗуб = Неопределено Тогда// Не найден зуб - пересекающихся вариантов нет 
			Возврат СтруктураВозврат;
		КонецЕсли;
		
		МассивСтруктурЗубов.Добавить(СтруктураЗуб);
		
		МаскаЗуба = СтруктураЗК.ДанныеВариантов.МаскиВариантов.Получить(СтруктураЗуб.ЗубВКарте);
		Если МаскаЗуба = Неопределено Тогда// Не найдена маска - пересекающихся вариантов нет
			Возврат СтруктураВозврат;
		КонецЕсли;
		
		МаскиВариантов.Добавить(МаскаЗуба);
		
	КонецЦикла;
		
	Если МаскиВариантов.Количество() = 0 Тогда
		Возврат СтруктураВозврат;
	КонецЕсли;
	
	КоличествоЗубов = МассивСтруктурЗубов.Количество();
	
	// Вычисляем варианты, доступные для всех выделенных зубов
	Если МаскиВариантов.Количество() > 1 Тогда
		МаскаПересечения = ПобитовыеОперацииКлиентСервер.ПобитовоеИМассив(МаскиВариантов);
	Иначе
		МаскаПересечения = МаскиВариантов[0];
	КонецЕсли;
	ПересекающиесяВарианты = ПобитовыеОперацииКлиентСервер.ПолучитьЭлементыМаски(СтруктураЗК.ДанныеВариантов.Варианты, МаскаПересечения);
	
	Для Каждого ПересекающийсяВариант Из ПересекающиесяВарианты Цикл
		
		СтруктураВариант = Новый Структура("Вариант, Основной, Конструкция, КоличествоЗубов, ВыбраноЗубов, Области, Зубы", 
			ПересекающийсяВариант.Вариант, ПересекающийсяВариант.Основной, ПересекающийсяВариант.Конструкция, 0, 0, Новый Массив, Новый Массив);
			
		МассивВариантов.Добавить(СтруктураВариант);
		
		СтруктураВариант.КоличествоЗубов = КоличествоЗубов;
		Если СтруктураВариант.Основной Тогда
			СтруктураВариант.КоличествоЗубов = КоличествоЗубов;
		Иначе
			СтруктураВариант.КоличествоЗубов = КоличествоЗубов * ПересекающийсяВариант.Области.Количество();
			Для Каждого Область Из ПересекающийсяВариант.Области Цикл
				СтруктураОбласть = Новый Структура("Область, Конструкция, КоличествоЗубов, ВыбраноЗубов, Зубы", 
					Область, СтруктураВариант.Конструкция, КоличествоЗубов, 0, Новый Массив);
				СтруктураВариант.Области.Добавить(СтруктураОбласть);
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого СтруктураЗуб Из МассивСтруктурЗубов Цикл
			
			ИдВарианта = СтруктураВариант.Вариант.УникальныйИдентификатор();
			
			СтруктураВариантЗуба = СтруктураЗуб.Варианты.Получить(СтруктураВариант.Вариант);
			Если СтруктураВариантЗуба = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтруктураВариантЗуба.Основной Тогда
				ВыделенныйЗуб = Новый Структура("ЗубВКарте, Выбран", СтруктураЗуб.ЗубВКарте, Ложь);
				СтруктураВариант.Зубы.Добавить(ВыделенныйЗуб);
				Если СтруктураВариантЗуба.Выбран Тогда
					ВыделенныйЗуб.Выбран = Истина;
					СтруктураВариант.ВыбраноЗубов = СтруктураВариант.ВыбраноЗубов + 1;
					МассивУстановленныхВариантов.Добавить(
						Новый Структура("Вариант, Область, ЗубВКарте", 
						СтруктураВариант.Вариант, , СтруктураЗуб.ЗубВКарте));
				КонецЕсли;
			Иначе
				Для Каждого СтруктураОбласть Из СтруктураВариант.Области Цикл
					ВыделенныйЗуб = Новый Структура("ЗубВКарте, Выбран", СтруктураЗуб.ЗубВКарте, Ложь);
					СтруктураОбласть.Зубы.Добавить(ВыделенныйЗуб);
					СтруктураОбластьЗуба = СтруктураВариантЗуба.Области.Получить(СтруктураОбласть.Область);
					Если СтруктураОбластьЗуба <> Неопределено И СтруктураОбластьЗуба.Выбран Тогда
						ВыделенныйЗуб.Выбран = Истина;
						СтруктураВариант.ВыбраноЗубов = СтруктураВариант.ВыбраноЗубов + 1;
						СтруктураОбласть.ВыбраноЗубов = СтруктураОбласть.ВыбраноЗубов + 1;
						МассивУстановленныхВариантов.Добавить(
							Новый Структура("Вариант, Область, ЗубВКарте", 
							СтруктураВариант.Вариант, СтруктураОбласть.Область, СтруктураЗуб.ЗубВКарте));
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат СтруктураВозврат;
	
КонецФункции

Функция ПолучитьДоступныеДиагнозыСостояний(СтруктураАдресЗК, ВыделенныеЗубыСегменты, УстановленныеДиагнозы)
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	ТаблицаДиагнозов = Новый ТаблицаЗначений;
	ТаблицаДиагнозов.Колонки.Добавить("Диагноз",	 Новый ОписаниеТипов("СправочникСсылка.Диагнозы"));
	ТаблицаДиагнозов.Колонки.Добавить("КодДиагноза", Новый ОписаниеТипов("Строка"));
	ТаблицаДиагнозов.Колонки.Добавить("Установлено", Новый ОписаниеТипов("Булево"));
	ТаблицаДиагнозов.Колонки.Добавить("Подходящий",	 Новый ОписаниеТипов("Булево"));
	
	КолонкиСортировки = "Установлено УБЫВ, Подходящий УБЫВ, КодДиагноза";
	СоотвСтрокТаблицыДиагнозов = Новый Соответствие;
	
	// Заполняем соответствие всеми диагнозами
	Для Каждого ДоступныйДиагноз Из СтруктураЗК.ДанныеДиагнозов.Диагнозы Цикл
		СтрокаДиагноз = ТаблицаДиагнозов.Добавить();
		СтрокаДиагноз.Диагноз = ДоступныйДиагноз.Диагноз;
		//СтрокаДиагноз.КодДиагноза = ДоступныйДиагноз.КодДиагноза;
		СоотвСтрокТаблицыДиагнозов.Вставить(ДоступныйДиагноз.Диагноз, СтрокаДиагноз);
	КонецЦикла;
	
	// Заполнение кода диагноза
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка КАК Диагноз, КодДиагноза ИЗ Справочник.Диагнозы ГДЕ Ссылка В (&Диагнозы)");
	Запрос.УстановитьПараметр("Диагнозы", ТаблицаДиагнозов.ВыгрузитьКолонку("Диагноз"));
	Выб = Запрос.Выполнить().Выбрать();
	Отбор = Новый Структура("Диагноз");
	Для Каждого СтрокаДиагноз Из ТаблицаДиагнозов Цикл
		Выб.Сбросить();
		Отбор.Диагноз = СтрокаДиагноз.Диагноз;
		Если Выб.НайтиСледующий(Отбор) Тогда
			СтрокаДиагноз.КодДиагноза = Выб.КодДиагноза;
		КонецЕсли;
	КонецЦикла;
	
	Если ВыделенныеЗубыСегменты.Количество() = 0 Тогда
		Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДиагнозов);
	КонецЕсли;
	
	// Собираем побитовые маски диагнозов установленных состояний выделенных сегментов для определения подходящих
	МаскиДиагнозов = Новый Массив;
	Для Каждого ВыделенныйЗуб Из ВыделенныеЗубыСегменты Цикл
		
		ВыделенныеСегменты = ВыделенныйЗуб.Сегменты;
		СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ВыделенныйЗуб.ЗубВКарте);
		
		// Добавим возможность при выделении всего зуба (и только его) на приоритезированное отображение диагнозов
		// Выделен весь зуб, без сегментов. Пройдёмся по всем, чтобы определить диагнозы
		Если ВыделенныеСегменты.Количество() = 0 Тогда
			Для каждого СтруктураТекСегмент Из СтруктураЗуб.ТекущиеСегменты Цикл
				Для Каждого кзСостояние Из СтруктураТекСегмент.Значение.Состояния Цикл
					СтруктураСостояние = кзСостояние.Значение;
					МаскаСостояния = СтруктураЗК.ДанныеДиагнозов.МаскиСостояний.Получить(СтруктураСостояние.Состояние);
					Если МаскаСостояния = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					МаскиДиагнозов.Добавить(МаскаСостояния);
				КонецЦикла;
			КонецЦикла;
			
			// Перейдём к следующему зубу
			Продолжить;
		КонецЕсли;
		
		// Проходим по неизвестному заранее кол-ву сегментов 
		Для Каждого СегментВЗубе Из ВыделенныеСегменты Цикл
			
			ИдСегмента = СегментВЗубе.УникальныйИдентификатор();
			СтруктураТекСегмент = СтруктураЗуб.ТекущиеСегменты.Получить(ИдСегмента);
			Если СтруктураТекСегмент = Неопределено Тогда
				Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДиагнозов);
			КонецЕсли;
			
			Для Каждого кзСостояние Из СтруктураТекСегмент.Состояния Цикл
				СтруктураСостояние = кзСостояние.Значение;
				МаскаСостояния = СтруктураЗК.ДанныеДиагнозов.МаскиСостояний.Получить(СтруктураСостояние.Состояние);
				Если МаскаСостояния = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				МаскиДиагнозов.Добавить(МаскаСостояния);
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Отмечаем подходящие
	Если МаскиДиагнозов.Количество() > 0 Тогда
		
		Если МаскиДиагнозов.Количество() > 1 Тогда
			МаскаПересечения = ПобитовыеОперацииКлиентСервер.ПобитовоеИлиМассив(МаскиДиагнозов);
		Иначе
			МаскаПересечения = МаскиДиагнозов[0];
		КонецЕсли;
		
		// Получаем полный список состояний для вывода
		ПересекающиесяДиагнозы = ПобитовыеОперацииКлиентСервер.ПолучитьЭлементыМаски(СтруктураЗК.ДанныеДиагнозов.Диагнозы, МаскаПересечения);
		
		Для Каждого СтруктураДиагноз Из ПересекающиесяДиагнозы Цикл
			СоотвСтрокТаблицыДиагнозов[СтруктураДиагноз.Диагноз].Подходящий = Истина;
		КонецЦикла;
		
	КонецЕсли;
	
	// Отмечаем установленные диагнозы
	Для Каждого СтрокаУстановленныйДиагноз Из УстановленныеДиагнозы Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаУстановленныйДиагноз.Диагноз) Или Не ЗначениеЗаполнено(СтрокаУстановленныйДиагноз.ЗубВКарте) Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаДиагноз = СоотвСтрокТаблицыДиагнозов.Получить(СтрокаУстановленныйДиагноз.Диагноз);
		Если СтрокаДиагноз = Неопределено Или СтрокаДиагноз.Установлено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ВыделенныйЗуб Из ВыделенныеЗубыСегменты Цикл
			ЗубВКарте = ВыделенныйЗуб.ЗубВКарте;
			Если ЗубВКарте <> СтрокаУстановленныйДиагноз.ЗубВКарте Тогда
				Продолжить;
			КонецЕсли;
			СтрокаДиагноз.Установлено = Истина;
			
			// Если есть сегмент у тек. зуба, а у диагноза - нет и наоборот
			Если ((ЗначениеЗаполнено(СтрокаУстановленныйДиагноз.СегментВЗубе) И (НЕ ВыделенныйЗуб.Сегменты.Количество() = 0) И ВыделенныйЗуб.Сегменты.Найти(СтрокаУстановленныйДиагноз.СегментВЗубе) = Неопределено)
				Или (Не ЗначениеЗаполнено(СтрокаУстановленныйДиагноз.СегментВЗубе) И ВыделенныйЗуб.Сегменты.Количество() > 0))
			Тогда
				Продолжить;
			КонецЕсли;
			
			Прервать;
		КонецЦикла;
		
	КонецЦикла;
	
	ТаблицаДиагнозов.Сортировать(КолонкиСортировки);
	ТаблицаДиагнозов.Колонки.Удалить("КодДиагноза");
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаДиагнозов);
	
КонецФункции

Функция ПолучитьСписокВыбораЗубов(СтруктураАдресЗК, ВключатьКонструкции = Истина) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	ОбозначенияЗубов = Новый СписокЗначений;
	Для Каждого кзЗуб Из СтруктураЗК.Зубы Цикл
		СтруктураЗуб = кзЗуб.Значение;
		ОбозначениеЗуба = ПолучитьОбозначениеЗуба(СтруктураЗК, СтруктураЗуб.ЗубВКарте);
		ОбозначенияЗубов.Добавить(СтруктураЗуб.ЗубВКарте, ОбозначениеЗуба);
	КонецЦикла;
	
	Если ВключатьКонструкции Тогда
		Для Каждого кзКонструкция Из СтруктураЗК.Конструкции Цикл
			СтруктураКонструкция = кзКонструкция.Значение;
			ОбозначенияЗубов.Добавить(СтруктураКонструкция.Конструкция, СтруктураКонструкция.Обозначение);
		КонецЦикла;
	КонецЕсли;
	
	ОбозначенияЗубов.СортироватьПоПредставлению();
	
	Возврат ОбозначенияЗубов;
	
КонецФункции

Функция ПолучитьСписокВыбораСегментов(СтруктураАдресЗК, ЗубВКартеИд, ИсключатьДекоративные = Истина, ИсключатьКонструкции = Истина) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	ОбозначенияСегментов = Новый СписокЗначений;
	
	СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ЗубВКартеИд);
	Если СтруктураЗуб = Неопределено Тогда
		Возврат ОбозначенияСегментов;
	КонецЕсли;
	
	Для Каждого кзСегмент Из СтруктураЗуб.ТекущиеСегменты Цикл
		
		СтруктураТекСегмент = кзСегмент.Значение;
		Если ИсключатьДекоративные И СтруктураТекСегмент.СтруктураСегмент.Декоративный Тогда
			Продолжить;
		КонецЕсли;
		Если ИсключатьКонструкции И СтруктураТекСегмент.СтруктураСегмент.Конструкция Тогда
			Продолжить;
		КонецЕсли;
		
		ОбозначениеСегмента = СтруктураТекСегмент.Обозначение;
		Если Не ПустаяСтрока(СтруктураТекСегмент.ОбозначениеСостояний) Тогда
			ОбозначениеСегмента = ОбозначениеСегмента + " (" + СтруктураТекСегмент.ОбозначениеСостояний + ")";
		КонецЕсли;
		
		ОбозначенияСегментов.Добавить(СтруктураТекСегмент.СегментВЗубе, ОбозначениеСегмента);
		
	КонецЦикла;
	
	ОбозначенияСегментов.СортироватьПоПредставлению();
	
	Возврат ОбозначенияСегментов;
	
КонецФункции

#КонецОбласти

#Область ВзаимодействиеСJS

Функция ПолучитьДанныеОВыделенныхЗубахСегментах(СтруктураАдресЗК, ВыделенныеЗубыСегментыJS, 
	ВозвращатьДанныеВариантов = Истина, ВозвращатьДанныеСостояний = Истина, Знач УстановленныеДиагнозы = Неопределено) Экспорт
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	ВыделенныеЗубыСегменты = СформироватьСтруктуруВыделенныхЗубовСегментов(СтруктураЗК, ВыделенныеЗубыСегментыJS);
	
	СтруктураЗК.ВыделенныеЗубыСегменты = ВыделенныеЗубыСегменты;
	
	ДанныеОВыделении = Новый Структура;
	ДанныеОВыделении.Вставить("ВыделенныеЗубыСегменты", ВыделенныеЗубыСегменты);
	Если ВозвращатьДанныеВариантов Тогда
		ДанныеОВыделении.Вставить("ВариантыЗубов", ПолучитьДоступныеВариантыЗубов(СтруктураЗК, ВыделенныеЗубыСегменты));
	КонецЕсли;
	Если ВозвращатьДанныеСостояний Тогда
		ДанныеОВыделении.Вставить("СостоянияЗубов", ПолучитьДоступныеСостоянияСегментов(СтруктураЗК, ВыделенныеЗубыСегменты, Ложь));
	КонецЕсли;
	Если УстановленныеДиагнозы <> Неопределено Тогда
		ДанныеОВыделении.Вставить("Диагнозы", ПолучитьДоступныеДиагнозыСостояний(СтруктураЗК, ВыделенныеЗубыСегменты, УстановленныеДиагнозы));
	КонецЕсли;
	
	Возврат ДанныеОВыделении;
	
КонецФункции

Функция СформироватьСтруктуруВыделенныхЗубовСегментов(СтруктураАдресЗК, ВыделенныеЗубыСегментыJS) 
	
	СтруктураЗК = ПолучитьСтруктуруЗК(СтруктураАдресЗК);
	
	// Выделенные зубы JS уже преобразованы
	Если ТипЗнч(ВыделенныеЗубыСегментыJS) = Тип("Массив") Тогда
		Возврат ВыделенныеЗубыСегментыJS;
	КонецЕсли;
	
	ВыделенныеЗубыСегменты = Новый Массив;
	Для Каждого кзЗуб Из ВыделенныеЗубыСегментыJS Цикл
		ИдЗуба = кзЗуб.Ключ;
		ВыделенныеСегменты = кзЗуб.Значение;
		СтруктураЗуб = НайтиЗубВКарте(СтруктураЗК, ИдЗуба);
		СтруктураВыделенныйЗуб = Новый Структура("ЗубВКарте, Сегменты", СтруктураЗуб.ЗубВКарте, Новый Массив);
		ВыделенныеЗубыСегменты.Добавить(СтруктураВыделенныйЗуб);
		Если ВыделенныеСегменты <> Неопределено Тогда
			Для Каждого кзСегмент Из ВыделенныеСегменты Цикл
				ИдСегмента = кзСегмент.Ключ;
				СтруктураСегмент = НайтиСегментВЗубе(СтруктураЗуб, ИдСегмента);
				Если СтруктураСегмент <> Неопределено Тогда
					СтруктураВыделенныйЗуб.Сегменты.Добавить(СтруктураСегмент.СегментВЗубе);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВыделенныеЗубыСегменты;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ФиксированноеРасположениеЗубов

Функция ПолучитьРасположениеЗубов() Экспорт
	
	РасположениеЗубов = Новый Соответствие;
	
	РасположениеЗубов.Вставить("18", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "18", 0, "в", "1"));
	РасположениеЗубов.Вставить("17", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "17", 1, "в", "1"));
	РасположениеЗубов.Вставить("16", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "16", 2, "в", "1"));
	РасположениеЗубов.Вставить("15", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "15", 3, "в", "1"));
	РасположениеЗубов.Вставить("14", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "14", 4, "в", "1"));
	РасположениеЗубов.Вставить("13", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "13", 5, "в", "1"));
	РасположениеЗубов.Вставить("12", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "12", 6, "в", "1"));
	РасположениеЗубов.Вставить("11", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "11", 7, "в", "1"));
	
	РасположениеЗубов.Вставить("21", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "21", 8, "в", "2"));
	РасположениеЗубов.Вставить("22", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "22", 9, "в", "2"));
	РасположениеЗубов.Вставить("23", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "23", 10, "в", "2"));
	РасположениеЗубов.Вставить("24", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "24", 11, "в", "2"));
	РасположениеЗубов.Вставить("25", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "25", 12, "в", "2"));
	РасположениеЗубов.Вставить("26", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "26", 13, "в", "2"));
	РасположениеЗубов.Вставить("27", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "27", 14, "в", "2"));
	РасположениеЗубов.Вставить("28", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "28", 15, "в", "2"));
	
	РасположениеЗубов.Вставить("48", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "48", 16, "н", "3"));
	РасположениеЗубов.Вставить("47", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "47", 17, "н", "3"));
	РасположениеЗубов.Вставить("46", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "46", 18, "н", "3"));
	РасположениеЗубов.Вставить("45", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "45", 19, "н", "3"));
	РасположениеЗубов.Вставить("44", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "44", 20, "н", "3"));
	РасположениеЗубов.Вставить("43", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "43", 21, "н", "3"));
	РасположениеЗубов.Вставить("42", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "42", 22, "н", "3"));
	РасположениеЗубов.Вставить("41", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "41", 23, "н", "3"));
	
	РасположениеЗубов.Вставить("31", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "31", 24, "н", "4"));
	РасположениеЗубов.Вставить("32", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "32", 25, "н", "4"));
	РасположениеЗубов.Вставить("33", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "33", 26, "н", "4"));
	РасположениеЗубов.Вставить("34", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "34", 27, "н", "4"));
	РасположениеЗубов.Вставить("35", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "35", 28, "н", "4"));
	РасположениеЗубов.Вставить("36", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "36", 29, "н", "4"));
	РасположениеЗубов.Вставить("37", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "37", 30, "н", "4"));
	РасположениеЗубов.Вставить("38", Новый Структура("Номер, Порядок, Челюсть, Квадрант", "38", 31, "н", "4"));
	
	Возврат РасположениеЗубов;
	
КонецФункции

Функция ПолучитьДиапазонЗубов() Экспорт
	
	мсСписокЗубов = Новый Массив;
	
	мсСписокЗубов.Добавить("18");
	мсСписокЗубов.Добавить("17");
	мсСписокЗубов.Добавить("16");
	мсСписокЗубов.Добавить("15");
	мсСписокЗубов.Добавить("14");
	мсСписокЗубов.Добавить("13");
	мсСписокЗубов.Добавить("12");
	мсСписокЗубов.Добавить("11");
	
	мсСписокЗубов.Добавить("21");
	мсСписокЗубов.Добавить("22");
	мсСписокЗубов.Добавить("23");
	мсСписокЗубов.Добавить("24");
	мсСписокЗубов.Добавить("25");
	мсСписокЗубов.Добавить("26");
	мсСписокЗубов.Добавить("27");
	мсСписокЗубов.Добавить("28");
	
	мсСписокЗубов.Добавить("48");
	мсСписокЗубов.Добавить("47");
	мсСписокЗубов.Добавить("46");
	мсСписокЗубов.Добавить("45");
	мсСписокЗубов.Добавить("44");
	мсСписокЗубов.Добавить("43");
	мсСписокЗубов.Добавить("42");
	мсСписокЗубов.Добавить("41");
	
	мсСписокЗубов.Добавить("31");
	мсСписокЗубов.Добавить("32");
	мсСписокЗубов.Добавить("33");
	мсСписокЗубов.Добавить("34");
	мсСписокЗубов.Добавить("35");
	мсСписокЗубов.Добавить("36");
	мсСписокЗубов.Добавить("37");
	мсСписокЗубов.Добавить("38");
	
	Возврат мсСписокЗубов;
	
КонецФункции

#КонецОбласти
