#Область СлужебныеПроцедурыИФункции

// Выполнение действий перед началом работы системы
//
Процедура ПередНачаломРаботыСистемы() Экспорт
	
	ТребуетсяПерезапуск = Ложь;
	
	ТребуетсяПерезапуск = ТребуетсяПерезапуск Или БИТСтили_ОформлениеИнтерфейса.ПриЗапускеСистемы();
	ТребуетсяПерезапуск = ТребуетсяПерезапуск Или ОбщегоНазначенияСервер.УстановитьКомпактныйРежимТакси();
	
	Если ТребуетсяПерезапуск Тогда
		ПрекратитьРаботуСистемы(Истина);
	КонецЕсли;
	
	// Вызов частных обработчиков подсистем и разделов
	
	// МедицинскаяДеятельностьКлиент
	ОбщийМодуль = ОбщегоНазначенияКлиент.ОбщийМодуль("МедицинскаяДеятельностьКлиент");
	Если ОбщийМодуль <> Неопределено Тогда
		ОбщийМодуль.ПередНачаломРаботыСистемы();
	КонецЕсли;
	
КонецПроцедуры

#Область ИнформацияОПрограмме

Функция ПолучитьИнформациюОПрограмме() Экспорт
	
	ИнформацияОПрограмме = УниверсальныеМеханизмыСервер.ПолучитьИнформациюОПрограммеСервер();
	ИнформацияКлиентское = СистемнаяИнформацияОКлиентскомПриложении();
	
	МассивДанныхИнформации = Новый Массив;
	
	ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "Конфигурация",		ИнформацияОПрограмме.ИмяКонфигурации);
	ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "Версия конфигурации", ИнформацияОПрограмме.ВерсияКонфигурации);
	ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "Версия платформы",	ИнформацияОПрограмме.ВерсияПлатформы);

	
	Если ЗначениеЗаполнено(ИнформацияОПрограмме.РасширенияКонфигурации) Тогда
		ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "Расширения конфигурации", Символы.ПС + ИнформацияОПрограмме.РасширенияКонфигурации);
	КонецЕсли;
	
	ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "", "");
	
	ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "Режим", ПредставлениеРежимаБазы(ИнформацияКлиентское.Режим));
	ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "Клиентское приложение",
		ИнформацияОПрограмме.ТипКлиента + " " + ИнформацияКлиентское.ТипПлатформы + " (" + ИнформацияКлиентское.ТипПлатформыТекст + ")" + " (RAM " + ИнформацияКлиентское.ОЗУ + "Гб)");
	//ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "ОС клиентского приложения",	ИнформацияОПрограмме.ВерсияОС + " (RAM " + ИнформацияКлиентское.ОЗУ + " Гб)");
	
	Если ИнформацияКлиентское.Режим <> "Файловый" Тогда
		ДобавитьФорматированнуюСтрокуВМассив(МассивДанныхИнформации, "Сервер ",	ИнформацияОПрограмме.ТипПлатформы + " (RAM " + ИнформацияОПрограмме.ОЗУ + "Гб)");
	КонецЕсли;
	
	Возврат МассивДанныхИнформации; 
	
КонецФункции

Процедура ДобавитьФорматированнуюСтрокуВМассив(МассивСтрок, Заголовок, Значение)
	
	ФС_Заголовок = Новый ФорматированнаяСтрока(Заголовок, Новый Шрифт(,,Истина,,Ложь));
	ФС = Новый ФорматированнаяСтрока(	ФС_Заголовок,
										?(ЗначениеЗаполнено(Заголовок), ": ", ""),
										Значение,
										Символы.ПС);
	МассивСтрок.Добавить(ФС);
	
КонецПроцедуры

Функция СистемнаяИнформацияОКлиентскомПриложении()
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Инфо = Новый Структура;
	Инфо.Вставить("ТипПлатформы", СистемнаяИнформация.ТипПлатформы);
	Инфо.Вставить("ТипПлатформыТекст", ?(СтрНайти(Строка(СистемнаяИнформация.ТипПлатформы), "64")>0, "64", "32") + НСтр("ru='-разрядный'"));
	Инфо.Вставить("ВерсияОС", СистемнаяИнформация.ВерсияОС);
	Инфо.Вставить("ОЗУ", Окр(СистемнаяИнформация.ОперативнаяПамять/1024 + 0.2));
	Инфо.Вставить("Режим", ПолучитьРежим());
	
	Возврат Инфо;
	
КонецФункции

Функция ПолучитьРежим()
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая(СтрокаСоединенияИнформационнойБазы()) Тогда
		Возврат "Файловый";
	ИначеЕсли ОбщегоНазначенияКлиентСервер.КлиентПодключенЧерезВебСервер() Тогда
		Возврат "ВебСерверный";
	Иначе
		Возврат "Серверный";
	КонецЕсли; 
	
КонецФункции

Функция ПредставлениеРежимаБазы(Режим)
	
	Если Режим = "Файловый" Тогда
		Возврат НСтр("ru='Файловый'");
	ИначеЕсли Режим = "ВебСерверный" Тогда
		Возврат НСтр("ru='Веб-серверный'");
	Иначе
		Возврат НСтр("ru='Серверный'");
	КонецЕсли; 
	
КонецФункции

#КонецОбласти

#Область ПечатныеФормы

// Процедура открывает общую форму выбора печатных форм. Выводит на печать документ.
//
// Параметры:
//  Объект			 - Метаданные				 - объект медаданных
//  ФормаВладелец	 - ФормаКлиентскогоПриложения	 - владелец ФормаВыбораПечатныхФорм.
//
Процедура ОткрытьФормуВыбораПечатныхФормОбъекта(Объект, ФормаВладелец) Экспорт
	
	Попытка 
		 //Открыть форму выбора печатных форм
		Если ТипЗнч(Объект) = Тип("Массив") Тогда 
			ДокСсылка = Объект[1];
			НаПринтер = Истина;
		Иначе 
			ДокСсылка = Объект;
			НаПринтер = Ложь;
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура("ТолькоПечать, ДокументСсылка", НаПринтер , ДокСсылка);
		
		ДополнительныеПараметры = Новый Структура;
		
		ДополнительныеПараметры.Вставить("Объект", Объект);
		ДополнительныеПараметры.Вставить("НаПринтер", НаПринтер);
		ДополнительныеПараметры.Вставить("ФормаВладелец", ФормаВладелец);
		ДополнительныеПараметры.Вставить("ДокСсылка", ДокСсылка);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораПечатныхФормОбъекта", УниверсальныеМеханизмыКлиент, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.ВыборПечатнойФормы", ПараметрыФормы, ФормаВладелец, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
		
КонецПроцедуры

Процедура ПослеЗакрытияФормыВыбораПечатныхФормОбъекта(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда 
		Объект = ДополнительныеПараметры.Объект; 
		ФормаВладелец = ДополнительныеПараметры.ФормаВладелец;
		НаПринтер = ДополнительныеПараметры.НаПринтер;
		ДокСсылка = ДополнительныеПараметры.ДокСсылка;
		
		Если ТипЗнч(Объект) = Тип("Массив") Тогда
			РедактированиеПакета = Ложь;
		Иначе 
			РедактированиеПакета = Результат.РедактированиеПакета;
		КонецЕсли;
		// Печать макета объекта
		Для Каждого Строка Из Результат.ДеревоМакетовПечати.ВыделенныеСтроки Цикл
			СтрокаКнопки = Результат.ДеревоМакетовПечати.ДанныеСтроки(Строка);
			Расшифровка = СтрокаКнопки.Расшифровка;
			мсПакет = Новый Массив;
			Если РедактированиеПакета И ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ПакетыПечати") Тогда 
				мсПакет.Добавить(СтрокаКнопки.СсылкаНаВнешнююОбработку);
			Иначе 
				Если ТипЗнч(Объект) = Тип("Массив") Тогда 
					Если ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ПакетыПечати") Тогда 
						СоставПакета = ПечатьДокументовСервер.ПередатьСоставВКлиент(СтрокаКнопки.СсылкаНаВнешнююОбработку, ДокСсылка);
					Иначе 
						СоставПакета = ПечатьДокументовСервер.ПередатьСоставВКлиент(СтрокаКнопки, ДокСсылка);
					КонецЕсли;	
					СтруктураНаПечать = ПечатьДокументовКлиент.НапечататьПакетДокументов(СоставПакета, ДокСсылка, СтрокаКнопки.СсылкаНаВнешнююОбработку, НаПринтер);
				Иначе 
					ВывестиНапечататьДокумент(Объект, Расшифровка,ДокСсылка,Результат.НаПринтер,ФормаВладелец,СтрокаКнопки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если мсПакет.Количество() > 0 Тогда 
			Парам = Новый Структура("Пакет, Источник",мсПакет, ДокСсылка);
			ОткрытьФорму("ОбщаяФорма.ФормаПакетнойПечати", Парам, ФормаВладелец, ФормаВладелец,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
	
Процедура ВывестиНапечататьДокумент(Объект, Расшифровка,ДокСсылка,НаПринтерФорма,ФормаВладелец,СтрокаКнопки)
	
	Перем ИспользованиеДиалогаПечати;
	
	Если ТипЗнч(Расшифровка) = Тип("Строка") И Расшифровка <> "Структура" Тогда
		
		СтруктураНаПечать = ПечатьДокументовСервер.ПечатьСервер(ДокСсылка, Расшифровка, 1, НаПринтерФорма); 
		
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("Строка") И Расшифровка = "Структура" Тогда
		
		Если ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ВнешниеОбработки") Тогда
			
			стрРасшифровка = новый Структура;
			стрРасшифровка.Вставить("ВидПечатнойФормы", СтрокаКнопки.ВидПечатнойФормы);
			стрРасшифровка.Вставить("СсылкаНаВнешнююОбработку", СтрокаКнопки.СсылкаНаВнешнююОбработку);
			стрРасшифровка.Вставить("ЗаменяемаяПечатнаяФорма", СтрокаКнопки.ЗаменяемаяПечатнаяФорма);
			стрРасшифровка.Вставить("ОбъектПечати", ДокСсылка);
			
			стрРасшифровка.Вставить("НомерСтроки", СтрокаКнопки.НомерСтроки);
			
			РезультатПечати = ПечатьДокументовКлиент.НапечататьВнешнююФормуСПроверкойРежимаКлиент(Объект, стрРасшифровка);
			Если ТипЗнч(РезультатПечати) = Тип("ТабличныйДокумент") Тогда
				ТабДокумент = РезультатПечати;
				ЭтоДокумент = Найти(ФормаВладелец.ИмяФормы,"Документ") <> 0;
				СтруктураНаПечать = УниверсальныеМеханизмыСервер.НапечататьДокумент(ТабДокумент, 0, НаПринтерФорма, ?(ЭтоДокумент, 
				ОбщегоНазначенияСервер.СформироватьЗаголовокДокумента(Объект), Строка(Объект)), 
					Объект, Расшифровка,,, СтрокаКнопки.Текст);
			Иначе
				Возврат;
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ШаблоныПечати") Тогда
			
			ШаблонПечати = СтрокаКнопки.СсылкаНаВнешнююОбработку;
			СодержаниеОшибки = "";
			Результат = РаботаСШаблонамиПечатиКлиент.ВыполнитьПечатьДокументаПоШаблонуПечати(Объект, ШаблонПечати, СодержаниеОшибки,,Новый Структура("НаПринтер,КоличествоЭкземпляров",НаПринтерФорма,1));
			Если Не Результат Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СодержаниеОшибки);
			КонецЕсли;

		ИначеЕсли ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ПакетыПечати") Тогда
			СоставПакета = ПечатьДокументовСервер.ПередатьСоставВКлиент(СтрокаКнопки.СсылкаНаВнешнююОбработку, ДокСсылка);
			НаПринтер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаКнопки.СсылкаНаВнешнююОбработку, "НаПринтер");
			СтруктураНаПечать = ПечатьДокументовКлиент.НапечататьПакетДокументов(СоставПакета, ДокСсылка, СтрокаКнопки.СсылкаНаВнешнююОбработку, НаПринтер);

			Если НаПринтер Тогда
				ИспользованиеДиалогаПечати = РежимИспользованияДиалогаПечати.Использовать;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПечатьДокументовКлиент.ВывестиНапечататьДокумент(СтруктураНаПечать,ДокСсылка,ИспользованиеДиалогаПечати);
	
КонецПроцедуры

// Процедура открывает общую форму выбора печатных форм. Выводит на печать документ.
//
// Параметры:
//  Объект			 - Метаданные				 - объект медаданных
//  ФормаВладелец	 - ФормаКлиентскогоПриложения	 - владелец ФормаВыбораПечатныхФорм.
// 
// Возвращаемое значение:
//   Массив. 
//
Функция ОткрытьФормуВыбораПечатныхФормОбъектаМножественнаяПечать(Объект, ФормаВладелец, ИмяФормыВыбораПФ = Неопределено) Экспорт
	
	мсСостав = Новый Массив;
	
	Попытка
		НаПринтер = Истина;
		ДокСсылка = Объект;
		
		// Открыть форму выбора печатных форм
		Если ИмяФормыВыбораПФ=Неопределено Тогда
			Форма = ПолучитьФорму("ОбщаяФорма.ВыборПечатнойФормы", ,ФормаВладелец);
		Иначе
			Форма = ПолучитьФорму(ИмяФормыВыбораПФ, , ФормаВладелец);
		КонецЕсли;
		
		Форма.ДокументСсылка = ДокСсылка;
		Форма.ТолькоПечать = НаПринтер;
			
		Если ТипЗнч(Форма.ОткрытьМодально()) <> Тип("Структура") Тогда
			Возврат мсСостав;
		КонецЕсли;
		
		Для Каждого Строка Из Форма.Элементы.ДеревоМакетовПечати.ВыделенныеСтроки Цикл
			СтрокаКнопки = Форма.Элементы.ДеревоМакетовПечати.ДанныеСтроки(Строка);
			Если ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ПакетыПечати")  Тогда
				мсСостав = ПечатьДокументовСервер.ПередатьСоставВКлиент(СтрокаКнопки.СсылкаНаВнешнююОбработку, ДокСсылка);
			Иначе 
				мсСостав.Добавить(СоставПакетаПоКнопке(СтрокаКнопки));
			КонецЕсли;
		КонецЦикла;

	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
		
	Возврат мсСостав;
		
КонецФункции

Функция СоставПакетаПоКнопке(СтрокаКнопки) Экспорт //+ОЛИМП
		
	Если ТипЗнч(СтрокаКнопки.Расшифровка) = Тип("Строка") И СтрокаКнопки.Расшифровка <> "Структура" Тогда		
		ВидОбъекта = ПредопределенноеЗначение("Перечисление.ВидыДокументовДляПечати.ПечатнаяФорма");
	ИначеЕсли ТипЗнч(СтрокаКнопки.СсылкаНаВнешнююОбработку) = Тип("СправочникСсылка.ШаблоныПечати") Тогда 	
		ВидОбъекта  = ПредопределенноеЗначение("Перечисление.ВидыДокументовДляПечати.ШаблонПечати")
	ИначеЕсли ТипЗнч(СтрокаКнопки.Расшифровка) = Тип("Строка") И СтрокаКнопки.Расшифровка = "Структура" Тогда
		ВидОбъекта = ПредопределенноеЗначение("Перечисление.ВидыДокументовДляПечати.ПечатнаяФорма");
	КонецЕсли;
	
	СтруктураСтрока = Новый Структура;
	СтруктураСтрока.Вставить("ПредставлениеОбъекта", СтрокаКнопки.Имя);
	СтруктураСтрока.Вставить("ВидОбъекта",ВидОбъекта);
	СтруктураСтрока.Вставить("ВключатьВПакет", Ложь);
	СтруктураСтрока.Вставить("КолЭкз",1);
	СтруктураСтрока.Вставить("СсылкаОбъекта",СтрокаКнопки.СсылкаНаВнешнююОбработку);
	СтруктураСтрока.Вставить("Имя",СтрокаКнопки.Имя);
	СтруктураСтрока.Вставить("СсылкаНаВнешнююОбработку",СтрокаКнопки.СсылкаНаВнешнююОбработку);
	СтруктураСтрока.Вставить("ЗаменяемаяПечатнаяФорма",СтрокаКнопки.ВидПечатнойФормы);
	СтруктураСтрока.Вставить("Расшифровка",СтрокаКнопки.Расшифровка);
	СтруктураСтрока.Вставить("ВидПечатнойФормы", СтрокаКнопки.ВидПечатнойФормы);
	СтруктураСтрока.Вставить("Действие", СтрокаКнопки.Действие);
	СтруктураСтрока.Вставить("Текст",СтрокаКнопки.Текст);
	СтруктураСтрока.Вставить("Печатать",Истина);
	СтруктураСтрока.Вставить("НаПринтер",Истина);
	
	Возврат СтруктураСтрока;
	
КонецФункции

// Процедура - Печать документов множественная печать
//
// Параметры:
//  мсПФ						 - Массив - массив имен печатных форм.
//  ДокСсылка					 - ДокументСсылка	 - печатаемый объект.
//  ИспользованиеДиалогаПечати	 - Булево	 - показывать ли диалог печати.
//
Процедура ПечатьДокументовМножественнаяПечать(мсПФ,ДокСсылка,ИспользованиеДиалогаПечати) Экспорт
	
	СтруктураНаПечать = ПечатьДокументовКлиент.НапечататьПакетДокументов(мсПФ,ДокСсылка,,Истина);
	ПечатьДокументовКлиент.ВывестиНапечататьДокумент(СтруктураНаПечать,ДокСсылка,ИспользованиеДиалогаПечати);
	
КонецПроцедуры

#КонецОбласти

#Область глОбщиеЗначения // Работа с клиентским кешем глОбщиеЗначения (переменная модуля приложения).

Функция ПолучитьЗначениеКлиентскогоКеша(Ключ) Экспорт
	
	Значение = Неопределено;
	
	Если ТипЗнч(глОбщиеЗначения) = Тип("Структура") Тогда
		глОбщиеЗначения.Свойство(Ключ, Значение);
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Процедура УстановитьЗначениеКлиентскогоКеша(Ключ, Значение) Экспорт
	
	Если глОбщиеЗначения = Неопределено Тогда
		глОбщиеЗначения = Новый Структура;
	КонецЕсли;
	
	глОбщиеЗначения.Вставить(Ключ, Значение);
	
КонецПроцедуры

Процедура УдалитьЗначениеКлиентскогоКеша(Ключ) Экспорт
	
	Если ТипЗнч(глОбщиеЗначения) = Тип("Структура")
		И глОбщиеЗначения.Свойство(Ключ)
	Тогда
		глОбщиеЗначения.Удалить(Ключ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область wkhtmltopdf

Процедура НастроитьПараметрыWkhtmltopdfПриОткрытии(Форма) Экспорт
	
	Форма.МожноФормироватьPDFНаКлиенте = РаботаСШаблонамиHTMLКлиентСервер.УтилитаWkhtmltopdfУстановленаВСистеме(Форма.АдресWkhtmltopdfНаКлиенте);
	Форма.Элементы.СохранитьВPDF.Видимость = Форма.МожноФормироватьPDFНаКлиенте Или Форма.МожноФормироватьPDFНаСервере;
	
КонецПроцедуры

Процедура ОбработатьНажатиеСохранитьВPDF(Форма) Экспорт
	
	ДиалогВыборФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыборФайла.ПолноеИмяФайла = "";
	ДиалогВыборФайла.Фильтр = "PDF(*.pdf)|*.pdf";
	ДиалогВыборФайла.МножественныйВыбор = Ложь;
	ДиалогВыборФайла.Заголовок = НСтр("ru='Укажите файл для записи'");
	ДиалогВыборФайла.Показать(Новый ОписаниеОповещения("СохранитьВPDFВыбор", УниверсальныеМеханизмыКлиент, Новый Структура("Форма", Форма)));
	
КонецПроцедуры

Процедура СохранитьВPDFВыбор(ВыбранныеФайлы, ДопПараметры) Экспорт
	
	Если ТипЗнч(ВыбранныеФайлы) <> Тип("Массив")
		Или ВыбранныеФайлы.Количество() = 0
	Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
		Возврат;
	КонецЕсли;
	
	ДанныеPDFФайла = ПреобразоватьHTMLвPDF(ДопПараметры.Форма);
	
	Если ТипЗнч(ДанныеPDFФайла) = Тип("ДвоичныеДанные") Тогда
		ДанныеPDFФайла.Записать(ВыбранныеФайлы[0]);
		Сообщить(НСтр("ru='Файл PDF успешно сохранен'"));
	Иначе
		Сообщить(НСтр("ru='Не удалось сохранить файл PDF'"));
	КонецЕсли;
	
КонецПроцедуры

Функция ПреобразоватьHTMLвPDF(Форма)
	
	ФормироватьHTMLДляPDFНаКлиенте = ФормироватьHTMLДляPDFНаКлиенте(Форма);
	
	Если ФормироватьHTMLДляPDFНаКлиенте = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстHTML = Неопределено;
	
	Если ФормироватьHTMLДляPDFНаКлиенте Тогда
		ТекстHTML = ПолучитьHTMLДляПреобразованияВPDF(Форма);
	КонецЕсли;
	
	ДанныеPDFФайла = Неопределено;
	
	Если Форма.МожноФормироватьPDFНаКлиенте Тогда
		Если Не ФормироватьHTMLДляPDFНаКлиенте Тогда
			ПараметрыФормированияHTML = ПараметрыФормированияHTMLДляPDFНаСервере(Форма);
			ТекстHTML = УниверсальныеМеханизмыСервер.ПолучитьHTMLДляПреобразованияВPDF(ПараметрыФормированияHTML);
		КонецЕсли;
		Если ЗначениеЗаполнено(ТекстHTML) Тогда
			ДанныеPDFФайла = РаботаСШаблонамиHTMLКлиент.ПреобразоватьHTMLвPDF(ТекстHTML, Форма.АдресWkhtmltopdfНаКлиенте, Ложь, Истина);
		КонецЕсли;
	Иначе
		ПараметрыФормированияHTML = ПараметрыФормированияHTMLДляPDFНаСервере(Форма);
		ДанныеPDFФайла = УниверсальныеМеханизмыСервер.ПолучитьДанныеPDFФайлаПоHTML(ПараметрыФормированияHTML, ТекстHTML);
	КонецЕсли;
	
	Возврат ДанныеPDFФайла;
	
КонецФункции

Функция ФормироватьHTMLДляPDFНаКлиенте(Форма)
	
	Если Форма.ИмяТипаОбъектаДляWkhtmltopdf = "Документ.Прием" Тогда
		Возврат Истина;
	ИначеЕсли Форма.ИмяТипаОбъектаДляWkhtmltopdf = "Обработка.ПросмотрМедКарт" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьHTMLДляПреобразованияВPDF(Форма)
	
	Если Форма.ИмяТипаОбъектаДляWkhtmltopdf = "Документ.Прием" Тогда
		Колонтитулы = Неопределено;
		Если Форма.ИспользуютсяЭП И Форма.Объект.ПодписанЭП Тогда
			Колонтитулы = РаботаСШаблонамиHTML.СформироватьКолонтитулыЭЦПШаблонов(Форма.Объект.Ссылка, Форма.ЭлектронныеПодписи, Форма.Объект.ШаблоныПриема, Форма.Объект.ЭМД, Форма.Объект.РолиИПодписиЭМД);
		КонецЕсли;
		
		ДопПараметры = ДокументыПриемаКлиентСервер.ДополнительныеПараметрыФормированияПолногоОсмотра();
		ДопПараметры.Колонтитулы					= Колонтитулы;
		ДопПараметры.РежимДляКлиента				= Форма.РежимПолучателяПечатнойВерсииОсмотра;
		ДопПараметры.ДанныеРедактируемыхЭлементов	= Новый Структура("РисункиКартинок, ДобавленныеИзображения", Форма.РисункиКартинок, Форма.ДобавленныеИзображения);
		
		Возврат ДокументыПриемаКлиентСервер.СформироватьHTMLТекстПечатиОсмотраПолный(Форма.Объект, Форма.ТаблицаПараметров, Форма.ПараметрыТаблицШаблонов, Форма.СписокНазначений, Форма.ВерсииШаблонов, ДопПараметры);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПараметрыФормированияHTMLДляPDFНаСервере(Форма)
	
	ПараметрыФормированияHTML = Новый Структура("ИмяТипаОбъектаДляWkhtmltopdf", Форма.ИмяТипаОбъектаДляWkhtmltopdf);
	
	Если Форма.ИмяТипаОбъектаДляWkhtmltopdf = "Обработка.ПросмотрМедКарт" Тогда
		ПараметрыФормированияHTML.Вставить("ИсходныйHTML", Форма.ПолеОсмотр);
	КонецЕсли;
	
	Возврат ПараметрыФормированияHTML;
	
КонецФункции

#КонецОбласти

#КонецОбласти
