&НаКлиенте
Перем мАвтоматическиЗаполнятьМатериалы; // Заполнять ли автоматически материалы при открытии нового документа.

&НаКлиенте
Перем мУчетнаяПолитика;

&НаКлиенте
Перем мСписокРаботДокумента;

&НаКлиенте
Перем ПредыдущийПрием;

&НаКлиенте
Перем НеобходимоОбновитьСтандартыЛечения;

&НаКлиенте
Перем соотвКешИзображенийШаблонов;

&НаКлиенте
Перем ТекущийЭлементПараметраШаблона;

&НаКлиенте
Перем ВерсияДляПечати;

&НаКлиенте
Перем мПредыдущаяСтраницаОсновнойПанелиПодбор;

&НаКлиенте
Перем мПараметрыПечатиСтраницыОсмотра;

&НаКлиенте
Перем мОбновленныеСтрокиШаблонов;

&НаКлиенте
Перем ДанныеЭлементаHTMLДляКонтекстногоМеню;

&НаКлиенте
Перем АдресЗКИстории;

#Область СобытияФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Версионирование.
	ДокументыПриемаКлиентСервер.ЗаполнитьТаблицуВерсийШаблонов(ВерсииШаблонов, Объект);
	ЗаполнитьДополнительныеРеквизитыТабЧастиШаблоны();
	
	Клиент = Объект.Клиент;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкаРеквизитовФормыПриСоздании();
	
	Элементы.СтандартыЛеченияПоДиагнозам.Пометка = РаботаСФормамиСервер.ПолучитьНастройкуФормы("ФормаДокументаПрием", "СтандартыЛеченияПоДиагнозам", Ложь);
	
	ДополнительныеСвойства = Новый Структура;
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);
	
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	
	ЗаполнитьДокументИзПараметровФормыПриСоздании();
	РаботаСКлиентамиПереопределяемый.ПриемПриСозданииНаСервере(Объект,ДополнительныеСвойства,Параметры); // Строго после ЗаполнитьДокументИзПараметровФормыПриСоздании().
	НастроитьДопустимоеКоличествоШаблоновПриСоздании(); // Строго после ЗаполнитьДокументИзПараметровФормыПриСоздании().
	
	РаботаСФормамиСервер.НастройкаПодбораПриСоздании(ЭтаФорма, Истина);
	Если РаботаСФормамиКлиентСервер.ИзменениеСоставаКомандТабличныхЧастейТолькоНаСервере() Тогда
		НастроитьРежимРедактированияТабличногоПоляМатериалов(Элементы, мУчетнаяПолитика, Объект,,Истина);
	КонецЕсли;
	
	#Область Стоматология
	Прейскурант = УправлениеНастройками.ПолучитьПрейскурантФилиала(Объект.Филиал);
	#КонецОбласти
	
	ДиагнозыНаФорме_ПриСозданииНаСервере();
	
	// Заказ во внешнюю лабораторию.
	ИмяТипаОснования = ДопСерверныеФункции.ИмяСсылочногоТипа(Объект.Основание);
	ЭтоПриемРезультатовАнализа = ЗначениеЗаполнено(Объект.Основание)
								И (		ИмяТипаОснования = "Документ.ЗаказВоВнешнююЛабораторию"
									Или ИмяТипаОснования = "Документ.invЗаявкаНаИсследование"
									Или ИмяТипаОснования = "Документ.ЗаказНаИсследованиеВнутренний"
								  );
	
	ИспользуетсяВерсионирование = мУчетнаяПолитика.ИспользоватьВерсионированиеШО;
	
	// Заполнение шаблона осмотра по-умолчанию для врача.
	Если Объект.Ссылка.Пустая()
		И ЗначениеЗаполнено(Объект.Врач)
		И КоличествоЗаполненныхШаблоновПриема(Объект.ШаблоныПриема) = 0
		И Не ЭтоПриемРезультатовАнализа
	Тогда
		ДанныеШаблона = ПолучитьДанныеОсновногоШаблонаОсмотраСотрудника(Объект.Врач, Объект.Дата, ИспользуетсяВерсионирование, , Объект.Специализация);
		
		Если ДанныеШаблона <> Неопределено Тогда
			Если Объект.ШаблоныПриема.Количество() = 0 Тогда
				СтрокаШаблона = Объект.ШаблоныПриема.Добавить();
			Иначе
				СтрокаШаблона = Объект.ШаблоныПриема[0];
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаШаблона, ДанныеШаблона);
			ШаблонОсмотра = СтрокаШаблона.ШаблонПриема;
		КонецЕсли;
	КонецЕсли;
		
	Если Объект.Ссылка.Пустая() 
		И ЗначениеЗаполнено(Объект.Клиент)
	Тогда
		// Автоподстановка медицинской карты клиента
		Если Не ЗначениеЗаполнено(Объект.МедицинскаяКарта) Тогда
			Объект.МедицинскаяКарта = КлиентПриИзмененииСервер(Объект.Клиент);
		КонецЕсли;
		
		// Автоподстановка первичного приёма
		Если ЗначениеЗаполнено(Объект.МедицинскаяКарта)
			И Не Объект.ЭтоПервичный
		Тогда
			Если Не ЗначениеЗаполнено(Объект.ПервичныйПрием) Тогда
				ПодставитьПервичныйПриемПоМедКарте(Объект.МедицинскаяКарта, Объект.ПервичныйПрием);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ПервичныйПрием)
				И Объект.Диагнозы.Количество() = 0
			Тогда
				ЗаполнитьДиагнозамиИзПриема(Объект.ПервичныйПрием, Истина, Ложь, Объект);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПланЛеченияНаСервере();
	
	ЗаполнитьИспользуемыеСтандартыЛечения(ИспользуемыеСтандартыЛечения, ПервичныйПриемДокумента(Объект));
	ЗаполнитьНМУДляПлановЛечения();

	ИнициализацияПолейОсмотраПриСоздании();

	ВосстановитьФлажокЗакрытНаКлиенте(Закрыт, Объект.Закрыт, Объект.Ссылка, Объект.ПервичныйПрием);
	
	ПолучитьКоличествоРецептовПоПервичномуПриему(
		?(ЗначениеЗаполнено(Объект.ПервичныйПрием), Объект.ПервичныйПрием, Объект.Ссылка),
		Элементы.ОткрытьСписокРецептов);
	
	РаботаСФормамиКлиентСервер.УстановитьВидимостьЭлементаФормы(Элементы, 
																"КомандаОткрытьАнамнез",
																ЗначениеЗаполнено(мУчетнаяПолитика.ШаблонАнамнезаЖизни));
																
																
	#Область ЭлектронныеПодписи
	ИспользуютсяЭП = ЭЦП_УМЦ_Сервер.ИспользоватьЭлектронныеПодписиЭМК();
	Если ИспользуютсяЭП И Не Объект.Ссылка.Пустая() Тогда
		Если Объект.ПодписанЭП Тогда
			ОбновитьСписокПодписей();
		Иначе
			доп_СертификатыЭЦП.ЗаполнитьСводкуПодписей(Объект.Ссылка, СводкаHTML, ЭлектронныеПодписи);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыФО = Новый Структура("ПараметрУчетнаяПолитикаРасширенная", Перечисления.ПараметрыУчетнойПолитики.ИспользоватьЭлектронныеПодписиЭМК);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	#КонецОбласти
	
	ГотовыеФразы.Параметры.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	НастроитьВидимостьГотовыхФраз();
	Элементы.РаботыНомерПробы.Видимость = ВычислитьВидимостьКолонкиНомераПробы(Объект.Работы);
	Элементы.ГруппаРецепты.Видимость = ПравоДоступа("Чтение", Метаданные.Документы.Рецепт);
	
	РаботаСФормамиКлиентСервер.УстановитьПолеЭлементаФормы(Элементы, "ОткрытьЛекарственнуюНепереносимость", "Заголовок", МедицинскаяДеятельность.ЗаголовокКнопкиОткрытьЛекарственнуюНепереносимость(Объект.Клиент));
	//ЛН_ПриСоздании(); //+ОЛИМП Стоматология
	
	Элементы.РаботыХарактеристикаНоменклатуры.Видимость = мУчетнаяПолитика.ВестиУчетПоХарактеристикам;
	Элементы.МатериалыХарактеристикаНоменклатуры.Видимость = мУчетнаяПолитика.ВестиУчетПоХарактеристикам;
	Элементы.МатериалыГруппаЗаполнитьПоFEFO.Видимость = мУчетнаяПолитика.ВестиУчетПоХарактеристикам; 
	
	// wkhtmltopdf
	УниверсальныеМеханизмыСервер.НастроитьПараметрыWkhtmltopdfПриСозданииНаСервере(ЭтотОбъект, Элементы.ПечатьВерсииДляПолучателя);
	
	// Комплексные расчеты
	Если Объект.Ссылка.Пустая() Тогда
		Объект.КомплексныйРасчет = КомплексныеРасчетыКлиентов.ПолучитьКомплексныеРасчетыПоПриему(Объект.Ссылка, Объект.ПервичныйПрием);
	КонецЕсли;
	ЗаполнитьЭтапыРаботСОтметкамиВыполнения();
	УправлениеЗаказами.УстановитьУсловноеОформлениеЭтапамРабот(ЭтаФорма);
	Элементы.ГруппаЭтапыРабот.Видимость = ЗначениеЗаполнено(Объект.КомплексныйРасчет);
	
	УстановитьВидимостьФлагаЗакрытСервер(Элементы.Закрыт, Объект.ПервичныйПрием);
	
	ТекущийЭлементПриСоздании();
	
	// РЭМД
	ИспользуетсяРЭМД = ИнтеграцияЕГИСЗСерверПовтИсп.ИспользуетсяИнтеграцияРЭМД();
	
	#Область Стоматология
	Если Объект.Ссылка.Метаданные().Реквизиты.Найти("СтоматологическийПрием") <> Неопределено Тогда
		Объект.СтоматологическийПрием = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Клиент)
		И (Не ЗначениеЗаполнено(Объект.ЗубнаяКарта)
			Или Не ЗначениеЗаполнено(Объект.ВариантЗубнойКарты))
	Тогда
		КартаВариант = стомСтоматология.ПолучитьВидВариантЗубнойКарты(Объект.Клиент);
		Объект.ЗубнаяКарта = КартаВариант.ЗубнаяКарта;
		Объект.ВариантЗубнойКарты = КартаВариант.ВариантЗубнойКарты;
	КонецЕсли;
	
	Элементы.ЗубнаяКарта.Видимость = стомСтоматология.ВедетсяНесколькоЗубныхКарт();
	ИнициализироватьЗубнуюКартуСервер();
	
	ВидимостьУпрощеннойЗФ = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Прием", "ВидимостьУпрощеннойЗФ");
	Если ВидимостьУпрощеннойЗФ <> Неопределено Тогда 
		Элементы.ГруппаВыделениеОбластейЗубов.Видимость = ВидимостьУпрощеннойЗФ;
	КонецЕсли;
	
	// Платформа не дает ввод по подстроке для составных типов даже в Режиме выбора из списка. Обходим ограничение.
	Элементы.ДиагнозыЗубВКарте.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.стомЗубыКарты");
	Элементы.РаботыЗубВКарте.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.стомЗубыКарты");
	#КонецОбласти
	
	УстановитьДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	
	Если РаботаСФормамиКлиентСервер.ИзменениеСоставаКомандТабличныхЧастейТолькоНаСервере() Тогда // 8.3.23 и выше.
		// Довычисление клиентской переменной.
		мАвтоматическиЗаполнятьМатериалы = мУчетнаяПолитика.ВестиУчетРасходаМатериаловНаУслуги И мУчетнаяПолитика.АвтоматическиЗаполнятьНормыРасходаМатериаловОУ И Не Объект.РучнаяКорректировкаМатериалов; // См. НастроитьРежимРедактированияТабличногоПоляМатериалов()
	Иначе // 8.3.21, 8.3.22.
		НастроитьРежимРедактированияТабличногоПоляМатериалов(Элементы, мУчетнаяПолитика, Объект, мАвтоматическиЗаполнятьМатериалы);
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() И Объект.ШаблоныПриема.Количество() > 0 Тогда
		ЗначенияПоУмолчанию = РаботаСШаблонамиHTML.ПолучитьЗначенияПараметровПоУмолчанию(ТаблицаПараметров, КешЗависимыхПараметров, Объект);
		РаботаСШаблонамиHTMLКлиентСервер.ОбновитьЗначенияТаблицыПараметров(ТаблицаПараметров, ЗначенияПоУмолчанию);
	КонецЕсли;
	
	ОбновитьСписокРаботДокумента();
	ПредыдущийПрием = Объект.ПервичныйПрием;
	
	НастроитьДоступностьЭлементов();
	УстановитьДоступностьКомандОсмотраПоТекущейСтраницеОсмотра();
	РаботаСФормамиКлиент.ОчиститьЛишниеКомандыПобор(ЭтаФорма);
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
	НеобходимоОбновитьСтандартыЛечения = Ложь;
	УстановитьОтборСтандартамЛечения(Элементы.СтандартыЛеченияПоДиагнозам.Пометка);
	
	УстановитьОтборГотовыхФраз(Ложь, ПредопределенноеЗначение("Справочник.СоставныеФразы.ПустаяСсылка"));
	
	// Подготовка данных по изображениям в шаблонах
	ВерсииШаблоновДокумента= Новый Массив;
	Для Каждого СтрокаШаблона Из Объект.ШаблоныПриема Цикл
		ВерсииШаблоновДокумента.Добавить(ПолучитьВерсиюШаблона(СтрокаШаблона.ШаблонПриема));
	КонецЦикла;
	РаботаСШаблонамиHTMLКлиентСервер.ИнициализироватьНастройкиИзображенийПриема(соотвКешИзображенийШаблонов, ВерсииШаблоновДокумента, ЭтаФорма.УникальныйИдентификатор);
	
	Если ИзмененияЗапрещены Тогда
		СформироватьОсмотрПоЭП();
	Иначе
		ПреобразоватьОсмотрВВерсиюДляРедактирования();
	КонецЕсли;
	
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		ОписаниеОшибки = "";
		
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
		
		ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);
		МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПоТипу(ОповещенияПриПодключении, УникальныйИдентификатор, ПоддерживаемыеТипыВО);

	КонецЕсли;
	
	// wkhtmltopdf
	УниверсальныеМеханизмыКлиент.НастроитьПараметрыWkhtmltopdfПриОткрытии(ЭтотОбъект);
	
	// РЭМД
	ИнтеграцияЕГИСЗ_РЭМДКлиент.НастроитьЭлементыФормы(ЭтотОбъект);
	
	РазвернутьДеревоНазначений(); //+Стоматология.

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.Свойство("ЭтоПодписание") Тогда
		ДополнительныеСвойства.Вставить("ЭтоПодписание");
	КонецЕсли;
	
	Если ИспользуютсяЭП И Не ДополнительныеСвойства.Свойство("ЭтоПодписание") Тогда	
		Если Не Объект.Ссылка.Пустая() И Объект.ПодписанЭП Тогда
			Если Вопрос(НСтр("ru='Документ подписан, после записи подпись будет перепроверена. Продолжить?'"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				Отказ = Истина;
			Иначе
				ДополнительныеСвойства.Вставить("ВыполнитьПроверкуЭП");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПеренестиЗначенияТекстовыхПолейОсмотраВТаблицуПараметров();
	
	ОчиститьПустуюТаблицуДиагнозов(Истина);
	
	УдалитьПустыеСтрокиШаблонов();
	
	ДокументыПриемаКлиент.СохранитьИдентификаторыСтрокШаблоновПередЗаписью(ЭтотОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	СвернутаяТаблицаРабот = ТекущийОбъект.Работы.Выгрузить();
	СвернутаяТаблицаРабот.Свернуть("Номенклатура");
	МассивНоменклатурыБезДоговора = ОтраслевыеДополнения.ПолучитьНоменклатуруНаКоторуюНетДоговора(СвернутаяТаблицаРабот.ВыгрузитьКолонку("Номенклатура"), ТекущийОбъект.Клиент, ТекущийОбъект.Дата);
	
	Если МассивНоменклатурыБезДоговора.Количество() > 0 Тогда
		
		ОбщегоНазначения.СообщитьОбОшибке(ОтраслевыеДополнения.СформироватьТекстСообщенияНоменклатурыБезДоговора(МассивНоменклатурыБезДоговора));
		
		// Если проведение услуг, требующих договора, без договора запрещено, то отменить проведение.
		Отказ = Отказ Или мУчетнаяПолитика.ЗапретитьПроведениеПродажиНоменклатурыБезДоговора;
		
	КонецЕсли;
	
	НазначенныеАнализы = ВыгрузитьНазначенныеАнализыИзПланаЛечения();
	Если НазначенныеАнализы.Количество() <> 0 Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НазначенныеАнализы", НазначенныеАнализы);
	КонецЕсли;
	
	// Подготовка оповещения журнала записи об изменении состояния заявки
	Если ЗначениеЗаполнено(Объект.ДокументОснование) 
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.Заявка")
	Тогда
		ДополнительныеСвойства.Вставить("СостояниеЗаявки", Объект.ДокументОснование.Состояние);
	КонецЕсли;
	
	ПараметрыПриема = Новый Структура("ТаблицаПараметров, ПараметрыТаблицШаблонов", ТаблицаПараметров.Выгрузить(), ПараметрыТаблицШаблонов.Выгрузить());
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ПараметрыПриема", ПараметрыПриема);
	
	ПланЛеченияТаблица = МедицинскаяДеятельность.ВыгрузитьПланЛеченияСтоматология(СписокНазначений, ТекущийОбъект.Ссылка);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ПланЛечения", ПланЛеченияТаблица);
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЭтоНовыйНаФорме", ТекущийОбъект.ЭтоНовый());
	
	#Область Стоматология
	ОбработатьКонструкцииПередЗаписью(ТекущийОбъект);	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗубнаяКартаАдрес", стомДанныеЗубныхКарт.Адрес);	
	#КонецОбласти
	
	// Удаляю из таблицы параметров те, что не встречаются в их шаблонах.
	СтрокиПараметровКУдалению = Новый Массив;
	Отбор = Новый Структура("ИдентификаторСтрокиШаблона");
	Для Каждого СтрокаШаблона Из Объект.ШаблоныПриема Цикл
		ВерсияШаблона = ПолучитьВерсиюШаблонаСервер(СтрокаШаблона.ШаблонПриема);
		ПараметрыШаблона = ВерсияШаблона.СоответствияПараметрам;
		Отбор.ИдентификаторСтрокиШаблона = СтрокаШаблона.ПолучитьИдентификатор();
		Для Каждого СтрокаПараметра Из ТаблицаПараметров.НайтиСтроки(Отбор) Цикл
			Если ПараметрыШаблона.Найти(СтрокаПараметра.Параметр) = Неопределено Тогда
				СтрокиПараметровКУдалению.Добавить(СтрокаПараметра);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Для Каждого СтрокаПараметра Из СтрокиПараметровКУдалению Цикл
		ТаблицаПараметров.Удалить(СтрокаПараметра);
	КонецЦикла;
	
	РассчитатьПечатныеВерсииВХодеЗаписиДокумента(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Отказ Тогда Возврат; КонецЕсли;
	
	РаботаСШаблонамиHTML.ЗаписатьЗначенияПараметровДокумента(ТекущийОбъект, ТаблицаПараметров, ПараметрыТаблицШаблонов, Отказ, Объект.ШаблоныПриема, ПараметрыЗаписи);
	Если Отказ Тогда Возврат; КонецЕсли;
	
	РаботаСШаблонамиHTML.СохранитьРисункиДокумента(ТекущийОбъект, РисункиКартинок, Объект.ШаблоныПриема);
	РаботаСШаблонамиHTML.СохранитьДобавленныеИзображенияДокумента(ТекущийОбъект, ДобавленныеИзображения, Объект.ШаблоныПриема);
	
	// Стандарты лечения.
	ПервичныйПрием = ТекущийОбъект.Ссылка;
	Если Не ТекущийОбъект.ЭтоПервичный И ЗначениеЗаполнено(ТекущийОбъект.ПервичныйПрием) Тогда
		ПервичныйПрием = ТекущийОбъект.ПервичныйПрием;
	КонецЕсли;
	
	СтандартыЛеченияНЗ = РегистрыСведений.СтандартыЛечения.СоздатьНаборЗаписей();
	СтандартыЛеченияНЗ.Отбор.ПервичныйПрием.Установить(ПервичныйПрием);
	Для Каждого СтрокаСтандартЛечения Из ИспользуемыеСтандартыЛечения Цикл
		НоваяЗапись = СтандартыЛеченияНЗ.Добавить();
		НоваяЗапись.ПервичныйПрием = ПервичныйПрием;
		НоваяЗапись.СтандартЛечения = СтрокаСтандартЛечения.СтандартЛечения;
	КонецЦикла;
	СтандартыЛеченияНЗ.Записать();
	
	СтандартыЛеченияВПланеЛечения = РегистрыСведений.СтандартыЛеченияВПланеЛечения.СоздатьНаборЗаписей();
	Для Каждого СтрокаКУдалению Из СтрокиПланаЛеченияКУдалению Цикл
		СтандартыЛеченияВПланеЛечения.Отбор.ИдентификаторНазначения.Установить(СтрокаКУдалению.Значение);
		СтандартыЛеченияВПланеЛечения.Записать();
	КонецЦикла;
	
	Для Каждого СтрокаНМУДляПлановЛечения Из НМУДляПлановЛечения Цикл
		
		СтандартыЛеченияВПланеЛеченияНоваяЗапись = РегистрыСведений.СтандартыЛеченияВПланеЛечения.СоздатьМенеджерЗаписи();
		СтандартыЛеченияВПланеЛеченияНоваяЗапись.ИдентификаторНазначения = СтрокаНМУДляПлановЛечения.ИдентификаторНазначения;
		СтандартыЛеченияВПланеЛеченияНоваяЗапись.НоменклатураМедицинскихУслуг = СтрокаНМУДляПлановЛечения.НоменклатураМедицинскихУслуг;
		СтандартыЛеченияВПланеЛеченияНоваяЗапись.ВидНазначения = СтрокаНМУДляПлановЛечения.ВидНазначения;
		СтандартыЛеченияВПланеЛеченияНоваяЗапись.Записать();
		
	КонецЦикла;
	
	// Формирование списка выполенных этапов работ
	ВыполненныеЭтапы = КомплексныеРасчетыКлиентовСервер.ПолучитьВыполненныхЭтаповРаботИзТаблицы(ЭтапыРабот);
	УправлениеЗаказами.ОтметитьВыполненныеЭтапыРасчета(ТекущийОбъект.КомплексныйРасчет, ВыполненныеЭтапы, ТекущийОбъект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(Объект, Истина, ЭтаФорма);
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		Или ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
	Тогда
		Если ТекущийОбъект.ДополнительныеСвойства.ЭтоНовыйНаФорме Тогда
			ДополнитьВыполнениеПланаЛеченияТекущимДокументом(СписокНазначений, ТекущийОбъект);
	    Иначе
			ЗаполнитьДанныеВыполненияПланаЛечения(СписокНазначений);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) 
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.Заявка")
		И (ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Или
		   ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения)
	Тогда
	    ДополнительныеСвойства.Вставить("ОповеститьОбИзмененииЗаявки", ДополнительныеСвойства.СостояниеЗаявки <> Объект.ДокументОснование.Состояние);
		ДополнительныеСвойства.Вставить("ДатаЗаявки", Объект.ДокументОснование.ДатаНачала);
	Иначе
	    ДополнительныеСвойства.Вставить("ОповеститьОбИзмененииЗаявки", Ложь);
		ДополнительныеСвойства.Вставить("ДатаЗаявки", Дата(1,1,1));
	КонецЕсли;
	
	ЗаполнитьДополнительныеРеквизитыТабЧастиШаблоны();
	
	// РЭМД
	ИнтеграцияЕГИСЗ_РЭМД.ПроверитьНаличиеПроблемныхПараметровВДокументеПослеЗаписи(Объект.Ссылка, ПараметрыЗаписи);
	
	Если ИспользуютсяЭП Тогда
		Если Объект.ПодписанЭП Тогда
			ОбновитьСписокПодписей();
		Иначе
			доп_СертификатыЭЦП.ЗаполнитьСводкуПодписей(Объект.Ссылка, СводкаHTML, ЭлектронныеПодписи);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанПрием", Новый Структура("Прием, ДокументОснование, Врач, Дата", 
												Объект.Ссылка,
												Объект.ДокументОснование,
												Объект.Врач,
												Объект.Дата));
	ОбновитьКоличествоРецептов();
	
	Если ДополнительныеСвойства.Свойство("ОповеститьОбИзмененииЗаявки") И ДополнительныеСвойства.ОповеститьОбИзмененииЗаявки Тогда
		Оповестить("ЗаявкаИзменение",Новый Структура("Дата, Ссылка, ИзменилосьТолькоСостояние", ДополнительныеСвойства.ДатаЗаявки, Объект.ДокументОснование, Истина));
	КонецЕсли;
	
	// ЭЦП.
	Если ДополнительныеСвойства.Свойство("ВыполнитьПроверкуЭП") Тогда
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("КоллекцияПодписей", ЭлектронныеПодписи);
		ПараметрыОповещения.Вставить("ДокументПодписан", Объект.ПодписанЭП);
		ПараметрыОповещения.Вставить("ОписаниеОповещения", Новый ОписаниеОповещения("ПослеЗавершенияПроверкиПодписи", ЭтотОбъект));
		
		доп_СертификатыЭЦПКлиент.ПроверитьПодписиОбъекта(ЭтотОбъект,,
			Новый ОписаниеОповещения("ПроверитьПодписиЗавершение", доп_СертификатыЭЦПКлиент, ПараметрыОповещения));
		
	КонецЕсли;
	
	// КОРП. Оповещение формы-владельца о записи
	Если ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") Тогда
		Оповестить("ПриемЗапись", ВладелецФормы, Объект.Ссылка);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.КомплексныйРасчет) Тогда 
		Оповестить("ИзмененыЭтапыРаботЗаказа", Объект.КомплексныйРасчет, Объект.Ссылка);
	КонецЕсли;
	
	// Компенсируем очищение платфомой доп. колонок табл. части Объекта при автосохранении при вводе на основании.
	ПодключитьОбработчикОжидания("ПослеПослеЗаписи", 0.1, Истина);
	
	Если ПараметрыЗаписи.Свойство("ТекстПредупреждения") Тогда
		ПоказатьПредупреждение(,ПараметрыЗаписи.ТекстПредупреждения);
	КонецЕсли;
	
	ДокументыПриемаКлиент.ОбновитьИдентификаторыСтрокШаблоновПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	УбратьФокусСПоляВводаНаТело();
	
	Если Не ЗавершениеРаботы Тогда
		// Сохранение настроек формы
		НастройкиФормы = Новый Структура;
		НастройкиФормы.Вставить("СтандартыЛеченияПоДиагнозам", Элементы.СтандартыЛеченияПоДиагнозам.Пометка);
		
		РаботаСФормамиСервер.СохранитьНастройкиФормы(НастройкиФормы, "ФормаДокументаПрием");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	// МеханизмВнешнегоОборудования.
	ПоддерживаемыеТипыВО = Новый Массив();
	ПоддерживаемыеТипыВО.Добавить("СканерШтрихкода");
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПоТипу(Неопределено, УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	// Конец МеханизмВнешнегоОборудования.
	
	Если ЗначениеЗаполнено(ВременныйКаталогИзображений) Тогда
		УдалитьФайлы(ВременныйКаталогИзображений);
	КонецЕсли;
	
	#Область Стоматология
	Если Не ЗавершениеРаботы Тогда
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Прием", "ВидимостьУпрощеннойЗФ", Элементы.ГруппаВыделениеОбластейЗубов.Видимость);
	КонецЕсли;
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Перем Действие;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.МедицинскиеКарты") Тогда
		
		Объект.МедицинскаяКарта = ВыбранноеЗначение;
		МедицинскаяКартаПриИзменении(Элементы.МедицинскаяКарта);
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		ВыбранноеЗначение.Свойство("Действие", Действие);
		
		Если Действие = "ПодборРаботы" Тогда
			
			Элементы.СтраницыРаботы.ТекущаяСтраница = Элементы.ГруппаРаботы;
			
			#Область Стоматология
			Если ДопСерверныеФункции.ПолучитьРеквизит(ВыбранноеЗначение.Номенклатура, "ВидНоменклатуры") = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Услуга") Тогда
				Если стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты.Количество() > 0 Тогда 
					Для Каждого ВыделенныйЗуб Из стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты Цикл
						СегментВЗубе = Неопределено;
						Если ВыделенныйЗуб.Сегменты.Количество() = 1 Тогда
							СегментВЗубе = ВыделенныйЗуб.Сегменты[0];
						КонецЕсли;
						СтрокаРаботы = ДобавитьНоменклатуруРабот(ВыбранноеЗначение, ВыделенныйЗуб.ЗубВКарте, СегментВЗубе);
					КонецЦикла;
				Иначе
					СтрокаРаботы = ДобавитьНоменклатуруРабот(ВыбранноеЗначение);
				КонецЕсли;
				Если СтрокаРаботы <> Неопределено Тогда
					Элементы.Работы.ТекущаяСтрока = СтрокаРаботы.ПолучитьИдентификатор();						
				КонецЕсли;
			Иначе
				СоставНабора = ОбщегоНазначенияСервер.ПолучитьСоставНабора(ВыбранноеЗначение.Номенклатура);
				Для Каждого СтрокаНабора Из СоставНабора Цикл
					СтрокаНабора.Вставить("Номенклатура", СтрокаНабора.Комплектующая);
				КонецЦикла;
				Если стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты.Количество() > 0 Тогда
					Для Каждого ВыделенныйЗуб Из стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты Цикл
						СегментВЗубе = Неопределено;
						Если ВыделенныйЗуб.Сегменты.Количество() = 1 Тогда
							СегментВЗубе = ВыделенныйЗуб.Сегменты[0];
						КонецЕсли;
						Для Инд = 0 По СоставНабора.Количество()-1 Цикл
							СтрокаРаботы = ДобавитьНоменклатуруРабот(СоставНабора[Инд], ВыделенныйЗуб.ЗубВКарте, СегментВЗубе);
							СтрокаРаботы.Количество = СоставНабора[Инд].Количество * ВыбранноеЗначение.Количество;
						КонецЦикла;
						Если СтрокаРаботы <> Неопределено Тогда
							Элементы.Работы.ТекущаяСтрока = СтрокаРаботы.ПолучитьИдентификатор();
						КонецЕсли;
					КонецЦикла;
				Иначе
					Для Инд = 0 По СоставНабора.Количество()-1 Цикл
						СтрокаРаботы = ДобавитьНоменклатуруРабот(СоставНабора[Инд]);
						СтрокаРаботы.Количество = СоставНабора[Инд].Количество * ВыбранноеЗначение.Количество;
					КонецЦикла;
					Если СтрокаРаботы <> Неопределено Тогда
						Элементы.Работы.ТекущаяСтрока = СтрокаРаботы.ПолучитьИдентификатор();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			#КонецОбласти
			РаботыНоменклатураПриИзменении(Неопределено);
		ИначеЕсли Действие = "ПодборМатериала" Тогда
			
			Если Не мАвтоматическиЗаполнятьМатериалы Тогда
				Элементы.СтраницыРаботы.ТекущаяСтраница = Элементы.ГруппаМатериалы;
				НовыйМатериал = Объект.Материалы.Добавить();
				НовыйМатериал.Номенклатура = ВыбранноеЗначение.Номенклатура;
				НовыйМатериал.ХарактеристикаНоменклатуры = ВыбранноеЗначение.ХарактеристикаНоменклатуры;
				НовыйМатериал.Количество = ВыбранноеЗначение.Количество;
				НовыйМатериал.ЕдиницаИзмерения = ВыбранноеЗначение.ЕдиницаИзмерения;
				Если ВыбранноеЗначение.СерияНоменклатуры <> Неопределено Тогда
					НовыйМатериал.СерияНоменклатуры = ВыбранноеЗначение.СерияНоменклатуры;
				КонецЕсли;
				
				// Подставить номенклатуру работы, если она одна в документе.
				Если мСписокРаботДокумента.Количество() = 1 Тогда
					Для Каждого СтрокаРаботы Из Объект.Работы Цикл
						Если СтрокаРаботы.КлючСтроки = мСписокРаботДокумента[0].Значение Тогда
							НовыйМатериал.Работа = СтрокаРаботы.Номенклатура;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Диагнозы") Тогда
		Элементы.Диагнозы.ТекущиеДанные.Диагноз = ВыбранноеЗначение;
		НеобходимоОбновитьСтандартыЛечения = Элементы.СтандартыЛеченияПоДиагнозам.Пометка;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененСоставФайлов" И Источник = Объект.Ссылка Тогда
		Если ИспользуютсяЭП Тогда
			
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("КоллекцияПодписей", ЭлектронныеПодписи);
			ПараметрыОповещения.Вставить("ДокументПодписан", Объект.ПодписанЭП);
			ПараметрыОповещения.Вставить("ОписаниеОповещения", Новый ОписаниеОповещения("ПослеЗавершенияПроверкиПодписи", ЭтотОбъект));
			
			доп_СертификатыЭЦПКлиент.ПроверитьПодписиОбъекта(ЭтотОбъект,,
				Новый ОписаниеОповещения("ПроверитьПодписиЗавершение", доп_СертификатыЭЦПКлиент, ПараметрыОповещения));
				
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзмененыЭтапыРаботЗаказа" И 
		Параметр = Объект.КомплексныйРасчет И Источник <> Объект.Ссылка 
	Тогда
		ЗаполнитьЭтапыРаботСОтметкамиВыполнения();
	ИначеЕсли ИмяСобытия = "ЛекарственнаяНепереносимостьИзменение" Тогда
		Если Параметр = Объект.Клиент Тогда
			Элементы.ОткрытьЛекарственнуюНепереносимость.Заголовок = МедицинскаяДеятельность.ЗаголовокКнопкиОткрытьЛекарственнуюНепереносимость(Объект.Клиент);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ВыбраныШаблоныПриема" Тогда
		Если Источник = ЭтотОбъект Тогда
			ПерезаполнитьШаблоныПриема(Параметр);
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "СобытиеЗакрытияФормыСозданияПланаЛечения"
		И Источник.ВладелецФормы = ЭтотОбъект
	Тогда
		ЗаполнитьПланыИзФормыСозданияПланаЛечения(Параметр.Планы, Параметр.Связи, Параметр.СтрокиПланаКУдалению);
	ИначеЕсли ИмяСобытия = "ИзменилисьПодписи"
		И Параметр = Объект.Ссылка
	Тогда
		ЭтотОбъект.Прочитать();
		ОбновитьДанныеПослеПодписания();
		ИнтеграцияЕГИСЗ_РЭМДКлиент.НастроитьЭлементыФормы(ЭтотОбъект);
		СформироватьОсмотрПоЭП();
	ИначеЕсли ИмяСобытия = "ОбновитьСписокПодписей"
		И Параметр = Объект.Ссылка
	Тогда
		ОбновитьСписокПодписей();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

/////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КНОПОК

&НаКлиенте
Процедура КомандаЗаполнитьПоУмолчанию(Команда)
	
	Если Не Элементы.КнопкаВерсияДляПечати.Пометка Тогда
		ПеренестиЗначенияТекстовыхПолейОсмотраВТаблицуПараметров();
		
		ЗначенияПоУмолчанию = РаботаСШаблонамиHTML.ПолучитьЗначенияПараметровПоУмолчанию(ТаблицаПараметров, КешЗависимыхПараметров, Объект);
		РаботаСШаблонамиHTMLКлиентСервер.ОбновитьЗначенияТаблицыПараметров(ТаблицаПараметров, ЗначенияПоУмолчанию);
			
		ПреобразоватьОсмотрВВерсиюДляРедактирования(, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПредыдущимЗначениям(Команда)
	
	Если Не Элементы.КнопкаВерсияДляПечати.Пометка Тогда
		ПеренестиЗначенияТекстовыхПолейОсмотраВТаблицуПараметров();
		
		Если ЗначениеЗаполнено(Объект.МедицинскаяКарта) Тогда
			
			СтруктураЗначенийПараметров = РаботаСШаблонамиHTML.ПолучитьСтруктуруЗначенийВсехПараметровПредыдущегоПриема(Объект, ТаблицаПараметров, ВерсииШаблонов);
			
			РаботаСШаблонамиHTMLКлиентСервер.ОбновитьЗначенияТаблицыПараметров(ТаблицаПараметров, СтруктураЗначенийПараметров.ЗначенияПредыдущие);
			РаботаСШаблонамиHTMLКлиентСервер.ОбновитьЗначенияДанныхТаблиц(ПараметрыТаблицШаблонов, Объект.ШаблоныПриема, СтруктураЗначенийПараметров.ЗначенияТаблицПредыдущие);
			
			ПреобразоватьОсмотрВВерсиюДляРедактирования(, Истина);
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='Следует перейти в режим редактирования из режима версии для печати!'"), 30);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьШаблонИзДругогоПриема(Команда)
	
	Если Не Элементы.КнопкаВерсияДляПечати.Пометка Тогда
		
		Если ЗначениеЗаполнено(Объект.МедицинскаяКарта) Тогда
			
			Если РежимОдногоШаблонаОсмотра Тогда
				ТекущаяСтрока = 0;
			Иначе
				ТекущаяСтрока = Элементы.ШаблоныПриема.ТекущаяСтрока;
			КонецЕсли;
			
			Если ТекущаяСтрока <> Неопределено Тогда
				ПеренестиЗначенияТекстовыхПолейОсмотраВТаблицуПараметров();
				СтрокаШаблона = Объект.ШаблоныПриема.НайтиПоИдентификатору(ТекущаяСтрока);
				Если СтрокаШаблона <> Неопределено Тогда
					ПараметрыОткрытияФормы = Новый Структура("Клиент, ТекущийПрием, ШаблонПриема", Объект.Клиент, Объект.Ссылка, СтрокаШаблона.ШаблонПриема);
					ОповещениеПродолжения = Новый ОписаниеОповещения("ЗаполнитьПоПриемуПродолжение", ЭтотОбъект, ТекущаяСтрока);
					ОткрытьФорму("Документ.Прием.Форма.ВыборПриемаДляЗаполненияШаблона", ПараметрыОткрытияФормы, ЭтотОбъект,,,,ОповещениеПродолжения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='Следует перейти в режим редактирования из режима версии для печати!'"), 30);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоПриемуПродолжение(Результат, ТекущаяСтрока) Экспорт
	
	Если Результат <> Неопределено Тогда  
		
		СтрокаШаблона = Объект.ШаблоныПриема.НайтиПоИдентификатору(ТекущаяСтрока);
		мШаблоныПриемов = Новый Массив;
		мШаблоныПриемов.Добавить(СтрокаШаблона);
		
		ОчищатьПараметрыБезЗаполнения = ?(Результат.Свойство("ОчищатьПараметрыБезЗаполнения"), Результат.ОчищатьПараметрыБезЗаполнения, Ложь);
		
		ПараметрыШаблонаВсе = ТаблицаПараметров.НайтиСтроки(Новый Структура("ИдентификаторСтрокиШаблона", ТекущаяСтрока));
		
		СтруктураЗначенийПараметров = ЗначенияПараметровДругогоПриемаДляЗаполнения(Объект, ВерсииШаблонов, Результат.ПриемОснование, Результат.ШаблонОснование, ТаблицаПараметров, ТекущаяСтрока, ОчищатьПараметрыБезЗаполнения);
		ЗначенияЗаполнения = СтруктураЗначенийПараметров.ЗначенияЗаполнения;
		
		// Удаление тех строк параметров из массива на заполнение, которые не надо затирать, если нет в источнике, т.к. у них НеЗаполняетсяПредыдущимиЗначениями.
		Если ОчищатьПараметрыБезЗаполнения Тогда
			НеЗаполняемыеПараметры = СтруктураЗначенийПараметров.НеЗаполняемыеПараметры;
			ПараметрыШаблона = Новый Массив;
			Для Каждого СтрокаПараметр Из ПараметрыШаблонаВсе Цикл
				Если НеЗаполняемыеПараметры.Найти(СтрокаПараметр.Параметр) = Неопределено Тогда
					ПараметрыШаблона.Добавить(СтрокаПараметр);
				КонецЕсли;
			КонецЦикла;
		Иначе
			ПараметрыШаблона = ПараметрыШаблонаВсе;
		КонецЕсли;
		
		РаботаСШаблонамиHTMLКлиентСервер.ОбновитьЗначенияТаблицыПараметров(ПараметрыШаблона, ЗначенияЗаполнения.ЗначенияПредыдущие,,, ОчищатьПараметрыБезЗаполнения);
		РаботаСШаблонамиHTMLКлиентСервер.ОбновитьЗначенияДанныхТаблиц(ПараметрыТаблицШаблонов, мШаблоныПриемов, ЗначенияЗаполнения.ЗначенияТаблицПредыдущие);
		
		ПреобразоватьОсмотрВВерсиюДляРедактирования(, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначенияПараметровДругогоПриемаДляЗаполнения(Знач Объект, Знач ВерсииШаблонов, Знач ПриемОснование, Знач ШаблонОснование, Знач ТаблицаПараметров, Знач ТекущаяСтрока, Знач ОчищатьПараметрыБезЗаполнения)
	
	ПараметрыШаблона = ТаблицаПараметров.НайтиСтроки(Новый Структура("ИдентификаторСтрокиШаблона", ТекущаяСтрока));
	ЗначенияЗаполнения = РаботаСШаблонамиHTML.ЗначенияПараметровДругогоПриемаДляЗаполнения(Объект, ПараметрыШаблона, ВерсииШаблонов, ПриемОснование, ШаблонОснование);
	
	Если ОчищатьПараметрыБезЗаполнения Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ ПланВидовХарактеристик.ПараметрыHTML ГДЕ Ссылка В (&Параметры) И НеЗаполняетсяПредыдущимиЗначениями");
		ПараметрыСсылки = Новый Массив;
		Для Каждого СтрокаПараметр Из ПараметрыШаблона Цикл
			ПараметрыСсылки.Добавить(СтрокаПараметр.Параметр);
		КонецЦикла;
		Запрос.Параметры.Вставить("Параметры", ПараметрыСсылки);
		НеЗаполняемыеПараметры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Иначе
		НеЗаполняемыеПараметры = Неопределено;
	КонецЕсли;
	
	Возврат Новый Структура("ЗначенияЗаполнения, НеЗаполняемыеПараметры", ЗначенияЗаполнения, НеЗаполняемыеПараметры);
	
КонецФункции

&НаКлиенте
Процедура СохранитьЗаполнениеКакШаблонЗаполнения(Команда)
	
	ИдентификаторСтрокиШаблона = ИдентификаторСтрокиШаблонаПриема();
	
	Если ИдентификаторСтрокиШаблона <> Неопределено Тогда
		
		СтрокаШаблона = Объект.ШаблоныПриема.НайтиПоИдентификатору(ИдентификаторСтрокиШаблона);
		Шаблон = СтрокаШаблона.ШаблонПриема;
		
		Если Шаблон = Неопределено Тогда
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	
	ЗначенияПараметровШаблона = Новый Соответствие;
	Для Каждого Элемент Из ТаблицаПараметров Цикл
		Если ИдентификаторСтрокиШаблона = Элемент.ИдентификаторСтрокиШаблона Тогда
			Если ЗначениеЗаполнено(Элемент.Значение) Тогда
				ЗначенияПараметровШаблона.Вставить(Элемент.Параметр, Элемент.Значение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	УдалитьНеРедактируемыеПараметры(ЗначенияПараметровШаблона);
	
	ПараметрыФормы.Вставить("ЗначенияПараметровШаблона", ЗначенияПараметровШаблона);
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Владелец", Шаблон));
	
	ОткрытьФорму("Справочник.ШаблоныЗаполненияОсмотра.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьНеРедактируемыеПараметры(ЗначенияПараметровШаблона)
	
	Для Каждого Элемент Из ЗначенияПараметровШаблона Цикл
		Если Элемент.Ключ.НеРедактируетсяПользователем Тогда
			ЗначенияПараметровШаблона.Удалить(Элемент.Ключ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВерсияДляПечати(Команда)
	
	ВерсияДляПечати = Не Элементы.КнопкаВерсияДляПечати.Пометка;
	
	#Область Стоматология
	Если ВерсияДляПечати И Не РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтаФорма) Тогда
		ТекстСообщения = НСтр("ru = 'Документ не проведен, некоторые поля бланка осмотра врача могут быть не заполнены!'");
		Сообщить(ТекстСообщения);
	КонецЕсли;
	#КонецОбласти
	
	Элементы.КнопкаВерсияДляПечати.Пометка = ВерсияДляПечати;
	
	Если ВерсияДляПечати Тогда
		ПеренестиЗначенияТекстовыхПолейОсмотраВТаблицуПараметров();
		ПреобразоватьОсмотрВВерсиюДляПечати();
		УстановитьОтборГотовыхФраз(Ложь);
	Иначе
		ПреобразоватьОсмотрВВерсиюДляРедактирования();
	КонецЕсли;
	
	Элементы.ГруппаПечатьВсегоОсмотра.Видимость = Не РежимОдногоШаблонаОсмотра
												И ВерсияДляПечати
												И КоличествоЗаполненныхШаблоновПриема(Объект.ШаблоныПриема) > 1;
												
	Элементы.ПодменюЗаполнитьОсмотр.Доступность = Не ВерсияДляПечати;
	Элементы.ШаблоныПриема.Доступность = Не ВерсияДляПечати;
	Элементы.ОткрытьОбработку.Доступность = Не ВерсияДляПечати;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПечатиПриНажатии(Команда)
	
	Если Команда = Команды.РежимПечатиДляКлиента Тогда
		РежимПолучателяПечатнойВерсииОсмотра = Истина;
	ИначеЕсли Команда = Команды.РежимПечатиДляМедкарты Тогда
		РежимПолучателяПечатнойВерсииОсмотра = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
	
	Элементы.РежимПечатиДляКлиента.Пометка	 = РежимПолучателяПечатнойВерсииОсмотра;
	Элементы.РежимПечатиДляМедкарты.Пометка	 = Не РежимПолучателяПечатнойВерсииОсмотра;
	
	ВерсияДляПечати = Элементы.КнопкаВерсияДляПечати.Пометка;
	Если ВерсияДляПечати Тогда
		ПреобразоватьОсмотрВВерсиюДляПечати();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьПоРежимуПечати(Команда)
	
	РежимПечатиИзменился = Ложь;
	Если Команда = Команды.ПечатьРежимПечатиДляКлиента Тогда
		НовыйРежимПечати = Истина;
	Иначе
		НовыйРежимПечати = Ложь;
	КонецЕсли;
	
	Если НовыйРежимПечати <> РежимПолучателяПечатнойВерсииОсмотра Тогда
		
		РежимПолучателяПечатнойВерсииОсмотра = НовыйРежимПечати;
		
		Элементы.РежимПечатиДляКлиента.Пометка	 = РежимПолучателяПечатнойВерсииОсмотра;
		Элементы.РежимПечатиДляМедкарты.Пометка	 = Не РежимПолучателяПечатнойВерсииОсмотра;
		
		ВерсияДляПечати = Элементы.КнопкаВерсияДляПечати.Пометка;
		Если ВерсияДляПечати Тогда
			ПреобразоватьОсмотрВВерсиюДляПечати();
		КонецЕсли;
	КонецЕсли;
	
	ПечатьБезПросмотра(Команда);
	
КонецПроцедуры

&НаКлиенте
Функция ПреобразоватьОсмотрВВерсиюДляПечати(ПреобразуемаяСтрокаШаблона = Неопределено)
	
	ВерсияДляПечати = Истина;
	Если ПреобразуемаяСтрокаШаблона <> Неопределено Тогда
		ДанныеДляОбратнойОперации = Новый Структура("ИмяПоляДокумента, ТекстРедактирования");
	КонецЕсли;
	
	Если ИспользуютсяЭП И Объект.ПодписанЭП Тогда
		Колонтитулы = РаботаСШаблонамиHTML.СформироватьКолонтитулыЭЦПШаблонов(Объект.Ссылка, ЭлектронныеПодписи, Объект.ШаблоныПриема, Объект.ЭМД, Объект.РолиИПодписиЭМД);
	Иначе
		Колонтитулы = Новый Соответствие;
	КонецЕсли;
	
	Для Каждого СтрокаШаблона Из Объект.ШаблоныПриема Цикл
		
		Если ПреобразуемаяСтрокаШаблона = Неопределено
			Или СтрокаШаблона.ПолучитьИдентификатор() = ПреобразуемаяСтрокаШаблона
		Тогда
			СтрокаСтраницыШаблона = ПолучитьСтрокуСтраницШаблонаПриемаКлиент(СтрокаШаблона);
			Если СтрокаСтраницыШаблона = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			КолонтитулыШаблона = Колонтитулы.Получить(СтрокаШаблона.ШаблонПриема);
			
			Если СтрокаШаблона.ВидШаблона = ПредопределенноеЗначение("Перечисление.ВидыШаблонов.HTMLШаблон") Тогда
				
				// Получение имени HTML-документа.
				ПолеДокумента = Элементы.Найти(СтрокаСтраницыШаблона.ИмяПоляДокумента);
				
				Если ПреобразуемаяСтрокаШаблона <> Неопределено Тогда
					ДанныеДляОбратнойОперации.ИмяПоляДокумента = СтрокаСтраницыШаблона.ИмяПоляДокумента;
					ДанныеДляОбратнойОперации.ТекстРедактирования = ПолеДокумента.Документ.body.innerHTML;
				КонецЕсли;
				
				МодульРаботыСШаблонами = РаботаСШаблонамиHTMLКлиентСервер;
				#Если ВебКлиент Или МобильныйКлиент Тогда
					МодульРаботыСШаблонами = РаботаСШаблонамиHTML;
				#КонецЕсли
				
				ДанныеШаблона = Новый Структура("Шаблон, ИдентификаторСтрокиШаблона, ТекстШаблона", 
					СтрокаШаблона.ШаблонПриема, СтрокаСтраницыШаблона.ИдентификаторСтрокиШаблона, СтрокаШаблона.ТекстШаблона);
				
				ДанныеТаблицШаблонов = Новый Структура("ПараметрыТаблицШаблонов, ЭталонныеСтрокиТаблиц", ПараметрыТаблицШаблонов, СтрокаШаблона.ЭталонныеСтрокиТаблиц);
				
				ДанныеСформированногоШаблона = МодульРаботыСШаблонами.СформироватьВерсиюДляПечатиШаблонаОсмотра(Объект, ДанныеШаблона, 
					ТаблицаПараметров, КешЗначенийВыбора, СписокНазначений, соотвКешИзображенийШаблонов, УникальныйИдентификатор, ДанныеТаблицШаблонов, , РисункиКартинок, ДобавленныеИзображения);
				
				СтрокаСтраницыШаблона.ТекстДляПечати = ДанныеСформированногоШаблона.ТекстШаблонаТело;
				
				Если Не ИзмененияЗапрещены Тогда
					СтрокаШаблона.ТекстДляПечати = ДанныеСформированногоШаблона.ТекстШаблонаТелоБезРисунков;
				КонецЕсли;
				
				ТекстШаблонаПолный = ДанныеСформированногоШаблона.ТекстШаблонаПолный;
				
				// При необходимости, преобразование в версию для клиента или для медкарты.
				Если РежимПолучателяПечатнойВерсииОсмотра <> Неопределено Тогда
					ТекстШаблонаПолный = МодульРаботыСШаблонами.ТекстШаблонаОсмотраПоРежиму(ТекстШаблонаПолный, РежимПолучателяПечатнойВерсииОсмотра);
				КонецЕсли;
				
				Если КолонтитулыШаблона <> Неопределено Тогда
					ТекстШаблонаПолный = РаботаСШаблонамиHTMLКлиентСервер.ДобавитьКолонтитулЭЦПВТекстТела(ТекстШаблонаПолный, КолонтитулыШаблона);
				КонецЕсли;
				
				Если Не СтрокаШаблона.НеИспользоватьШапкуШаблона Тогда
					ТекстШаблонаПолный = МодульРаботыСШаблонами.УстановитьШапкуШаблона(ТекстШаблонаПолный, РежимПолучателяПечатнойВерсииОсмотра, Объект);
				КонецЕсли;
				
				РаботаСШаблонамиHTMLКлиентСервер.УстановитьСтильСкрываемостиПриПечатиВЗаголовокДокумента(ТекстШаблонаПолный);
				
				ЭтаФорма[СтрокаСтраницыШаблона.ИмяРеквизита] = ТекстШаблонаПолный;
			Иначе
				Если ПустаяСтрока(СтрокаШаблона.ТекстДляПечати) Тогда
					СтрокаШаблона.ТекстДляПечати = РаботаСШаблонамиHTMLКлиентСервер.ПолучитьТекстШаблонаHTMLПоУмолчанию();
				КонецЕсли;
				
				ТекстШаблонаПолный = СтрокаШаблона.ТекстДляПечати;
				Если КолонтитулыШаблона <> Неопределено Тогда
					ТекстШаблонаПолный = РаботаСШаблонамиHTMLКлиентСервер.ДобавитьКолонтитулЭЦПВТекстТела(ТекстШаблонаПолный, КолонтитулыШаблона);
				КонецЕсли;
				
				ЭтаФорма[СтрокаСтраницыШаблона.ИмяРеквизита] = РаботаСDOMКлиентСервер.СформироватьПолныйТекстДокументаHTML(ТекстШаблонаПолный);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	// В случае перехода к версии для печати всего приема сохраняется текст печати всего документа.
	Если ПреобразуемаяСтрокаШаблона = Неопределено Тогда
		ДопПараметры = ДокументыПриемаКлиентСервер.ДополнительныеПараметрыФормированияПолногоОсмотра();
		ДопПараметры.Колонтитулы					= Колонтитулы;
		ДопПараметры.РежимДляКлиента				= РежимПолучателяПечатнойВерсииОсмотра;
		ДопПараметры.ДанныеРедактируемыхЭлементов	= Новый Структура("РисункиКартинок, ДобавленныеИзображения", РисункиКартинок, ДобавленныеИзображения);
		
		ТекстПечатиПриема = ДокументыПриемаКлиентСервер.СформироватьHTMLТекстПечатиОсмотраПолный(Объект, ТаблицаПараметров, ПараметрыТаблицШаблонов, СписокНазначений, ВерсииШаблонов, ДопПараметры);
		ПолеHTMLПечати = ТекстПечатиПриема;
	КонецЕсли;
	
	Возврат ДанныеДляОбратнойОперации;
	
КонецФункции

&НаКлиенте
Процедура ПреобразоватьОсмотрВВерсиюДляРедактирования(ПреобразуемаяСтрокаШаблона = Неопределено, ВызыватьПереобновлениеПолейШаблоновОсмотра = Ложь)
	
	ВерсияДляПечати = Ложь;
	ТекущийЭлементПараметраШаблона = Неопределено;
	
	мОбновленныеСтрокиШаблонов = Новый Массив;
	Если ВызыватьПереобновлениеПолейШаблоновОсмотра Тогда 
		ПодключитьОбработчикОжидания("ОтложенноеОбновлениеТекстаШаблоновОсмотра", 0.1, Истина);
	КонецЕсли;
	
	Для Каждого СтрокаШаблона Из Объект.ШаблоныПриема Цикл
		
		Если ПреобразуемаяСтрокаШаблона = Неопределено
			Или СтрокаШаблона.ПолучитьИдентификатор() = ПреобразуемаяСтрокаШаблона
		Тогда
			// Получение имени HTML-документа
			СтрокаСтраницыШаблона = ПолучитьСтрокуСтраницШаблонаПриемаКлиент(СтрокаШаблона);
			Если СтрокаСтраницыШаблона <> Неопределено Тогда
				
				Если СтрокаШаблона.ВидШаблона = ПредопределенноеЗначение("Перечисление.ВидыШаблонов.HTMLШаблон") Тогда
					
					ВерсияШаблона = ПолучитьВерсиюШаблона(СтрокаШаблона.ШаблонПриема);
					
					ДанныеШаблона = Новый Структура("Шаблон, ИдентификаторСтрокиШаблона, ТекстШаблона", 
						ВерсияШаблона, СтрокаСтраницыШаблона.ИдентификаторСтрокиШаблона, ОбщегоНазначения.ПолучитьЗначениеРеквизита(ПолучитьВерсиюШаблона(СтрокаШаблона.ШаблонПриема), "ТекстHTML"));
					//ДанныеШаблона = Новый Структура("Шаблон, ИдентификаторСтрокиШаблона, ТекстШаблона", 
					//	СтрокаШаблона.ШаблонПриема, СтрокаСтраницыШаблона.ИдентификаторСтрокиШаблона, СтрокаШаблона.ТекстШаблона);
						
					МодульРаботыСШаблонами = РаботаСШаблонамиHTMLКлиентСервер;
					#Если ВебКлиент Или МобильныйКлиент Тогда
						МодульРаботыСШаблонами = РаботаСШаблонамиHTML;
					#КонецЕсли
					
					ДанныеТаблицШаблонов = Новый Структура("ПараметрыТаблицШаблонов, ЭталонныеСтрокиТаблиц", ПараметрыТаблицШаблонов, СтрокаШаблона.ЭталонныеСтрокиТаблиц);
					
					ДанныеСформированногоШаблона = МодульРаботыСШаблонами.СформироватьВерсиюДляРедактированияШаблонаОсмотра(УникальныйИдентификатор, ДанныеШаблона,
						ТаблицаПараметров, КешЗначенийВыбора, соотвКешИзображенийШаблонов, ДанныеТаблицШаблонов, РисункиКартинок, ДобавленныеИзображения);
					
					ТекстШаблона = ДанныеСформированногоШаблона.ТекстШаблонаПолный;
					
					Если ДанныеСформированногоШаблона.ОбновленныеЗначенияПараметров.Количество() > 0 Тогда
						РаботаСШаблонамиHTMLКлиентСервер.ОбновитьЗначенияТаблицыПараметров(
							ТаблицаПараметров, ДанныеСформированногоШаблона.ОбновленныеЗначенияПараметров, СтрокаСтраницыШаблона.ИдентификаторСтрокиШаблона);
					КонецЕсли;
					
					Если ВызыватьПереобновлениеПолейШаблоновОсмотра Тогда 
						ЭтаФорма[СтрокаСтраницыШаблона.ИмяРеквизита] = ТекстШаблона + "<BR>";
						мОбновленныеСтрокиШаблонов.Добавить(Новый Структура("СтрокаСтраницыШаблона, ТекстШаблона", СтрокаСтраницыШаблона, ТекстШаблона));
					Иначе
						ЭтаФорма[СтрокаСтраницыШаблона.ИмяРеквизита] = ТекстШаблона;
					КонецЕсли;
					
				Иначе
					Если ПустаяСтрока(СтрокаШаблона.ТекстДляПечати) Тогда
						СтрокаШаблона.ТекстДляПечати = РаботаСШаблонамиHTMLКлиентСервер.ПолучитьТекстШаблонаHTMLПоУмолчанию();
					КонецЕсли;
					ЭтаФорма[СтрокаСтраницыШаблона.ИмяРеквизита] = РаботаСDOMКлиентСервер.СформироватьПолныйТекстДокументаHTML(СтрокаШаблона.ТекстДляПечати);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтложенноеОбновлениеТекстаШаблоновОсмотра()
	
	Если мОбновленныеСтрокиШаблонов = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого ОбновленнаяСтрока Из мОбновленныеСтрокиШаблонов Цикл
		ЭтаФорма[ОбновленнаяСтрока.СтрокаСтраницыШаблона.ИмяРеквизита] = ОбновленнаяСтрока.ТекстШаблона;	
	КонецЦикла;
	
	мОбновленныеСтрокиШаблонов = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуСтраницШаблонаПриемаКлиент(СтрокаШаблона)
	
	Если ТипЗнч(СтрокаШаблона) = Тип("Число") Тогда
		ИдентификаторСтроки = СтрокаШаблона;
	Иначе
		ИдентификаторСтроки = СтрокаШаблона.ПолучитьИдентификатор();
	КонецЕсли;
	
	мсСтр = СтраницыШаблоновПриема.НайтиСтроки(Новый Структура("ИдентификаторСтрокиШаблона", ИдентификаторСтроки));
	Если мсСтр.Количество() <> 0 Тогда
		Возврат мсСтр[0];
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура КомандаПросмотрЭМК(Команда)
	
	Если Объект.Клиент.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Клиент, Медицинскаякарта", Объект.Клиент, Объект.МедицинскаяКарта);
	ОткрытьФорму("Обработка.ПросмотрМедКарт.Форма.ФормаАмбулаторнаяМК", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПриёмПоЭлектроннойПочте(Команда)
	
	УправлениеЭлектроннойПочтойКлиент.ОтправитьДокументПоЭлектроннойПочте(ЭтотОбъект);
	
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ.

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДокументыПриемаКлиентСервер.ЗаполнитьТаблицуВерсийШаблонов(ВерсииШаблонов, Объект);
	ЗаполнитьДополнительныеРеквизитыТабЧастиШаблоны(Истина);
	СтраницыШаблоновПриема.Очистить();
	ПерезаполнитьТаблицуСтраницШаблоновПриема();
	
	ВерсииШаблоновДокумента = Новый Массив;
	Для Каждого СтрокаШаблона Из Объект.ШаблоныПриема Цикл
		ВерсииШаблоновДокумента.Добавить(ПолучитьВерсиюШаблона(СтрокаШаблона.ШаблонПриема));
	КонецЦикла;
	РаботаСШаблонамиHTMLКлиентСервер.ИнициализироватьНастройкиИзображенийПриема(соотвКешИзображенийШаблонов, ВерсииШаблоновДокумента, ЭтаФорма.УникальныйИдентификатор);
	
	РаботаСШаблонамиHTMLКлиент.ПересчетПараметровОтЗависимыхРеквизитов("Дата", ЭтаФорма, Объект);
	
	#Область Стоматология
	ИнициализироватьЗубнуюКарту();
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда 
		Если Не ЗначениеЗаполнено(Объект.МедицинскаяКарта) Тогда
			Объект.МедицинскаяКарта = КлиентПриИзмененииСервер(Объект.Клиент);
			МедицинскаяКартаПриИзменении(Элементы.МедицинскаяКарта);
		КонецЕсли;
		
		#Область Стоматология
		КартаВариант = стомСтоматология.ПолучитьВидВариантЗубнойКарты(Объект.Клиент);
		Объект.ЗубнаяКарта = КартаВариант.ЗубнаяКарта;
		Объект.ВариантЗубнойКарты = КартаВариант.ВариантЗубнойКарты;
		#КонецОбласти
	КонецЕсли;
	
	Если Клиент <> Объект.Клиент Тогда
	
		Объект.ПервичныйПрием = ПредопределенноеЗначение("Документ.Прием.ПустаяСсылка");
		ОбновитьПривязывающиеРеквизитыПланаЛечения();
		
		НастроитьДоступностьЭлементов();
	
		#Область Стоматология
		ИнициализироватьЗубнуюКарту();
		#КонецОбласти
	
		РаботаСШаблонамиHTMLКлиент.ПересчетПараметровОтЗависимыхРеквизитов("Клиент", ЭтаФорма, Объект);
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Клиент, "Тестовый") = Истина Тогда
		Объект.Тестовый = Истина;
	КонецЕсли;
	
	Клиент = Объект.Клиент;
	
КонецПроцедуры

&НаСервереБезКонтекста 
Функция КлиентПриИзмененииСервер(Клиент)
	
	Если ЗначениеЗаполнено(Клиент.ОсновнаяМедицинскаяКарта) Тогда
		Возврат Клиент.ОсновнаяМедицинскаяКарта;
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Клиент", Клиент);
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 2
		|	МедицинскиеКарты.Ссылка
		|ИЗ
		|	Справочник.МедицинскиеКарты КАК МедицинскиеКарты
		|ГДЕ
		|	МедицинскиеКарты.Клиент = &Клиент"
		;
		Выб = Запрос.Выполнить().Выбрать();
		Если Выб.Количество() = 1 Тогда
			Выб.Следующий();
			Возврат Выб.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.МедицинскиеКарты.ПустаяСсылка();
	
КонецФункции

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ВерсияДляПечати Тогда
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Если ДанныеСобытия.Element.hasAttribute("bit-contextmenu-selectElement") Тогда
		ОбновитьЗначениеЭлементаHTMLДляКонтекстногоМеню(ДанныеСобытия.Element, Элемент.Имя);
		ДанныеСобытия.Element.removeAttribute("bit-contextmenu-selectElement");
		Элементы.ПолеHTMLДокументаКонтекстноеМенюПолеHTMLДокументаОчистить.Доступность = ДанныеЭлементаHTMLДляКонтекстногоМеню <> Неопределено;
		Элементы.ПолеHTMLДокументаКонтекстноеМенюПолеHTMLДокументаЗаполнитьПоУмолчанию.Доступность = ДанныеЭлементаHTMLДляКонтекстногоМеню <> Неопределено;
		СтандартнаяОбработка = Ложь;
		Возврат;
	Иначе
		ДанныеЭлементаHTMLДляКонтекстногоМеню = Неопределено;
		Элементы.ПолеHTMLДокументаКонтекстноеМенюПолеHTMLДокументаОчистить.Доступность = Ложь;
		Элементы.ПолеHTMLДокументаКонтекстноеМенюПолеHTMLДокументаЗаполнитьПоУмолчанию.Доступность = Ложь;
	КонецЕсли;
	
	ТекущийЭлементПараметраШаблона = Неопределено;
	
	ЭлементHTMLНижний = ДанныеСобытия.Element;
	ЭлементHTML = РаботаСШаблонамиHTMLКлиентСервер.НайтиЭлементСЗаполненнымIDВышеПоИерархии(ЭлементHTMLНижний);
	Попытка
		// Необходимо, чтобы webkit понял, какой элемент сейчас текущий и платформа корректно отработала положение для ПоказатьВыборИзСписка().
		ЭлементHTML.focus();
	Исключение КонецПопытки;
	
	ИдентификаторСтрокиШаблона = ИдентификаторСтрокиШаблонаПриема();
	Если ИдентификаторСтрокиШаблона = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСШаблонамиHTMLКлиент.ОбработатьИзмененныеПоляВвода(ДанныеСобытия.Document, ЭтотОбъект, Элемент.Имя, ИдентификаторСтрокиШаблона, ТаблицаПараметров, КешЗначенийВыбора, Объект);
	
	БлижайшийЭлементКнопки = РаботаСHTMLКлиентСервер.ПолучитьБлижайшийУзел(ЭлементHTMLНижний, "button");
	Если БлижайшийЭлементКнопки <> Неопределено Тогда
		РаботаСШаблонамиHTMLКлиент.КнопкаШаблонаНажатие(ЭтотОбъект, БлижайшийЭлементКнопки, ИдентификаторСтрокиШаблона, соотвКешИзображенийШаблонов);
		ЭлементHTML = Неопределено;
	КонецЕсли;
	
	Если ЭлементHTML = Неопределено Тогда
		УстановитьОтборГотовыхФраз(Ложь);
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	// Чтобы не срабатывал переход по ссылке
	ТегЭлемента = ВРег(ЭлементHTML.TagName);
	Если ВРег(ЭлементHTMLНижний.TagName) = "A" Или ТегЭлемента = "A" Тогда 
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Если ТегЭлемента <> "TEXTAREA" И ТегЭлемента <> "INPUT" Тогда
		УстановитьОтборГотовыхФраз(Ложь);
	КонецЕсли;
	
	мсСтрокаПараметра = ТаблицаПараметров.НайтиСтроки(Новый Структура("СтрокаУидПараметра, ИдентификаторСтрокиШаблона", ЭлементHTML.id, ИдентификаторСтрокиШаблона));
	Если мсСтрокаПараметра.Количество() > 0 Тогда
		
		ТекущийЭлементПараметраШаблона = Новый Структура("СтрокаУидПараметра, ИдентификаторСтрокиШаблона, ИмяПоляШаблона, ЭлементHTML, ТегЭлемента", 
			ЭлементHTML.id, ИдентификаторСтрокиШаблона, Элемент.Имя, СтруктураТекущегоЭлементаШаблонаHTML(ЭлементHTML), ТегЭлемента);
		
		СтрокаПараметра = мсСтрокаПараметра[0];
		РаботаСШаблонамиHTMLКлиент.ВыбратьЗначениеПараметраHTMLИнтерактивно(ЭтаФорма, Элемент.Имя, ЭлементHTML, СтрокаПараметра, КешЗначенийВыбора, Объект);
		
		Если ТегЭлемента = "TEXTAREA" Или ТегЭлемента = "INPUT" Тогда
			УстановитьОтборГотовыхФраз(Истина, СтрокаПараметра.Параметр);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗначениеЭлементаHTMLДляКонтекстногоМеню(ЭлементHTML, ИмяЭлемента)
	
	ДанныеЭлементаHTMLДляКонтекстногоМеню = Неопределено;
	
	// Теги элементов, которые могут содержать атрибут 'id', не являющихся параметрами
	ИсключаемыеТеги = Новый Массив;
	ИсключаемыеТеги.Добавить("IMG");
	ИсключаемыеТеги.Добавить("TT");
	
	Попытка
		Если ИсключаемыеТеги.Найти(ВРег(ЭлементHTML.tagName)) = Неопределено И ЗначениеЗаполнено(ЭлементHTML.id) Тогда
			ЭлементыПоУИД = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(ЭлементHTML.ownerDocument, ЭлементHTML.id);
			Для НомерЭлемента = 0 По ЭлементыПоУИД.length Цикл
				Если ЭлементыПоУИД[НомерЭлемента] = ЭлементHTML Тогда
					ДанныеЭлементаHTMLДляКонтекстногоМеню = Новый Структура("id, НомерЭлемента, ИмяЭлемента", ЭлементHTML.id, НомерЭлемента, ИмяЭлемента);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	Исключение КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLДокументаДокументСформирован(Элемент)
	
	Если мПараметрыПечатиСтраницыОсмотра = Неопределено Или 
		Элемент <> мПараметрыПечатиСтраницыОсмотра.ПолеДокумента 
	Тогда
		Возврат;
	КонецЕсли;
	
	мПараметрыПечатиСтраницыОсмотра.ПолеДокумента.Документ.execCommand("Print");
	Элементы.ГруппаСтраницыОсмотра.ТекущаяСтраница = мПараметрыПечатиСтраницыОсмотра.ТекущаяСтраница;
	мПараметрыПечатиСтраницыОсмотра = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыПриИзменении(Элемент)
	РаботаСШаблонамиHTMLКлиент.ПересчетПараметровОтЗависимыхРеквизитов("Работы", ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура РаботыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Элемент.ТекущиеДанные <> Неопределено Тогда
		
		Элемент.ТекущиеДанные.КлючСтроки = ОбщегоНазначенияКлиентСервер.ПолучитьМаксимумМинимумСвойстваВКоллекции(Объект.Работы, "КлючСтроки", Истина, 0) + 1;
		Элемент.ТекущиеДанные.ИД = Неопределено;
		
		#Область Стоматология
		Если Не Копирование Тогда
			ТекДанные = Элемент.ТекущиеДанные;
			Если стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты.Количество() = 1 Тогда
				Для Каждого ВыделенныйЗуб Из стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты Цикл 
					ТекДанные.ЗубВКарте = ВыделенныйЗуб.ЗубВКарте;
					Если ВыделенныйЗуб.Сегменты.Количество() = 1 Тогда
						ТекДанные.СегментВЗубе = ВыделенныйЗуб.Сегменты[0];
						Элемент.ТекущийЭлемент = Элементы.ДиагнозыДиагноз;
					КонецЕсли;
					Элемент.ТекущийЭлемент = Элементы.РаботыНоменклатура;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		#КонецОбласти
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьСписокРаботДокумента();
	УдалитьМатериалыУдаленныхРабот();
	Если мАвтоматическиЗаполнятьМатериалы Тогда
		ЗаполнитьМатериалыПоНормамРабот();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыПослеУдаления(Элемент)
	
	ОбновитьСписокРаботДокумента();
	УдалитьМатериалыУдаленныхРабот();
	Если мАвтоматическиЗаполнятьМатериалы Тогда
		ЗаполнитьМатериалыПоНормамРабот();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Элемент.ТекущиеДанные <> Неопределено И Не Копирование Тогда
		
		Если Элемент.ТекущиеДанные.Количество = 0 Тогда
			Элемент.ТекущиеДанные.Количество = 1;
		КонецЕсли;
		
		Если мСписокРаботДокумента.Количество() = 1 Тогда
			Для Каждого СтрокаРаботы Из Объект.Работы Цикл
				Если СтрокаРаботы.КлючСтроки = мСписокРаботДокумента[0].Значение Тогда
					Элемент.ТекущиеДанные.Работа = СтрокаРаботы.Номенклатура;
					Элемент.ТекущиеДанные.КлючСтроки = СтрокаРаботы.КлючСтроки;
					Элементы.Материалы.ТекущийЭлемент = Элементы.МатериалыНоменклатура;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РучнаяКорректировкаМатериаловПриИзменении(Элемент)
	
	НастроитьРежимРедактированияТабличногоПоляМатериалов(Элементы, мУчетнаяПолитика, Объект, мАвтоматическиЗаполнятьМатериалы);
	
	Если РаботаСФормамиКлиентСервер.ИзменениеСоставаКомандТабличныхЧастейТолькоНаСервере() Тогда // 8.3.23 и выше.
		РаботаСФормамиКлиент.ОчиститьЛишниеКомандыПобор(ЭтаФорма, Истина); // Обход проблемы 8.3.23+ по сбросу основной команды документа от изменения Материалы.ИзменятьСоставСтрок.
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	Если мАвтоматическиЗаполнятьМатериалы Тогда
		ЗаполнитьМатериалыПоНормамРабот();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РаботыКоличествоПриИзменении(Элемент)
	
	Если мАвтоматическиЗаполнятьМатериалы Тогда
		ЗаполнитьМатериалыПоНормамРабот();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Работы.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		ПозицияВводаСтроки = 0; 
	Иначе
		ПозицияВводаСтроки = СтрокаТабличнойЧасти.НомерСтроки-1; 
	КонецЕсли;
	
	Если ДопСерверныеФункции.ПолучитьРеквизит(СтрокаТабличнойЧасти.Номенклатура, "ВидНоменклатуры") = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Набор") Тогда
		
		СоставНабора = ОбщегоНазначенияСервер.ПолучитьСоставНабора(СтрокаТабличнойЧасти.Номенклатура);
		Если СтрокаТабличнойЧасти <> Неопределено Тогда
			Объект.Работы.Удалить(ПозицияВводаСтроки);
		КонецЕсли;
		
		Для Каждого СтрокаСостава Из СоставНабора Цикл
			СтрокаРаботы = Объект.Работы.Вставить(ПозицияВводаСтроки);
			СтрокаРаботы.Номенклатура = СтрокаСостава.Комплектующая;
			СтрокаРаботы.ХарактеристикаНоменклатуры = СтрокаСостава.ХарактеристикаКомплектующей;
			СтрокаРаботы.Количество   = СтрокаСостава.Количество;
			СтрокаРаботы.КлючСтроки   = ОбщегоНазначенияКлиентСервер.ПолучитьМаксимумМинимумСвойстваВКоллекции(Объект.Работы, "КлючСтроки", Истина, 0) + 1;
			Элементы.Работы.ТекущаяСтрока = СтрокаРаботы.ПолучитьИдентификатор();
			РаботыНоменклатураПриИзменении(Неопределено);
			ПозицияВводаСтроки = ПозицияВводаСтроки + 1;
		КонецЦикла;
		
		РаботыПриОкончанииРедактирования(Элементы.Работы,Ложь,Ложь);
		
	ИначеЕсли СтрокаТабличнойЧасти.Номенклатура.Пустая() 
		Или ДопСерверныеФункции.ПолучитьРеквизит(СтрокаТабличнойЧасти.Номенклатура, "ВидНоменклатуры") = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Услуга")
	Тогда
	
		Если СтрокаТабличнойЧасти.Количество = 0 Тогда
			СтрокаТабличнойЧасти.Количество = 1;
		КонецЕсли;
		
	КонецЕсли;
	
	УдалитьМатериалыУдаленныхРабот();
	Если мАвтоматическиЗаполнятьМатериалы Тогда
		ЗаполнитьМатериалыПоНормамРабот();
	КонецЕсли;
	ОбновитьСписокРаботДокумента();
	
	Элементы.РаботыНомерПробы.Видимость = Элементы.РаботыНомерПробы.Видимость Или ВычислитьВидимостьКолонкиНомераПробы(Объект.Работы);

КонецПроцедуры

&НаКлиенте
Процедура НазначенияПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) <> Тип("Массив") 
		Или ТипЗнч(ПараметрыПеретаскивания.Значение[0].СтандартЛечения) <> Тип("СправочникСсылка.СтандартыЛечения")
	Тогда 
  		
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Отмена;
		
	Иначе
		
		ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;	                 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПодменюШаблоновЗаполненияОсмотра()
	
	// Удаление лишних команд, кнопок, строк шаблонов заполнения.
	ИдентификаторыСтрокШаблонов = Новый Массив;
	Для Каждого СтрокаШаблона Из Объект.ШаблоныПриема Цикл
		ИдентификаторыСтрокШаблонов.Добавить(СтрокаШаблона.ПолучитьИдентификатор());
	КонецЦикла;
	СтрокиШаблоновЗаполненияКУдалению = Новый Массив;
	Для Каждого СтрокаШаблонаЗаполнения Из ШаблоныЗаполненияОсмотра Цикл
		Если ИдентификаторыСтрокШаблонов.Найти(СтрокаШаблонаЗаполнения.ИдентификаторСтрокиШаблона) = Неопределено Тогда
			СтрокиШаблоновЗаполненияКУдалению.Добавить(СтрокаШаблонаЗаполнения);
		КонецЕсли;
	КонецЦикла;
	
	ЭлементыформыКУдалению = Новый Массив;
	Для Каждого СтрокаШаблонаЗаполнения Из СтрокиШаблоновЗаполненияКУдалению Цикл
		
		Для Каждого КнопкаЗаполнения Из Элементы.ГруппаШаблоныЗаполнения.ПодчиненныеЭлементы Цикл
			Если КнопкаЗаполнения.ИмяКоманды = СтрокаШаблонаЗаполнения.ИмяКоманды Тогда
				ЭлементыформыКУдалению.Добавить(КнопкаЗаполнения);
			КонецЕсли;
		КонецЦикла;
		
		Команды.Удалить(Команды.Найти(СтрокаШаблонаЗаполнения.ИмяКоманды));
		ШаблоныЗаполненияОсмотра.Удалить(СтрокаШаблонаЗаполнения);
	КонецЦикла;
	Для Каждого КнопкаЗаполнения Из ЭлементыформыКУдалению Цикл
		Элементы.Удалить(КнопкаЗаполнения);
	КонецЦикла;
	
	// Добавление новых шаблонов заполнения, соотетсвующих шаблонам приема.
	ШаблоныПриема = Объект.ШаблоныПриема;
	
	ТаблицаШаблоныПриема = ШаблоныПриема.Выгрузить();
	ТаблицаШаблоныПриема.Свернуть("ШаблонПриема");
	МассивШаблоновПриема = ТаблицаШаблоныПриема.ВыгрузитьКолонку("ШаблонПриема");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ШаблоныПриема", МассивШаблоновПриема);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШаблоныЗаполненияОсмотра.Ссылка КАК ШаблонЗаполнения,
	|	ШаблоныЗаполненияОсмотра.Представление КАК Представление,
	|	ШаблоныЗаполненияОсмотра.Владелец КАК ШаблонПриема,
	|	ШаблоныЗаполненияОсмотра.Владелец.Представление КАК ШаблонПриемаПредставление
	|ИЗ
	|	Справочник.ШаблоныЗаполненияОсмотра КАК ШаблоныЗаполненияОсмотра
	|ГДЕ
	|	ШаблоныЗаполненияОсмотра.Владелец В(&ШаблоныПриема)
	|	И НЕ ШаблоныЗаполненияОсмотра.ЭтоГруппа
	|	И НЕ ШаблоныЗаполненияОсмотра.ПометкаУдаления"
	;
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Количество() <> 0 Тогда
		
		КолШаблонов = ШаблоныПриема.Количество() 
					- ШаблоныПриема.НайтиСтроки(Новый Структура("ШаблонПриема", Справочники.ШаблоныHTML.ПустаяСсылка())).Количество();
		
		ПовторяющиесяШаблоны = Новый ТаблицаЗначений;
		ПовторяющиесяШаблоны.Колонки.Добавить("ШаблонПриема");
		ПовторяющиесяШаблоны.Колонки.Добавить("Счетчик", Новый ОписаниеТипов("Число"));
		ПронумерованныеПовторяющиесяШаблоны = Новый Массив;
		
		Для Каждого ШаблонПриема Из МассивШаблоновПриема Цикл
			Если ЗначениеЗаполнено(ШаблонПриема) 
				И ШаблоныПриема.НайтиСтроки(Новый Структура("ШаблонПриема", ШаблонПриема)).Количество() >= 2
				И ПовторяющиесяШаблоны.Найти(ШаблонПриема) = Неопределено
			Тогда
				ПовторяющиесяШаблоны.Добавить().ШаблонПриема = ШаблонПриема;
			КонецЕсли;
		КонецЦикла;
		
		// Очистка шаблонов заполнения для полного перезаполнения в нужном порядке.
		Для Каждого СтрокаШаблонаЗаполнения Из ШаблоныЗаполненияОсмотра Цикл
			Элементы.Удалить(Элементы.Найти(СтрокаШаблонаЗаполнения.ИмяКоманды));
			Команды.Удалить(Команды.Найти(СтрокаШаблонаЗаполнения.ИмяКоманды));
		КонецЦикла;
		ШаблоныЗаполненияОсмотра.Очистить();
		
		// Добавление шаблонов заполнения шаблонов приема - построчно.
		Отбор = Новый Структура("ИдентификаторСтрокиШаблона, ШаблонЗаполнения");
		Для Каждого СтрокаШаблона Из ШаблоныПриема Цикл
			Отбор.ИдентификаторСтрокиШаблона = СтрокаШаблона.ПолучитьИдентификатор();
			Выб.Сбросить();
			Пока Выб.НайтиСледующий(Новый Структура("ШаблонПриема", СтрокаШаблона.ШаблонПриема)) Цикл
				Отбор.ШаблонЗаполнения = Выб.ШаблонЗаполнения;
				Если ШаблоныЗаполненияОсмотра.НайтиСтроки(Отбор).Количество() = 0 Тогда
					СтрокаШаблонаЗаполнения = ШаблоныЗаполненияОсмотра.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаШаблонаЗаполнения, Отбор);
					СтрокаШаблонаЗаполнения.ИмяКоманды = СгенерироватьУникальноеИмя("Команда_");
					
					Если КолШаблонов = 1 Тогда
						ЗаголовокКнопки = Выб.Представление;
					Иначе
						СтрокаПовторяющиесяШаблоны = ПовторяющиесяШаблоны.Найти(СтрокаШаблона.ШаблонПриема);
						Если СтрокаПовторяющиесяШаблоны = Неопределено Тогда
							ИндексПовтора = "";
						Иначе
							Если ПронумерованныеПовторяющиесяШаблоны.Найти(Отбор.ИдентификаторСтрокиШаблона) = Неопределено Тогда
								ПронумерованныеПовторяющиесяШаблоны.Добавить(Отбор.ИдентификаторСтрокиШаблона);
								СтрокаПовторяющиесяШаблоны.Счетчик = СтрокаПовторяющиесяШаблоны.Счетчик + 1;
							КонецЕсли;
							ИндексПовтора = " (" + СтрокаПовторяющиесяШаблоны.Счетчик + ")";
						КонецЕсли;
						ЗаголовокКнопки = Выб.ШаблонПриемаПредставление + ИндексПовтора + " [" + Выб.Представление + "]";
					КонецЕсли;
					СоздатьКнопкуШаблонаЗаполненияОсмотра(СтрокаШаблонаЗаполнения.ИмяКоманды, ЗаголовокКнопки);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

	// Сортировка кнопок заполнения. 
	ТаблицаСортировки = Новый ТаблицаЗначений;
	ТаблицаСортировки.Колонки.Добавить("НомерСтрокиШаблонаПриема");
	ТаблицаСортировки.Колонки.Добавить("ШаблонЗаполненияПредставление");
	ТаблицаСортировки.Колонки.Добавить("ИмяКоманды");
	
	Для Каждого СтрокаШаблонаЗаполнения Из ШаблоныЗаполненияОсмотра Цикл
		СтрокаСортировки = ТаблицаСортировки.Добавить();
		СтрокаШаблона = ШаблоныПриема.НайтиПоИдентификатору(СтрокаШаблонаЗаполнения.ИдентификаторСтрокиШаблона);
		СтрокаСортировки.НомерСтрокиШаблонаПриема = СтрокаШаблона.НомерСтроки;
		СтрокаСортировки.ШаблонЗаполненияПредставление = Строка(СтрокаШаблонаЗаполнения.ШаблонЗаполнения);
		СтрокаСортировки.ИмяКоманды = СтрокаШаблонаЗаполнения.ИмяКоманды;
	КонецЦикла;
	
	ТаблицаСортировки.Сортировать("НомерСтрокиШаблонаПриема, ШаблонЗаполненияПредставление");
	ГруппаКнопок = Элементы.ГруппаШаблоныЗаполнения;	
	Для Каждого СтрокаСортировки Из ТаблицаСортировки Цикл
		Элементы.Переместить(Элементы.Найти(СтрокаСортировки.ИмяКоманды), ГруппаКнопок);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКнопкуШаблонаЗаполненияОсмотра(ИмяКоманды, Заголовок)
	
	Команда = Команды.Добавить(ИмяКоманды);
	Команда.Действие = "КнопкаЗаполненияОсмотраПриНажатии";
	Команда.Заголовок = Заголовок;
	Команда.ИзменяетСохраняемыеДанные = Истина;
	
	КнопкаЗаполнения = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.ГруппаШаблоныЗаполнения);
	КнопкаЗаполнения.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗаполненияОсмотраПриНажатии(Команда)
	
	СтрокаШаблонаЗаполнения = ШаблоныЗаполненияОсмотра.НайтиСтроки(Новый Структура("ИмяКоманды", Команда.Имя))[0];

	ЗначенияДляПерезаполнения = ПолучитьЗначенияШаблонаЗаполненияОсмотра(СтрокаШаблонаЗаполнения.ШаблонЗаполнения);
	РаботаСШаблонамиHTMLКлиентСервер.ОбновитьЗначенияТаблицыПараметров(ТаблицаПараметров, ЗначенияДляПерезаполнения, СтрокаШаблонаЗаполнения.ИдентификаторСтрокиШаблона);
	ПреобразоватьОсмотрВВерсиюДляРедактирования(СтрокаШаблонаЗаполнения.ИдентификаторСтрокиШаблона, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначенияШаблонаЗаполненияОсмотра(ШаблонЗаполнения)
	
	ТаблицаЗначенийПараметров = Новый ТаблицаЗначений;
	ТаблицаЗначенийПараметров.Колонки.Добавить("Параметр", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ПараметрыHTML"));
	ТаблицаЗначенийПараметров.Колонки.Добавить("Значение");
	ТаблицаЗначенийПараметров.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	
	Для Каждого ЗначениеЗаполнения Из ШаблонЗаполнения.ЗначенияЗаполнения Цикл
		
		СтрокаПараметра = ТаблицаЗначенийПараметров.Добавить();
		
		СтрокаПараметра.Параметр = ЗначениеЗаполнения.Параметр;
		
		Если ТипЗнч(ЗначениеЗаполнения.Значение) = Тип("СправочникСсылка.СтрокиЭМКНеограниченнойДлины") Тогда
			СтрокаПараметра.Значение = ЗначениеЗаполнения.Значение.Значение;
		Иначе
			СтрокаПараметра.Значение = ЗначениеЗаполнения.Значение;
		КонецЕсли;
		СтрокаПараметра.Представление = Формат(СтрокаПараметра.Значение);
		
	КонецЦикла;
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗначенийПараметров);
	
КонецФункции

&НаКлиенте
Процедура ПеренестиЗначенияТекстовыхПолейОсмотраВТаблицуПараметров()
	
	Для Каждого СтрокаСтраницыШаблона Из СтраницыШаблоновПриема Цикл
		
		ПолеДокумента = Элементы.Найти(СтрокаСтраницыШаблона.ИмяПоляДокумента);
		Если ПолеДокумента = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		РаботаСШаблонамиHTMLКлиент.ПеренестиЗначениеАктивногоТекстовогоПоляОсмотраВТаблицуПараметров(
			ЭтаФорма, ПолеДокумента, СтрокаСтраницыШаблона.ИдентификаторСтрокиШаблона);
		
	КонецЦикла;
	
КонецПроцедуры

// Для обработчика ПослеЗаписиНаСервере
&НаСервереБезКонтекста
Процедура ДополнитьВыполнениеПланаЛеченияТекущимДокументом(СписокНазначений, ТекущийОбъект)

	НазначенияПланаЛечения = СписокНазначений.ПолучитьЭлементы();
	
	// Добавление выполненных этим документом
	Для Каждого Движение Из ТекущийОбъект.Движения.ВыполнениеПланаЛечения Цикл
		
		Для Каждого Назначение Из НазначенияПланаЛечения Цикл
			Если Назначение.ИдентификаторНазначения = Движение.ИдентификаторЭлемента
				И Назначение.ДокументВыполнения.НайтиПоЗначению(ТекущийОбъект.Ссылка) = Неопределено
			Тогда
				Назначение.ДокументВыполнения.Добавить(ТекущийОбъект.Ссылка);
				Назначение.Факт = Назначение.Факт + Движение.Количество;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Для обработчика ПослеЗаписиНаСервере
&НаСервереБезКонтекста
Процедура ЗаполнитьДанныеВыполненияПланаЛечения(СписокНазначений)
	
	ИдентификаторыПозицийПланаЛечения = Новый Массив;
	Для Каждого ЭлементВерхнегоУровня Из СписокНазначений.ПолучитьЭлементы() Цикл
		Для Каждого ЭлементПланаЛечения Из ЭлементВерхнегоУровня.ПолучитьЭлементы() Цикл
			ИдентификаторыПозицийПланаЛечения.Добавить(Новый УникальныйИдентификатор(ЭлементПланаЛечения.ИдентификаторНазначения));
		КонецЦикла;
	КонецЦикла;
	
	Если ИдентификаторыПозицийПланаЛечения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификтаторы", ИдентификаторыПозицийПланаЛечения);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВыполнениеПланаЛечения.ИдентификаторЭлемента,
	|	СУММА(ВЫБОР
	|			КОГДА ВыполнениеПланаЛечения.Количество = 0
	|				ТОГДА 1
	|			ИНАЧЕ ВыполнениеПланаЛечения.Количество
	|		КОНЕЦ) КАК Количество,
	|	ВыполнениеПланаЛечения.Регистратор
	|ИЗ
	|	РегистрСведений.ВыполнениеПланаЛечения КАК ВыполнениеПланаЛечения
	|ГДЕ
	|	ВыполнениеПланаЛечения.ИдентификаторЭлемента В(&Идентификтаторы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыполнениеПланаЛечения.ИдентификаторЭлемента,
	|	ВыполнениеПланаЛечения.Регистратор";
	ТаблицаВыполнения = Запрос.Выполнить().Выгрузить();
	
	Отбор = Новый Структура("ИдентификаторЭлемента");
	Для Каждого ЭлементВерхнегоУровня Из СписокНазначений.ПолучитьЭлементы() Цикл
		Для Каждого ЭлементПланаЛечения Из ЭлементВерхнегоУровня.ПолучитьЭлементы() Цикл
			
			Отбор.ИдентификаторЭлемента = Новый УникальныйИдентификатор(ЭлементПланаЛечения.ИдентификаторНазначения);
			
			КоличествоВыполнено = 0;
			
			СписокРегистраторов = Новый СписокЗначений;
			СтрокиТаблицыВыполнения = ТаблицаВыполнения.НайтиСтроки(Отбор);
			Для Каждого СтрокаВыполнения Из СтрокиТаблицыВыполнения Цикл
				
				СписокРегистраторов.Добавить(СтрокаВыполнения.Регистратор);
				КоличествоВыполнено = КоличествоВыполнено + СтрокаВыполнения.Количество;
				
			КонецЦикла;
			
			ЭлементПланаЛечения.Факт = КоличествоВыполнено;
			ЭлементПланаЛечения.ДокументВыполнения = СписокРегистраторов;
			
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСтандартамЛечения(ПоДиагнозам = Неопределено)
	
	Если ПоДиагнозам = Неопределено Тогда
		ПоДиагнозам = НеобходимоОбновитьСтандартыЛечения;
	КонецЕсли;
	
	мсДиагнозы = Новый Массив;
	мсРодителиДиагнозов = Новый Массив;
	Если ПоДиагнозам Тогда
		// Фомируем список диагнозов и их родителей.
		ЗаполнитьМассивыДиагнозовРодителей(Объект.Диагнозы, мсДиагнозы, мсРодителиДиагнозов);
		Элементы.СтандартыЛечения.Отображение = ОтображениеТаблицы.Список;
	Иначе
		Элементы.СтандартыЛечения.Отображение = ОтображениеТаблицы.ИерархическийСписок;
	КонецЕсли;
	
	СтандартыЛечения.Параметры.УстановитьЗначениеПараметра("ОтборПоДиагнозам", ПоДиагнозам);
	СтандартыЛечения.Параметры.УстановитьЗначениеПараметра("Диагнозы", мсДиагнозы);
	СтандартыЛечения.Параметры.УстановитьЗначениеПараметра("РодителиДиагнозов", мсРодителиДиагнозов);
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьМассивыДиагнозовРодителей(Знач ТаблицаДиагнозов, мсДиагнозы, мсРодителиДиагнозов)
	
	Для Каждого СтрокаДиагноз Из ТаблицаДиагнозов Цикл
		мсДиагнозы.Добавить(СтрокаДиагноз.Диагноз);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(мсРодителиДиагнозов, ОбщегоНазначения.ПолучитьСписокРодителейЭлемента(СтрокаДиагноз.Диагноз));
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПервичныйПриемДокумента(ОбъектФормы)
	
	ПервичныйПрием = ОбъектФормы.Ссылка;
	Если Не ОбъектФормы.ЭтоПервичный И ЗначениеЗаполнено(ОбъектФормы.ПервичныйПрием) Тогда
		ПервичныйПрием = ОбъектФормы.ПервичныйПрием;
	КонецЕсли;
	
	Возврат ПервичныйПрием;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьИспользуемыеСтандартыЛечения(ИспользуемыеСтандартыЛечения, Знач ПервичныйПрием)
	
	Если ЗначениеЗаполнено(ПервичныйПрием) Тогда
		КопироватьДанныеФормы(ПолучитьИспользуемыеСтандартыЛечения(ИспользуемыеСтандартыЛечения, ПервичныйПрием), ИспользуемыеСтандартыЛечения);
	Иначе
		ИспользуемыеСтандартыЛечения.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИспользуемыеСтандартыЛечения(Знач ИспользуемыеСтандартыЛечения, Знач ПервичныйПрием)
	
	СтандартыЛеченияНЗ = РегистрыСведений.СтандартыЛечения.СоздатьНаборЗаписей();
	СтандартыЛеченияНЗ.Отбор.ПервичныйПрием.Установить(ПервичныйПрием);
	СтандартыЛеченияНЗ.Прочитать();
	
	ИспользуемыеСтандартыЛечения.Загрузить(СтандартыЛеченияНЗ.Выгрузить());
	
	Возврат ИспользуемыеСтандартыЛечения;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПланЛеченияИзСтандартаЛечения(СтандартыЛечения)
	
	РеквизитыСтандартов = ЗаполнитьПланЛеченияИзСтандартаЛечения_РеквизитыСтандартовЛечения(СтандартыЛечения);
	
	Для Каждого РеквизитыСтандарта Из РеквизитыСтандартов Цикл
		
		Если РеквизитыСтандарта.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		// Если это регламентированный стандарт лечения, то не выполняем заполнение.
		Если РеквизитыСтандарта.ВидСтандарта Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаНазначение Из РеквизитыСтандарта.Назначения Цикл
			
			Дата = НачалоДня(Объект.Дата) + (СтрокаНазначение.СмещениеОтДатыПриема * 86400);
			Сотрудник = ?(СтрокаНазначение.ПодставитьВрачаИзПриема, Объект.Врач, СтрокаНазначение.Сотрудник);
			
			Если стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты.Количество() > 0 Тогда 
				Для Каждого ВыделенныйЗуб Из стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты Цикл
					СегментВЗубе = Неопределено;
					Если ВыделенныйЗуб.Сегменты.Количество() = 1 Тогда
						СегментВЗубе = ВыделенныйЗуб.Сегменты[0];
					КонецЕсли;
					
					Если НайтиНазначенияВПлане(СписокНазначений, СтрокаНазначение.Назначение, Неопределено, ВыделенныйЗуб.ЗубВКарте).Количество() = 0 Тогда
						ДобавитьНазначение(ЭтаФорма, СтрокаНазначение.Назначение, Строка(ВыделенныйЗуб.ЗубВКарте.УникальныйИдентификатор()), 
							ВыделенныйЗуб.ЗубВКарте, СегментВЗубе, СтрокаНазначение.Количество, Дата, Сотрудник, СтрокаНазначение.Комментарий);//, СтрокаНазначение.ВидНазначения);
					КонецЕсли;
				КонецЦикла;
			Иначе
			    ТекСтрокаПланаЛечения = Элементы.Назначения.ТекущаяСтрока;
				Если ТекСтрокаПланаЛечения = Неопределено Тогда 
					ТекСтрокаПланаЛечения = ДобавитьЗубВПланЛечения(ЭтаФорма);
				КонецЕсли;
				
				ТекДанные = СписокНазначений.НайтиПоИдентификатору(ТекСтрокаПланаЛечения);
				
				Если ТипЗнч(ТекДанные.Назначение) = Тип("СправочникСсылка.стомЗубыКарты") Тогда
					// Это зуб
					ЗубВКарте = ТекДанные.ЗубВКарте;
					ИдентификаторГруппы = ТекДанные.ИдентификаторНазначения;
				ИначеЕсли ТипЗнч(ТекДанные.Назначение) = Тип("СправочникСсылка.Номенклатура") Тогда
					// Это сегмент зуба, смотрим его зуб-родитель.
					ГруппаНазначения = ТекДанные.ПолучитьРодителя();
					ЗубВКарте = ГруппаНазначения.ЗубВКарте;
					ИдентификаторГруппы = ГруппаНазначения.ИдентификаторНазначения;
				Иначе
					// Это конструкция
					ЗубВКарте = ПредопределенноеЗначение("Справочник.стомЗубыКарты.ПустаяСсылка");
					ИдентификаторГруппы = ТекДанные.ИдентификаторНазначения;
				КонецЕсли;
				
				Если НайтиНазначенияВПлане(СписокНазначений, СтрокаНазначение.Назначение, Неопределено, ЗубВКарте).Количество() = 0 Тогда 
					ДобавитьНазначение(ЭтаФорма, СтрокаНазначение.Назначение, ИдентификаторГруппы, ЗубВКарте, Неопределено, СтрокаНазначение.Количество, Дата, Сотрудник, СтрокаНазначение.Комментарий); //, СтрокаНазначение.ВидНазначения);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьПланЛеченияИзСтандартаЛечения_РеквизитыСтандартовЛечения(СтандартыЛечения)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка, ЭтоГруппа, ВидСтандарта, Назначения КАК НазначенияТаб ИЗ Справочник.СтандартыЛечения ГДЕ Ссылка В (&СтандартыЛечения)");
	Запрос.УстановитьПараметр("СтандартыЛечения", СтандартыЛечения);
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	ТаблицаРезультат.Колонки.Добавить("Назначения", Новый ОписаниеТипов("Массив"));
	Для Каждого СтрокаСтандарт Из ТаблицаРезультат Цикл
		СтрокаСтандарт.Назначения = ОбщегоНазначенияКлиентСервер.ТаблицуЗначенийВМассивСтруктур(СтрокаСтандарт.НазначенияТаб);
	КонецЦикла;
	ТаблицаРезультат.Колонки.Удалить("НазначенияТаб");
	
	Возврат ОбщегоНазначенияКлиентСервер.ТаблицуЗначенийВМассивСтруктур(ТаблицаРезультат);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НайтиНазначенияВПлане(ПланЛеченияНаФорме, Назначение, ВидНазначения = Неопределено, АнатомическаяОбласть)
	
	НайденныеНазначения = Новый Массив;
	
	Для Каждого СтрокаЗубПлана Из ПланЛеченияНаФорме.ПолучитьЭлементы() Цикл
		Если СтрокаЗубПлана.Назначение = АнатомическаяОбласть Тогда // ЗубВКарте
			Для Каждого СтрокаПлана Из СтрокаЗубПлана.ПолучитьЭлементы() Цикл
				Если СтрокаПлана.Назначение = Назначение
					И (ВидНазначения = Неопределено Или СтрокаПлана.ВидНазначения = ВидНазначения)
				Тогда
					НайденныеНазначения.Добавить(СтрокаПлана);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НайденныеНазначения;
	
КонецФункции

&НаКлиенте
Процедура СтандартыЛеченияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ИзмененияЗапрещены Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	ТекущиеДанные = Элементы.СтандартыЛечения.ТекущиеДанные;
	
	Если ТекущиеДанные.ЭтоГруппа Тогда
		Если Элементы.СтандартыЛечения.ТекущийРодитель = Неопределено Тогда
			Элементы.СтандартыЛечения.ТекущийРодитель = Элементы.СтандартыЛечения.ТекущаяСтрока;
		Иначе
			Элементы.СтандартыЛечения.ТекущийРодитель = Неопределено;
		КонецЕсли;
	Иначе
		// Добавляем стандарт в список используемых планом лечения
		Если ИспользуемыеСтандартыЛечения.НайтиСтроки(Новый Структура("СтандартЛечения", ТекущиеДанные.СтандартЛечения)).Количество() = 0 Тогда
			НоваяСтрока = ИспользуемыеСтандартыЛечения.Добавить();
			НоваяСтрока.СтандартЛечения = ТекущиеДанные.СтандартЛечения;
		КонецЕсли;
			
		#Область Стоматология
		// Запоминаю текущие группы(зубы) плана лечениЯ, чтобы потом развернуть добавленные.
		ТекущиеГруппыПланаЛечения = Новый Массив;
		Для Каждого СтрокаПлана Из СписокНазначений.ПолучитьЭлементы() Цикл
			ТекущиеГруппыПланаЛечения.Добавить(СтрокаПлана);
		КонецЦикла;
		
		СтандартыЛеченияВыбранные = Новый Массив;
		СтандартыЛеченияВыбранные.Добавить(Элементы.СтандартыЛечения.ТекущиеДанные.СтандартЛечения);
		ЗаполнитьПланЛеченияИзСтандартаЛечения(СтандартыЛеченияВыбранные);
		ПересчитатьСуммыПланаЛечения(ЭтаФорма);
		
		// Разворачиваю узлы новых групп
		Для Каждого СтрокаПлана Из СписокНазначений.ПолучитьЭлементы() Цикл
			Если ТекущиеГруппыПланаЛечения.Найти(СтрокаПлана) = Неопределено Тогда
				Элементы.Назначения.Развернуть(СтрокаПлана.ПолучитьИдентификатор());
			КонецЕсли;
		КонецЦикла;
		#КонецОбласти
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтандартыЛеченияПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтандартыЛеченияПросмотрСтандарта.Доступность = ТекДанные.ЕстьДокумент;
	
КонецПроцедуры

&НаКлиенте
Процедура СтандартыЛеченияПоДиагнозам(Команда)
	
	Элементы.СтандартыЛеченияПоДиагнозам.Пометка = Не Элементы.СтандартыЛеченияПоДиагнозам.Пометка;
	УстановитьОтборСтандартамЛечения(Элементы.СтандартыЛеченияПоДиагнозам.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрСтандарта(Команда)
	
	ТекДанные = Элементы.СтандартыЛечения.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Документ = ПолучитьДокументСтандартаЛечения(ТекДанные.СтандартЛечения);
	Если Документ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
	ИмяФайлаДокумента = ПолучитьИмяВременногоФайла(Документ.Расширение);
	Документ.ДанныеДокумента.Записать(ИмяФайлаДокумента);
	ЗапуститьПриложение(ИмяФайлаДокумента);
	#КонецЕсли
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДокументСтандартаЛечения(СтандартЛечения)
	
	ДанныеДокумента = СтандартЛечения.ФайлДокумента.Получить();
	Если ДанныеДокумента = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Новый Структура("ДанныеДокумента, Расширение", ДанныеДокумента, СтандартЛечения.РасширениеФайлаДокумента);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьСтандартЛечения(Команда)
	
	Если Команда.Имя = "ОткрытьСтандартЛечения" Тогда
		СтандартыЛеченияСписок = Элементы.СтандартыЛечения;
	Иначе
		СтандартыЛеченияСписок = Элементы.ИспользуемыеСтандартыЛечения;
	КонецЕсли;
	
	ТекДанные = СтандартыЛеченияСписок.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначение(ТекДанные.СтандартЛечения);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоНормам(Команда)
	
	Если Объект.Материалы.Количество() <> 0 Тогда
		// Вопрос об очистке.
		ОповещениеОтвета = Новый ОписаниеОповещения("ЗаполнитьПоНормамПодтверждение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Перед заполнением табличная часть будет очищена. Заполнить?'");
		ПоказатьВопрос(ОповещениеОтвета,ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	Иначе
		ЗаполнитьМатериалыПоНормамРабот();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоНормамПодтверждение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьМатериалыПоНормамРабот();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоНормамРабот()
	
	Материалы = ЗаполнитьМатериалыПоНормамРаботСервер(Объект);
	Объект.Материалы.Очистить();
	Для Каждого СтрокаМатериал Из Материалы Цикл
		ЗаполнитьЗначенияСвойств(Объект.Материалы.Добавить(), СтрокаМатериал);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьМатериалыПоНормамРаботСервер(Знач Объект)
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.Прием"));
	ДокументОбъект.ЗаполнитьМатериалыПоНормамРабот();
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ДокументОбъект.Материалы.Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокРаботДокумента()
	
	мСписокРаботДокумента = Новый СписокЗначений;
	
	Для Каждого СтрокаРаботы Из Объект.Работы Цикл
		
		мСписокРаботДокумента.Добавить(СтрокаРаботы.КлючСтроки, Строка(СтрокаРаботы.Номенклатура) + " " +Строка(СтрокаРаботы.ХарактеристикаНоменклатуры));
		
	КонецЦикла;
	#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда	
		Элементы.МатериалыРабота.СписокВыбора.ДоступныеЗначения = мСписокРаботДокумента;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьРежимРедактированияТабличногоПоляМатериалов(Элементы, мУчетнаяПолитика, Объект, мАвтоматическиЗаполнятьМатериалы = Неопределено, ПриОткрытии = Ложь)
	
	Если мУчетнаяПолитика.ВестиУчетРасходаМатериаловНаУслуги Тогда
		
		Если ПриОткрытии И Объект.Ссылка.Пустая() Тогда
			Объект.РучнаяКорректировкаМатериалов = Объект.РучнаяКорректировкаМатериалов Или Не мУчетнаяПолитика.АвтоматическиЗаполнятьНормыРасходаМатериаловПриема;
		КонецЕсли;
		
		мАвтоматическиЗаполнятьМатериалы = мУчетнаяПолитика.АвтоматическиЗаполнятьНормыРасходаМатериаловПриема И Не Объект.РучнаяКорректировкаМатериалов;

		Элементы.Материалы.ИзменятьСоставСтрок			= Не мАвтоматическиЗаполнятьМатериалы; // Для 8.3.23+ приводит к смене основной команды формы.
		Элементы.Материалы.КоманднаяПанель.Доступность	= Не мАвтоматическиЗаполнятьМатериалы;
		Элементы.Материалы.КонтекстноеМеню.Доступность	= Не мАвтоматическиЗаполнятьМатериалы;
		Элементы.МатериалыПодбор.Доступность			= Не мАвтоматическиЗаполнятьМатериалы;
		Элементы.МатериалыНоменклатура.Доступность		= Не мАвтоматическиЗаполнятьМатериалы;
		Элементы.МатериалыРабота.Доступность			= Не мАвтоматическиЗаполнятьМатериалы;
		Элементы.МатериалыКоличество.Доступность		= Не мАвтоматическиЗаполнятьМатериалы;
		Элементы.МатериалыЕдиницаИзмерения.Доступность	= Не мАвтоматическиЗаполнятьМатериалы;
		Элементы.МатериалыВходитВСтоимость.Доступность	= Не мАвтоматическиЗаполнятьМатериалы;
		
		Если мУчетнаяПолитика.АвтоматическиЗаполнятьНормыРасходаМатериаловПриема Тогда
			Элементы.РучнаяКорректировкаМатериалов.ТолькоПросмотр = Объект.РучнаяКорректировкаМатериалов; // Запрет на снятие взведенного ручного редактирования.
		Иначе
			Элементы.РучнаяКорректировкаМатериалов.Видимость = Ложь;
		КонецЕсли;
	Иначе
		мАвтоматическиЗаполнятьМатериалы = Ложь;
		Элементы.Материалы.Видимость = Объект.Материалы.Количество() <> 0; // Т.е. видима только если не пустая.
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьМатериалыУдаленныхРабот()
	
	МахОбрИнд = Объект.Материалы.Количество()-1;
	Для сч = 0 по МахОбрИнд Цикл
		СтрокаМатериалов = Объект.Материалы[МахОбрИнд-сч];
		Если ЗначениеЗаполнено(СтрокаМатериалов.Работа) Тогда
			флУдалять = Истина;
			Для Каждого ЭлементСписка из мСписокРаботДокумента Цикл
				Если ЭлементСписка.Значение = СтрокаМатериалов.КлючСтроки Тогда
					флУдалять = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если флУдалять Тогда
				Объект.Материалы.Удалить(СтрокаМатериалов);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыРаботаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбранныйЭлемент = ВыбратьИзСписка(мСписокРаботДокумента);
	Если ВыбранныйЭлемент <> Неопределено Тогда
		ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
		ТекущаяСтрока.КлючСтроки = ВыбранныйЭлемент.Значение;
		Для Каждого СтрокаРаботы Из Объект.Работы Цикл 
			Если СтрокаРаботы.КлючСтроки = ТекущаяСтрока.КлючСтроки Тогда
				ТекущаяСтрока.Работа = СтрокаРаботы.Номенклатура;
				Модифицированность = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыРаботаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		МатериалыРаботаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыРаботаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ВыбранноеЗначение <> Неопределено Тогда
		ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
		ТекущаяСтрока.КлючСтроки = ВыбранноеЗначение;
		Для Каждого СтрокаРаботы Из Объект.Работы Цикл 
			Если СтрокаРаботы.КлючСтроки = ТекущаяСтрока.КлючСтроки Тогда
				ТекущаяСтрока.Работа = СтрокаРаботы.Номенклатура;
				Модифицированность = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоFEFOМатериалы(Команда)

	РаботаСДокументамиКлиент.ЗаполнитьПоFEFOКлиент(ЭтаФорма, "Материалы");

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоFEFOМатериалыТекущаяСтрока(Команда)
	
	ТоварыТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
	Если ТоварыТекущиеДанные <> Неопределено Тогда 
		НомерСтроки = ТоварыТекущиеДанные.НомерСтроки;
		РаботаСДокументамиКлиент.ЗаполнитьПоFEFOКлиент(ЭтаФорма, "Материалы", НомерСтроки);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельРаботыКнопкаПодбор(Кнопка)
	
	ПодборПометка = РаботаСФормамиКлиент.КнопкаПодборПриНажатии(ЭтаФорма, "Работы", "Услуга", "Набор");
	Элементы.МатериалыПодбор.Пометка = ПодборПометка;
	Если ПодборПометка Тогда
		ПодключитьОбработчикОжидания("ОбновитьСписокПодбора", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыборПодбор(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Ложь Тогда ЗапрашиватьКоличество = Ложь; ЗапрашиватьЦену = Ложь; ЗапрашиватьХарактеристику = Ложь; ЗапрашиватьСерию = Ложь; КонецЕсли;
	СтандартнаяОбработка = Ложь;
	
	Если НЕ ДопСерверныеФункции.ПолучитьРеквизит(ВыбранноеЗначение, "ЭтоГруппа") Тогда 
		
		Если Элементы.СтраницыРаботы.ТекущаяСтраница = Элементы.ГруппаРаботы Тогда
			Действие = "ПодборРаботы";
		ИначеЕсли Элементы.СтраницыРаботы.ТекущаяСтраница = Элементы.ГруппаМатериалы Тогда
			Действие = "ПодборМатериала";
		Иначе
			Возврат;
		КонецЕсли;
		
		Результат = РаботаСФормамиКлиент.ВыборПодборОбработка(ВыбранноеЗначение, ЗапрашиватьКоличество, ЗапрашиватьЦену, ЗапрашиватьХарактеристику, ЗапрашиватьСерию, Действие, ЭтаФорма);
		
		Если Результат <> Неопределено Тогда
			ОбработкаВыбора(Результат, Неопределено);
			Модифицированность = Истина;
		КонецЕсли	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПрейскурантПодборПриИзменении(Элемент)
	РаботаСФормамиКлиент.УстановитьПараметрПрейскурантПодбора(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПодбора()
	РаботаСФормамиКлиент.ОбновитьДинамическийСписокПринудительно(ЭтаФорма.РеквизитСписокПодбор);
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельМатериалыКнопкаПодбор(Кнопка)
		
	ПодборПометка = РаботаСФормамиКлиент.КнопкаПодборПриНажатии(ЭтаФорма, "Материалы", "Материал");
	Элементы.РаботыПодбор.Пометка = ПодборПометка;	
	Если ПодборПометка Тогда
		ПодключитьОбработчикОжидания("ОбновитьСписокПодбора", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначенияНазначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ТекДанные = Элементы.Назначения.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоЗуб = (ТекДанные.ПолучитьРодителя() = Неопределено);
	
	Элементы.НазначенияНазначение.БыстрыйВыбор = ЭтоЗуб;
	Элементы.НазначенияНазначение.РежимВыбораИзСписка = ЭтоЗуб;
	Элементы.НазначенияНазначение.ИсторияВыбораПриВводе = ?(ЭтоЗуб,ИсторияВыбораПриВводе.НеИспользовать, ИсторияВыбораПриВводе.Авто);

КонецПроцедуры

&НаКлиенте
Процедура СтраницыРаботыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаМатериалы
		Или ТекущаяСтраница = Элементы.ГруппаРаботы
	Тогда
		Если Элементы.РаботыПодбор.Пометка
			Или Элементы.МатериалыПодбор.Пометка
		Тогда
			Если ТекущаяСтраница = Элементы.ГруппаМатериалы Тогда
				РаботаСФормамиКлиент.ОбновитьОтборПодбора(ЭтаФорма, "Материалы", "Материал");
			ИначеЕсли ТекущаяСтраница = Элементы.ГруппаРаботы Тогда
				РаботаСФормамиКлиент.ОбновитьОтборПодбора(ЭтаФорма, "Работы", "Услуга");
			КонецЕсли;
		КонецЕсли;
		
		ПодключитьОбработчикОжидания("ОбновитьСписокПодбора", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ИдентификаторСтрокиШаблонаПриема()
	
	ИмяСтраницы = Элементы.ГруппаСтраницыОсмотра.ТекущаяСтраница.Имя;
	
	СтрокиСтраниц = СтраницыШаблоновПриема.НайтиСтроки(Новый Структура("ИмяСтраницыФормы", ИмяСтраницы));
	Если СтрокиСтраниц.Количество() <> 0 Тогда
		Возврат СтрокиСтраниц[0].ИдентификаторСтрокиШаблона;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции	

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	ТекСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекСтрока.ЕдиницаИзмерения = ДопСерверныеФункции.ПолучитьРеквизит(ТекСтрока.Номенклатура, "ЕдиницаХраненияОстатков");
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйПриемПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.ПервичныйПрием) = Тип("ДокументСсылка.Прием") Тогда
		
		ПервичныйПриемЗаполнен = ЗначениеЗаполнено(Объект.ПервичныйПрием);
		Объект.ЭтоПервичный = Не ПервичныйПриемЗаполнен Или Объект.ПервичныйПрием = Объект.Ссылка;
		
		Если ПервичныйПриемЗаполнен Тогда
			Объект.МедицинскаяКарта = ДопСерверныеФункции.ПолучитьРеквизит(Объект.ПервичныйПрием, "МедицинскаяКарта");
		КонецЕсли;
		ПерезаполнитьПланЛеченияПоПервичномуПриемуСУчетомВведенных();
		
		УстановитьВидимостьФлагаЗакрыт();
		ВосстановитьФлажокЗакрытНаКлиенте(Закрыт, Объект.Закрыт, Объект.Ссылка, Объект.ПервичныйПрием);
		
		ОбновитьКоличествоРецептов();
		
		РежимЗаполненияДиагнозов = мУчетнаяПолитика.РежимЗаполненияДиагнозовПоПервичномуПриему;
		
		Если РежимЗаполненияДиагнозов <> 3 Тогда
			Если Объект.ПервичныйПрием <> ПредыдущийПрием Тогда
				Результат = "Перезаполнить";
				Если Объект.Диагнозы.Количество() > 1
					Или (Объект.Диагнозы.Количество() = 1 
						И (	ЗначениеЗаполнено(Объект.Диагнозы[0].Диагноз) 
							Или ЗначениеЗаполнено(Объект.Диагнозы[0].Детализация)))					
				Тогда
					Если РежимЗаполненияДиагнозов = 0 Тогда
						// Режим выбирается пользователем.
						СписокОтветов = Новый СписокЗначений;
						СписокОтветов.Добавить("Перезаполнить");
						СписокОтветов.Добавить("Дополнить");
						СписокОтветов.Добавить("Отмена");
						
						Результат = Вопрос("Первичный прием изменился. Изменить список диагнозов?", СписокОтветов, 30);
						Если ТипЗнч(Результат) <> Тип("Строка") Тогда
							Результат = "";
						КонецЕсли;
					ИначеЕсли РежимЗаполненияДиагнозов = 1 Тогда
						Результат = "Перезаполнить";
					ИначеЕсли РежимЗаполненияДиагнозов = 2 Тогда
						Результат = "Дополнить";
					ИначеЕсли РежимЗаполненияДиагнозов = 4 Тогда
						Результат = "";
					КонецЕсли;
				КонецЕсли;
				
				Если Результат = "Перезаполнить" Тогда
					ЗаполнитьДиагнозамиИзПриема(Объект.ПервичныйПрием, Истина, Истина, Объект);
				ИначеЕсли Результат = "Дополнить" Тогда
					ЗаполнитьДиагнозамиИзПриема(Объект.ПервичныйПрием, Истина, Ложь, Объект);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ПредыдущийПрием = Объект.ПервичныйПрием;
	
	ЗаполнитьИспользуемыеСтандартыЛечения(ИспользуемыеСтандартыЛечения, ПервичныйПриемДокумента(Объект));
	Объект.КомплексныйРасчет = КомплексныеРасчетыКлиентов.ПолучитьКомплексныеРасчетыПоПриему(Объект.Ссылка, Объект.ПервичныйПрием);
	ЗаполнитьЭтапыРаботСОтметкамиВыполнения();
	Элементы.ГруппаЭтапыРабот.Видимость = ЗначениеЗаполнено(Объект.КомплексныйРасчет);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАктуальныеДиагнозыПоПервичномуПриему(ПервичныйПрием)
	
	Перем ПриемСДиагнозами;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Прием.Ссылка КАК Ссылка,
	               |	Прием.Диагнозы.(
	               |		Ссылка КАК Ссылка
	               |	) КАК Диагнозы
	               |ИЗ
	               |	Документ.Прием КАК Прием
	               |ГДЕ
	               |	Прием.ПервичныйПрием = &СсылкаНаПервичныйПрием
	               |	И Прием.Проведен
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Прием.Дата УБЫВ";
	Запрос.УстановитьПараметр("СсылкаНаПервичныйПрием", ПервичныйПрием);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Строка Из РезультатЗапроса Цикл
		Если Строка.Диагнозы.Количество() > 0 Тогда
			ПриемСДиагнозами = Строка.Ссылка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ПриемСДиагнозами <> Неопределено Тогда
		Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ПриемСДиагнозами.Диагнозы.Выгрузить());
	КонецЕсли;
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДиагнозамиИзПриема(Прием, ЗаполнениеПоПервичномуПриему, ОчиститьТекущиеДиагнозы, Объект)
	
	Если ОчиститьТекущиеДиагнозы Тогда
		Объект.Диагнозы.Очистить();
	КонецЕсли;
	
	Если ЗаполнениеПоПервичномуПриему Тогда
		ДиагнозыПриема = ПолучитьАктуальныеДиагнозыПоПервичномуПриему(Прием);
	Иначе
		ДиагнозыПриема = ПолучитьДиагнозыПриема(Прием);
	КонецЕсли;
	
	Если ДиагнозыПриема <> Неопределено Тогда
		Для Каждого СтрокаДиагноза Из ДиагнозыПриема Цикл
			Если Объект.Диагнозы.НайтиСтроки(Новый Структура("Диагноз", СтрокаДиагноза.Диагноз)).Количество() = 0
				Или Объект.Диагнозы.НайтиСтроки(Новый Структура("ЗубВКарте,СегментВЗубе", СтрокаДиагноза.ЗубВКарте,СтрокаДиагноза.СегментВЗубе)).Количество() = 0
			Тогда
				НоваяСтрока = Объект.Диагнозы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаДиагноза,,"Сопутствующий");
			КонецЕсли; 
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзДругогоПриема(Команда)
	
	ОткрытьФорму("Документ.Прием.Форма.ВыборПриемаДляПерезаполненияДиагнозов", Новый Структура ("Клиент, СсылкаНаТекущийПрием, СсылкаНаПервичныйПрием", Объект.Клиент, Объект.Ссылка, Объект.ПервичныйПрием),,,,, Новый ОписаниеОповещения("ЗаполнитьДиагнозыИзДругогоПриемаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДиагнозыИзДругогоПриемаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЗаполнитьДиагнозамиИзПриема(Результат.Прием, Ложь, Результат.УдалятьСтарые, Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДиагнозыПриема(Прием)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриемДиагнозы.Диагноз КАК Диагноз,
	|	ПриемДиагнозы.Детализация КАК Детализация,
	|	ПриемДиагнозы.Классификация1 КАК Классификация1,
	|	ПриемДиагнозы.Классификация2 КАК Классификация2,
	|	ПриемДиагнозы.Классификация3 КАК Классификация3,
	|	ПриемДиагнозы.Сопутствующий КАК Сопутствующий,
	|	ПриемДиагнозы.Травма КАК Травма
	|ИЗ
	|	Документ.Прием.Диагнозы КАК ПриемДиагнозы
	|ГДЕ
	|	ПриемДиагнозы.Ссылка = &СсылкаНаПрием";
	Запрос.УстановитьПараметр("СсылкаНаПрием", Прием);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
КонецФункции

&НаСервереБезКонтекста
Функция ВычислитьВидимостьКолонкиНомераПробы(Знач ДанныеФормыРаботы)
	
	Видимость = Ложь;
	
	Если ДанныеФормыРаботы.Количество() <> 0 Тогда

		НоменклатураРабот = Новый Массив;
		Для Каждого СтрокаРабот Из ДанныеФормыРаботы Цикл
			НоменклатураРабот.Добавить(СтрокаРабот.Номенклатура);
		КонецЦикла;

		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", НоменклатураРабот);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕстьNULL(МАКСИМУМ(Номенклатура.Анализ), ЛОЖЬ) КАК Анализ
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&Ссылка)"
		;
    	Видимость = Запрос.Выполнить().Выгрузить()[0][0];
			
	КонецЕсли;
	
	Возврат Видимость;

КонецФункции

&НаКлиенте
Процедура ВрачПриИзменении(Элемент)

	Если ЗначениеЗаполнено(Объект.Врач)
		И КоличествоЗаполненныхШаблоновПриема(Объект.ШаблоныПриема) = 0 
	Тогда
		ДанныеШаблона = ПолучитьДанныеОсновногоШаблонаОсмотраСотрудника(Объект.Врач, Объект.Дата, ИспользуетсяВерсионирование, , Объект.Специализация);
		Если ДанныеШаблона <> Неопределено Тогда
			Если Объект.ШаблоныПриема.Количество() = 0 Тогда
				СтрокаШаблона = Объект.ШаблоныПриема.Добавить();
			Иначе
				СтрокаШаблона = Объект.ШаблоныПриема[0];
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(СтрокаШаблона, ДанныеШаблона);
			ВерсияШаблона = ПолучитьВерсиюШаблона(СтрокаШаблона.ШаблонПриема); // Неявно добавляем строку в таблицу "ВерсииШаблонов".
			
			ПерезаполнитьТаблицуСтраницШаблоновПриема();
			УстановитьДоступностьКомандОсмотраПоТекущейСтраницеОсмотра();
			
			ШаблонОсмотра = СтрокаШаблона.ШаблонПриема;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Врач)
		И Не ЗначениеЗаполнено(Объект.СкладМатериалов)
	Тогда
		Объект.СкладМатериалов = УправлениеНастройками.ПолучитьЗначениеСотрудникаПоУмолчанию(Объект.Врач, "ОсновнойСкладМатериалов", Объект[ПроцедурыСпециализацииПоставки.ИмяРеквизитаФилиалДокументов()]);
	КонецЕсли;
	
	РаботаСШаблонамиHTMLКлиент.ПересчетПараметровОтЗависимыхРеквизитов("Врач", ЭтаФорма, Объект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОсновногоШаблонаОсмотраСотрудника(Врач, Дата = Неопределено, ИспользуетсяВерсионирование = Ложь, ЭтоМедосмотр = Ложь, Специализация = Неопределено)
	
	Если ЗначениеЗаполнено(Специализация) Тогда
		ОсновнойШаблонВрача = МедицинскаяДеятельность.ПолучитьОсновнойШаблонОсмотраСпециализации(Специализация, ЭтоМедосмотр);
	Иначе
		ОсновнойШаблонВрача = МедицинскаяДеятельность.ПолучитьОсновнойШаблонОсмотраСотрудника(Врач, ЭтоМедосмотр);
	КонецЕсли;
	
	Если ИспользуетсяВерсионирование Тогда
		ВерсияШаблона = ВерсионированиеШаблонов.ПолучитьВерсиюШаблона(ОсновнойШаблонВрача, Дата);
	Иначе
		ВерсияШаблона = ОсновнойШаблонВрача;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВерсияШаблона) Тогда
		
		Возврат Новый Структура("ШаблонПриема, ВерсияШаблона, ВидШаблона, ТекстШаблона", 
								 ОсновнойШаблонВрача,
								 ВерсияШаблона,
								 ВерсияШаблона.ВидШаблона,
								 ВерсияШаблона.ТекстHTML);
		
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КоличествоЗаполненныхШаблоновПриема(Знач ШаблоныПриема)
	
	Возврат ШаблоныПриема.Количество()
		  - ШаблоныПриема.НайтиСтроки(Новый Структура("ШаблонПриема", ПредопределенноеЗначение("Справочник.ШаблоныHTML.ПустаяСсылка"))).Количество();
	
КонецФункции

&НаКлиенте
Процедура ЗакрытПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.ПервичныйПрием) = Тип("ДокументСсылка.Прием")
		И ЗначениеЗаполнено(Объект.ПервичныйПрием)
		И Объект.Ссылка <> Объект.ПервичныйПрием
	Тогда
		УстановитьПризнакЗакрытПервичномуПриему(Объект.ПервичныйПрием, Закрыт);
	КонецЕсли;
	Объект.Закрыт = Закрыт;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВосстановитьФлажокЗакрытНаКлиенте(Закрыт, ОбъектЗакрыт, ОбъектСсылка, ПервичныйПрием)
	Если ТипЗнч(ПервичныйПрием) = Тип("ДокументСсылка.Прием") Тогда
		Если ЗначениеЗаполнено(ПервичныйПрием) Тогда
			Если ПервичныйПрием = ОбъектСсылка Тогда
				Закрыт = ОбъектЗакрыт;
			Иначе
				ПервичныйПриемЗакрыт = ДопСерверныеФункции.ПолучитьРеквизит(ПервичныйПрием, "Закрыт");
				Закрыт = ПервичныйПриемЗакрыт;
				ОбъектЗакрыт = ПервичныйПриемЗакрыт;
			КонецЕсли;
		Иначе
			Закрыт = ОбъектЗакрыт;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДокументСтроки(Команда)
	Если Элементы.Назначения.ТекущиеДанные <> Неопределено Тогда
		ОткрытьЗначение(Элементы.Назначения.ТекущиеДанные.ДокументРегистратор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьДоступностьЭлементов()
	
	КлиентЗаполнен = ЗначениеЗаполнено(Объект.Клиент);
	Элементы.МедицинскаяКарта.Доступность		= КлиентЗаполнен;
	Элементы.ПервичныйПрием.Доступность			= КлиентЗаполнен;
	Элементы.СтраницаДиагнозы.Доступность		= КлиентЗаполнен;
	Элементы.СтраницаПланЛечения.Доступность	= КлиентЗаполнен;
	Элементы.СтраницаУслуги.Доступность			= КлиентЗаполнен;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработку(Команда)
	
	СтруктураПараметров = Неопределено;
	
	ИдентификаторСтрокиШаблона = ИдентификаторСтрокиШаблонаПриема();
	Если ИдентификаторСтрокиШаблона <> Неопределено Тогда
		
		СтрокаШаблона = Объект.ШаблоныПриема.НайтиПоИдентификатору(ИдентификаторСтрокиШаблона);
		ВерсияШаблона = ПолучитьВерсиюШаблона(СтрокаШаблона.ШаблонПриема);
		ДанныеШаблонаОбработки = ПолучитьДанныеШаблонаОсмотраОбработки(ВерсияШаблона);
	
		Если ДанныеШаблонаОбработки <> Неопределено Тогда
			Если ДанныеШаблонаОбработки.Свойство("ИмяВстроеннойОбработки") Тогда
				Результат = ОткрытьОбработкуШаблона(ДанныеШаблонаОбработки.СтруктураПараметров, СтрокаШаблона.ПолучитьИдентификатор(), , , ДанныеШаблонаОбработки.ИмяВстроеннойОбработки);
			Иначе
				#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда 
					ИмяФайла = ПолучитьИмяВременногоФайла(".epf");
					ДанныеШаблонаОбработки.ДвоичныеДанные.Записать(ИмяФайла);
					Результат = ОткрытьОбработкуШаблона(ДанныеШаблонаОбработки.СтруктураПараметров, СтрокаШаблона.ПолучитьИдентификатор(), , ИмяФайла);
				#Иначе
					Если ДанныеШаблонаОбработки.ДвоичныеДанные <> Неопределено Тогда
						Адрес = ПоместитьВоВременноеХранилище(ДанныеШаблонаОбработки.ДвоичныеДанные);
						Результат = ОткрытьОбработкуШаблона(ДанныеШаблонаОбработки.СтруктураПараметров, СтрокаШаблона.ПолучитьИдентификатор(), Адрес, "");
					Иначе
						Адрес = "";
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Данных для записи не найдено'"));
					КонецЕсли;
				#КонецЕсли
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеШаблонаОсмотраОбработки(ШаблонПриема)
	
	Перем Результат;
	
	ДанныеОбработки = ШаблонПриема.Обработка.Получить();
	
	Если ДанныеОбработки <> Неопределено Тогда
		
		СтруктураПараметров = Новый Структура;
		
		ПараметрыОбработки = Новый Массив;
		Для Каждого СоотвПараметров Из ШаблонПриема.СоответствияПараметрам Цикл
			ПараметрыОбработки.Добавить(Новый Структура("Наименование,Параметр",
														СоотвПараметров.Наименование,
														СоотвПараметров.Параметр));
		КонецЦикла;
		СтруктураПараметров.Вставить("ПараметрыОбработки", ПараметрыОбработки);
		
		ТаблицыПараметровШаблона = Новый Массив;
		Для Каждого СоотвТаблиц Из ШаблонПриема.СоответствияТаблицамШаблонов Цикл
			ТаблицыПараметровШаблона.Добавить(Новый Структура("ТаблицаШаблонов, ТаблицаОбработки, Наименование, Параметр",
														СоотвТаблиц.ТаблицаШаблонов,
														СоотвТаблиц.ТаблицаОбработки,
														СоотвТаблиц.Наименование,
														СоотвТаблиц.Параметр));
		КонецЦикла;
		СтруктураПараметров.Вставить("ТаблицыПараметровШаблона", ТаблицыПараметровШаблона);
		
		Если ТипЗнч(ДанныеОбработки) = Тип("Строка") Тогда // Встроенная обработка
			Результат = Новый Структура("ИмяВстроеннойОбработки, СтруктураПараметров", ДанныеОбработки, СтруктураПараметров);
		Иначе
			Результат = Новый Структура("ДвоичныеДанные, СтруктураПараметров", ДанныеОбработки, СтруктураПараметров);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Данных для записи не найдено'"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ОткрытьОбработкуШаблона(СтруктураПараметров, ИдентификаторСтрокиШаблона, АдресХранилищаВеб = Неопределено, ИмяФайла = Неопределено, ИмяВстроеннойОбработки = Неопределено)
	
	Попытка
		
		ИмяОбработки = Неопределено;
		Если ИмяВстроеннойОбработки <> Неопределено Тогда
			ИмяФормыОбработки = "Обработка." + ИмяВстроеннойОбработки + ".Форма";
		Иначе
			
			// Помещаем обработку во временном хранилище.
			АдресХранилища = "";
			Попытка
				#Если НЕ ВебКлиент И НЕ МобильныйКлиент Тогда
					Результат = ПоместитьФайл(АдресХранилища, ИмяФайла, , Ложь);
				#Иначе
					АдресХранилища = АдресХранилищаВеб;
				#КонецЕсли
				ИмяОбработки = ОбщегоНазначенияСервер.ПодключитьВнешнююОбработку(АдресХранилища,Ложь);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
			ИмяФормыОбработки = "ВнешняяОбработка." + ИмяОбработки + ".Форма";
		КонецЕсли;
		
		ИспользоватьТиповоеЗаполнение = ИспользоватьТиповоеЗаполнение(ИмяОбработки, ИмяВстроеннойОбработки);
		
		Если СтруктураПараметров.Свойство("ПараметрыОбработки") Тогда
			ПараметрыОбработки = СтруктураПараметров.ПараметрыОбработки;
		Иначе
			ПараметрыОбработки = Новый Массив;
		КонецЕсли;
		Если СтруктураПараметров.Свойство("ТаблицыПараметровШаблона") Тогда
			ТаблицыПараметровШаблона = СтруктураПараметров.ТаблицыПараметровШаблона;
		Иначе
			ТаблицыПараметровШаблона = Новый Массив;
		КонецЕсли;
		
		СтрокаШаблона = Объект.ШаблоныПриема.НайтиПоИдентификатору(ИдентификаторСтрокиШаблона);
		
		// Откроем форму подключенной внешней обработки.
		СтруктураПараметровОткрытияФормы = ПолучитьСтруктуруПараметровОткрытияФормы(СтрокаШаблона.ШаблонПриема, Объект);
		ПараметрыФормы = Новый Структура("ЗначенияПоУмолчанию", СтруктураПараметровОткрытияФормы.ЗначенияПоУмолчанию);
		ПараметрыФормы.Вставить("СписокЗаполнений", СтруктураПараметровОткрытияФормы.СписокЗаполнений);
		ПараметрыФормы.Вставить("СтруктураШапки", СтруктураПараметровОткрытияФормы.СтруктураШапки);
		ПараметрыФормы.Вставить("ШаблонПриема", СтрокаШаблона.ШаблонПриема);
		ПараметрыФормы.Вставить("ИдентификаторСтрокиШаблона", ИдентификаторСтрокиШаблона);
		
		ДиагнозыКопия = Объект.Диагнозы;
		ПараметрыФормы.Вставить("Диагнозы", ДиагнозыКопия);
		
		СоответсвиеПараметрамШаблона = Новый Соответствие;
		Для Каждого Строка Из ТаблицаПараметров Цикл
			Если Строка.ИдентификаторСтрокиШаблона = ИдентификаторСтрокиШаблона Тогда
				СоответсвиеПараметрамШаблона.Вставить(Строка.Параметр, Новый Структура("Параметр, Значение, ТипЗначения", Строка.Параметр, Строка.Значение, Строка.ТипЗначения));
			КонецЕсли;
		КонецЦикла;
		
		МассивЗначенийПараметров = Новый Массив;
		Для Каждого Строка Из ТаблицаПараметров Цикл
			Если Строка.ИдентификаторСтрокиШаблона = ИдентификаторСтрокиШаблона Тогда
				СтруктураПараметра = Новый Структура("Параметр, Представление, Значение, СтрокаУидПараметра, ТипЗначения, ФорматнаяСтрока, ДеревоЗначенийВыбора",
					Строка.Параметр, Строка.Представление, Строка.Значение, Строка.СтрокаУидПараметра, Строка.ТипЗначения, Строка.ФорматнаяСтрока, Строка.ДеревоЗначенийВыбора);
				МассивЗначенийПараметров.Добавить(СтруктураПараметра);
			КонецЕсли;
		КонецЦикла;
		ПараметрыФормы.Вставить("ЗначенияПараметров", МассивЗначенийПараметров);
		ЗначенияПараметровТаблицШаблонов = Новый Массив;
		Для Каждого Строка Из ПараметрыТаблицШаблонов Цикл
			Если Строка.ИдентификаторСтрокиШаблона = ИдентификаторСтрокиШаблона Тогда
				СтруктураПараметра = Новый Структура("ИдентификаторТаблицы, НомерСтрокиТаблицы, Параметр, Значение, ИдентификаторСтроки, ИдентификаторРодительскойСтроки");
				ЗаполнитьЗначенияСвойств(СтруктураПараметра, Строка);
				ЗначенияПараметровТаблицШаблонов.Добавить(СтруктураПараметра);
			КонецЕсли;
		КонецЦикла;
		ПараметрыФормы.Вставить("ЗначенияПараметровТаблицШаблона", ЗначенияПараметровТаблицШаблонов);
		
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("ИдентификаторСтрокиШаблона", ИдентификаторСтрокиШаблона);
		ФормаОбработки = ПолучитьФорму(ИмяФормыОбработки, ПараметрыФормы, ЭтаФорма, ИмяФормыОбработки);
		
		Если ИспользоватьТиповоеЗаполнение <> Ложь Тогда
			
			Для Каждого СоответсвиеПараметрам Из ПараметрыОбработки Цикл
				
				СтрокаПараметра = СоответсвиеПараметрамШаблона.Получить(СоответсвиеПараметрам.Параметр);
				Если СтрокаПараметра = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Попытка
					ФормаОбработки[СоответсвиеПараметрам.Наименование] = СтрокаПараметра.Значение;
					
					Если СтрокаПараметра.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДополнительныеЗначенияХарактеристик")) Тогда
						НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", СоответсвиеПараметрам.Параметр);
						НовыйМассив = Новый Массив();
						НовыйМассив.Добавить(НовыйПараметр);
						НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
						
						ФормаОбработки.Элементы[СоответсвиеПараметрам.Наименование].ПараметрыВыбора = НовыеПараметры;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЦикла;
			
			// Заполние таблиц обработки
			Если ТаблицыПараметровШаблона.Количество()<> 0 И ПараметрыТаблицШаблонов.Количество() <> 0 Тогда
				СоответствиеТаблицШаблонов = Новый Соответствие;
				Для Каждого СтрокаДТ Из ТаблицыПараметровШаблона Цикл
					ИдентификаторТаблицы = Строка(СтрокаДТ.ТаблицаШаблонов.УникальныйИдентификатор());
					ИдентификаторПараметра = Строка(СтрокаДТ.Параметр.УникальныйИдентификатор());
					СоответствиеТаблицШаблонов.Вставить("" + Строка(ИдентификаторСтрокиШаблона) + " " + ИдентификаторТаблицы + " " + ИдентификаторПараметра,
					Новый Структура("Ссылка, ТаблицаОбработки, Наименование", СтрокаДТ.ТаблицаШаблонов, СтрокаДТ.ТаблицаОбработки, СтрокаДТ.Наименование));
				КонецЦикла;
				РасшПараметрыТаблицШаблонов = Новый Массив;
				Для Каждого ПараметрТШ Из ПараметрыТаблицШаблонов Цикл
					СтрокаСопоставления = "" + Строка(ПараметрТШ.ИдентификаторСтрокиШаблона) + " " + ПараметрТШ.ИдентификаторТаблицы + " " + Строка(ПараметрТШ.Параметр.УникальныйИдентификатор());
					ПараметрыТаблицыОбработки = СоответствиеТаблицШаблонов.Получить(СтрокаСопоставления);
					Если ПараметрыТаблицыОбработки <> Неопределено Тогда
						РасшПараметрыТаблицШаблонов.Добавить(Новый Структура(
						"ИдентификаторСтрокиШаблона, ИдентификаторТаблицы, НомерСтрокиТаблицы, Параметр, Значение, СсылкаНаТаблицу, ТаблицаОбработки, Наименование",
						ПараметрТШ.ИдентификаторСтрокиШаблона, ПараметрТШ.ИдентификаторТаблицы, ПараметрТШ.НомерСтрокиТаблицы, ПараметрТШ.Параметр, ПараметрТШ.Значение, ПараметрыТаблицыОбработки.Ссылка, ПараметрыТаблицыОбработки.ТаблицаОбработки, ПараметрыТаблицыОбработки.Наименование));
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого ПараметрТШ Из РасшПараметрыТаблицШаблонов Цикл
					Попытка
						ТаблицаОбработки = ФормаОбработки[ПараметрТШ.ТаблицаОбработки];
						Пока ПараметрТШ.НомерСтрокиТаблицы > ТаблицаОбработки.Количество() Цикл
							ТаблицаОбработки.Добавить();
						КонецЦикла;
						ТаблицаОбработки[ПараметрТШ.НомерСтрокиТаблицы-1][ПараметрТШ.Наименование] = ПараметрТШ.Значение;
						
						Если СодержитДопЗначения(ПараметрТШ.Параметр) Тогда
							НовыйПараметр = Новый ПараметрВыбора("Отбор.Владелец", ПараметрТШ.Параметр);
							НовыйМассив = Новый Массив();
							НовыйМассив.Добавить(НовыйПараметр);
							НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
							
							ФормаОбработки.Элементы[ПараметрТШ.Наименование].ПараметрыВыбора = НовыеПараметры;
						КонецЕсли;
					Исключение КонецПопытки;
				КонецЦикла;
				
			КонецЕсли;
			
			// Таблица состояний зубов в обработку редактирования осмотра.
			СостоянияЗубов = ПолучитьТекущуюЗубнуюКартуКлиента(СтрокаШаблона.ШаблонПриема);
			Если СостоянияЗубов <> Неопределено И СостоянияЗубов.Количество() > 0 Тогда
				Попытка
					Для Каждого СтрокаСостояния Из СостоянияЗубов Цикл
						ЗаполнитьЗначенияСвойств(ФормаОбработки.ТаблицаКОтправке.Добавить(), СтрокаСостояния); // НомерЗуба, СегментЗуба, Состояние, Описание.
					КонецЦикла;
				Исключение
				КонецПопытки;
			КонецЕсли;
			
		КонецЕсли;
		
		// Открытие формы.
		ОповещениеЗакрытия = Новый ОписаниеОповещения("ОбработкаШаблонаЗакрытие", ЭтотОбъект, ПараметрыЗакрытия);
		ФормаОбработки.ОписаниеОповещенияОЗакрытии = ОповещениеЗакрытия;
		ФормаОбработки.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ФормаОбработки.Открыть();
		
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаШаблонаЗакрытие(Результат, ПараметрыЗакрытия) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		// Перенос значений из обработки в приём.
		СтрокаШаблона = Объект.ШаблоныПриема.НайтиПоИдентификатору(ПараметрыЗакрытия.ИдентификаторСтрокиШаблона);
		ПеренестиЗначенияПараметровОтОбработкиВТаблицуПараметров(Результат.МассивПараметров, ПараметрыЗакрытия.ИдентификаторСтрокиШаблона);
		Если Результат.Свойство("ТаблицаПараметров") Тогда
			ПеренестиЗначенияПараметровОтОбработкиВТаблицуПараметров(Результат.ТаблицаПараметров, ПараметрыЗакрытия.ИдентификаторСтрокиШаблона, Истина);
		КонецЕсли;
		СтрокаСтраницыШаблона = СтраницыШаблоновПриема.НайтиСтроки(Новый Структура("ИдентификаторСтрокиШаблона", ПараметрыЗакрытия.ИдентификаторСтрокиШаблона));
		Если СтрокаСтраницыШаблона.Количество() > 0 Тогда
			СтрокаСтраницыШаблона = СтрокаСтраницыШаблона[0];
		КонецЕсли;
		
		Если Результат.Свойство("СтрокаТЗВизуальноеРедактированиеЗубов") Тогда
			ПроверитьНаОбработкуВизуальногоРедактированияЗубов(Результат.СтрокаТЗВизуальноеРедактированиеЗубов);
		КонецЕсли;
		
		// Установка текста печати.
		Если Результат.Свойство("НеМенятьИменаКлассов")
			И Результат.НеМенятьИменаКлассов
		Тогда
			СтрокаСтраницыШаблона.ТекстДляПечати = РаботаСHTMLКлиентСервер.ПеренестиСтилиИзHeadВТелоДокумента(Результат.ПредставлениеОсмотра);
		Иначе
			СтрокаСтраницыШаблона.ТекстДляПечати = РаботаСHTMLКлиентСервер.ПеренестиСтилиИзHeadВТелоДокументаСЗаменойИменКлассов(Результат.ПредставлениеОсмотра);
		КонецЕсли;
		ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM(СтрокаСтраницыШаблона.ТекстДляПечати);
		СтрокаШаблона.ТекстДляПечати = СтрокаСтраницыШаблона.ТекстДляПечати;
		ЭтаФорма[СтрокаСтраницыШаблона.ИмяРеквизита] = РаботаСDOMКлиентСервер.ПолучитьТекстHTMLДокументаDOM(ДокументHTML);
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьСтруктуруШапки(Знач Объект)
	ОбъектДокумент = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.Прием"));
	Возврат ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ОбъектДокумент);	
КонецФункции

&НаСервереБезКонтекста
Функция СодержитДопЗначения(ПараметрОбработки)
	Возврат ПараметрОбработки.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ДополнительныеЗначенияХарактеристик"));
КонецФункции

&НаКлиенте
Процедура ПеренестиЗначенияПараметровОтОбработкиВТаблицуПараметров(ПарамерыИзОбработки, ИдентификаторСтрокиШаблона, ЭтоПереносТаблиц = Ложь)
	
	Перем ИмяКолонкиТаблицы, ТаблицаШаблонов;
	
	Отбор = Новый Структура("ИдентификаторСтрокиШаблона", ИдентификаторСтрокиШаблона);
	
	// Удаление старых значений параметров шаблона обработки.
	Если ЭтоПереносТаблиц Тогда
		ПараметрыШаблона = ПараметрыТаблицШаблонов.НайтиСтроки(Отбор);
		мОбрИнд = ПараметрыТаблицШаблонов.Количество()-1;
		Для Сч = 0 По мОбрИнд Цикл
			СтрокаТЗ = ПараметрыТаблицШаблонов[мОбрИнд-Сч];
			Если СтрокаТЗ.ИдентификаторСтрокиШаблона = ИдентификаторСтрокиШаблона Тогда
				ПараметрыТаблицШаблонов.Удалить(мОбрИнд-Сч);
			КонецЕсли;
		КонецЦикла;
	Иначе
		ПараметрыШаблона = ТаблицаПараметров.НайтиСтроки(Отбор);
		Для Каждого СтрокаПараметра Из ПараметрыШаблона Цикл
			СтрокаПараметра.Значение = СтрокаПараметра.ТипЗначения.ПривестиЗначение(Неопределено);
		КонецЦикла;
	КонецЕсли;
	
	СтрокаШаблона = Объект.ШаблоныПриема.НайтиПоИдентификатору(ИдентификаторСтрокиШаблона);
	ВерсияШаблона = ПолучитьВерсиюШаблона(СтрокаШаблона.ШаблонПриема);
	СоответствияПараметрамШаблона = РаботаСШаблонамиОбработкамиСервер.ПолучитьСоответствиеПараметровОбработки(ВерсияШаблона, ЭтоПереносТаблиц, Истина);
	
	Отбор.Вставить("Параметр");
	
	Если ЭтоПереносТаблиц Тогда
		ИмяКолонкиТаблицы = Неопределено;
		
		ВариантыИмениКолонкиТаблицы = Новый Массив;
		ВариантыИмениКолонкиТаблицы.Добавить("СсылкаНаТаблицу");
		ВариантыИмениКолонкиТаблицы.Добавить("ТаблицаШаблонов");
		ВариантыИмениКолонкиТаблицы.Добавить("ИмяТаблицыШаблонов");
		ВариантыИмениКолонкиТаблицы.Добавить("ИмяТаблицы");
		
		Если ПарамерыИзОбработки.Количество() = 0 Тогда
			Возврат;
		Иначе
			СтрокаПараметраИзОбработки = ПарамерыИзОбработки[0];
		КонецЕсли;
		
		Для Каждого ВариантИмени Из ВариантыИмениКолонкиТаблицы Цикл
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаПараметраИзОбработки, ВариантИмени) Тогда
				ИмяКолонкиТаблицы = ВариантИмени;
			КонецЕсли;
		КонецЦикла;
		Если ИмяКолонкиТаблицы = Неопределено Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаПараметраИзОбработки Из ПарамерыИзОбработки Цикл
		
		Если ЭтоПереносТаблиц Тогда
			ТаблицаШаблонов = ПолучитьТаблицуШаблонаПоРезультатуОбработкиШаблона(СтрокаПараметраИзОбработки, СоответствияПараметрамШаблона, ИмяКолонкиТаблицы);
		КонецЕсли;
		
		Параметр = НайтиПараметрИзОбработкаВСоответствииШаблона(СтрокаПараметраИзОбработки, СоответствияПараметрамШаблона, ТаблицаШаблонов);
		Если Параметр = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоПереносТаблиц Тогда
			НоваяСтрока = ПараметрыТаблицШаблонов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПараметраИзОбработки);
			НоваяСтрока.Представление = Строка(НоваяСтрока.Значение);
			НоваяСтрока.ИдентификаторТаблицы = СтрокаПараметраИзОбработки.СсылкаНаТаблицу.УникальныйИдентификатор();
			НоваяСтрока.ИдентификаторСтрокиШаблона = ИдентификаторСтрокиШаблона;
		Иначе
			Для Каждого СтрокаПараметра Из ПараметрыШаблона Цикл
				Если Параметр = СтрокаПараметра.Параметр Тогда
					СтрокаПараметра.Значение = СтрокаПараметраИзОбработки.Значение;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиПараметрИзОбработкаВСоответствииШаблона(СтрокаПараметраИзОбработки, СоответствияПараметрамШаблона, ТаблицаШаблонов = Неопределено)

	Перем Параметр, ИмяКолонкиТаблицы;
	
	// Определение ссылки на параметр шаблона.
	ТипПоляПараметр = ТипЗнч(СтрокаПараметраИзОбработки.Параметр);
	
	Если ТипПоляПараметр = Тип("ПланВидовХарактеристикСсылка.ПараметрыHTML") Тогда
		Параметр = СтрокаПараметраИзОбработки.Параметр;
	ИначеЕсли ТипПоляПараметр = Тип("Строка") Тогда
		// Ищем ссылку на параметр в табличной части соответствия параметров.
		Для Каждого СтрокаСоответствия Из СоответствияПараметрамШаблона Цикл
			Если СтрокаСоответствия.Наименование = СтрокаПараметраИзОбработки.Параметр Тогда
				
				Если ЗначениеЗаполнено(ТаблицаШаблонов)
					И СтрокаСоответствия.ТаблицаШаблонов <> ТаблицаШаблонов
				Тогда
					Продолжить;
				КонецЕсли;
				
				Параметр = СтрокаСоответствия.Параметр;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Параметр
	
КонецФункции

&НаКлиенте
Функция ПолучитьТаблицуШаблонаПоРезультатуОбработкиШаблона(СтрокаПараметраИзОбработки, СоответствияПараметрамШаблона, ИмяКолонкиТаблицы)
	
	Перем ТаблицаШаблонов;
	
	ТаблицаИзОбработки = СтрокаПараметраИзОбработки[ИмяКолонкиТаблицы];
	
	Если ТипЗнч(ТаблицаИзОбработки) = Тип("СправочникСсылка.ТаблицыШаблоновПриема") Тогда
		ТаблицаШаблонов = ТаблицаИзОбработки;
	ИначеЕсли ТипЗнч(ТаблицаИзОбработки) = Тип("Строка") Тогда
		
		// Предполагаем, что одна таблица шаблона фигурирует в строках соответствий одной таблице формы строго под одним именем (иное неадекватно).
		Для Каждого СтрокаСоответствия Из СоответствияПараметрамШаблона Цикл
			Если СтрокаСоответствия.ТаблицаОбработки = ТаблицаИзОбработки Тогда
				ТаблицаШаблонов = СоответствияПараметрамШаблона.ТаблицаШаблонов;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаШаблонов;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	ОповещениеОВыборе = Новый ОписаниеОповещения("Подключаемый_КнопкаФилиалПриНажатииЗавершение", ЭтотОбъект);
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтотОбъект, , ОповещениеОВыборе);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатииЗавершение(Результат, ДополнительныеЗначения) Экспорт
	
	Если Результат.ИсходныйФилиал <> Объект.Филиал Тогда
		РаботаСШаблонамиHTMLКлиент.ПересчетПараметровОтЗависимыхРеквизитов("Филиал", ЭтотОбъект, Объект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиДвиженияДокумента(Команда)
	РаботаСДиалогамиКлиент.ВывестиДвиженияДокумента(Объект.Ссылка, Команда);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьБезПросмотра(Команда)
	
	Если Не РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ГруппаСтраницыОсмотра.ТекущаяСтраница = Элементы.ГруппаПечатьВсегоОсмотра Тогда
		
		Элементы.ПолеHTMLДокументаПечать.Документ.execCommand("Print");
		
	Иначе
		СтрокиСтраницШаблона = СтраницыШаблоновПриема.НайтиСтроки(Новый Структура("ИмяСтраницыФормы", Элементы.ГруппаСтраницыОсмотра.ТекущаяСтраница.Имя));
		Если СтрокиСтраницШаблона.Количество() <> 0 Тогда
			СтрокаСтраницыШаблона = СтрокиСтраницШаблона[0];
			ПолеДокумента = Элементы.Найти(СтрокаСтраницыШаблона.ИмяПоляДокумента);
			
			Если Элементы.КнопкаВерсияДляПечати.Пометка Тогда
				ПолеДокумента.Документ.execCommand("Print");
			Иначе
				ПеренестиЗначенияТекстовыхПолейОсмотраВТаблицуПараметров();
				
				СтрокаШаблона = Объект.ШаблоныПриема.НайтиПоИдентификатору(СтрокаСтраницыШаблона.ИдентификаторСтрокиШаблона);
				
				Если СтрокаШаблона.ВидШаблона = ПредопределенноеЗначение("Перечисление.ВидыШаблонов.HTMLШаблон") Тогда
					
					мПараметрыПечатиСтраницыОсмотра = Новый Структура;
					мПараметрыПечатиСтраницыОсмотра.Вставить("ТекущаяСтраница",	Элементы.ГруппаСтраницыОсмотра.ТекущаяСтраница);
					мПараметрыПечатиСтраницыОсмотра.Вставить("ПолеДокумента",	ПолеДокумента);

					КомандаВерсияДляПечати(Неопределено);
				Иначе
					ПолеДокумента.Документ.execCommand("Print");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПервичныйПриемНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПредыдущийПрием = Объект.ПервичныйПрием;
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Клиент", Объект.Клиент));
	ОткрытьФорму("Документ.Прием.Форма.ФормаВыбораПервичногоДокумента",ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура МедицинскаяКартаПриИзменении(Элемент)
	#Область Стоматология
	Если НЕ Объект.ЭтоПервичный Тогда
	#КонецОбласти
		СлучайБылИзменен = Ложь;
		ПодставитьПервичныйПриемПоМедКарте(Объект.МедицинскаяКарта, Объект.ПервичныйПрием, СлучайБылИзменен);
		Если СлучайБылИзменен Тогда
			ПервичныйПриемПриИзменении(Неопределено);
			ЗаполнитьИспользуемыеСтандартыЛечения(ИспользуемыеСтандартыЛечения, ПервичныйПриемДокумента(Объект));
		КонецЕсли;
	КонецЕсли;
	
	РаботаСШаблонамиHTMLКлиент.ПересчетПараметровОтЗависимыхРеквизитов("МедицинскаяКарта", ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура МедицинскаяКартаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если Ожидание = 0 Тогда
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьМедицинскиеКартыПациентаДляВыбора(Объект.Клиент);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМедицинскиеКартыПациентаДляВыбора(Клиент)
	
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МедицинскиеКарты.Ссылка,
	|	МедицинскиеКарты.Представление
	|ИЗ
	|	Справочник.МедицинскиеКарты КАК МедицинскиеКарты
	|ГДЕ
	|	МедицинскиеКарты.Клиент = &Клиент
	|	И НЕ МедицинскиеКарты.ПометкаУдаления"
	;
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		Результат.Добавить(Выб.Ссылка, Выб.Представление);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ПодставитьПервичныйПриемПоМедКарте(МедицинскаяКарта, ПервичныйПрием, СлучайБылИзменен = Неопределено)
	
	ТекущийПервичныйПриём = МедицинскаяДеятельность.ПолучитьТекущийПервичныйПриемМедкарты(МедицинскаяКарта);
	
	Если ТекущийПервичныйПриём <> ПервичныйПрием  Тогда
		Если Не ЗначениеЗаполнено(ТекущийПервичныйПриём) Тогда
			ПервичныйПрием = Документы.Прием.ПустаяСсылка();
		Иначе
			ПервичныйПрием = ТекущийПервичныйПриём;
		КонецЕсли;
		СлучайБылИзменен = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоПервичныйПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ПервичныйПрием)
		И (	 Не Объект.ЭтоПервичный	И Объект.ПервичныйПрием = Объект.Ссылка
			Или Объект.ЭтоПервичный	И Объект.ПервичныйПрием <> Объект.Ссылка)
	Тогда
		Объект.ПервичныйПрием = ПредопределенноеЗначение("Документ.Прием.ПустаяСсылка");
		ПервичныйПриемПриИзменении(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДиагнозыДиагнозНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбратьДиагноз(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДиагноз(Элемент)
	
	ПараметрыВыбораЗначения = Новый Массив;
	ПараметрыВыбораЗначения.Добавить(Новый ПараметрВыбора("Сотрудник", Объект.Врач));
	
	ТекущиеДанные = Элементы.Диагнозы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыВыбораЗначения.Добавить(Новый ПараметрВыбора("ВидНозологическойЕдиницы", ТекущиеДанные.Классификация3));
	КонецЕсли;
	
	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораЗначения);

КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.СтраницаДиагнозы Тогда
		Если Объект.Диагнозы.Количество() = 0 И Не ИзмененияЗапрещены Тогда
			ТекущаяМодифицированность = Модифицированность;
			Элементы.Диагнозы.ДобавитьСтроку();
			Объект.Диагнозы[0].Классификация3 = ПредопределенноеЗначение("Перечисление.КлассификацииДиагнозов.ОсновноеЗаболевание");
			ЭтаФорма.ТекущийЭлемент = Элементы.Диагноз;
			Модифицированность = ТекущаяМодифицированность;
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаЭП Тогда
		// РЭМД
		ИнтеграцияЕГИСЗ_РЭМДКлиент.НастроитьЭлементыФормы(ЭтотОбъект);
	Иначе
		ОчиститьПустуюТаблицуДиагнозов();
		
		Если ТекущаяСтраница = Элементы.СтраницаПланЛечения Тогда
			Если НеобходимоОбновитьСтандартыЛечения Тогда
				УстановитьОтборСтандартамЛечения();
				НеобходимоОбновитьСтандартыЛечения = Ложь;
			КонецЕсли;
		ИначеЕсли ТекущаяСтраница = Элементы.СтраницаОсмотр Тогда 
			ТекущийЭлемент = Элементы.ПолеHTMLДокумента;
		КонецЕсли;
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонОсмотраПриИзменении(Элемент)
	
	Если Объект.ШаблоныПриема.Количество() = 0 Тогда 
		СтрокаШаблона = Объект.ШаблоныПриема.Добавить();
	Иначе 
		СтрокаШаблона = Объект.ШаблоныПриема[0];
	КонецЕсли;
	СтрокаШаблона.ШаблонПриема = ШаблонОсмотра;
	ШаблонПриемаПриИзменении(СтрокаШаблона);
	
	ПерезаполнитьТаблицуСтраницШаблоновПриема();
	УстановитьДоступностьКомандОсмотраПоТекущейСтраницеОсмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонОсмотраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ШаблонПриемаНачалоВыбора(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПриемаШаблонПриемаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ШаблоныПриема.ТекущиеДанные;
	ШаблонПриемаПриИзменении(ТекущиеДанные);
	
	ПерезаполнитьТаблицуСтраницШаблоновПриема();
	УстановитьДоступностьКомандОсмотраПоТекущейСтраницеОсмотра();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриемаНачалоВыбора(Элемент)
	
	НовыйПараметр = Новый ПараметрВыбора("Врач", Объект.Врач);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элемент.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриемаПриИзменении(СтрокаШаблона)
	
	Если ЗначениеЗаполнено(СтрокаШаблона.ШаблонПриема) Тогда
		ВерсияШаблона = ПолучитьВерсиюШаблона(СтрокаШаблона.ШаблонПриема);
		ДанныеВерсииШаблона = ДокументыПриемаСервер.ДанныеВерсииШаблонаДляСтрокиШаблонов(ВерсияШаблона, СтрокаШаблона.ШаблонПриема);
		ЗаполнитьЗначенияСвойств(СтрокаШаблона, ДанныеВерсииШаблона);
	Иначе
		СтрокаШаблона.ТекстШаблона = РаботаСШаблонамиHTMLКлиентСервер.ПолучитьТекстШаблонаHTMLПоУмолчанию();
		СтрокаШаблона.ВидШаблона = Неопределено;
		СтрокаШаблона.ВидДокумента = Неопределено;
	КонецЕсли;
	
	УстановитьДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПриемаШаблонПриемаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
	ШаблонПриемаНачалоВыбора(Элемент);
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьНазначенныеАнализыИзПланаЛечения()
	Выгрузка = Новый ТаблицаЗначений;
	Выгрузка.Колонки.Добавить("Назначение");
	Выгрузка.Колонки.Добавить("ИдентификаторНазначения");

	Для Каждого Назначение Из СписокНазначений.ПолучитьЭлементы() Цикл
		Если ТипЗнч(Назначение.Назначение) = Тип("СправочникСсылка.Номенклатура")
			И Назначение.Назначение.Анализ = Истина // Не группа номенклатуры с null в реквизите (платформа может позволить ввести).
			И (Назначение.ДокументРегистратор.Пустая() ИЛИ Назначение.ДокументРегистратор = Объект.Ссылка)
		Тогда 
			НоваяЗапись = Выгрузка.Добавить();
			НоваяЗапись.Назначение = Назначение.Назначение;
			НоваяЗапись.ИдентификаторНазначения = Новый УникальныйИдентификатор(Назначение.ИдентификаторНазначения);	
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Выгрузка;
КонецФункции

&НаСервере
Функция ПолучитьТекущиеИД()
	СЗ = Новый СписокЗначений;
	СЗ.ЗагрузитьЗначения(Объект.Работы.Выгрузить().ВыгрузитьКолонку("ИД"));
	Возврат СЗ;
КонецФункции

&НаКлиенте
Процедура ВыбратьШаблоныИзСпециализацийВрача(Команда)
	
	Если ЗначениеЗаполнено(Объект.Врач) Тогда
		ПеренестиЗначенияТекстовыхПолейОсмотраВТаблицуПараметров();
		
		ПараметрыФормы = Новый Структура("Врач, ШаблоныПриема", Объект.Врач, Объект.ШаблоныПриема);
		ОткрытьФорму("Документ.Прием.Форма.ПанельВыборШаблонаПриема", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьШаблоныПриема(НовыйСоставШаблонов)
	
	Если ТипЗнч(НовыйСоставШаблонов) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	ИндексСтроки = 0;
	Для Каждого ШаблонПриема Из НовыйСоставШаблонов Цикл
		
		// Если есть старая строка, перемещаем её в нужную позицию.
		СтараяСтрокаНайдена = Ложь;
		Для Сч = ИндексСтроки По Объект.ШаблоныПриема.Количество()-1 Цикл
			СтрокаШаблона = Объект.ШаблоныПриема[Сч];
			Если СтрокаШаблона.ШаблонПриема = ШаблонПриема Тогда
				СтараяСтрокаНайдена = Истина;
				Объект.ШаблоныПриема.Сдвинуть(Сч, (ИндексСтроки - Сч));
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не СтараяСтрокаНайдена Тогда
			НоваяСтрока = Объект.ШаблоныПриема.Вставить(ИндексСтроки);
			НоваяСтрока.ШаблонПриема = ШаблонПриема;
			ШаблонПриемаПриИзменении(НоваяСтрока);
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
		
	КонецЦикла;
	
	ТребуемоеКоличество = НовыйСоставШаблонов.Количество();
	Пока ТребуемоеКоличество < Объект.ШаблоныПриема.Количество() Цикл
		Объект.ШаблоныПриема.Удалить(ТребуемоеКоличество); // Первый после последнего нужного элемента коллекции.
	КонецЦикла;
	
	ШаблоныПриемаПриИзменении(Элементы.ШаблоныПриема);
	
	ПодключитьОбработчикОжидания("ПреобразоватьОсмотрВВерсиюДляРедактированияОбщий", 0.1, Истина);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПреобразоватьОсмотрВВерсиюДляРедактированияОбщий()
	ПреобразоватьОсмотрВВерсиюДляРедактирования();
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПриемаПриАктивизацииСтроки(Элемент)

	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Если Элементы.КнопкаВерсияДляПечати.Пометка 
			И Не РежимОдногоШаблонаОсмотра
			И КоличествоЗаполненныхШаблоновПриема(Объект.ШаблоныПриема) > 1
		Тогда
			Элементы.ГруппаСтраницыОсмотра.ТекущаяСтраница = Элементы.ГруппаПечатьВсегоОсмотра
		Иначе
			СтрокаТаблицыСтраницОсмотра = ПолучитьСтрокуСтраницШаблонаПриемаКлиент(Элемент.ТекущаяСтрока);
			Если СтрокаТаблицыСтраницОсмотра <> Неопределено Тогда
				Элементы.ГруппаСтраницыОсмотра.ТекущаяСтраница = Элементы.Найти(СтрокаТаблицыСтраницОсмотра.ИмяСтраницыФормы);
				УстановитьДоступностьКомандОсмотраПоТекущейСтраницеОсмотра();
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;
	
	УстановитьОтборГотовыхФраз(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПриемаПриИзменении(Элемент)
	
	ПерезаполнитьТаблицуСтраницШаблоновПриема();
	УстановитьДоступностьКомандОсмотраПоТекущейСтраницеОсмотра();
	РаботаСФормамиКлиент.ОчиститьЛишниеКомандыПобор(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьТаблицуСтраницШаблоновПриема()
	
	СтрокиСИзмененнымШаблоном = Новый Массив;
	
	// Нединамическая страница формы, используемая для экономии производительности в тех случаях, когда врач использует 
	// только шаблон.
	ПерваяСтраницаОсмотра = Элементы.ГруппаПерваяСтраницаОсмотра;
	
	// Состав шаблонов точно изменился, если изменилось количество заполненых строк (обработка удаления строки шаблона).
	КоличествоЗаполненныхСтрокШаблонов	= Объект.ШаблоныПриема.Количество() 
										- Объект.ШаблоныПриема.НайтиСтроки(Новый Структура("ШаблонПриема", ПредопределенноеЗначение("Справочник.ШаблоныHTML.ПустаяСсылка"))).Количество();
																							
	флСоставШаблоновИзменился = КоличествоЗаполненныхСтрокШаблонов <> СтраницыШаблоновПриема.Количество();
	
	// Первоначально заполняю список свободных для назначения страниц группы осмотра всеми её наполняющими.
	СвободныеСтраницыОсмотра = Новый Массив;
	Для Каждого СтраницаОсмотра Из Элементы.ГруппаСтраницыОсмотра.ПодчиненныеЭлементы Цикл
		Если СтраницаОсмотра <> Элементы.ГруппаПечатьВсегоОсмотра Тогда
			СвободныеСтраницыОсмотра.Добавить(СтраницаОсмотра.Имя);
		КонецЕсли;
	КонецЦикла;
	
	мсСопоставленныеСтрокиСтраницОсмотра = Новый Массив;
	Отбор = Новый Структура("ИдентификаторСтрокиШаблона");
	Для Каждого СтрокаШаблонПриема Из Объект.ШаблоныПриема Цикл
		
		Отбор.ИдентификаторСтрокиШаблона = СтрокаШаблонПриема.ПолучитьИдентификатор();
		СтрокиСтраниц = СтраницыШаблоновПриема.НайтиСтроки(Отбор);
		Если СтрокиСтраниц.Количество() = 0 Тогда
			
			Если ЗначениеЗаполнено(СтрокаШаблонПриема.ШаблонПриема) Тогда
				
				СтрокаТаблицыСтраницОсмотра = СтраницыШаблоновПриема.Добавить();
				СтрокаТаблицыСтраницОсмотра.ИдентификаторСтрокиШаблона = СтрокаШаблонПриема.ПолучитьИдентификатор();
				СтрокаТаблицыСтраницОсмотра.ШаблонПриема = СтрокаШаблонПриема.ШаблонПриема;
				СтрокаТаблицыСтраницОсмотра.НомерСтроки  = СтрокаШаблонПриема.НомерСтроки;
				
				мсСопоставленныеСтрокиСтраницОсмотра.Добавить(СтрокаТаблицыСтраницОсмотра);
				
				СтрокиСИзмененнымШаблоном.Добавить(СтрокаШаблонПриема.ПолучитьИдентификатор());
				флСоставШаблоновИзменился = Истина;
			КонецЕсли;
		Иначе
			СтрокаТаблицыСтраницОсмотра = СтрокиСтраниц[0];
			флСоставШаблоновИзменился = флСоставШаблоновИзменился 
									  Или СтрокаШаблонПриема.ШаблонПриема <> СтрокаТаблицыСтраницОсмотра.ШаблонПриема
									  Или СтрокаШаблонПриема.НомерСтроки  <> СтрокаТаблицыСтраницОсмотра.НомерСтроки;
			
			Если ЗначениеЗаполнено(СтрокаШаблонПриема.ШаблонПриема) Тогда
				
				Если СтрокаШаблонПриема.ШаблонПриема <> СтрокаТаблицыСтраницОсмотра.ШаблонПриема Тогда
					СтрокиСИзмененнымШаблоном.Добавить(СтрокаШаблонПриема.ПолучитьИдентификатор());
				КонецЕсли;
										  
				СвободныеСтраницыОсмотра.Удалить(СвободныеСтраницыОсмотра.Найти(СтрокаТаблицыСтраницОсмотра.ИмяСтраницыФормы));
				
				СтрокаТаблицыСтраницОсмотра.ШаблонПриема = СтрокаШаблонПриема.ШаблонПриема;
				СтрокаТаблицыСтраницОсмотра.НомерСтроки  = СтрокаШаблонПриема.НомерСтроки;
				
				мсСопоставленныеСтрокиСтраницОсмотра.Добавить(СтрокаТаблицыСтраницОсмотра);
			Иначе
				СтраницыШаблоновПриема.Удалить(СтрокаТаблицыСтраницОсмотра);	
			КонецЕсли;										
		КонецЕсли;	
	КонецЦикла;
	
	// Удаление ставших лишними строк СтраницыШаблоновПриема.
	мОбрИнд = СтраницыШаблоновПриема.Количество()-1;
	Для сч = 0 по мОбрИнд Цикл
		
		СтрокаТаблицыСтраницОсмотра = СтраницыШаблоновПриема[мОбрИнд-сч];
		Если мсСопоставленныеСтрокиСтраницОсмотра.Найти(СтрокаТаблицыСтраницОсмотра) = Неопределено Тогда
			СтраницыШаблоновПриема.Удалить(мОбрИнд-сч);
		КонецЕсли;
		
	КонецЦикла;
	
	Если флСоставШаблоновИзменился Тогда
		
		ПеренестиЗначенияТекстовыхПолейОсмотраВТаблицуПараметров();
		ПриИзмененииСоставаШаблоновСервер(СвободныеСтраницыОсмотра, СтрокиСИзмененнымШаблоном);
		
		Если Элементы.ГруппаСтраницыОсмотра.ТекущаяСтраница = Неопределено 
			Или СтраницыШаблоновПриема.НайтиСтроки(Новый Структура("ИмяСтраницыФормы",  Элементы.ГруппаСтраницыОсмотра.ТекущаяСтраница.Имя)).Количество() = 0
		Тогда
			Если СтраницыШаблоновПриема.Количество() = 0 Тогда
				Элементы.ГруппаСтраницыОсмотра.ТекущаяСтраница = Элементы.ГруппаПерваяСтраницаОсмотра;
			Иначе
				Элементы.ГруппаСтраницыОсмотра.ТекущаяСтраница = Элементы.Найти(СтраницыШаблоновПриема[0].ИмяСтраницыФормы);
			КонецЕсли;
		КонецЕсли;
		
		ПреобразоватьОсмотрВВерсиюДляРедактирования(, Ложь);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСоставаШаблоновСервер(СвободныеСтраницыОсмотра, СтрокиСИзмененнымШаблоном = Неопределено)

	ИмяПервойСтраницыОсмотра = "ГруппаПерваяСтраницаОсмотра";
	
	мСтраницыШаблоновПриема = СтраницыШаблоновПриема.Выгрузить();
	Для Каждого СтрокаТаблицыСтраницОсмотра Из мСтраницыШаблоновПриема Цикл
		
		Если ПустаяСтрока(СтрокаТаблицыСтраницОсмотра.ИмяСтраницыФормы) Тогда
			
			ЗаголовокСтраницы = СтрокаТаблицыСтраницОсмотра.ШаблонПриема.Наименование;
			
			Если СвободныеСтраницыОсмотра.Количество() > 0 Тогда
				
				СтрокаТаблицыСтраницОсмотра.ИмяСтраницыФормы = СвободныеСтраницыОсмотра[0];
				СтрокаТаблицыСтраницОсмотра.ИмяПоляДокумента = ПолучитьИмяПоляДокументаСтраницыОсмотра(СвободныеСтраницыОсмотра[0]);
				СтрокаТаблицыСтраницОсмотра.ИмяРеквизита 	= Элементы[СтрокаТаблицыСтраницОсмотра.ИмяПоляДокумента].ПутьКДанным;
				
				СвободныеСтраницыОсмотра.Удалить(0);
				
				Если СтрокаТаблицыСтраницОсмотра.ИмяСтраницыФормы = ИмяПервойСтраницыОсмотра Тогда
					Элементы.ПолеHTMLДокумента.Видимость = Истина;
					Элементы.ДекорацияПерваяСтраницаОсмотра.Видимость = Ложь;
				КонецЕсли;
				
				ГруппаСтраницы = Элементы.Найти(СтрокаТаблицыСтраницОсмотра.ИмяСтраницыФормы);
				Если ГруппаСтраницы.Заголовок <> ЗаголовокСтраницы Тогда
					ГруппаСтраницы.Заголовок = ЗаголовокСтраницы
				КонецЕсли;
			Иначе
				// Создаю новую страницу осмотра, её имена присваиваю строке таблицы страниц.
				ЗаполнитьЗначенияСвойств(СтрокаТаблицыСтраницОсмотра, СоздатьСтраницуОсмотра(ЗаголовокСтраницы));
			КонецЕсли;
			ТекстHTML = ?(СтрокаТаблицыСтраницОсмотра.ШаблонПриема.ВидШаблона = Перечисления.ВидыШаблонов.HTMLШаблон, 
							СтрокаТаблицыСтраницОсмотра.ШаблонПриема.ТекстHTML,
							РаботаСШаблонамиHTMLКлиентСервер.ПолучитьТекстШаблонаHTMLПоУмолчанию()); // Здесь добавить заполнение изначального текста HTML от обработки
			ЭтаФорма[СтрокаТаблицыСтраницОсмотра.ИмяРеквизита] = РаботаСDOMКлиентСервер.СформироватьПолныйТекстДокументаHTML(ТекстHTML);
		Иначе
			// Проверка, не изменили ли шаблон у этой старой строки табл. части. Если изменили, то обновляю заголовок.
			Если ТипЗнч(СтрокиСИзмененнымШаблоном) = Тип("Массив")
				И СтрокиСИзмененнымШаблоном.Найти(СтрокаТаблицыСтраницОсмотра.ИдентификаторСтрокиШаблона) <> Неопределено
			Тогда
				ГруппаСтраницы = Элементы.Найти(СтрокаТаблицыСтраницОсмотра.ИмяСтраницыФормы);
				ГруппаСтраницы.Заголовок = СтрокаТаблицыСтраницОсмотра.ШаблонПриема.Наименование;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	СтраницыШаблоновПриема.Загрузить(мСтраницыШаблоновПриема);
	
	// Удаление лишних страниц осмотра.
	ПерваяСтраницаОсмотра = Элементы.ГруппаПерваяСтраницаОсмотра;
	Для Каждого ИмяСтраницыОсмотра Из СвободныеСтраницыОсмотра Цикл
		Если ИмяСтраницыОсмотра = ИмяПервойСтраницыОсмотра Тогда
			Элементы.ПолеHTMLДокумента.Видимость = Ложь;
			Если СтраницыШаблоновПриема.Количество() = 0 Тогда
				Элементы.ДекорацияПерваяСтраницаОсмотра.Видимость = Истина;
			КонецЕсли;
		Иначе
			УдалитьСтраницуОсмотра(ИмяСтраницыОсмотра);
		КонецЕсли;
	КонецЦикла;
	
	ОтображениеСтраниц = ?(СтраницыШаблоновПриема.Количество() > 1,
							  ОтображениеСтраницФормы.ЗакладкиСверху,
							  ОтображениеСтраницФормы.Нет);
	Если Элементы.ГруппаСтраницыОсмотра.ОтображениеСтраниц <> ОтображениеСтраниц Тогда
		Элементы.ГруппаСтраницыОсмотра.ОтображениеСтраниц = ОтображениеСтраниц;
	КонецЕсли;
	
	// Сортировка страниц.
	ГруппаСтраницОсмотра = Элементы.ГруппаСтраницыОсмотра;
	Отбор = Новый Структура("ИдентификаторСтрокиШаблона");
	Для Каждого СтрокаШаблонПриема Из Объект.ШаблоныПриема Цикл
		
		Если ЗначениеЗаполнено(СтрокаШаблонПриема.ШаблонПриема) Тогда
			Отбор.ИдентификаторСтрокиШаблона = СтрокаШаблонПриема.ПолучитьИдентификатор();
			СтрокаТаблицыСтраницОсмотра = СтраницыШаблоновПриема.НайтиСтроки(Отбор)[0];
			
			ЭлементСтраница = Элементы.Найти(СтрокаТаблицыСтраницОсмотра.ИмяСтраницыФормы);
			Элементы.Переместить(ЭлементСтраница, ГруппаСтраницОсмотра);
		КонецЕсли;
	
	КонецЦикла;
	
	КешЗначенийВыбора = Новый ФиксированноеСоответствие(РаботаСШаблонамиHTML.ПолучитьКешЗначенийВыбора(
		ВерсииШаблонов.Выгрузить().ВыгрузитьКолонку("ВерсияШаблона")));
	
	ДокументыПриемаСервер.ДополнитьТаблицуПараметровПоШаблонамПриема(Объект, ТаблицаПараметров, ВерсииШаблонов, КешЗависимыхПараметров);
	ПерезаполнитьПодменюШаблоновЗаполненияОсмотра();	
	
	Если ТипЗнч(СтрокиСИзмененнымШаблоном) = Тип("Массив") Тогда
		Для Каждого СтрокаСИзмененнымШаблоном Из СтрокиСИзмененнымШаблоном Цикл
			ЗаполнитьШаблонЗначениямиПоУмолчанию(СтрокаСИзмененнымШаблоном);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьШаблонЗначениямиПоУмолчанию(Знач СтрокаШаблона)
	
	Если ТипЗнч(СтрокаШаблона) = Тип("Массив") Тогда
		ЗаполняемыеШаблоны = СтрокаШаблона;
	Иначе
		ЗаполняемыеШаблоны = Новый Массив;
		ЗаполняемыеШаблоны.Добавить(СтрокаШаблона);
	КонецЕсли;
	
	Для Каждого СтрокаШаблона Из ЗаполняемыеШаблоны Цикл
		// Заполнение по-умолчанию новых параметров.
		Если Объект.ШаблоныПриема.НайтиПоИдентификатору(СтрокаШаблона).ВидШаблона = Перечисления.ВидыШаблонов.HTMLШаблон Тогда

			ТаблицаПараметровШаблона = ТаблицаПараметров.Выгрузить().СкопироватьКолонки();
			СтрокиПараметровИзмененногоШаблона = ТаблицаПараметров.НайтиСтроки(Новый Структура("ИдентификаторСтрокиШаблона", СтрокаШаблона));
			
			Для Каждого СтрокаПараметра Из СтрокиПараметровИзмененногоШаблона Цикл
				// Если Значение параметра не заполнено, добавляю параметр в число тех, чьё значение по-умолчанию надо получить.
				Если СтрокаПараметра.Значение = Ложь Или Не ЗначениеЗаполнено(СтрокаПараметра.Значение) Тогда
					ЗаполнитьЗначенияСвойств(ТаблицаПараметровШаблона.Добавить(), СтрокаПараметра);
				КонецЕсли;
			КонецЦикла;
			
			ЗначенияПоУмолчанию = РаботаСШаблонамиHTML.ПолучитьЗначенияПараметровПоУмолчанию(ТаблицаПараметровШаблона, КешЗависимыхПараметров, Объект, , СтрокаШаблона);
			РаботаСШаблонамиHTMLКлиентСервер.ОбновитьЗначенияТаблицыПараметров(ТаблицаПараметров, ЗначенияПоУмолчанию, СтрокаШаблона);
			
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция СоздатьСтраницуОсмотра(ЗаголовокСтраницы)
	
	ИмяСтраницы = СгенерироватьУникальноеИмя("СтраницаОсмотра_");
	ИмяПоляДокумента = ПолучитьИмяПоляДокументаСтраницыОсмотра(ИмяСтраницы);
	
	// Создание реквизита для поля HTML документа.
	Реквизит = Новый РеквизитФормы(ИмяПоляДокумента, Новый ОписаниеТипов("Строка"));
	мсРеквизит = Новый Массив;
	мсРеквизит.Добавить(Реквизит);
	ИзменитьРеквизиты(мсРеквизит);
	
	// Создание группы-страницы.
	ГруппаСтраница = Элементы.Добавить(ИмяСтраницы, Тип("ГруппаФормы"), Элементы.ГруппаСтраницыОсмотра);
	ГруппаСтраница.Заголовок = ЗаголовокСтраницы;
	ГруппаСтраница.Вид = ВидГруппыФормы.Страница;
	
	// Создание поля HTML документа.
	ПолеДокумента = Элементы.Добавить(ИмяПоляДокумента, Тип("ПолеФормы"), ГруппаСтраница);
	ПолеДокумента.ПутьКДанным = ИмяПоляДокумента;
	ПолеДокумента.Вид = ВидПоляФормы.ПолеHTMLДокумента;
	ПолеДокумента.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ПолеДокумента.УстановитьДействие("ПриНажатии", "ОбработчикПриНажатии");
	ПолеДокумента.УстановитьДействие("ДокументСформирован", "ПолеHTMLДокументаДокументСформирован");
	
	// Создание команды "Вставить"
	КомандаВставить = Элементы.Добавить(ИмяПоляДокумента + "Вставить", Тип("КнопкаФормы"), ПолеДокумента.КонтекстноеМеню);
	КомандаВставить.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КомандаВставить.ИмяКоманды = "ПолеHTMLДокументаВставить";
	
	// Создание команды "Очистить"
	КомандаВставить = Элементы.Добавить(ИмяПоляДокумента + "Очистить", Тип("КнопкаФормы"), ПолеДокумента.КонтекстноеМеню);
	КомандаВставить.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КомандаВставить.ИмяКоманды = "ПолеHTMLДокументаОчистить";
	
	// Создание команды "ЗаполнитьПоУмолчанию"
	КомандаВставить = Элементы.Добавить(ИмяПоляДокумента + "ЗаполнитьПоУмолчанию", Тип("КнопкаФормы"), ПолеДокумента.КонтекстноеМеню);
	КомандаВставить.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	КомандаВставить.ИмяКоманды = "ПолеHTMLДокументаЗаполнитьПоУмолчанию";
	
	Возврат Новый Структура("ИмяСтраницыФормы, ИмяПоляДокумента, ИмяРеквизита", ИмяСтраницы, ИмяПоляДокумента, ИмяПоляДокумента);
	
КонецФункции

&НаСервере
Процедура УдалитьСтраницуОсмотра(ИмяСтраницы)
	
	ИмяПоляДокумента = ПолучитьИмяПоляДокументаСтраницыОсмотра(ИмяСтраницы);
	
	// Удаление реквизита поля HTML документа.
	мсРеквизит = Новый Массив;
	мсРеквизит.Добавить(ИмяПоляДокумента);
	ИзменитьРеквизиты(,мсРеквизит);
	
	// Удаление группы-страницы (со всем содержимым).
	Элементы.Удалить(Элементы.Найти(ИмяСтраницы));
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИмяПоляДокументаСтраницыОсмотра(ИмяСтраницы)
	
	Если ИмяСтраницы = "ГруппаПерваяСтраницаОсмотра" Тогда
		// Предопределенная страница.
		Возврат "ПолеHTMLДокумента";
	Иначе
		Возврат СтрЗаменить(ИмяСтраницы, "СтраницаОсмотра_", "ПолеДокумента_");	
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция СгенерироватьУникальноеИмя(Префикс)
	
	Возврат Префикс + СтрЗаменить(Строка(Новый УникальныйИдентификатор),"-","_");
	
КонецФункции

&НаСервере
Процедура ТекущийЭлементПриСоздании()
	
	Если Не ЗначениеЗаполнено(Объект.Врач) Тогда
		ТекущийЭлемент = Элементы.Врач;
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Клиент) Тогда
		ТекущийЭлемент = Элементы.Клиент;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияПолейОсмотраПриСоздании()
	
	Если Объект.Ссылка.Пустая() Тогда
		ДокументыПриемаКлиентСервер.ЗаполнитьТаблицуВерсийШаблонов(ВерсииШаблонов, Объект);
	КонецЕсли;
	
	Если Объект.ШаблоныПриема.Количество() <> 0 Тогда
		
		Если Не Объект.Ссылка.Пустая() Тогда
			ЗагрузитьТаблицуПараметров();
			ЗагрузитьПараметрыТаблицШаблонов();
			ЗагрузитьРисункиКартинок();
			ЗагрузитьДобавленныеИзображения();
		КонецЕсли;
		
		ЗаполнитьДополнительныеРеквизитыТабЧастиШаблоны();
		
		// Создание структур данных о страницах осмотра.
		СвободныеСтраницыОсмотра = Новый Массив;
		СвободныеСтраницыОсмотра.Добавить("ГруппаПерваяСтраницаОсмотра");
		
		Для Каждого СтрокаШаблонПриема Из Объект.ШаблоныПриема Цикл
			
			Если ЗначениеЗаполнено(СтрокаШаблонПриема.ШаблонПриема) Тогда
				
				СтрокаТаблицыСтраницОсмотра = СтраницыШаблоновПриема.Добавить();
				СтрокаТаблицыСтраницОсмотра.ИдентификаторСтрокиШаблона = СтрокаШаблонПриема.ПолучитьИдентификатор();
				СтрокаТаблицыСтраницОсмотра.ШаблонПриема = СтрокаШаблонПриема.ШаблонПриема;
				СтрокаТаблицыСтраницОсмотра.НомерСтроки  = СтрокаШаблонПриема.НомерСтроки;
				
			КонецЕсли;
		КонецЦикла;
		
		ПриИзмененииСоставаШаблоновСервер(СвободныеСтраницыОсмотра);
		
	КонецЕсли;
	
	// Команды разделения печатной версии на вариант Клиента и вариант Медицинской карты.
	РежимРазметкиКлиентскойОбластиШаблоновПриема = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("РежимРазметкиКлиентскойОбластиШаблоновПриема");
	
	// Неопределено - не использовать разделение, Истина - для клиента, Ложь - для медкарты
	РежимПолучателяПечатнойВерсииОсмотра = ?(ЗначениеЗаполнено(РежимРазметкиКлиентскойОбластиШаблоновПриема),
												РежимРазметкиКлиентскойОбластиШаблоновПриема = 1, Неопределено);
												
	Если РежимПолучателяПечатнойВерсииОсмотра <> Неопределено Тогда
		// Пометка кнопки основной печатной версии
		Элементы.РежимПечатиДляКлиента.Пометка	 = РежимРазметкиКлиентскойОбластиШаблоновПриема;
		Элементы.РежимПечатиДляМедкарты.Пометка	 = Не Элементы.РежимПечатиДляКлиента.Пометка;
	Иначе
		// Разделение печатных версий не используется.
		Элементы.РежимПечатиДляКлиента.Видимость = Ложь;
		Элементы.РежимПечатиДляМедкарты.Видимость = Ложь;
		Элементы.ПечатьРежимПечатиДляКлиента.Видимость = Ложь;
		Элементы.ПечатьРежимПечатиДляМедкарты.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТаблицуПараметров()
	
	ТаблицаПараметров.Очистить();
	
	// Заполнение из БД.
	Если Не Объект.Ссылка.Пустая() Тогда
		
		ТаблЗначенияПараметровHTML = ПолучитьТаблицуЗначенийПараметров(Объект.Ссылка);
		
		Для Каждого СтрокаЗначения Из ТаблЗначенияПараметровHTML Цикл

			НоваяСтрока = ТаблицаПараметров.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаЗначения);
			НоваяСтрока.СтрокаУидПараметра = Строка(СтрокаЗначения.Параметр.УникальныйИдентификатор());
			НоваяСтрока.ИдентификаторСтрокиШаблона = СтрокаЗначения.ИндексШаблона;				
			Если ЗначениеЗаполнено(СтрокаЗначения.ЗначениеЭМК) Тогда
				НоваяСтрока.Значение = СтрокаЗначения.ЗначениеЭМК;	
			КонецЕсли; 					
			НоваяСтрока.Представление = РаботаСШаблонамиHTMLКлиентСервер.ПолучитьПредставлениеПараметра(НоваяСтрока);
			
			ДокументыПриемаСервер.ЗаполнитьПараметрыВводаСтрокиПараметра(НоваяСтрока);
			
		КонецЦикла;
	КонецЕсли;
	
	// Заполнение параметрами шаблона.
	// Не требуется при обязательном вызове ПриИзмененииСоставаШаблоновСервер() после загрузки
	// ДокументыПриемаСервер.ДополнитьТаблицуПараметровПоШаблонамПриема(Объект, ТаблицаПараметров, ВерсииШаблонов, КешЗависимыхПараметров);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТаблицуЗначенийПараметров(ДокументСсылка)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗначенияПараметровHTML.Параметр КАК Параметр,
	               |	ЗначенияПараметровHTML.Документ КАК Документ,
	               |	ЗначенияПараметровHTML.ИндексШаблона КАК ИндексШаблона,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ЗначенияПараметровHTML.Значение) = ТИП(Справочник.СтрокиЭМКНеограниченнойДлины)
	               |			ТОГДА ЗначенияПараметровHTML.Значение.Значение
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК ЗначениеЭМК,
	               |	ЗначенияПараметровHTML.Значение КАК Значение,
	               |	ЗначенияПараметровHTML.Параметр.ВыборПоСсылкеИзОграниченногоСписка КАК ВыборПоСсылкеИзОграниченногоСписка,
	               |	ЗначенияПараметровHTML.Параметр.ФорматнаяСтрока КАК ФорматнаяСтрока,
	               |	ЗначенияПараметровHTML.Параметр.ТипЗначения КАК ТипЗначения,
	               |	ЗначенияПараметровHTML.Параметр.НеРедактируетсяПользователем КАК НеРедактируетсяПользователем,
	               |	ВЫБОР КОГДА ЗначенияПараметровHTML.Параметр.НаименованиеДляВрача = """" ТОГДА ПРЕДСТАВЛЕНИЕ(ЗначенияПараметровHTML.Параметр) ИНАЧЕ ЗначенияПараметровHTML.Параметр.НаименованиеДляВрача КОНЕЦ КАК НаименованиеДляВрача
	               |ИЗ
	               |	РегистрСведений.ЗначенияПараметровHTML КАК ЗначенияПараметровHTML
	               |ГДЕ
	               |	ЗначенияПараметровHTML.Документ = &Документ
	               |	И НЕ ЗначенияПараметровHTML.Параметр.ЭтоГруппа";
	Запрос.УстановитьПараметр("Документ",ДокументСсылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьПараметрыТаблицШаблонов()
	
	ПараметрыТаблицШаблонов.Очистить();
	
	ПараметрыЭталонныхСтрокТаблицШаблонов = Новый Соответствие;
	
	Если Не Объект.Ссылка.Пустая() Тогда
		НаборЗаписей = РегистрыСведений.ДанныеТаблицШаблоновПриема.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ.Установить(Объект.Ссылка);
		НаборЗаписей.Прочитать();
		
		// Реквизиты параметров шаблонов единым запросом
		Запрос = Новый Запрос("ВЫБРАТЬ Ссылка, ФорматнаяСтрока ИЗ ПланВидовХарактеристик.ПараметрыHTML ГДЕ Ссылка В(&Ссылка)");
		Запрос.УстановитьПараметр("Ссылка", НаборЗаписей.ВыгрузитьКолонку("Параметр"));
		РеквизитыПараметров = Запрос.Выполнить().Выбрать();
		ОтборРеквизиты = Новый Структура("Ссылка");
		
		ИдентификаторыОбработанныхСтрок = Новый Массив;
		
		// Заполнение таблицы параметров на форме
		Для Каждого Запись Из НаборЗаписей Цикл
			
			СтрокаШаблона = Объект.ШаблоныПриема[Запись.ИндексШаблона];
			ИдентификаторСтроки = СтрокаШаблона.ПолучитьИдентификатор();
			
			ПараметрыЭталонныхСтрокТаблиц = ПараметрыЭталонныхСтрокТаблицШаблонов.Получить(СтрокаШаблона.ШаблонПриема);
			Если ПараметрыЭталонныхСтрокТаблиц = Неопределено Тогда
				Если СтрокаШаблона.ВидШаблона = Перечисления.ВидыШаблонов.Обработка Тогда
					ПараметрыЭталонныхСтрокТаблиц = РаботаСШаблонамиОбработкамиСервер.ПараметрыЭталонныхСтрокТаблиц(СтрокаШаблона.ШаблонПриема);
				Иначе
					ПараметрыЭталонныхСтрокТаблиц = РаботаСШаблонамиHTML.ПараметрыЭталонныхСтрокТаблиц(РаботаСШаблонамиHTML.ЭталонныеСтрокиТаблиц(СтрокаШаблона.ТекстШаблона), СтрокаШаблона.ТекстШаблона);
				КонецЕсли;
			КонецЕсли;
			
			ПараметрыЭталоннойСтрокиТаблицы = РаботаСШаблонамиHTML.ПараметрыЭталоннойСтрокиТаблицы(ПараметрыЭталонныхСтрокТаблиц, Строка(Запись.ТаблицаШаблонов.УникальныйИдентификатор()));
			
			Если ИдентификаторыОбработанныхСтрок.Найти(Запись.ИдентификаторСтроки) = Неопределено Тогда
				// Заполняем всеми параметрами по эталонной строке
				Если ПараметрыЭталоннойСтрокиТаблицы <> Неопределено
					И ПараметрыЭталоннойСтрокиТаблицы.Количество() > 0
				Тогда
					Для Каждого ПараметрЭталоннойСтроки Из ПараметрыЭталоннойСтрокиТаблицы Цикл
						НоваяСтрока = ПараметрыТаблицШаблонов.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись, , "Значение");
						НоваяСтрока.Параметр = ПараметрЭталоннойСтроки;
						НоваяСтрока.ИдентификаторТаблицы = Запись.ТаблицаШаблонов.УникальныйИдентификатор();
						НоваяСтрока.ИдентификаторСтрокиШаблона = ИдентификаторСтроки;
					КонецЦикла;
				КонецЕсли;
				
				ИдентификаторыОбработанныхСтрок.Добавить(Запись.ИдентификаторСтроки);
			КонецЕсли;
			
			Если Запись.Параметр <> ПланыВидовХарактеристик.ПараметрыHTML.ПустаяСсылка() Тогда
				СтруктураПоиска = Новый Структура("НомерСтрокиТаблицы, Параметр, ИдентификаторСтроки, ИдентификаторРодительскойСтроки");
				ЗаполнитьЗначенияСвойств(СтруктураПоиска, Запись);
				СтруктураПоиска.Вставить("ИдентификаторТаблицы", Строка(Запись.ТаблицаШаблонов.УникальныйИдентификатор()));
				СтруктураПоиска.Вставить("ИдентификаторСтрокиШаблона", ИдентификаторСтроки);
				СтрокиПараметраЗаписи = ПараметрыТаблицШаблонов.НайтиСтроки(СтруктураПоиска);
				Если СтрокиПараметраЗаписи.Количество() > 0 Тогда
					ТекущаяСтрока = СтрокиПараметраЗаписи[0];
					Если ТипЗнч(Запись.Значение) = Тип("СправочникСсылка.СтрокиЭМКНеограниченнойДлины") Тогда
						ТекущаяСтрока.Значение = Запись.Значение.Значение;
					Иначе
						ТекущаяСтрока.Значение = Запись.Значение;
					КонецЕсли;
					
					// Применение форматной строки параметра
					РеквизитыПараметров.Сбросить();
					ОтборРеквизиты.Ссылка = Запись.Параметр;
					Если РеквизитыПараметров.НайтиСледующий(ОтборРеквизиты) Тогда
						ТекущаяСтрока.Представление = РаботаСШаблонамиHTMLКлиентСервер.ПолучитьПредставлениеПараметра(Запись, РеквизитыПараметров.ФорматнаяСтрока);
					Иначе
						ТекущаяСтрока.Представление = Строка(ТекущаяСтрока.Значение);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРисункиКартинок()
	
	РисункиКартинок.Очистить();
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Для Каждого СтрокаШаблона Из Объект.ШаблоныПриема Цикл
			ИндексШаблона = Объект.ШаблоныПриема.Индекс(СтрокаШаблона);
			
			НаборЗаписей = РегистрыСведений.ФайлыРедактируемыхЭлементовШаблонаПриема.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Объект.Ссылка);
			НаборЗаписей.Отбор.ИндексШаблона.Установить(ИндексШаблона);
			НаборЗаписей.Отбор.Тип.Установить(Перечисления.ТипыФайловРедактируемыхЭлементовШаблона.Рисунок);
			НаборЗаписей.Прочитать();
			
			Для Каждого Запись Из НаборЗаписей Цикл
				ДДРисунка = доп_РаботаСФайлами.ПолучитьДвоичныеДанныеФайлаРедактируемогоЭлемента(Запись.ПутьКФайлу, Запись.Файл);
				Если ДДРисунка <> Неопределено Тогда
					НоваяСтрока = РисункиКартинок.Добавить();
					НоваяСтрока.ИдентификаторРисунка = Запись.ИдентификаторЭлемента;
					НоваяСтрока.ИдентификаторСтрокиШаблона = Объект.ШаблоныПриема[ИндексШаблона].ПолучитьИдентификатор();
					НоваяСтрока.АдресРисунка = ПоместитьВоВременноеХранилище(ДДРисунка, УникальныйИдентификатор);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДобавленныеИзображения()
	
	ДобавленныеИзображения.Очистить();
	
	Если Не Объект.Ссылка.Пустая() Тогда
		Для Каждого СтрокаШаблона Из Объект.ШаблоныПриема Цикл
			ИндексШаблона = Объект.ШаблоныПриема.Индекс(СтрокаШаблона);
			
			НаборЗаписей = РегистрыСведений.ФайлыРедактируемыхЭлементовШаблонаПриема.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Объект.Ссылка);
			НаборЗаписей.Отбор.ИндексШаблона.Установить(ИндексШаблона);
			НаборЗаписей.Отбор.Тип.Установить(Перечисления.ТипыФайловРедактируемыхЭлементовШаблона.ДобавленноеИзображение);
			НаборЗаписей.Прочитать();
			
			Для Каждого Запись Из НаборЗаписей Цикл
				ДДИзображения = доп_РаботаСФайлами.ПолучитьДвоичныеДанныеФайлаРедактируемогоЭлемента(Запись.ПутьКФайлу, Запись.Файл);
				Если ДДИзображения <> Неопределено Тогда
					НоваяСтрока = ДобавленныеИзображения.Добавить();
					НоваяСтрока.ИдентификаторИзображения = Запись.ИдентификаторЭлемента;
					НоваяСтрока.ИдентификаторСтрокиШаблона = Объект.ШаблоныПриема[ИндексШаблона].ПолучитьИдентификатор();
					НоваяСтрока.АдресИзображения = ПоместитьВоВременноеХранилище(ДДИзображения, УникальныйИдентификатор);
					НоваяСтрока.Расширение = Запись.Расширение;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастройкаРеквизитовФормыПриСоздании()
	
	ДобавляемыеРеквизиты = Новый Массив;
	ТипЗначенияПараметраHTML = Новый ОписаниеТипов(Метаданные.ПланыВидовХарактеристик.ПараметрыHTML.Тип, , , , Новый КвалификаторыСтроки());
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Значение", ТипЗначенияПараметраHTML, "ТаблицаПараметров",		"Значение"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Значение", ТипЗначенияПараметраHTML, "ПараметрыТаблицШаблонов",	"Значение"));
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Клиент = Объект.Клиент;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДокументИзПараметровФормыПриСоздании()
	
	Если ТипЗнч(Параметры.ШаблоныПриема) = Тип("Массив") Тогда
		Для Каждого ШаблонПриема Из Параметры.ШаблоныПриема Цикл
			Объект.ШаблоныПриема.Добавить().ШаблонПриема = ШаблонПриема;
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(Параметры.Работы) = Тип("Массив") Тогда
		Для Каждого ДанныеРаботы Из Параметры.Работы Цикл
			СтрокаРаботы = Объект.Работы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРаботы, ДанныеРаботы);
			СтрокаРаботы.КлючСтроки = ОбщегоНазначенияКлиентСервер.ПолучитьМаксимумМинимумСвойстваВКоллекции(Объект.Работы, "КлючСтроки", Истина, 0) + 1;
			Если СтрокаРаботы.Количество = 0 Тогда
				СтрокаРаботы.Количество = 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если Объект.Клиент.Пустая() Тогда
		Объект.Клиент = Параметры.Клиент;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДопустимоеКоличествоШаблоновПриСоздании()
	
	РежимОдногоШаблонаОсмотра = Объект.ШаблоныПриема.Количество() <= 1
								И (УправлениеНастройками.ПараметрУчета("ИспользуетсяРежимВводаПриемаПоОдномуШаблону")
									Или УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(,"ИспользуетсяРежимВводаПриемаПоОдномуШаблону"));
	
	Если РежимОдногоШаблонаОсмотра Тогда
		Если Объект.ШаблоныПриема.Количество() = 0 Тогда
			Объект.ШаблоныПриема.Добавить();
		Иначе
			ШаблонОсмотра = Объект.ШаблоныПриема[0].ШаблонПриема;
		КонецЕсли;
		Элементы.ГруппаШаблоныПриема.Видимость = Ложь;
	Иначе
		Элементы.ШаблонОсмотра.Видимость = Ложь;
		Элементы.ПечатьБезПросмотра.Заголовок = НСтр("ru='Печать страницы'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьПечатныеВерсииВХодеЗаписиДокумента(ТекущийОбъект)
	
	// // Еще не актуально
	//Если Не ЗначениеЗаполнено(ТекущийОбъект.Номер) Тогда
	//	ТекущийОбъект.УстановитьНовыйНомер();
	//	Объект.Номер = ТекущийОбъект.Номер;
	//КонецЕсли;
	
	// Сохранения текста шаблона для печати. После записи, чтобы учесть сохраненные планы лечения.
	ДопПараметры = ДокументыПриемаКлиентСервер.ДополнительныеПараметрыФормированияПолногоОсмотра();
	ДопПараметры.ИгнорироватьТекстПечатиИзТЧ	= Истина;
	ДопПараметры.ТекущийОбъектШаблоны			= ТекущийОбъект.ШаблоныПриема;
	ДопПараметры.ДобавлятьШапкуШаблона			= Ложь;
	
	ТекстПечатиПриема = ДокументыПриемаКлиентСервер.СформироватьHTMLТекстПечатиОсмотраПолный(Объект, ТаблицаПараметров, ПараметрыТаблицШаблонов, СписокНазначений, ВерсииШаблонов, ДопПараметры);
	
	Если ТекущийОбъект.Осмотр <> ТекстПечатиПриема Тогда
		#Область Стоматология
		// Убрана проверка на результат анализов
		//Если Не ЭтоПриемРезультатовАнализа Или ТекущийОбъект.Осмотр = "" Тогда
		//	ТекущийОбъект.Осмотр = ТекстПечатиПриема;
		//КонецЕсли;
		ТекущийОбъект.Осмотр = ТекстПечатиПриема;
		#КонецОбласти
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыТабЧастиШаблоны(ПерезаполнятьЗаполненные = Ложь)
	
	ЕстьНеЗаполненныеСтроки = Объект.ШаблоныПриема.НайтиСтроки(Новый Структура("ВидШаблона", Перечисления.ВидыШаблонов.ПустаяСсылка())).Количество() <> 0;
	
	Если ПерезаполнятьЗаполненные Или ЕстьНеЗаполненныеСтроки Тогда
	
		Для Каждого СтрокаШаблона Из Объект.ШаблоныПриема Цикл
			ВерсияШаблона = ПолучитьВерсиюШаблонаСервер(СтрокаШаблона.ШаблонПриема);
			СтрокаШаблона.ТекстШаблона = ВерсияШаблона.ТекстHTML;
			СтрокаШаблона.ВидШаблона = ВерсияШаблона.ВидШаблона;
			СтрокаШаблона.ВидДокумента = ВерсияШаблона.ВидДокумента;
			СтрокаШаблона.НеИспользоватьШапкуШаблона = ВерсияШаблона.НеИспользоватьШапкуШаблона;
			СтрокаШаблона.ПечатаетсяБезПереходаНаНовуюСтраницу = СтрокаШаблона.ШаблонПриема.ПечатаетсяБезПереходаНаНовуюСтраницу;
			СтрокаШаблона.ЭталонныеСтрокиТаблиц = РаботаСШаблонамиHTML.ЭталонныеСтрокиТаблиц(СтрокаШаблона.ТекстШаблона);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыОсмотраПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УстановитьДоступностьКомандОсмотраПоТекущейСтраницеОсмотра();
	УстановитьОтборГотовыхФраз(Ложь);
	ТекущийЭлементПараметраШаблона = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКомандОсмотра(ВидШаблона)
	
	ЭтоВидШаблонаHTML = ВидШаблона = ПредопределенноеЗначение("Перечисление.ВидыШаблонов.HTMLШаблон")
						Или Не ЗначениеЗаполнено(ВидШаблона);
						
	Элементы.КнопкаЗаполнитьПоУмолчанию.Доступность	= ЭтоВидШаблонаHTML;
	Элементы.КнопкаЗаполнитьПоПредыдущимЗначениям.Доступность = ЭтоВидШаблонаHTML;
	Элементы.ОткрытьОбработку.Видимость = Не ИзмененияЗапрещены И Не ЭтоВидШаблонаHTML;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКомандОсмотраПоТекущейСтраницеОсмотра()
	
	ИдентификаторСтрокиШаблона = ИдентификаторСтрокиШаблонаПриема();
	
	Если ИдентификаторСтрокиШаблона <> Неопределено Тогда
		СтрокаШаблона = Объект.ШаблоныПриема.НайтиПоИдентификатору(ИдентификаторСтрокиШаблона);
		УстановитьДоступностьКомандОсмотра(СтрокаШаблона.ВидШаблона);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	Если ТипЗнч(НовыйОбъект) = Тип("ДокументСсылка.Рецепт") Тогда
		ОбновитьКоличествоРецептов();
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоРецептов()
	
	Если Элементы.ГруппаРецепты.Видимость Тогда
	
		КоличествоРецептов = ПолучитьКоличествоРецептовПоПервичномуПриему(?(ЗначениеЗаполнено(Объект.ПервичныйПрием), Объект.ПервичныйПрием, Объект.Ссылка));
		
		Если КоличествоРецептов = 0 Тогда
			Элементы.ОткрытьСписокРецептов.Видимость = Ложь;
		Иначе
			Элементы.ОткрытьСписокРецептов.Видимость = Истина;
			Текст = нСтр("ru='Выписано рецептов: %Количество%'", "ru");
			Элементы.ОткрытьСписокРецептов.Заголовок = СтрЗаменить(Текст, "%Количество%", Строка(КоличествоРецептов));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокРецептов(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли; 
	ФормаРецепта = ПолучитьФорму("Документ.Рецепт.ФормаСписка",,ЭтаФорма);
	Если ЗначениеЗаполнено(Объект.ПервичныйПрием) Тогда
		РаботаСФормамиКлиент.УстановитьОтборСписка("Прием.ПервичныйПрием", Объект.ПервичныйПрием, ФормаРецепта.Список);
	Иначе
		РаботаСФормамиКлиент.УстановитьОтборСписка("Прием", Объект.Ссылка, ФормаРецепта.Список);
	КонецЕсли; 
	
	ФормаРецепта.Открыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоРецептовПоПервичномуПриему(Прием, КомандаСпискаРецептов = Неопределено)
	
	КоличествоРецептов = Документы.Рецепт.ПолучитьКоличествоРецептовПриема(Прием);
	
	Если КомандаСпискаРецептов <> Неопределено Тогда 
		Если КоличествоРецептов = 0 Тогда
			КомандаСпискаРецептов.Видимость = Ложь;
		Иначе
			КомандаСпискаРецептов.Видимость = Истина;
			Текст = нСтр("ru='Выписано рецептов: %Количество%'", "ru");
			КомандаСпискаРецептов.Заголовок = СтрЗаменить(Текст, "%Количество%", Строка(КоличествоРецептов));
		КонецЕсли;
	КонецЕсли;
	
	Возврат КоличествоРецептов;
	
КонецФункции

&НаКлиенте
Процедура ВыписатьРецепт(Команда)
	
	Если Не РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеНоменклатуры = Новый Массив;
	
	Для Каждого СтрокаГруппы Из СписокНазначений.ПолучитьЭлементы() Цикл
		Если Ложь Тогда// СтрокаГруппы.ВидНазначения = ПредопределенноеЗначение("Перечисление.ВидыНазначений.Медикаменты") Тогда  //+Стоматология
			ОписаниеНоменклатуры.Добавить(ОписаниеНоменклатурыДляВводаРецепта(СтрокаГруппы));
		КонецЕсли;
	КонецЦикла;
	
	Если ОписаниеНоменклатуры.Количество() > 1 Тогда
		ВыписатьРецептПоПараметрам(ОписаниеНоменклатуры, Истина);
	ИначеЕсли ОписаниеНоменклатуры.Количество() = 1 Тогда
		ВыписатьРецептПоПараметрам(ОписаниеНоменклатуры[0]);
	Иначе
		ВыписатьРецептПоПараметрам(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыписатьРецептПоНазначению(Команда)
	
	Если Не РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтаФорма) Тогда
		Возврат;
	КонецЕсли;
	
	МассивНоменклатуры = Новый Массив;
	
	ВыделенныеСтроки = Элементы.Назначения.ВыделенныеСтроки;
	Для Каждого ВыделеннаяСтрока Из Элементы.Назначения.ВыделенныеСтроки Цикл
		
		СтрокаМедикамента = СписокНазначений.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		Если Ложь //СтрокаМедикамента.ВидНазначения = ПредопределенноеЗначение("Перечисление.ВидыНазначений.Медикаменты") //+Стоматология
			И ЗначениеЗаполнено(СтрокаМедикамента.Назначение)
			И (ТипЗнч(СтрокаМедикамента.Назначение) = Тип("СправочникСсылка.Номенклатура")
				Или ТипЗнч(СтрокаМедикамента.Назначение) = Тип("СправочникСсылка.СправочникМеждународныхНепатентованныхНаименований")
				Или ТипЗнч(СтрокаМедикамента.Назначение) = Тип("Строка"))
		Тогда
			МассивНоменклатуры.Добавить(ОписаниеНоменклатурыДляВводаРецепта(СтрокаМедикамента));

		КонецЕсли;
	КонецЦикла;
	
	Если МассивНоменклатуры.Количество() > 1 Тогда 
		ВыписатьРецептПоПараметрам(МассивНоменклатуры, Истина);
	ИначеЕсли МассивНоменклатуры.Количество() = 1 Тогда
		ВыписатьРецептПоПараметрам(МассивНоменклатуры[0]);	
	Иначе
		ВыписатьРецептПоПараметрам(Неопределено);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьШапку(Команда)
	Элементы.ГруппаШапка.Видимость = Не Элементы.ГруппаШапка.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПустыеСтрокиШаблонов()
	
	СтрокиШаблоновКУдалению = Новый Массив;
	Для Каждого СтрокаШаблона Из Объект.ШаблоныПриема Цикл
		Если СтрокаШаблона.ШаблонПриема.Пустая() Тогда
			СтрокиШаблоновКУдалению.Добавить(СтрокаШаблона);
		ИначеЕсли СтрокаШаблона.ВидШаблона <> ПредопределенноеЗначение("Перечисление.ВидыШаблонов.Обработка") Тогда
			// СтрокаШаблона.ТекстДляПечати = "";
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаШаблона Из СтрокиШаблоновКУдалению Цикл
		Объект.ШаблоныПриема.Удалить(СтрокаШаблона);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПослеЗаписи()
	
	Если Открыта() Тогда
		// Компенсируем очищение платфомой доп. колонок табл. части Объекта при автосохранении при вводе на основании.
		Для Каждого СтрокаШаблона Из Объект.ШаблоныПриема Цикл
			Если Не ЗначениеЗаполнено(СтрокаШаблона.ВидШаблона) Тогда
				ШаблонПриемаПриИзменении(СтрокаШаблона);
			КонецЕсли;
		КонецЦикла;

		#Область Стоматология
		ИнициализироватьЗубнуюКарту();
		#КонецОбласти
	КонецЕсли;
	
КонецПроцедуры

#Область ЭлектронныеПодписи

#Область ЭлектронныеПодписиКоманды

&НаКлиенте
Процедура ПодписатьВсе(Команда)
	
	УбратьФокусСПоляВводаНаТело();
	ЭЦП_УМЦ_Клиент.ПерейтиКПодписаниюЭМД(ЭтотОбъект, , , ТребуетсяПодписаниеРЭМД());
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКПодписаниюЭМД(Команда)
	
	УбратьФокусСПоляВводаНаТело();
	ЭЦП_УМЦ_Клиент.ПерейтиКПодписаниюЭМД(ЭтотОбъект, Истина, , ТребуетсяПодписаниеРЭМД());
	
КонецПроцедуры

&НаКлиенте
Процедура РЭМДПроверитьДанныеПередПодписанием(Команда)
	
	УбратьФокусСПоляВводаНаТело();
	ИнтеграцияЕГИСЗ_РЭМДКлиент.ВыполнитьДействие(ЭтотОбъект, "ПроверитьДанныеПередПодписанием");
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписиСлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокПодписей()
	
	доп_СертификатыЭЦП.ЗаполнитьСписокПодписей(Объект.Ссылка, УникальныйИдентификатор, Элементы.ГруппаЭП, ЭлектронныеПодписи,, СводкаHTML);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОсмотрПоЭП()
	
	ВерсияДляПечати = Истина;
	Элементы.КнопкаВерсияДляПечати.Пометка = ВерсияДляПечати;
	ПреобразоватьОсмотрВВерсиюДляПечати();
	Элементы.ГруппаПечатьВсегоОсмотра.Видимость = Не РежимОдногоШаблонаОсмотра И ВерсияДляПечати И КоличествоЗаполненныхШаблоновПриема(Объект.ШаблоныПриема) > 1;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПослеПодписания()
	
	ОбновитьСписокПодписей();
	УстановитьДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗавершенияПроверкиПодписи(Результат, ДополнительныеПараметры) Экспорт
	
	ПрочитатьУстановитьДоступностьПолейЗаполнитьПодписи();
	СформироватьОсмотрПоЭП();
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписиУправлениеДоступностьюПолей

&НаСервере
Процедура ПрочитатьУстановитьДоступностьПолейЗаполнитьПодписи()
	
	Прочитать();
	ЗаполнитьДополнительныеРеквизитыТабЧастиШаблоны();
	УстановитьДоступностьВидимость();
	ОбновитьСписокПодписей();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

&НаСервере
Процедура УстановитьДоступностьВидимость()
	
	Элементы.ГруппаЭП.Видимость = ИспользуютсяЭП И (Объект.ПодписанЭП Или ШаблоныПриемаТребуютПодписания());
	
	ОткрытАвтором = (Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь) И ЗначениеЗаполнено(Объект.Ответственный);
	ОтсутствуютПраваНаИзменение = Не ПравоДоступа("Изменение", Объект.Ссылка.Метаданные());
	
	ИзмененияЗапрещены = ОтсутствуютПраваНаИзменение Или (ИспользуютсяЭП И Объект.ПодписанЭП); // Или Не ОткрытАвтором);
	
	РаботаСФормамиКлиентСервер.УстановитьДоступностьЭлементаФормы(Элементы, "СтраницаОсмотр",			Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьДоступностьЭлементаФормы(Элементы, "СтраницаДиагнозы",			Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьДоступностьЭлементаФормы(Элементы, "СтраницаПланЛечения",		Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьДоступностьЭлементаФормы(Элементы, "Врач",						Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьДоступностьЭлементаФормы(Элементы, "Клиент",					Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьДоступностьЭлементаФормы(Элементы, "МедицинскаяКарта",			Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьДоступностьЭлементаФормы(Элементы, "Дата",						Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьДоступностьЭлементаФормы(Элементы, "Подбор",					Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьДоступностьЭлементаФормы(Элементы, "НазначенияКнопкиДобавить",	Не ИзмененияЗапрещены);
	
	РаботаСФормамиКлиентСервер.УстановитьПолеЭлементаФормы(Элементы, "ПодменюЗаполнитьОсмотр",							"Доступность", Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьПолеЭлементаФормы(Элементы, "ОткрытьОбработку",								"Доступность", Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьПолеЭлементаФормы(Элементы, "КнопкаВерсияДляПечати",							"Доступность", Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьПолеЭлементаФормы(Элементы, "ДиагнозыЗаполнитьИзДругогоПриема",				"Доступность", Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьПолеЭлементаФормы(Элементы, "ШаблоныПриемаВыбратьШаблоныИзСпециализацийВрача",	"Доступность", Не ИзмененияЗапрещены);
	РаботаСФормамиКлиентСервер.УстановитьПолеЭлементаФормы(Элементы, "КнопкаФилиал",									"Доступность", Не ИзмененияЗапрещены);
	
	УстановитьДоступностьПодчиненныхКнопок(Элементы.Назначения.КоманднаяПанель,						ИзмененияЗапрещены);
	УстановитьДоступностьПодчиненныхКнопок(Элементы.Назначения.КонтекстноеМеню,						ИзмененияЗапрещены);
	УстановитьДоступностьПодчиненныхКнопок(Элементы.СтандартыЛечения.КоманднаяПанель,				ИзмененияЗапрещены);
	УстановитьДоступностьПодчиненныхКнопок(Элементы.ИспользуемыеСтандартыЛечения.КоманднаяПанель,	ИзмененияЗапрещены);
	УстановитьДоступностьПодчиненныхКнопок(Элементы.Работы.КоманднаяПанель,							ИзмененияЗапрещены);
	
	Если ОтсутствуютПраваНаИзменение Тогда
		ИсключаемыеЭлементы = Новый Массив;
		ИсключаемыеЭлементы.Добавить(Элементы.ПерейтиКПодписаниюЭМД);
		УстановитьДоступностьПодчиненныхКнопок(Элементы.ГруппаКомандЭП, Истина, ИсключаемыеЭлементы);
		РаботаСФормамиКлиентСервер.УстановитьДоступностьЭлементаФормы(Элементы, "Закрыт", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ШаблоныПриемаТребуютПодписания()
	
	Для Каждого СтрокаШаблона Из Объект.ШаблоныПриема Цикл
		СтрокиВерсии = ВерсииШаблонов.НайтиСтроки(Новый Структура("ШаблонПриема", СтрокаШаблона.ШаблонПриема));
		
		Если СтрокиВерсии.Количество() > 0 Тогда
			ВерсияШаблона = СтрокиВерсии[0].ВерсияШаблона;
		Иначе
			ВерсияШаблона = СтрокаШаблона.ШаблонПриема;
		КонецЕсли;
		
		Если ИспользуетсяРЭМД
			И ЗначениеЗаполнено(ВерсияШаблона.ВидДокумента)
			Или ВерсияШаблона.РолиПодписей.Количество() > 0
		Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьПодчиненныхКнопок(Родитель, ИзмененияЗапрещены, ИсключаемыеЭлементы = Неопределено)
	
	Для Каждого ПодчиненныйЭлемент Из Родитель.ПодчиненныеЭлементы Цикл
		Если ИсключаемыеЭлементы <> Неопределено
			И ИсключаемыеЭлементы.Найти(ПодчиненныйЭлемент) <> Неопределено
		Тогда
			Продолжить;
		КонецЕсли;
		ПодчиненныйЭлемент.Доступность = Не ИзмененияЗапрещены;
	КонецЦикла;
	
КонецПроцедуры

// Добавляет в таблицу версий новую версию по шаблону, либо обновляет существующую возвращает добавленную версию.
&НаКлиенте
Функция ДополнитьТаблицуВерсийПоШаблону(Шаблон, Дата = Неопределено)
	
	Если Дата = Неопределено Тогда
		Дата = Объект.Дата;
	КонецЕсли;
	
	СтрокиВерсии = ВерсииШаблонов.НайтиСтроки(Новый Структура("ШаблонПриема", Шаблон));
	
	Если ИспользуетсяВерсионирование Тогда
		Версия = ВерсионированиеШаблонов.ПолучитьВерсиюШаблона(Шаблон, Дата);
	Иначе
		Версия = Шаблон;
	КонецЕсли;
	
	Если СтрокиВерсии.Количество() > 0 Тогда
		СтрокиВерсии[0].ВерсияШаблона = Версия;	
	Иначе
		НоваяСтрока = ВерсииШаблонов.Добавить();
		НоваяСтрока.ШаблонПриема = Шаблон;
		НоваяСтрока.ВерсияШаблона = Версия;
	КонецЕсли;
	
	Возврат Версия;
	
КонецФункции

&НаСервере
Функция ДополнитьТаблицуВерсийПоШаблонуСервер(Шаблон, Дата = Неопределено)
	
	Если Дата = Неопределено Тогда
		Дата = Объект.Дата;
	КонецЕсли;
	
	СтрокиВерсии = ВерсииШаблонов.НайтиСтроки(Новый Структура("ШаблонПриема", Шаблон));
	
	Если ИспользуетсяВерсионирование Тогда
		Версия = ВерсионированиеШаблонов.ПолучитьВерсиюШаблона(Шаблон, Дата);
	Иначе
		Версия = Шаблон;
	КонецЕсли;
	
	Если СтрокиВерсии.Количество() > 0 Тогда
		СтрокиВерсии[0].ВерсияШаблона = Версия;	
	Иначе
		НоваяСтрока = ВерсииШаблонов.Добавить();
		НоваяСтрока.ШаблонПриема = Шаблон;
		НоваяСтрока.ВерсияШаблона = Версия;
	КонецЕсли;
	
	Возврат Версия;
	
КонецФункции

// Возвращает версию по шаблону, в случае отсутствия - добавляет.
&НаКлиенте
Функция ПолучитьВерсиюШаблона(Шаблон)
	
	СтрокиВерсии = ВерсииШаблонов.НайтиСтроки(Новый Структура("ШаблонПриема", Шаблон));
	Если СтрокиВерсии.Количество() > 0 Тогда
		Возврат СтрокиВерсии[0].ВерсияШаблона;
	Иначе
		Возврат ДополнитьТаблицуВерсийПоШаблону(Шаблон);
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьВерсиюШаблонаСервер(Шаблон)
	
	СтрокиВерсии = ВерсииШаблонов.НайтиСтроки(Новый Структура("ШаблонПриема", Шаблон));
	Если СтрокиВерсии.Количество() > 0 Тогда
		Возврат СтрокиВерсии[0].ВерсияШаблона;
	Иначе
		Возврат ДополнитьТаблицуВерсийПоШаблонуСервер(Шаблон);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановитьЗнакТочки(Команда)
	Элементы.ЗнакТочка.Пометка = Не Элементы.ЗнакТочка.Пометка;
	Элементы.ЗнакЗапятая.Пометка=Ложь;
	Элементы.ЗнакТочкаСЗапятой.Пометка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗнакЗапятой(Команда)
	Элементы.ЗнакЗапятая.Пометка = Не Элементы.ЗнакЗапятая.Пометка;
	Элементы.ЗнакТочка.Пометка=Ложь;
	Элементы.ЗнакТочкаСЗапятой.Пометка=Ложь;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗнакТочкиСЗапятой(Команда)
	Элементы.ЗнакТочкаСЗапятой.Пометка = Не Элементы.ЗнакТочкаСЗапятой.Пометка;
	Элементы.ЗнакЗапятая.Пометка=Ложь;
	Элементы.ЗнакТочка.Пометка=Ложь;	
КонецПроцедуры

&НаКлиенте
Процедура ГотовыеФразыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИдентификаторСтрокиШаблона = ИдентификаторСтрокиШаблонаПриема();
	Если ИдентификаторСтрокиШаблона = Неопределено
		Или ТекущийЭлементПараметраШаблона = Неопределено
		Или ТекущийЭлементПараметраШаблона.ЭлементHTML = Неопределено
		Или ИдентификаторСтрокиШаблона <> ТекущийЭлементПараметраШаблона.ИдентификаторСтрокиШаблона
	Тогда
		УстановитьОтборГотовыхФраз(Ложь);
		Возврат;
	КонецЕсли;
	
	ДокументHTML = Элементы[ТекущийЭлементПараметраШаблона.ИмяПоляШаблона].Документ;
	ЭлементHTML = ПолучитьТекущийЭлементШаблонаHTML(ТекущийЭлементПараметраШаблона.ЭлементHTML, ТекущийЭлементПараметраШаблона.ИмяПоляШаблона);
	Если ЭлементHTML = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТегЭлемента = ВРег(ЭлементHTML.TagName);
	
	ТекстФразы = ПолучитьТекстФразы(ВыбраннаяСтрока);
	
	ИсходныйТекст = ЭлементHTML.value;
	
	Если Элементы.ЗнакЗапятая.Пометка Тогда
		Если ЗначениеЗаполнено(ИсходныйТекст) Тогда
			ТекстФразы = ", " + СокрЛП(ТекстФразы);
		Иначе
			ТекстФразы = СокрЛП(ТекстФразы);
		КонецЕсли;
	ИначеЕсли Элементы.ЗнакТочкаСЗапятой.Пометка Тогда
		ТекстФразы = " " + СокрЛП(ТекстФразы) + ";";
	ИначеЕсли Элементы.ЗнакТочка.Пометка Тогда
		ТекстФразы = " " + СокрЛП(ТекстФразы) + ".";
	КонецЕсли;
	
	Если РаботаСHTMLКлиентСервер.ЭтоВнешнийОбъект(ЭлементHTML) Тогда
		ВставитьТекстВTextArea_selectionStart(ЭлементHTML, ТекстФразы);
	Иначе
		Попытка
			ВставитьТекстВTextArea_Range(ДокументHTML, ЭлементHTML, ТекстФразы);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Попытка
		РаботаСШаблонамиHTMLКлиент.УстановитьПризнакИзмененияПоляВвода(ЭлементHTML);
		РаботаСШаблонамиHTMLКлиент.ОбработатьИзмененныеПоляВвода(ЭлементHTML.ownerDocument, ЭтотОбъект, ТекущийЭлементПараметраШаблона.ИмяПоляШаблона, ИдентификаторСтрокиШаблона, ТаблицаПараметров, КешЗначенийВыбора, Объект);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьТекстВTextArea_selectionStart(ЭлементHTML, Текст)
	
	ТекЗначение = ЭлементHTML.value;
	ДлинаЗначения = СтрДлина(ТекЗначение);
	ЛеваяЧасть = Лев(ТекЗначение, ЭлементHTML.selectionStart) + Текст;
	ПраваяЧасть = Прав(ТекЗначение, ДлинаЗначения - ЭлементHTML.selectionEnd);
	ЭлементHTML.value = ЛеваяЧасть + ПраваяЧасть;
	ЭлементHTML.selectionStart = СтрДлина(ЛеваяЧасть);
	ЭлементHTML.selectionEnd = ЭлементHTML.selectionStart;
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьТекстВTextArea_Range(ДокументHTML, ЭлементHTML, Текст)
	
	Если НРег(ЭлементHTML.type) = "text" 
		Или НРег(ЭлементHTML.type) = "none"
		Или НРег(ЭлементHTML.type) = "textarea"
		Или НРег(ЭлементHTML.type) = "input"
	Тогда 
		Выделение = ЭлементHTML;
		Выделение.value = Выделение.value + Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLДокументаВставить(Команда)
	
	мсСтр = СтраницыШаблоновПриема.НайтиСтроки(Новый Структура("ИмяСтраницыФормы", Элементы.ГруппаСтраницыОсмотра.ТекущаяСтраница.Имя));
	Если мсСтр.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПоляШаблона = мсСтр[0].ИмяПоляДокумента;
	ДокументHTML = Элементы[ИмяПоляШаблона].Документ;
	ЭлементHTML = ДокументHTML.activeElement;
	
	ТегЭлемента = ВРег(ЭлементHTML.TagName);
	
	ЭлементHTML = РаботаСШаблонамиHTMLКлиентСервер.НайтиЭлементСЗаполненнымIDВышеПоИерархии(ЭлементHTML);
	Если ЭлементHTML = Неопределено Или (ТегЭлемента <> "TEXTAREA" И ТегЭлемента <> "INPUT") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДокументHTML.queryCommandSupported("paste") Тогда 
		ДокументHTML.execCommand("paste");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLДокументаОчистить(Команда)
	
	Если ДанныеЭлементаHTMLДляКонтекстногоМеню = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	мсСтрокаПараметра = ТаблицаПараметров.НайтиСтроки(Новый Структура("СтрокаУидПараметра, ИдентификаторСтрокиШаблона", ДанныеЭлементаHTMLДляКонтекстногоМеню.id, ИдентификаторСтрокиШаблонаПриема()));
	Если мсСтрокаПараметра.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыПоУИД = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(Элементы[ДанныеЭлементаHTMLДляКонтекстногоМеню.ИмяЭлемента].Документ, ДанныеЭлементаHTMLДляКонтекстногоМеню.id);
	Если ЭлементыПоУИД.length < ДанныеЭлементаHTMLДляКонтекстногоМеню.НомерЭлемента + 1 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементHTMLДляКонтекстногоМеню = ЭлементыПоУИД[ДанныеЭлементаHTMLДляКонтекстногоМеню.НомерЭлемента];
	РаботаСШаблонамиHTMLКлиент.ОчиститьЗначениеПараметраHTMLИнтерактивно(ЭтаФорма, ДанныеЭлементаHTMLДляКонтекстногоМеню.ИмяЭлемента, ЭлементHTMLДляКонтекстногоМеню, мсСтрокаПараметра[0], КешЗначенийВыбора, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLДокументаЗаполнитьПоУмолчанию(Команда)
	
	Если ДанныеЭлементаHTMLДляКонтекстногоМеню = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтрокиШаблонаПриема = ИдентификаторСтрокиШаблонаПриема();
	
	мсСтрокаПараметра = ТаблицаПараметров.НайтиСтроки(Новый Структура("СтрокаУидПараметра, ИдентификаторСтрокиШаблона", ДанныеЭлементаHTMLДляКонтекстногоМеню.id, ИдентификаторСтрокиШаблонаПриема));
	Если мсСтрокаПараметра.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыПоУИД = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(Элементы[ДанныеЭлементаHTMLДляКонтекстногоМеню.ИмяЭлемента].Документ, ДанныеЭлементаHTMLДляКонтекстногоМеню.id);
	Если ЭлементыПоУИД.length < ДанныеЭлементаHTMLДляКонтекстногоМеню.НомерЭлемента + 1 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементHTMLДляКонтекстногоМеню = ЭлементыПоУИД[ДанныеЭлементаHTMLДляКонтекстногоМеню.НомерЭлемента];
	
	ЗначенияПоУмолчанию = РаботаСШаблонамиHTML.ПолучитьЗначенияПараметровПоУмолчанию(ТаблицаПараметров, КешЗависимыхПараметров, Объект, мсСтрокаПараметра[0].Параметр, ИдентификаторСтрокиШаблонаПриема,, Истина);
	Если ЗначенияПоУмолчанию.Количество() > 0 Тогда
		РаботаСШаблонамиHTMLКлиентСервер.ОбновитьЗначенияТаблицыПараметров(ТаблицаПараметров, ЗначенияПоУмолчанию, ИдентификаторСтрокиШаблонаПриема);
		Для Каждого РассчитанноеЗначение Из ЗначенияПоУмолчанию Цикл
			РаботаСШаблонамиHTMLКлиент.УстановитьЗначениеПредставлениеПараметраHTMLИнтерактивно(РассчитанноеЗначение, ЭлементHTMLДляКонтекстногоМеню.ownerDocument, КешЗначенийВыбора);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстФразы(Ссылка)
	
	ТекстФразы = "";
	
	Пока ЗначениеЗаполнено(Ссылка) Цикл
		
		Если ЗначениеЗаполнено(Ссылка.Текст) Тогда
			ТекстФразы = Ссылка.Текст + " " + ТекстФразы;
		КонецЕсли;
		
		Ссылка = Ссылка.Родитель;
			
	КонецЦикла; 
	
	Возврат ТекстФразы;
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтборГотовыхФраз(ИспользоватьГФ = Неопределено, Параметр = Неопределено)
	
	ИспользоватьГФПред = ГотовыеФразы.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИспользоватьГотовыеФразы")).Значение;	
	Если ИспользоватьГФ <> Неопределено И ИспользоватьГФПред <> ИспользоватьГФ Тогда 
		ГотовыеФразы.Параметры.УстановитьЗначениеПараметра("ИспользоватьГотовыеФразы", ИспользоватьГФ);
	КонецЕсли;
	
	ПараметрПред = ГотовыеФразы.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Параметр")).Значение;
	Если Параметр <> Неопределено И ПараметрПред <> Параметр Тогда
		ГотовыеФразы.Параметры.УстановитьЗначениеПараметра("Параметр", Параметр);
	КонецЕсли;
	
	ТолькоЛичныеПараметр = ГотовыеФразы.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТолькоЛичные"));
	Если Элементы.ГотовыеФразыГотовыеФразыТолькоЛичные.Пометка <> ТолькоЛичныеПараметр.Значение Или Не ТолькоЛичныеПараметр.Использование Тогда 
		ГотовыеФразы.Параметры.УстановитьЗначениеПараметра("ТолькоЛичные", Элементы.ГотовыеФразыГотовыеФразыТолькоЛичные.Пометка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГотовыеФразыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	Параметр = ГотовыеФразы.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Параметр")).Значение;
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения",Новый Структура("Параметр, Родитель", Параметр, Элемент.ТекущийРодитель));
	ОткрытьФорму("Справочник.СоставныеФразы.ФормаОбъекта", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнитьТекстИзГФ(Команда)
	
	мсСтр = СтраницыШаблоновПриема.НайтиСтроки(Новый Структура("ИмяСтраницыФормы", Элементы.ГруппаСтраницыОсмотра.ТекущаяСтраница.Имя));
	Если мсСтр.Количество() > 0 Тогда
		ПолеHTMLДокумента = Элементы[мсСтр[0].ИмяПоляДокумента];
		ДокументHTML = ПолеHTMLДокумента.Документ;
		ЭлементHTML = ДокументHTML.activeElement;
		
		ЭлементHTML = РаботаСШаблонамиHTMLКлиентСервер.НайтиЭлементСЗаполненнымIDВышеПоИерархии(ЭлементHTML);
		Если ЭлементHTML = Неопределено Тогда
			УстановитьОтборГотовыхФраз(Ложь);
			Возврат;
		КонецЕсли;
		
		мсСтрокаПараметра = ТаблицаПараметров.НайтиСтроки(Новый Структура("СтрокаУидПараметра, ИдентификаторСтрокиШаблона", ЭлементHTML.id, мсСтр[0].ИдентификаторСтрокиШаблона));
		Если мсСтрокаПараметра.Количество() > 0 Тогда
			СтрокаПараметра = мсСтрокаПараметра[0];
			КонПозиция = ЭлементHTML.selectionStart;
			ПолныйТекст = ЭлементHTML.value;
			Если КонПозиция > 0 Тогда
				НачПозиция = НайтиПозициюБлижайшегоСловаСКонца(Лев(ПолныйТекст, КонПозиция));
				ТекстПоиска = Сред(ПолныйТекст, НачПозиция, КонПозиция - НачПозиция + 1);
				ДлинаТекстаПоиска = СтрДлина(ТекстПоиска);
				
				Пользователь = ГотовыеФразы.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Пользователь")).Значение;
				Параметр = ГотовыеФразы.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Параметр")).Значение;
				мсГотовыеФразы = НайтиГотовыеФразыПоТексту(ТекстПоиска, Пользователь, Параметр);
				Если мсГотовыеФразы.Количество() > 0 Тогда 
					Если мсГотовыеФразы.Количество() = 1 Тогда 
						ВыбранноеЗначение = мсГотовыеФразы[0].Текст;
					Иначе	
						СписокВыбора = Новый СписокЗначений;
						Для Каждого элГотоваяФраза Из мсГотовыеФразы Цикл
							СписокВыбора.Добавить(элГотоваяФраза.Текст, элГотоваяФраза.Наименование);
						КонецЦикла;
						ВыбранноеЗначение = ВыбратьИзСписка(СписокВыбора, ПолеHTMLДокумента);
						Если ВыбранноеЗначение <> Неопределено Тогда
							ВыбранноеЗначение = ВыбранноеЗначение.Значение;
						КонецЕсли;
					КонецЕсли;
					
					Если ВыбранноеЗначение <> Неопределено Тогда
						
						ЭлементHTML.value = Лев(ПолныйТекст, КонПозиция)
										  + Прав(ВыбранноеЗначение, СтрДлина(ВыбранноеЗначение) - ДлинаТекстаПоиска)
										  + Прав(ПолныйТекст, СтрДлина(ПолныйТекст) - КонПозиция);
						СтрокаПараметра.Значение = ЭлементHTML.value;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиПозициюБлижайшегоСловаСКонца(Знач Текст)
	
	ШаблонСимвОкончанияСлова = ",.; " + Символы.ПС + Символы.НПП;
	Сч = СтрДлина(Текст);
	Пока Сч > 0 Цикл
		ТекСимвол = Сред(Текст, Сч, 1);
		Если Найти(ШаблонСимвОкончанияСлова, ТекСимвол) Тогда
			Сч = Сч + 1;
			Прервать;
		КонецЕсли;
		Сч = Сч - 1;
	КонецЦикла;
	
	Возврат Сч;
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиГотовыеФразыПоТексту(Текст, Пользователь, Параметр)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СправочникСоставныеФразы.Ссылка,
	|	СправочникСоставныеФразы.ВерсияДанных,
	|	СправочникСоставныеФразы.ПометкаУдаления,
	|	СправочникСоставныеФразы.Предопределенный,
	|	СправочникСоставныеФразы.Родитель,
	|	СправочникСоставныеФразы.Наименование,
	|	СправочникСоставныеФразы.Текст,
	|	СправочникСоставныеФразы.Пользователь,
	|	СправочникСоставныеФразы.Параметр
	|ИЗ
	|	Справочник.СоставныеФразы КАК СправочникСоставныеФразы
	|ГДЕ
	|	(СправочникСоставныеФразы.Параметр = &Параметр
	|			ИЛИ СправочникСоставныеФразы.Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПараметрыHTML.ПустаяСсылка))
	|	И (СправочникСоставныеФразы.Пользователь = &Пользователь
	|			ИЛИ СправочникСоставныеФразы.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка))
	|	И СправочникСоставныеФразы.Наименование ПОДОБНО &ТекстПоиска";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Параметр", Параметр);
	Запрос.УстановитьПараметр("ТекстПоиска", Текст + "%");
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(Запрос.Выполнить().Выгрузить());	
	
КонецФункции

&НаСервере
Процедура НастроитьВидимостьГотовыхФраз()
	
	ТолькоЛичные = ОбщегоНазначенияСервер.НастройкиИзХранилища("Прием", "ГотовыеФразыТолькоЛичные");
	ТолькоЛичные = ?(ТолькоЛичные = Неопределено, Ложь, ТолькоЛичные);
	СкрытьГотовыеФразы = ОбщегоНазначенияСервер.НастройкиИзХранилища("Прием", "ГотовыеФразыСкрыть");
	СкрытьГотовыеФразы = ?(СкрытьГотовыеФразы = Неопределено, Ложь, СкрытьГотовыеФразы);
		
	Элементы.ГотовыеФразыГотовыеФразыТолькоЛичные.Пометка = ТолькоЛичные;
	Элементы.ГотовыеФразыСкрыть.Пометка = СкрытьГотовыеФразы;
	Элементы.ГруппаГотовыеФразы.Видимость = Не СкрытьГотовыеФразы;
	
КонецПроцедуры

&НаКлиенте
Процедура ГотовыеФразыТолькоЛичные(Команда)
	
	Элементы.ГотовыеФразыГотовыеФразыТолькоЛичные.Пометка = Не Элементы.ГотовыеФразыГотовыеФразыТолькоЛичные.Пометка;
	ОбщегоНазначенияСервер.НастройкиВХранилище("Прием", "ГотовыеФразыТолькоЛичные", Элементы.ГотовыеФразыГотовыеФразыТолькоЛичные.Пометка);
	УстановитьОтборГотовыхФраз();
	
КонецПроцедуры

&НаКлиенте
Процедура ГотовыеФразыСкрыть(Команда)
	
	Элементы.ГотовыеФразыСкрыть.Пометка = Не Элементы.ГотовыеФразыСкрыть.Пометка;
	ОбщегоНазначенияСервер.НастройкиВХранилище("Прием", "ГотовыеФразыСкрыть", Элементы.ГотовыеФразыСкрыть.Пометка);
	Элементы.ГруппаГотовыеФразы.Видимость = Не Элементы.ГотовыеФразыСкрыть.Пометка;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьШаблоныДополненияПриемаПоАнализам(ШаблоныПриема, РаботыПриема, ИспользуетсяВерсионированиеШаблоновПриема, Дата)
	
	Результат = Новый Структура("НедостающиеШаблоны, ВерсииШаблонов");
	НедостающиеШаблоны = Новый Массив;
	ВерсииШаблонов = Новый Соответствие;
	
	ТаблицаРаботыПриема = Новый ТаблицаЗначений;
	ТаблицаРаботыПриема.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Для Каждого Номенклатура Из РаботыПриема Цикл
		ТаблицаРаботыПриема.Добавить().Номенклатура = Номенклатура;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таб", ТаблицаРаботыПриема);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таб.Номенклатура
	|ПОМЕСТИТЬ ТабНом
	|ИЗ
	|	&Таб КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СправочникНоменклатура.ИндивидуальныйШаблонОсмотра КАК ШаблонПриема,
	|	КОЛИЧЕСТВО(ТабНом.Номенклатура) КАК Количество
	|ПОМЕСТИТЬ ШаблоныРабот
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТабНом КАК ТабНом
	|		ПО СправочникНоменклатура.Ссылка = ТабНом.Номенклатура
	|ГДЕ
	|	СправочникНоменклатура.ИндивидуальныйШаблонОсмотра <> ЗНАЧЕНИЕ(Справочник.ШаблоныHTML.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	СправочникНоменклатура.ИндивидуальныйШаблонОсмотра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШаблоныРабот.ШаблонПриема,
	|	ШаблоныРабот.ШаблонПриема.ТекстHTML КАК ТекстШаблона,
	|	ШаблоныРабот.ШаблонПриема.ВидШаблона КАК ВидШаблона,
	|	ШаблоныРабот.Количество
	|ИЗ
	|	ШаблоныРабот КАК ШаблоныРабот"
	;
	ШаблоныРабот = Запрос.Выполнить().Выгрузить();
	
	Для Каждого ШаблонПриема Из ШаблоныПриема Цикл
		
		СтрШаблон = ШаблоныРабот.Найти(ШаблонПриема, "ШаблонПриема");
		Если СтрШаблон <> Неопределено Тогда
			СтрШаблон.Количество = СтрШаблон.Количество - 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ШаблоныРабот Цикл
		Если СтрокаТаблицы.Количество > 0 Тогда
			Для Сч = 1 По СтрокаТаблицы.Количество Цикл
				
				СтруктураСтроки = Новый Структура("ШаблонПриема,ТекстШаблона, ВидШаблона");
				
				Если ИспользуетсяВерсионированиеШаблоновПриема Тогда
					Версия = ВерсионированиеШаблонов.ПолучитьВерсиюШаблона(СтрокаТаблицы.ШаблонПриема, Дата);
				Иначе
					Версия = СтрокаТаблицы.ШаблонПриема;
				КонецЕсли;
				
				ВерсииШаблонов.Вставить(СтрокаТаблицы.ШаблонПриема, Версия);
				
				СтруктураСтроки = Новый Структура("ШаблонПриема,ТекстШаблона, ВидШаблона",
												  Версия, СтрокаТаблицы.ТекстШаблона, СтрокаТаблицы.ВидШаблона);
				НедостающиеШаблоны.Добавить(СтруктураСтроки);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Результат.НедостающиеШаблоны = НедостающиеШаблоны;
	Результат.ВерсииШаблонов	 = ВерсииШаблонов;
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:
				|""%ОписаниеОшибки%"".'" );
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПланЛечения()
	
	ЗаполнитьПланЛеченияСтоматологияКлиент();
	
КонецПроцедуры

// Для вызова в серверном контексте, например, ПриСозданииНаСервере()
&НаСервере
Процедура ЗаполнитьПланЛеченияНаСервере()
	
	МедицинскаяДеятельность.ЗагрузитьПланЛеченияСтоматология(СписокНазначений, Объект.ПервичныйПрием);
	ПересчитатьСуммыПланаЛечения(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПланЛеченияПоПервичномуПриемуСУчетомВведенных()
	
	// Список строк плана лечения, которые пользователь ввёл в этом документе
	НазначенияЭтогоДокумента = Новый Массив;
	Для Каждого НазначениеЗуб Из СписокНазначений.ПолучитьЭлементы() Цикл
		Для Каждого Назначение Из НазначениеЗуб.ПолучитьЭлементы() Цикл	
			
		Если 	Назначение.ДокументРегистратор = Объект.Ссылка
			Или Не ЗначениеЗаполнено(Назначение.ДокументРегистратор)
		Тогда
			НазначенияЭтогоДокумента.Добавить(Новый Структура("Назначение, НазначениеЗуб", Назначение, НазначениеЗуб));
		КонецЕсли;
		
		КонецЦикла;
	КонецЦикла;
	
	// Перезаполнение по случаю обращения (первичному приему)
	СписокНазначений.ПолучитьЭлементы().Очистить();
	ЗаполнитьПланЛечения();
	
	СтрокиПлана = СписокНазначений.ПолучитьЭлементы(); // Заполненный план
	// Добавление строк плана лечения, которые пользователь ввёл в этом документе к перезаполненному плану лечения.
	Для Каждого НазначениеСтруктура Из НазначенияЭтогоДокумента Цикл
		
		УжеВПлане = Ложь;
		
		 //+Стоматология
		ПодходящаяСтрокаПланаЗуб = Неопределено;
		Для Каждого СтрокаПланаЗуб Из СтрокиПлана Цикл
			Если СтрокаПланаЗуб.ЗубВКарте = НазначениеСтруктура.НазначениеЗуб.ЗубВКарте Тогда
				ПодходящаяСтрокаПланаЗуб = СтрокаПланаЗуб;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ПодходящаяСтрокаПланаЗуб = Неопределено Тогда
			ПодходящаяСтрокаПланаЗуб = СписокНазначений.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(ПодходящаяСтрокаПланаЗуб, НазначениеСтруктура.НазначениеЗуб);
		КонецЕсли;
		
		СтрокиПланаЗуб = ПодходящаяСтрокаПланаЗуб.ПолучитьЭлементы();
		КолСтрокПлана = СтрокиПланаЗуб.Количество();
		//-Стоматология
		
		Для Инд = 0 По (КолСтрокПлана - 1) Цикл
			Если НазначениеСтруктура.Назначение.ИдентификаторНазначения = СтрокиПланаЗуб[Инд].ИдентификаторНазначения Тогда
				УжеВПлане = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если Не УжеВПлане Тогда
			НоваяСтрока = СтрокиПланаЗуб.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НазначениеСтруктура.Назначение);
		КонецЕсли;
	КонецЦикла;
	РазвернутьДеревоНазначений();
	
КонецПроцедуры

&НаКлиенте
Процедура НазначенияДатаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Назначения.ТекущиеДанные;
	ТекущиеДанные.ДатаНачалаБезВремени = ТекущиеДанные.Дата;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Дата)
		И ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания)
	Тогда
		ТекущиеДанные.ДатаОкончания = Дата(1,1,1);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПросмотрВыполнения(Команда)
	
	Если Элементы.Назначения.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Назначения.ТекущиеДанные.ДокументВыполнения.Количество() = 1 Тогда
		ДокументВыполнения = Элементы.Назначения.ТекущиеДанные.ДокументВыполнения[0].Значение;
		Если ДокументВыполнения = Объект.Ссылка Тогда
			ПоказатьПредупреждение(,НСтр("ru='Назначение выполнено текущим документом'"), 15, НСтр("ru='Документ выполнения уже открыт'"));
		Иначе
			ОткрытьЗначение(ДокументВыполнения);
		КонецЕсли;
	Иначе
		ВыбранноеЗначение = ВыбратьИзМеню(Элементы.Назначения.ТекущиеДанные.ДокументВыполнения);
		Если ВыбранноеЗначение <> Неопределено Тогда
			ОткрытьЗначение(ВыбранноеЗначение.Значение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтменитьИзмененияПлана(Команда)
	
	СписокНазначений.ПолучитьЭлементы().Очистить();
	ЗаполнитьПланЛечения();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВОчередь(Команда)
	
	Если РаботаСДиалогамиКлиент.ЗаписатьНовыйОбъектВФорме(ЭтаФорма) Тогда
		
		ЗначенияЗаполнения = CRMСервер.ПолучитьЗначенияЗаполненияДляЛистаОжиданияПоОбъекту(Объект.Ссылка);
		ПараметрыФормы = Новый Структура("Клиент, ДатаНачала", Объект.Клиент, ТекущаяДата());
		
		#Область Стоматология
		Если Команда.Имя = "ДобавитьВОчередьЗК" Тогда 
			Если ЗначениеЗаполнено(стомДанныеЗубныхКарт.ДатаПоследнейАкутализации) Тогда
				ПараметрыФормы.Вставить("ИсходнаяДата", Макс(ДобавитьМесяц(стомДанныеЗубныхКарт.ДатаПоследнейАкутализации, 6), ТекущаяДата()));
			КонецЕсли;
			ЗначенияЗаполнения.Вставить("ПричинаЗаписи", ПредопределенноеЗначение("Справочник.ПричиныЗаписиНаПрием.КонтрольныйОсмотр"));
		#КонецОбласти
		ИначеЕсли Команда.Имя = "ДобавитьВОчередьПоПлануЛечения" Тогда
			
			СписокНоменклатуры = Новый СписокЗначений;
			ПлановаяДата = Неопределено;
			Сотрудник = Неопределено;
			Для Каждого ИдентификаторСтрокиДерева Из Элементы.Назначения.ВыделенныеСтроки Цикл
				
				ЭлементГруппы = СписокНазначений.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
				Если ЭлементГруппы = Неопределено Тогда 
					Продолжить;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(ЭлементГруппы.Назначение)
					Или	ТипЗнч(ЭлементГруппы.Назначение) <> Тип("СправочникСсылка.Номенклатура") Тогда
					Продолжить;
				КонецЕсли;
				
				ВидНоменклатуры = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭлементГруппы.Назначение, "ВидНоменклатуры");
				Если ВидНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Материал") Тогда
					Продолжить;
				КонецЕсли;	
				
				СписокНоменклатуры.Добавить(ЭлементГруппы.Назначение);
				Если ЗначениеЗаполнено(ЭлементГруппы.Дата) И ПлановаяДата = Неопределено Тогда 
					ПлановаяДата = ЭлементГруппы.Дата;
				КонецЕсли;
				Если ЗначениеЗаполнено(ЭлементГруппы.Сотрудник) И Сотрудник = Неопределено Тогда 
					Сотрудник = ЭлементГруппы.Сотрудник;
				КонецЕсли;
				
			КонецЦикла;
			
			ПараметрыФормы.Вставить("СписокНоменклатуры", СписокНоменклатуры);
			Если ПлановаяДата <> Неопределено Тогда 
				ПараметрыФормы.Вставить("ПлановаяДата", ПлановаяДата);
			КонецЕсли;
			Если Сотрудник <> Неопределено Тогда 
				ЗначенияЗаполнения.Вставить("Сотрудник", Сотрудник);
			КонецЕсли;
			
		КонецЕсли;
		
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		Если Команда.Имя = "ДобавитьВОчередьПоПлануЛечения"
			Или CRMСервер.ПолучитьАктуальныеДокументыОчередиКлиента(Объект.Клиент).Количество() = 0
		Тогда
			ОткрытьФорму("Документ.ЛистОжидания.Форма.ФормаБыстрогоСоздания", ПараметрыФормы);
		Иначе
			// Показываем список уже созданных листов ожидания по этому приёму
			ОткрытьФорму("Документ.ЛистОжидания.ФормаСписка", ПараметрыФормы);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаявкуПоПлануЛечения(Команда)
	
	Если РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтаФорма, Истина) Тогда
		
		мсДанныеДляЗаявки = Новый Массив;
		мсСотрудники = Новый Массив;
		ПлановаяДата = Неопределено;
		ТекущийПользователь = ОбщегоНазначения.ТекущийПользователь();
		Сотрудник = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ТекущийПользователь, "Сотрудник");
		Если Не ЗначениеЗаполнено(Сотрудник) Тогда  
			Сотрудник = Объект.Врач;	
		КонецЕсли;	
		Для Каждого ИдентификаторСтрокиДерева Из Элементы.Назначения.ВыделенныеСтроки Цикл
			
			ЭлементГруппы = СписокНазначений.НайтиПоИдентификатору(ИдентификаторСтрокиДерева);
			Если ЭлементГруппы = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ЭлементГруппы.Назначение) Или
				ТипЗнч(ЭлементГруппы.Назначение) <> Тип("СправочникСсылка.Номенклатура") Тогда
				Продолжить;
			КонецЕсли;
			
			ВидНоменклатуры = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭлементГруппы.Назначение, "ВидНоменклатуры");
			Если ВидНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Материал") Тогда
				Продолжить;
			КонецЕсли;	
				
			ДанныеДляЗаявки = Новый Структура;
			ДанныеДляЗаявки.Вставить("Номенклатура", ЭлементГруппы.Назначение);
			Если ЗначениеЗаполнено(ЭлементГруппы.Сотрудник)
				И ЭлементГруппы.Сотрудник <> Сотрудник 	
			Тогда 
				ДанныеДляЗаявки.Вставить("Сотрудник", ЭлементГруппы.Сотрудник);
			КонецЕсли;
			мсДанныеДляЗаявки.Добавить(ДанныеДляЗаявки);
			стрСотрудник = ?(ЗначениеЗаполнено(ЭлементГруппы.Сотрудник), ЭлементГруппы.Сотрудник, Сотрудник);
			Если мсСотрудники.Найти(стрСотрудник) = Неопределено Тогда 
				мсСотрудники.Добавить(стрСотрудник);	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлементГруппы.Дата) И ПлановаяДата = Неопределено Тогда 
				ПлановаяДата = ЭлементГруппы.Дата;
			КонецЕсли;
			
		КонецЦикла;
		
		Если мсСотрудники.Количество() <> 0 Тогда 
			Сотрудник = ?(мсСотрудники.Найти(Сотрудник) = Неопределено, мсСотрудники[0], Сотрудник);
		КонецЕсли;
		
		Если ПлановаяДата = Неопределено Тогда 
			ПлановаяДата = НачалоДня(ТекущаяДата()) + ОбщегоНазначения.ВремяВСекунды(УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ВремяНачалаРаботы"));
		Иначе
			ПлановаяДата = Макс(ПлановаяДата, НачалоДня(ПлановаяДата) + ОбщегоНазначения.ВремяВСекунды(УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ВремяНачалаРаботы")));
		КонецЕсли;
			
		Если мсСотрудники.Количество() < 2 Тогда 
			ПараметрыЗаписи = Новый Структура("ДокументЗаписи, Клиент, Работы, ЛистОжидания", Объект.Ссылка, Объект.Клиент, мсДанныеДляЗаявки);
			ПараметрыЗаписи.Вставить("ДанныеЛистаОжидания", Новый Структура("ДатаНачала, ДатаОкончания, Сотрудник, Специализация", 
				ПлановаяДата, ПлановаяДата, Сотрудник));
			КалендарьПланированияКлиент.ОткрытьАктивизироватьКалендарьПланирования();
			Оповестить("НамерениеЗаписиПоДокументу", ПараметрыЗаписи, ПараметрыЗаписи.ДокументЗаписи);
		Иначе
			ЗначенияЗаполнения = Новый Структура("Дата, ДатаНачала, ДатаОкончания, ВремяНачала, ВремяОкончания, Клиент, Сотрудник, Оборудование, Филиал,
				| Основание, Работы", ТекущаяДата(), ПлановаяДата, ПлановаяДата, ПлановаяДата, ПлановаяДата, Объект.Клиент, Сотрудник,
				Неопределено, Объект.Филиал, Объект.Ссылка, мсДанныеДляЗаявки);
			ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
			ОткрытьФорму("Документ.Заявка.ФормаОбъекта", ПараметрыФормы);	
		КонецЕсли;
		
	КонецЕсли;            	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПривязывающиеРеквизитыПланаЛечения()
	
	Для Каждого ГруппаНазначения Из СписокНазначений.ПолучитьЭлементы() Цикл
		Для Каждого Назначение Из ГруппаНазначения.ПолучитьЭлементы() Цикл
			Назначение.ИдентификаторНазначения = Новый УникальныйИдентификатор;
			Назначение.ДокументРегистратор = Неопределено;
			Назначение.ДокументВыполнения.Очистить();
			Назначение.Факт = 0;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьФлагаЗакрыт()

	УстановитьВидимостьФлагаЗакрытСервер(Элементы.Закрыт, Объект.ПервичныйПрием);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьФлагаЗакрытСервер(ЭлементФлагЗакрыт, ПервичныйПрием)

	ЭлементФлагЗакрыт.Видимость = Не ЗначениеЗаполнено(ПервичныйПрием) Или ТипЗнч(ПервичныйПрием) = Тип("ДокументСсылка.Прием");
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПризнакЗакрытПервичномуПриему(ПервичныйПрием, Закрыт)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбъектПервичногоПриема = ПервичныйПрием.ПолучитьОбъект();
	ОбъектПервичногоПриема.Закрыт = Закрыт;
	ОбъектПервичногоПриема.ДополнительныеСвойства.Вставить("НеПроверятьГраницуЗапретаИзмененияДанных", Истина);
	
	ОбъектПервичногоПриема.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДиагнозНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыбратьДиагноз(Элемент);
КонецПроцедуры

&НаКлиенте
Функция ПолучитьТекущуюЗубнуюКартуКлиента(ШаблонПриема)
	
	Если Объект.СостоянияЗубов.Количество() <> 0 Тогда
		Возврат Объект.СостоянияЗубов;
	Иначе
		Возврат ПолучитьТекущуюЗубнуюКартуКлиентаСервер(Объект.Клиент, Объект.Дата, Объект.СостоянияЗубов, ШаблонПриема);
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьТекущуюЗубнуюКартуКлиентаСервер(Клиент, ДатаДокумента, Знач СостоянияЗубов, ШаблонПриема)
	
	Если УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("РаботаСЗубнымиКартами") Тогда	
		Если ШаблонПриема.РаботаетСЗубнойКартой Тогда // Занесение параметров.
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СостоянияЗубовСрезПоследних.НомерЗуба,
			|	СостоянияЗубовСрезПоследних.Сегмент КАК СегментЗуба,
			|	СостоянияЗубовСрезПоследних.Состояние,
			|	СостоянияЗубовСрезПоследних.Описание
			|ИЗ
			|	РегистрСведений.СостоянияЗубов.СрезПоследних(&ДатаПериода, Клиент = &Клиент) КАК СостоянияЗубовСрезПоследних";
			
			Запрос.УстановитьПараметр("ДатаПериода", ?(ДатаДокумента = Дата(1,1,1),ТекущаяДата(), ДатаДокумента));
			Запрос.УстановитьПараметр("Клиент", Клиент);
			
			ТаблицаСостояний = Запрос.Выполнить().Выгрузить();
			
			Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаСостояний);
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура ПроверитьНаОбработкуВизуальногоРедактированияЗубов(ПараметрыИзОбработки)
	
	Если УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("РаботаСЗубнымиКартами") Тогда
		Если ПараметрыИзОбработки <> Неопределено Тогда
			Объект.СостоянияЗубов.Очистить();
			Для Каждого СтрокаПараметра Из ПараметрыИзОбработки Цикл
				СтрокаСостоянияЗуба = Объект.СостоянияЗубов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаСостоянияЗуба, СтрокаПараметра);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеНоменклатурыДляВводаРецепта(СтрокаМедикамента)
	Номенклатура = Новый Массив;
	
	Если Ложь //СтрокаМедикамента.ВидНазначения = ПредопределенноеЗначение("Перечисление.ВидыНазначений.Медикаменты") //+Стоматология
			И ЗначениеЗаполнено(СтрокаМедикамента.Назначение)
		Тогда
			РеквизитыНоменклатуры = Новый Структура;
			РеквизитыНоменклатуры.Вставить("Номенклатура",		СтрокаМедикамента.Назначение);
			РеквизитыНоменклатуры.Вставить("ЕдиницаИзмерения",	СтрокаМедикамента.ЕдиницаИзмерения);
			РеквизитыНоменклатуры.Вставить("Количество",		СтрокаМедикамента.Количество * СтрокаМедикамента.Дозировка);
			РеквизитыНоменклатуры.Вставить("КоличествоДней", 	СтрокаМедикамента.Количество / ?(СтрокаМедикамента.ПриемовВДень = 0, 1, СтрокаМедикамента.ПриемовВДень));
			РеквизитыНоменклатуры.Вставить("ПриемовВДень",		СтрокаМедикамента.ПриемовВДень);
			РеквизитыНоменклатуры.Вставить("Дозировка",			СтрокаМедикамента.Дозировка);
			Номенклатура.Добавить(РеквизитыНоменклатуры);
		КонецЕсли;	
	
	Возврат Номенклатура;
	
КонецФункции

&НаКлиенте
Процедура ВыписатьРецептПоПараметрам(Номенклатура = Неопределено, ИспользоватьПомощникСозданияРецептов = Ложь)
	
	ЗначенияЗаполнения = Новый Структура("Прием, Врач, Клиент, МедицинскаяКарта",
											Объект.Ссылка, 
											Объект.Врач, 
											Объект.Клиент, 
											Объект.МедицинскаяКарта);
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ЗначенияЗаполнения.Вставить("Номенклатура",	Номенклатура);
	КонецЕсли;
	
	Если ИспользоватьПомощникСозданияРецептов Тогда
		ОткрытьФорму("Документ.Рецепт.Форма.ПомощникСозданияРецептов", ЗначенияЗаполнения, ЭтаФорма, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	Иначе
		ФормаРецепта = ОткрытьФорму("Документ.Рецепт.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДиагнозыНаФорме_ПриСозданииНаСервере()
	
	Элементы.ДиагнозыВидНозологии.СписокВыбора.ЗагрузитьЗначения(МедицинскаяДеятельностьПовтИсп.ВидыНозологий());
	Элементы.ВидНозологииДиагноза.СписокВыбора.ЗагрузитьЗначения(МедицинскаяДеятельностьПовтИсп.ВидыНозологий());
	
	Если Не Объект.Ссылка.Пустая()
		И Объект.Диагнозы.НайтиСтроки(Новый Структура("Классификация2", Перечисления.КлассификацииДиагнозов.ОбострениеХронического)).Количество() <> 0
	Тогда
		Элементы.ХарактерЗаболевания.СписокВыбора.Добавить(Перечисления.КлассификацииДиагнозов.ОбострениеХронического);
	КонецЕсли;
	
	Элементы.СопутствующийДиагноз.Видимость = (Объект.Диагнозы.Количество() <> Объект.Диагнозы.НайтиСтроки(Новый Структура("Сопутствующий","")).Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура ДиагнозыПослеУдаления(Элемент)
	НеобходимоОбновитьСтандартыЛечения = Элементы.СтандартыЛеченияПоДиагнозам.Пометка;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКолонкиСпискаНазначений(Знач СписокНазначений)
	
	КолонкиСпискаЗначений = Новый Массив;
	СписокДерево = ДанныеФормыВЗначение(СписокНазначений, Тип("ДеревоЗначений"));
	КолонкиДерева = СписокДерево.Колонки;
	Для Каждого Колонка Из КолонкиДерева Цикл
		КолонкиСпискаЗначений.Добавить(Колонка.Имя);	
	КонецЦикла;
	
	Возврат КолонкиСпискаЗначений;
	
КонецФункции

#Область КомплексныеРасчеты

&НаСервере
Процедура ЗаполнитьЭтапыРаботСОтметкамиВыполнения()
	
	КомплексныеРасчетыКлиентовСервер.ЗаполнитьЭтапыРаботСОтметкамиВыполнения(Объект.КомплексныйРасчет, ЭтапыРабот, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыРаботВыполненПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЭтапыРабот.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	КомплексныеРасчетыКлиентовКлиент.ЭтапыРаботВыполненПриИзменении(ТекДанные);
	ТекДанные.ИсполнительФакт = ?(ТекДанные.ОтметкаВыполнения, Объект.Врач, Неопределено);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтапыРаботОтметкаВыполненияПриИзменении(Элемент)
	
	ТекДанные = Элементы.ЭтапыРабот.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	КомплексныеРасчетыКлиентовКлиент.ЭтапыРаботОтметкаВыполненияПриИзменении(ТекДанные);
	ТекДанные.ИсполнительФакт = ?(ТекДанные.ОтметкаВыполнения, Объект.Врач, Неопределено);	

КонецПроцедуры

&НаКлиенте
Процедура ЭтапыРаботВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = ЭтапыРабот.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ЭтапыРаботДокументРегистратор Тогда
		СтандартнаяОбработка = Ложь;
		Если ЗначениеЗаполнено(ТекДанные.ДокументРегистратор) Тогда 
			ОткрытьЗначение(ТекДанные.ДокументРегистратор);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомплексныйРасчетПриИзменении(Элемент)
	
	Элементы.ГруппаЭтапыРабот.Видимость = ЗначениеЗаполнено(Объект.КомплексныйРасчет);
	Если ЗначениеЗаполнено(Объект.КомплексныйРасчет) Тогда 
		ЗаполнитьЭтапыРаботСОтметкамиВыполнения();
	Иначе
		ЭтапыРабот.Очистить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ИспользоватьТиповоеЗаполнение(ИмяПодключеннойОбработки, ИмяВстроеннойОбработки)
	
	Если ИмяВстроеннойОбработки <> Неопределено Тогда
		Попытка
			Возврат Вычислить(СтрШаблон("Обработки.%1.Создать().ИспользоватьТиповоеЗаполнение()", ИмяВстроеннойОбработки));
		Исключение
			Возврат Неопределено;
		КонецПопытки;
	КонецЕсли;
	
	ВнОбработка = ВнешниеОбработки.Создать(ИмяПодключеннойОбработки, Ложь, ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
	Попытка
		Возврат ВнОбработка.ИспользоватьТиповоеЗаполнение();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруПараметровОткрытияФормы(ШаблонПриема, Знач Объект)
	
	СтруктураПараметровОткрытияФормы = Новый Структура;
	СтруктураПараметровОткрытияФормы.Вставить("ЗначенияПоУмолчанию", УправлениеОбработкамиШаблоновСервер.ПолучитьСтруктуруСоответствий(ШаблонПриема, Объект));
	СтруктураПараметровОткрытияФормы.Вставить("СписокЗаполнений", УправлениеОбработкамиШаблоновСервер.СформироватьМассивЗаполнений(ШаблонПриема));
	СтруктураПараметровОткрытияФормы.Вставить("СтруктураШапки", СформироватьСтруктуруШапки(Объект));
	
	Возврат СтруктураПараметровОткрытияФормы;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНМУДляПлановЛечения()
	
	СтандартыЛеченияВПланеЛеченияНЗ = РегистрыСведений.СтандартыЛеченияВПланеЛечения.СоздатьНаборЗаписей();
	Для Каждого СтрокаПланаЛечения Из СписокНазначений.ПолучитьЭлементы() Цикл
		СтандартыЛеченияВПланеЛеченияНЗ.Отбор.ИдентификаторНазначения.Установить(СтрокаПланаЛечения.ИдентификаторНазначения);
		СтандартыЛеченияВПланеЛеченияНЗ.Прочитать();
		Для Каждого Строка Из СтандартыЛеченияВПланеЛеченияНЗ.Выгрузить() Цикл
			НоваяСтрокаСвязи = НМУДляПлановЛечения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСвязи, Строка);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПланЛечения(СтрокиПланов, ИдентификаторНазначения)
	
	НайденныеПланы = СтрокиПланов.НайтиСтроки(Новый Структура("ИдентификаторНазначения", ИдентификаторНазначения));
	Если НайденныеПланы.Количество() > 0 Тогда
		Возврат НайденныеПланы[0];
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПланыИзФормыСозданияПланаЛечения(ПолученныеПланыЛечения, ПолученныеНМУДляПлановЛечения, СтрокиПланаКУдалению)
	
	ПланыЛечения = РеквизитФормыВЗначение("СписокНазначений");
	СтрокиПлановЛечения = ПланыЛечения.Строки;
	
	Для Каждого СтрокаПланаЛечения Из ПолученныеПланыЛечения Цикл
		// Сначала поиск такого Плана
		ПланЛечения = ПолучитьПланЛечения(СтрокиПлановЛечения, СтрокаПланаЛечения.ИдентификаторНазначения);
		
		Если ПланЛечения = Неопределено Тогда
			ПланЛечения = СтрокиПлановЛечения.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ПланЛечения, СтрокаПланаЛечения);
		
	КонецЦикла;
	
	НМУДляПлановЛечения.Очистить();
	Для Каждого СтрокаНМУДляПлановЛечения Из ПолученныеНМУДляПлановЛечения Цикл
		
		НоваяСтрокаНМУДляПлановЛечения = НМУДляПлановЛечения.Добавить();
		НоваяСтрокаНМУДляПлановЛечения.НоменклатураМедицинскихУслуг = СтрокаНМУДляПлановЛечения.НМУ;
		НоваяСтрокаНМУДляПлановЛечения.ВидНазначения = СтрокаНМУДляПлановЛечения.ВидНазначения;
		НоваяСтрокаНМУДляПлановЛечения.ИдентификаторНазначения = СтрокаНМУДляПлановЛечения.ИдентификаторПланаЛечения;
		
	КонецЦикла;
	
	Для Каждого СтрокаПланаКУдалению Из СтрокиПланаКУдалению Цикл
		СтрокиПланаЛеченияКУдалению.Добавить(СтрокаПланаКУдалению.Значение);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ПланыЛечения, "СписокНазначений");
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСвязиСПланомЛечения(ИдентификаторНазначения)
	
	СтрокиСвязей = НМУДляПлановЛечения.НайтиСтроки(Новый Структура("ИдентификаторНазначения", ИдентификаторНазначения));
	Для Каждого СтрокаСвязи Из СтрокиСвязей Цикл
		
		НМУДляПлановЛечения.Удалить(СтрокаСвязи);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеПланаЛечения(Команда)
	
	ТаблицаИспользуемыхСтандартовЛечения = ИспользуемыеСтандартыЛечения;
	РегламентированныеСтандарты = ПолучитьРегламентированныеСтандарты(ТаблицаИспользуемыхСтандартовЛечения);
	
	Если РегламентированныеСтандарты.Количество() > 0 Тогда
		
		ПланЛечения = Новый Массив;
		Для Каждого СтрокаПланаЛечения Из СписокНазначений.ПолучитьЭлементы() Цикл
			
			Попытка
				Если ЗначениеЗаполнено(СтрокаПланаЛечения.ВидНазначения)
					И ОбщегоНазначения.ИмяЗначенияПеречисления(СтрокаПланаЛечения.ВидНазначения) = "Медикаменты"
				Тогда
					Продолжить;
				КонецЕсли;
			Исключение 
				Продолжить;
			КонецПопытки;
			
			СтруктураСтрокиПланаЛечения = Новый Структура();
			
			СтруктураСтрокиПланаЛечения.Вставить("Номенклатура",СтрокаПланаЛечения.Назначение);
			СтруктураСтрокиПланаЛечения.Вставить("ИдентификаторНоменклатуры", СтрокаПланаЛечения.ИдентификаторНазначения);
			СтруктураСтрокиПланаЛечения.Вставить("Комментарий", СтрокаПланаЛечения.Комментарий);
			СтруктураСтрокиПланаЛечения.Вставить("Количество", СтрокаПланаЛечения.Количество);
			СтруктураСтрокиПланаЛечения.Вставить("ВидНазначения", СтрокаПланаЛечения.ВидНазначения);
			
			ПланЛечения.Добавить(СтруктураСтрокиПланаЛечения);
			
		КонецЦикла;
		
		СвязиНМУСНоменклатурой = Новый Массив;
		Для Каждого СтрокаНМУДляПлановЛечения Из НМУДляПлановЛечения Цикл
			
			СтруктураНМУДляПлановЛечения = Новый Структура;
			
			СтруктураНМУДляПлановЛечения.Вставить("НМУ", СтрокаНМУДляПлановЛечения.НоменклатураМедицинскихУслуг);
			СтруктураНМУДляПлановЛечения.Вставить("ВидНазначения", СтрокаНМУДляПлановЛечения.ВидНазначения);
			СтруктураНМУДляПлановЛечения.Вставить("ИдентификаторПланаЛечения", СтрокаНМУДляПлановЛечения.ИдентификаторНазначения);
			
			СвязиНМУСНоменклатурой.Добавить(СтруктураНМУДляПлановЛечения);
			
		КонецЦикла;
		
		ПараметрыФормы = Новый Структура("Стандарты, ПланЛечения, СвязиНМУСНоменклатурой", РегламентированныеСтандарты, ПланЛечения, СвязиНМУСНоменклатурой);
		ОткрытьФорму("Документ.Прием.Форма.СозданиеПланаЛеченияПоРеглСтандартам", ПараметрыФормы, ЭтаФорма,);
	Иначе
		ПоказатьПредупреждение(,НСтр("ru='Не выбрано ни одного регламентированного стандарта (не внутреннего стандарта лечения)'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазделитьСтрокуПлана(Команда)
	
	Если Элементы.Назначения.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаПлана = СписокНазначений.НайтиПоидентификатору(Элементы.Назначения.ТекущиеДанные.ПолучитьИдентификатор());
	НоваяСтрокаПлана = РазделитьСтрокуПланаЛечения(СтрокаПлана);
	Если НоваяСтрокаПлана <> Неопределено Тогда
		Элементы.Назначения.ТекущаяСтрока = НоваяСтрокаПлана.ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРегламентированныеСтандарты(ИспользуемыеСтандартыЛечения)
	
	РегламентированныеСтандарты = Новый Массив;
	
	Для Каждого Стандарт Из ИспользуемыеСтандартыЛечения Цикл
		
		Если Стандарт.СтандартЛечения.ВидСтандарта Тогда
			РегламентированныеСтандарты.Добавить(Стандарт.СтандартЛечения);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РегламентированныеСтандарты;
	
КонецФункции

&НаКлиенте
Процедура СохранитьВPDF(Команда)
	
	УниверсальныеМеханизмыКлиент.ОбработатьНажатиеСохранитьВPDF(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьФокусСПоляВводаНаТело()
	
	Если ТекущийЭлементПараметраШаблона <> Неопределено
		И ВРег(ТекущийЭлементПараметраШаблона.ТегЭлемента) = "INPUT"
		И ТекущийЭлементПараметраШаблона.ЭлементHTML <> Неопределено
	Тогда
		ТекущийЭлементHTML = ПолучитьТекущийЭлементШаблонаHTML(ТекущийЭлементПараметраШаблона.ЭлементHTML, ТекущийЭлементПараметраШаблона.ИмяПоляШаблона);
		Если ТекущийЭлементHTML <> Неопределено Тогда
			ТекущийЭлементHTML.ownerDocument.body.click();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ТребуетсяПодписаниеРЭМД()
	
	Для Каждого СтрокаШаблона Из Объект.ШаблоныПриема Цикл
		Если ЗначениеЗаполнено(СтрокаШаблона.ВидДокумента) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция СтруктураТекущегоЭлементаШаблонаHTML(ЭлементHTML)
	
	Попытка
		ЭлементыПоТегу = ЭлементHTML.ownerDocument.getElementsByTagName(ЭлементHTML.tagName);
		Для НомерЭлемента = 1 По ЭлементыПоТегу.length Цикл
			ИндексЭлемента = НомерЭлемента - 1;
			Если ЭлементыПоТегу[ИндексЭлемента] = ЭлементHTML Тогда
				Возврат Новый Структура("ИмяТега, НомерЭлемента", ЭлементHTML.tagName, ИндексЭлемента);
			КонецЕсли;
		КонецЦикла;
	Исключение КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТекущийЭлементШаблонаHTML(ДанныеТекущегоЭлементаШаблонаHTML, ИмяПоляШаблона)
	
	Если ДанныеТекущегоЭлементаШаблонаHTML = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		ЭлементыПоТегу = Элементы[ИмяПоляШаблона].Документ.getElementsByTagName(ДанныеТекущегоЭлементаШаблонаHTML.ИмяТега);
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	Если ЭлементыПоТегу.length < ДанныеТекущегоЭлементаШаблонаHTML.НомерЭлемента + 1 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ЭлементыПоТегу[ДанныеТекущегоЭлементаШаблонаHTML.НомерЭлемента];
	
КонецФункции

&НаКлиенте
Функция РазделитьСтрокуПланаЛечения(СтрокаПлана, ОтделяемоеКоличество = 0)
	
	Если ТипЗнч(СтрокаПлана.Назначение) <> Тип("СправочникСсылка.Номенклатура") Тогда Возврат Неопределено; КонецЕсли;
	
	// Количество в новой строке.
	Если ОтделяемоеКоличество = 0 Тогда
		Если СтрокаПлана.Количество <= 1 Тогда
			Количество = 0;
		ИначеЕсли СтрокаПлана.Факт > 0 И СтрокаПлана.Количество > СтрокаПлана.Факт Тогда
			Количество = СтрокаПлана.Количество - СтрокаПлана.Факт;
		Иначе
			Количество = (СтрокаПлана.Количество + СтрокаПлана.Количество%2)/2;
		КонецЕсли;
	Иначе
		Количество = Мин(ОтделяемоеКоличество, СтрокаПлана.Количество);
	КонецЕсли;
	
	НоваяСтрокаПлана = СтрокаПлана.ПолучитьРодителя().ПолучитьЭлементы().Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрокаПлана, СтрокаПлана);
	НоваяСтрокаПлана.ИдентификаторНазначения = Новый УникальныйИдентификатор();
	НоваяСтрокаПлана.Количество = Количество;
	СтрокаПлана.Количество = СтрокаПлана.Количество - НоваяСтрокаПлана.Количество;
	
	Если СтрокаПлана.Количество < СтрокаПлана.Факт
		И НоваяСтрокаПлана.Количество <> 0
	Тогда
		НоваяСтрокаПлана.Факт = СтрокаПлана.Факт - СтрокаПлана.Количество;
		СтрокаПлана.Факт = СтрокаПлана.Количество;
	Иначе
		НоваяСтрокаПлана.Факт = 0;
	КонецЕсли;
	
	// Связи стандартов лечения
	СтрокиСвязи = НМУДляПлановЛечения.НайтиСтроки(Новый Структура("ИдентификаторНазначения", СтрокаПлана.ИдентификаторНазначения));
	
	Для Каждого СтрокаСвязи Из СтрокиСвязи Цикл
		
		НоваяСтрокаСвязи = НМУДляПлановЛечения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСвязи, СтрокаСвязи);
		НоваяСтрокаСвязи.ИдентификаторНазначения = НоваяСтрокаПлана.ИдентификаторНазначения;
		
	КонецЦикла;
	
	Возврат НоваяСтрокаПлана
	
КонецФункции

&НаКлиенте
Процедура ПланЛеченияАктуализироватьЦены(Команда)
	
	ПланЛеченияВерхнийУровень = СписокНазначений.ПолучитьЭлементы();
	Для Каждого СтрокаЗуб Из ПланЛеченияВерхнийУровень Цикл
		Для Каждого СтрокаНазначение Из СтрокаЗуб.ПолучитьЭлементы() Цикл
			Если СтрокаНазначение.Количество > СтрокаНазначение.Факт Тогда // Не трогаем полностью выполненные строки.
				
				Цена = Ценообразование.ПолучитьЦену(Прейскурант, СтрокаНазначение.Назначение).Цена;
				Если СтрокаНазначение.Факт = 0 Тогда
					ИзменяемаяСтрока = СтрокаНазначение;
				Иначе
					ИзменяемаяСтрока = РазделитьСтрокуПланаЛечения(СтрокаНазначение, СтрокаНазначение.Количество - СтрокаНазначение.Факт); // Новая Строка плана лечения.
				КонецЕсли;
				ИзменяемаяСтрока.Цена = Цена;
				ПересчитатьСуммыПланаЛечения(ЭтотОбъект, ИзменяемаяСтрока);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоНазначений()
	
	// Получаем коллекцию групп элементов(назначений) плана лечения.
	ГруппыНазначений = СписокНазначений.ПолучитьЭлементы();
	Для Каждого ГруппаНазначений Из ГруппыНазначений Цикл
		Элементы.Назначения.Развернуть(ГруппаНазначений.ПолучитьИдентификатор(), Ложь);
	КонецЦикла;
	
КонецПроцедуры

#Область Стоматология
&НаКлиенте
Функция ДобавитьНоменклатуруРабот(ВыбранноеЗначение, ЗубВКарте = Неопределено, СегментВЗубе = Неопределено)
	
	НоваяСтрока = Объект.Работы.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыбранноеЗначение);
	НоваяСтрока.ЗубВКарте = ЗубВКарте;
	НоваяСтрока.СегментВЗубе = СегментВЗубе;
	НоваяСтрока.КлючСтроки = ОбщегоНазначенияКлиентСервер.ПолучитьМаксимумМинимумСвойстваВКоллекции(Объект.Работы, "КлючСтроки", Истина, 0) + 1;
	
	Возврат НоваяСтрока;
	
КонецФункции
#КонецОбласти

&НаКлиенте
Процедура НазначенияНазначениеПриИзменении(Элемент)
	
	ТекДанные = Элементы.Назначения.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоЗуб = (ТекДанные.ПолучитьРодителя() = Неопределено);
	
	Если Не ЭтоЗуб Тогда
		
		Если ДопСерверныеФункции.ПолучитьРеквизит(ТекДанные.Назначение, "ВидНоменклатуры") = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Набор") Тогда
			
			СоставНабора = ОбщегоНазначенияСервер.ПолучитьСоставНабора(ТекДанные.Назначение);
			//Если СтрокаТабличнойЧасти <> Неопределено Тогда
			//	Объект.Работы.Удалить(ПозицияВводаСтроки);
			//КонецЕсли;
			
			ТекущийЭлементНазначения = СписокНазначений.НайтиПоИдентификатору(Элементы.Назначения.ТекущаяСтрока);
			НазначенияЗуба = ТекущийЭлементНазначения.ПолучитьРодителя().ПолучитьЭлементы();
			ПозицияВводаСтроки = НазначенияЗуба.Индекс(ТекущийЭлементНазначения);
			
			Если СоставНабора.Количество() = 0 Тогда
				НазначенияЗуба.Удалить(ТекущийЭлементНазначения);
			Иначе
				ЭтоПервый = Истина;
				Для Каждого СтрокаСостава Из СоставНабора Цикл
					Если ЭтоПервый Тогда
						ЭлементНазначения = ТекущийЭлементНазначения;
						ЭтоПервый = Ложь;
					Иначе
						ЭлементНазначения = НазначенияЗуба.Вставить(ПозицияВводаСтроки);
						ЭлементНазначения.ИдентификаторНазначения = Новый УникальныйИдентификатор;
						ПозицияВводаСтроки = ПозицияВводаСтроки + 1;
						ЗаполнитьЗначенияСвойств(ЭлементНазначения, ТекущийЭлементНазначения);
						ЭлементНазначения.Назначение = СтрокаСостава.Комплектующая;
					КонецЕсли;
					
					ЭлементНазначения.Назначение = СтрокаСостава.Комплектующая;
					ЭлементНазначения.Количество = СтрокаСостава.Количество;
				КонецЦикла;
			КонецЕсли;
			
		Иначе // Выбрана услуга.
			ТекДанные.Цена = Ценообразование.ПолучитьЦену(Прейскурант, ТекДанные.Назначение).Цена;
			ПересчитатьСуммыПланаЛечения(ЭтаФорма, ТекДанные);
		КонецЕсли;

	Иначе
		СуществующаяГруппа = НайтиГруппуПланаЛечения(ЭтаФорма, ТекДанные.ИдентификаторНазначения, ТекДанные);
		Если СуществующаяГруппа <> Неопределено Тогда
			ЭлементыГруппы = СуществующаяГруппа.ПолучитьЭлементы();
			Для Каждого СтрокаНазначение Из ТекДанные.ПолучитьЭлементы() Цикл
				НоваяСтрокаНазначение = ЭлементыГруппы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаНазначение, СтрокаНазначение);
				НоваяСтрокаНазначение.ЗубВКарте = СуществующаяГруппа.ЗубВКарте;
			КонецЦикла;
			СписокНазначений.ПолучитьЭлементы().Удалить(ТекДанные);
			ПересчитатьСуммыПланаЛечения(ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначенияКоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.Назначения.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьСуммыПланаЛечения(ЭтаФорма, ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначенияЦенаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Назначения.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьСуммыПланаЛечения(ЭтаФорма, ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначенияСуммаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Назначения.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьСуммыПланаЛечения(ЭтаФорма, ТекДанные);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьЗубВПланЛечения(Форма, ЗубВКарте = Неопределено, СписокНазначенийДляКопирования = Неопределено)
	
	Если ЗубВКарте = Неопределено Тогда
		ЗубВКарте = ПредопределенноеЗначение("Справочник.стомЗубыКарты.ПустаяСсылка");
	КонецЕсли;
	
	СтрокаЗуб = НайтиГруппуПланаЛечения(Форма, ЗубВКарте.УникальныйИдентификатор());    	
	Если СтрокаЗуб = Неопределено Тогда
		НоваяСтрока = Форма.СписокНазначений.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Назначение = ЗубВКарте;
		НоваяСтрока.ЗубВКарте = ЗубВКарте;
		НоваяСтрока.ИдентификаторНазначения = Строка(ЗубВКарте.УникальныйИдентификатор());
		СтрокаЗуб = НоваяСтрока;
	КонецЕсли;

	// Копирование назначений из другого зуба
	Если СписокНазначенийДляКопирования <> Неопределено Тогда
		СписокНазначений = СтрокаЗуб.ПолучитьЭлементы();
		Если СписокНазначений <> СписокНазначенийДляКопирования Тогда 
			Для Каждого СтрокаНазначение Из СписокНазначенийДляКопирования Цикл
				НоваяСтрокаНазначение = СписокНазначений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаНазначение, СтрокаНазначение);
				ЗаполнитьЗначенияСвойств(НоваяСтрокаНазначение, СтрокаЗуб, "ЗубВКарте, Факт");
				НоваяСтрокаНазначение.ИдентификаторНазначения = Новый УникальныйИдентификатор;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтрокаЗуб.ПолучитьИдентификатор();
	
КонецФункции

&НаКлиенте
Функция ДобавитьНазначениеВПланЛечения(Знач ДанныеЗуба, Назначение = Неопределено, СегментВЗубе = Неопределено)
	
	Если ТипЗнч(ДанныеЗуба) = Тип("СправочникСсылка.стомЗубыКарты") Тогда
		ДанныеЗуба = СписокНазначений.НайтиПоИдентификатору(ДобавитьЗубВПланЛечения(ЭтаФорма, ДанныеЗуба));
	КонецЕсли;
	
	Если Назначение = Неопределено Тогда
		Назначение = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	КонецЕсли;
	
	НоваяСтрока = ДанныеЗуба.ПолучитьЭлементы().Добавить();
	НоваяСтрока.Назначение	= Назначение;
	НоваяСтрока.ЗубВКарте	= ДанныеЗуба.ЗубВКарте;
	НоваяСтрока.СегментВЗубе = СегментВЗубе;
	НоваяСтрока.ИдентификаторНазначения = Новый УникальныйИдентификатор;
	НоваяСтрока.Количество = 1;
	
	Возврат НоваяСтрока.ПолучитьИдентификатор();
	
КонецФункции

&НаКлиенте
Процедура НазначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ТекДанные = Элементы.Назначения.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЭтоЗуб = ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.стомКонструкцииЗубовКлиентов")
		Или ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.стомЗубыКарты");
	
	Если ЭтоЗуб	Тогда
		
		ТекДанные.ЗубВКарте = ВыбранноеЗначение;
		ТекДанные.Назначение = ВыбранноеЗначение;
		ТекДанные.ИдентификаторНазначения = ВыбранноеЗначение.УникальныйИдентификатор();	
	
	КонецЕсли;
	
	ЗубВКартеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, Элементы.Назначения);
	
	Если ЭтоЗуб	Тогда
		НазначенияЗуба = СписокНазначений.НайтиПоИдентификатору(Элементы.Назначения.ТекущаяСтрока).ПолучитьЭлементы();
		Если НазначенияЗуба.Количество() = 0 Тогда
			Элементы.Назначения.ТекущаяСтрока = ДобавитьНазначениеВПланЛечения(ТекДанные);
			Элементы.Назначения.ИзменитьСтроку();
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПодборПланаЛеченияПослеВыбораНазначений(СписокНазначений, ДополнительныеПараметры) Экспорт
	
	Если СписокНазначений <> Неопределено Тогда
		Для Каждого ЭлементСписка Из СписокНазначений Цикл
			ДобавитьНазначениеВыделеннымЗубамСегментам(ЭлементСписка.Назначение);
		КонецЦикла;
		ПересчитатьСуммыПланаЛечения(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПересчитатьСуммыПланаЛечения(Форма, ИзмененнаяСтрокаНазначения = Неопределено)
	
	Если ИзмененнаяСтрокаНазначения = Неопределено Тогда 
		Форма.СуммаПланаЛечения = ПересчитатьСуммыПланаЛеченияРекурсивно(Форма.СписокНазначений);
	Иначе
		СтрокаЗуб = ИзмененнаяСтрокаНазначения.ПолучитьРодителя();
		ПредСумма = СтрокаЗуб.Сумма;
		НоваяСумма = ПересчитатьСуммыПланаЛеченияРекурсивно(СтрокаЗуб);
		Форма.СуммаПланаЛечения = Форма.СуммаПланаЛечения - (ПредСумма - НоваяСумма);
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиентеНаСервереБезКонтекста
Функция ПересчитатьСуммыПланаЛеченияРекурсивно(УзелДерева)
	
	ВетвиДерева = УзелДерева.ПолучитьЭлементы();
	Если ВетвиДерева.Количество() = 0 Тогда
		Если ТипЗнч(УзелДерева) = Тип("ДанныеФормыДерево") Тогда
			Возврат 0;
		Иначе
			УзелДерева.Сумма = УзелДерева.Цена * УзелДерева.Количество;
			Возврат УзелДерева.Сумма;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураУзла = Новый Структура("Сумма", 0);
	Для Каждого ВетвьДерева Из ВетвиДерева Цикл
		СтруктураУзла.Сумма = СтруктураУзла.Сумма + ПересчитатьСуммыПланаЛеченияРекурсивно(ВетвьДерева);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(УзелДерева, СтруктураУзла);
	
	Возврат СтруктураУзла.Сумма;
	
КонецФункции

#Область Стоматология

&НаКлиенте
Процедура ОчиститьПустуюТаблицуДиагнозов(ПриЗаписи = Ложь)

	Если (Объект.Диагнозы.Количество() = 1) 
			И Не ЗначениеЗаполнено(Объект.Диагнозы[0].Диагноз) 
			И Не ЗначениеЗаполнено(Объект.Диагнозы[0].Детализация)
			И (ПриЗаписи
				Или (Не ЗначениеЗаполнено(Объект.Диагнозы[0].ЗубВКарте)
					И Не ЗначениеЗаполнено(Объект.Диагнозы[0].СегментВЗубе)))
	Тогда
		Объект.Диагнозы.Очистить();	
	КонецЕсли; 	

КонецПроцедуры

#Область Инициализация

&НаКлиенте
Процедура ИнициализироватьЗубнуюКарту(ПеревыбратьКартуВариант = Ложь)
	
	ИнициализироватьЗубнуюКартуСервер();
	
	стомКомпонентыКлиент.ОбработатьЗагрузкуПриложения(ЭтаФорма, Элементы[стомДанныеЗубныхКарт.ИмяЭлемента], стомДанныеЗубныхКарт);
	ВыделитьЗубыУпрощеннойЗубнойКарты();
	Элементы.ГруппаСтраницыЗубнойКарты.ТекущаяСтраница = Элементы.СтраницаРедактированиеЗубнойКарты;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьЗубнуюКартуСервер()
	
	стомЗубнаяКартаHTML = ПараметрыСеанса.стомКешированныеДанныеЗК.ПриложениеHTML;
	стомЗубнаяКартаМетоды.ИнициализироватьЗубнуюКарту(ЭтаФорма);
	стомДанныеЗубныхКарт.ИмяЭлемента = Элементы.стомЗубнаяКартаHTML.Имя;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПараметрыПриложения(Элемент, ВыделенныеЗубыСегменты) Экспорт
	
	Если Элемент = Элементы.стомЗубнаяКартаHTML Тогда
		ПриВыделенииЗубовСегментов(ВыделенныеЗубыСегменты);
	ИначеЕсли Элемент = Элементы.стомЗубнаяКартаHTMLИстория Тогда
		СформироватьИсториюЗубов(ВыделенныеЗубыСегменты);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьУсловноеОформлениеСпискиВыбораЗубов()
	
	стомЗубнаяКартаМетоды.УстановитьУсловноеОформлениеЗубов(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики

&НаКлиенте
Процедура ЗубнаяКартаПриИзменении(Элемент)
	
	ИнициализироватьЗубнуюКарту();
	
КонецПроцедуры

&НаКлиенте
Процедура стомЗубнаяКартаHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	стомКомпонентыКлиент.ОбработатьСобытиеПриложения(ЭтаФорма, Элемент, ДанныеСобытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыделенииЗубовСегментов(ВыделенныеЗубыСегментыJS, ОбновлятьВарианты = Истина, ОбновлятьСостояния = Истина, ОбновлятьДиагнозы = Истина)
	
	Если Не стомДанныеЗубныхКарт.СтруктураЗагружена Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеОВыделении = стомЗубнаяКартаМетоды.ПолучитьДанныеОВыделенныхЗубахСегментах(
		стомДанныеЗубныхКарт.Адрес, ВыделенныеЗубыСегментыJS, ОбновлятьВарианты, ОбновлятьСостояния, ?(ОбновлятьДиагнозы, Объект.Диагнозы, Неопределено));
	
	стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты = ДанныеОВыделении.ВыделенныеЗубыСегменты;
	
	Элементы.стомДиагнозы.ТолькоПросмотр = (стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты.Количество() = 0);
	
	// Перезаполнение списков
	Если ОбновлятьВарианты Тогда
		ОтборСтроки = стомЗубнаяКартаМетодыКлиентСервер.СохранитьТекщуюСтрокуТаблицыФормы(Элементы.стомДоступныеВарианты, "Вариант, Область, ЗубВКарте");
		стомДоступныеВарианты.ПолучитьЭлементы().Очистить();
		стомЗубнаяКартаМетодыКлиентСервер.ЗаполнитьДеревоДоступныхВариантов(ДанныеОВыделении.ВариантыЗубов.Варианты, стомДоступныеВарианты);
		стомЗубнаяКартаМетодыКлиентСервер.ВосстановитьТекущуюСтрокуТаблицыФормы(Элементы.стомДоступныеВарианты, стомДоступныеВарианты, ОтборСтроки);
	КонецЕсли;	
	Если ОбновлятьСостояния Тогда 	
		ОтборСтроки = стомЗубнаяКартаМетодыКлиентСервер.СохранитьТекщуюСтрокуТаблицыФормы(Элементы.стомДоступныеСостояния, "Состояние, СегментВЗубе, ЗубВКарте");
		стомДоступныеСостояния.ПолучитьЭлементы().Очистить();
		стомЗубнаяКартаМетодыКлиентСервер.ЗаполнитьДеревоДоступныхСостояний(ДанныеОВыделении.СостоянияЗубов.Состояния, стомДоступныеСостояния);
		стомЗубнаяКартаМетодыКлиентСервер.ВосстановитьТекущуюСтрокуТаблицыФормы(Элементы.стомДоступныеСостояния, стомДоступныеСостояния, ОтборСтроки);
	КонецЕсли;
	Если ОбновлятьДиагнозы Тогда
		ОтборСтроки = стомЗубнаяКартаМетодыКлиентСервер.СохранитьТекщуюСтрокуТаблицыФормы(Элементы.стомДиагнозы, "Диагноз");
		стомДиагнозы.Очистить();
		Для Каждого СтрокаДиагноз Из ДанныеОВыделении.Диагнозы Цикл
			ЗаполнитьЗначенияСвойств(стомДиагнозы.Добавить(), СтрокаДиагноз);
		КонецЦикла;
		стомЗубнаяКартаМетодыКлиентСервер.ВосстановитьТекущуюСтрокуТаблицыФормы(Элементы.стомДиагнозы, стомДиагнозы, ОтборСтроки);
	КонецЕсли;
	
	ВыделитьЗубыУпрощеннойЗубнойКарты();
	
КонецПроцедуры

&НаКлиенте
Процедура стомДоступныеСостоянияСостояниеУстановленоПриИзменении(Элемент)

	ТекДанные = Элементы.стомДоступныеСостояния.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	// Установка состояний
	стомЗубнаяКартаМетодыКлиентСервер.УстановкаСнятиеСостоянияВДереве(ЭтаФорма, стомДоступныеСостояния, ТекДанные); 	

	// Обновление диагнозов, в связи с установкой состояния
	ПриВыделенииЗубовСегментов(стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты, Ложь, Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура стомДоступныеВариантыВариантУстановленПриИзменении(Элемент)
	
	ТекДанные = Элементы.стомДоступныеВарианты.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	стомЗубнаяКартаМетодыКлиентСервер.УстановкаСнятиеВариантаВДереве(ЭтаФорма, стомДоступныеВарианты, ТекДанные);
	ПриВыделенииЗубовСегментов(стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты);
	ОбновитьУсловноеОформлениеСпискиВыбораЗубов();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьКонструкцииПередЗаписью(ТекущийОбъект)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Документ проводится задним числом и это не перепроведение
	Если (НЕ Объект.Проведен) И (стомУстановленныеКонструкции.Количество() > 0) И (НачалоДня(Объект.Дата) < НачалоДня(ТекущаяДата())) Тогда
		// Ищем есть ли хоть один документ приёма более позднего времени
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	стомВариантыЗубовСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.стомВариантыЗубов.СрезПоследних(&ТекущаяДата, Клиент = &ТекущийКлиент) КАК стомВариантыЗубовСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
		
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("ТекущийКлиент", Объект.Клиент);
		
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.Период > Объект.Дата Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Проведение этого документа нарушает последовательность документов.
				| Откройте и Перепроведите последний по дате документ у данного пользователя'"));
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицыСКонструкциями = Новый Массив;
	ТаблицыСКонструкциями.Добавить(ТекущийОбъект.Диагнозы);
	ТаблицыСКонструкциями.Добавить(ТекущийОбъект.Работы);
	
	мсКонструкцииНаУдаление = Новый Массив;
	Для Каждого СтрокаКонструкция Из стомУстановленныеКонструкции Цикл 
		Если СтрокаКонструкция.НеСоздана И СтрокаКонструкция.Удалена Тогда 
			мсКонструкцииНаУдаление.Добавить(СтрокаКонструкция);
		Иначе
			КонструкцияОбъект = СтрокаКонструкция.Конструкция.ПолучитьОбъект();
			КонструкцияОбъект.ПометкаУдаления = СтрокаКонструкция.Удалена;
			Если Не ЗначениеЗаполнено(КонструкцияОбъект.ДатаУстановки) Тогда 
				КонструкцияОбъект.ДатаУстановки = ТекущийОбъект.Дата;
			КонецЕсли;
			Если СтрокаКонструкция.Удалена И Не ЗначениеЗаполнено(КонструкцияОбъект.ДатаУдаления) Тогда 
				КонструкцияОбъект.ДатаУдаления = ТекущийОбъект.Дата;
			КонецЕсли;
			Если СтрокаКонструкция.ОбозначениеИзменено Или КонструкцияОбъект.Предварительная Тогда 
				КонструкцияОбъект.Наименование = СтрокаКонструкция.Обозначение;
				КонструкцияОбъект.Комментарий = СтрокаКонструкция.Комментарий;
			КонецЕсли;
			КонструкцияОбъект.Предварительная = Ложь;
			КонструкцияОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	// Удаляем строки, содержащие удаленную конструкцию
	Если мсКонструкцииНаУдаление.Количество() > 0 Тогда 
		
		Для Каждого Таблица Из ТаблицыСКонструкциями Цикл
			Для Каждого Конструкция Из мсКонструкцииНаУдаление Цикл
				СтрокиТаблицы = Таблица.НайтиСтроки(Новый Структура("ЗубВКарте", Конструкция));
				Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
					Таблица.Удалить(СтрокаТаблицы);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		// План лечения
		мсСтрокиПланаЛеченияНаУдаление = Новый Массив;
		ЭлементыПлана = СписокНазначений.ПолучитьЭлементы();
		Для Каждого СтрокаПлан Из ЭлементыПлана Цикл
			Если мсКонструкцииНаУдаление.Найти(СтрокаПлан.Назначение) <> Неопределено Тогда 
				мсСтрокиПланаЛеченияНаУдаление.Добавить(СтрокаПлан);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаПлан Из мсСтрокиПланаЛеченияНаУдаление Цикл 
			ЭлементыПлана.Удалить(СтрокаПлан);
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого СтрокаКонструкция Из мсКонструкцииНаУдаление Цикл 
		СтрокаКонструкция.Конструкция.ПолучитьОбъект().Удалить();
		стомУстановленныеКонструкции.Удалить(СтрокаКонструкция);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура стомУстановленныеКонструкцииОбозначениеКомментарийКонструкцииПриИзменении(Элемент)
	
	ТекДанные = Элементы.стомУстановленныеКонструкции.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ТекДанные.ОбозначениеИзменено = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура стомУстановленныеКонструкцииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.стомУстановленныеКонструкцииОбозначениеКонструкции Или 
		Поле = Элементы.стомУстановленныеКонструкцииКомментарий 
	Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	СтрокаКонструкция = стомУстановленныеКонструкции.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если Не СтрокаКонструкция.НеСоздана Тогда 
		ОткрытьЗначение(СтрокаКонструкция.Конструкция);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура стомДиагнозыДиагнозУстановленПриИзменении(Элемент)
	
	ТекДанные = Элементы.стомДиагнозы.ТекущиеДанные;
	
	// Для снижения нагрузки мы сначала получим значение искомого состояния по диагнозу
	// Он используется при проверке сегментов выделенного одного элемента
	// (выделен зуб, проверяем есть ли состояние диагноза у каналов)
    СостояниеСегментаПоДиагнозу = стомЗубнаяКартаМетоды.ВернутьСостояниеЗубнойКартыПоДиагнозу(стомДанныеЗубныхКарт.Адрес,ТекДанные.Диагноз);	
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	// Поиск установленных диагнозов зуба
	Для Каждого ВыделенныйЗуб Из стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты Цикл 
		
		УстановленныеДиагнозы = Объект.Диагнозы.НайтиСтроки(Новый Структура("ЗубВКарте, Диагноз", ВыделенныйЗуб.ЗубВКарте, ТекДанные.Диагноз));
		
		// Удаляем существующие диагнозы на зубе
		Если УстановленныеДиагнозы.Количество() > 0 Тогда 
			Для Каждого СтрокаДиагноз Из УстановленныеДиагнозы Цикл
				Если ВыделенныйЗуб.Сегменты.Количество() = 0 
					Или ВыделенныйЗуб.Сегменты.Найти(СтрокаДиагноз.СегментВЗубе) <> Неопределено
				Тогда
					Объект.Диагнозы.Удалить(СтрокаДиагноз);	
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
		
		Если ТекДанные.Установлено Тогда
			Если ВыделенныйЗуб.Сегменты.Количество() > 0 Тогда 
				Для Каждого СегментВЗубе Из ВыделенныйЗуб.Сегменты Цикл 
					НоваяСтрока = Объект.Диагнозы.Добавить();
					НоваяСтрока.ЗубВКарте = ВыделенныйЗуб.ЗубВКарте;
					НоваяСтрока.СегментВЗубе  = СегментВЗубе;
					НоваяСтрока.Диагноз = ТекДанные.Диагноз;
				КонецЦикла;
			Иначе
				// При выделении всего зуба, мы проверяем - есть ли связанная болезнь с сегментом (не выделенным)
				// Если есть - то мы присваиваем только этому сегменту
				// Если ничего нет, то оставляем как диагноз на сам зуб
				МассивСегментовЗуба = стомЗубнаяКартаМетоды.ПолучитьСегментыЗубаИмеющиеСостояниенаМоментПоиска(стомЗубнаяКартаМетоды.НайтиЗубВКарте(стомДанныеЗубныхКарт.Адрес, ВыделенныйЗуб.ЗубВКарте),СостояниеСегментаПоДиагнозу);
          		
				Если МассивСегментовЗуба.Количество() = 0 Тогда
					НоваяСтрока = Объект.Диагнозы.Добавить();
					НоваяСтрока.ЗубВКарте = ВыделенныйЗуб.ЗубВКарте;
					НоваяСтрока.Диагноз = ТекДанные.Диагноз;		
				Иначе
				    Для каждого СегментЗуба Из МассивСегментовЗуба Цикл
						НоваяСтрока = Объект.Диагнозы.Добавить();
						НоваяСтрока.ЗубВКарте = ВыделенныйЗуб.ЗубВКарте;
						НоваяСтрока.СегментВЗубе  = СегментЗуба;
						НоваяСтрока.Диагноз = ТекДанные.Диагноз;	
					КонецЦикла;
				КонецЕсли;																			
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура стомТаблицаПриАктивизацииЯчейки(Элемент)
	
	ПоляСегмента = Новый Массив;
	ПоляСегмента.Добавить(Элементы.ДиагнозыСегментВЗубе);
	ПоляСегмента.Добавить(Элементы.РаботыСегментВЗубе);
	ПоляСегмента.Добавить(Элементы.НазначенияСегментВЗубе);
	
	Если ПоляСегмента.Найти(Элемент.ТекущийЭлемент) = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
	СписокВыбораСегментов = стомЗубнаяКартаМетоды.ПолучитьСписокВыбораСегментов(стомДанныеЗубныхКарт.Адрес, ТекДанные.ЗубВКарте);
	Для Каждого ЭлементСегмент Из СписокВыбораСегментов Цикл
		Элемент.ТекущийЭлемент.СписокВыбора.Добавить(ЭлементСегмент.Значение, ЭлементСегмент.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура стомТаблицаЗубВКартеПриИзменении(Элемент)
	
	ЭлементТаблица = ОбщегоНазначенияКлиентСерверПереопределяемый.НайтиТаблицуПоляФормы(Элемент);	
	ТекДанные = ЭлементТаблица.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекДанные.СегментВЗубе = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыЗубнойКартыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаИсторияЗубнойКарты Тогда 
		Если Не стомДанныеЗубныхКарт.ИсторияЗубов.Загружена Тогда
			Попытка
				ИнициализироватьИсториюЗубов();
			Исключение
				Сообщить(ОписаниеОшибки());
				стомДанныеЗубныхКарт.ИсторияЗубов.Загружена = Ложь;
			КонецПопытки;
		КонецЕсли;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаПараметрыЗубов Тогда 
		Если Не стомДанныеЗубныхКарт.ПараметрыЗубов.Загружены Тогда
			Попытка
				ЗагрузитьПараметрыЗубнойФормулы();
				ИнициализироватьПараметрыЗубнойФормулы();
			Исключение
				Сообщить(ОписаниеОшибки());
				стомДанныеЗубныхКарт.ПараметрыЗубов.Загружены = Ложь;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура стомЗубнаяКартаУпрощеннаяПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	Если Не стомДанныеЗубныхКарт.СтруктураЗагружена Тогда 
		Возврат;
	КонецЕсли;
	
	Если ДанныеСобытия = Неопределено Или ДанныеСобытия.Element = Неопределено Или
		НРег(ДанныеСобытия.Element.TagName) <> "a" Или Не ЗначениеЗаполнено(ДанныеСобытия.Element.id)	
	Тогда 
		Возврат;
	КонецЕсли;
	
	ДокументHTML = Элементы.стомЗубнаяКартаУпрощенная.Документ;
	СписокСсылок = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоИмени(ДокументHTML, "A", Истина);
	
	ОбластьКвадрантНомер = ДанныеСобытия.Element.id;
	ЭтоЗуб = (СтрДлина(ОбластьКвадрантНомер) = 36);
	
	ВыделениеНескольких = ДанныеСобытия.Event.ctrlKey;
	
	Если ЭтоЗуб Тогда 
		ВыделенныеЗубы = Новый Соответствие;
		ДанныеСобытия.Element.parentNode.className = ?(Не ЗначениеЗаполнено(ДанныеСобытия.Element.parentNode.className), "focus", "");
		Если ВыделениеНескольких Тогда 
			Для Каждого ЭлементСсылка Из СписокСсылок Цикл
				Если ЗначениеЗаполнено(ЭлементСсылка.id) И ЭлементСсылка.parentNode.className = "focus" Тогда
					ВыделенныеЗубы.Вставить(ЭлементСсылка.id);
				КонецЕсли;
			КонецЦикла;
		Иначе
			ЭлементСсылка = ДанныеСобытия.Element;
			Если ЗначениеЗаполнено(ЭлементСсылка.id) И ЭлементСсылка.parentNode.className = "focus" Тогда
				ВыделенныеЗубы.Вставить(ЭлементСсылка.id);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ВыделенныеЗубы = стомЗубнаяКартаМетоды.ПолучитьЗубыПоЧелюстиКвадрантуНомеру(стомДанныеЗубныхКарт.Адрес, ОбластьКвадрантНомер, Истина);
	КонецЕсли;
	
	ВыделенныеЗубыСегментыJSON = стомЗубнаяКартаМетоды.ВыделитьЗубыСегменты(стомДанныеЗубныхКарт.Адрес, ВыделенныеЗубы);
	Если стомДанныеЗубныхКарт.ПриложениеЗагружено Тогда
		стомКомпонентыКлиент.ОбновитьПриложениеЗубнойКарты(Элементы[стомДанныеЗубныхКарт.ИмяЭлемента], ВыделенныеЗубыСегментыJSON); 
	КонецЕсли;
	ПриВыделенииЗубовСегментов(ВыделенныеЗубы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьЗубыУпрощеннойЗубнойКарты()
	
	ДокументHTML = Элементы.стомЗубнаяКартаУпрощенная.Документ;
	Если ДокументHTML = Неопределено Тогда 
		ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM(стомЗубнаяКартаУпрощенная);
	КонецЕсли;
	СписокСсылок = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоИмени(ДокументHTML, "A", Истина);
	
	// Убираем выделение со всех зубов
	Для Каждого ЭлементСсылка Из СписокСсылок Цикл
		Если ЗначениеЗаполнено(ЭлементСсылка.id) Тогда
			ЭлементСсылка.parentNode.className = "";
		КонецЕсли;
	КонецЦикла;
	
	// Устанавливаем выделение выбранным
	Для Каждого ВыделенныйЗуб Из стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты Цикл
		ИдЗуба = ВыделенныйЗуб;
		Если ТипЗнч(ВыделенныйЗуб) = Тип("Структура") Тогда 
			Если ВыделенныйЗуб.Свойство("ЗубВКарте") Тогда 
				ИдЗуба = ВыделенныйЗуб.ЗубВКарте.УникальныйИдентификатор();
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		ЭлементЗуб = ДокументHTML.getElementById(Строка(ИдЗуба));
		Если ЭлементЗуб <> Неопределено Тогда 
			ЭлементЗуб.parentNode.className = "focus";
		КонецЕсли;
	КонецЦикла;
	
	Если РаботаСHTMLКлиентСервер.ЭтоДокументDOM(ДокументHTML) Тогда 
		стомЗубнаяКартаУпрощенная = РаботаСDOMКлиентСервер.ПолучитьТекстHTMLДокументаDOM(ДокументHTML);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВыделенныеЗубыСегментыНажатие(Элемент)
	
	Элементы.ГруппаВыделениеОбластейЗубов.Видимость = Не Элементы.ГруппаВыделениеОбластейЗубов.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ДиагнозыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		
		ТекДанные = Элемент.ТекущиеДанные;
		Если ТекДанные = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		Если стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты.Количество() = 1 Тогда
			Для Каждого ВыделенныйЗуб Из стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты Цикл 
				ТекДанные.ЗубВКарте = ВыделенныйЗуб.ЗубВКарте;
				Если ВыделенныйЗуб.Сегменты.Количество() = 1 Тогда
					ТекДанные.СегментВЗубе = ВыделенныйЗуб.Сегменты[0];
					Элемент.ТекущийЭлемент = Элементы.ДиагнозыДиагноз;
				КонецЕсли;
				Элемент.ТекущийЭлемент = Элементы.ДиагнозыДиагноз;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура стомЗубнаяКартаHTMLДокументСформирован(Элемент)
	
	стомКомпонентыКлиент.ОбработатьЗагрузкуПриложения(ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура стомЗубнаяКартаHTMLИсторияДокументСформирован(Элемент)
	
	стомКомпонентыКлиент.ОбработатьЗагрузкуПриложения(ЭтаФорма, Элемент, стомДанныеЗубныхКарт.ИсторияЗубов);
	
КонецПроцедуры

#Область МассовоеРедактированиеДиагнозов

&НаКлиенте
Процедура ИсходПриИзменении(Элемент)
	
	ИзменениеПоляМножественногоВыделения("Исход",Элементы.Диагнозы.ТекущиеДанные.Исход);	
КонецПроцедуры

&НаКлиенте
Процедура ВидНозологииДиагнозаПриИзменении(Элемент)
	
	ИзменениеПоляМножественногоВыделения("Классификация3",Элементы.Диагнозы.ТекущиеДанные.Классификация3);
КонецПроцедуры

&НаКлиенте
Процедура УточненностьДиагнозаПриИзменении(Элемент)
	
	ИзменениеПоляМножественногоВыделения("Классификация1",Элементы.Диагнозы.ТекущиеДанные.Классификация1);
КонецПроцедуры

&НаКлиенте
Процедура ХарактерЗаболеванияПриИзменении(Элемент)
	
	ИзменениеПоляМножественногоВыделения("Классификация2",Элементы.Диагнозы.ТекущиеДанные.Классификация2);
КонецПроцедуры

&НаКлиенте
Процедура ПолеДиагнозПриИзменении(Элемент)
	
	ИзменениеПоляМножественногоВыделения("Диагноз",Элементы.Диагнозы.ТекущиеДанные.Диагноз);
КонецПроцедуры 

// При изменении нескольких диагнозов одновременно (выделили несколько строк и изменили) заполняются все выделенные поля
//
// Параметры:
//  НаименованиеПоля  - Строка - Имя поля диагноза, который подвергается изменению
//  ЗначениеТекстаЗаполнения  - Произвольный - Значение на заполнение полей диагнозов
//
&НаКлиенте
Процедура ИзменениеПоляМножественногоВыделения(НаименованиеПоля, ЗначениеТекстаЗаполнения)	
	
	// Было выделенно несколько строк в диагнозах. Данные поля допускаются для массового изменения.
	// В выделенных строках содержится значение индекса		
	Если Элементы.Диагнозы.ВыделенныеСтроки.Количество() > 1 Тогда
		
		Для каждого ВыделеннаяСтрокаИндекс Из Элементы.Диагнозы.ВыделенныеСтроки Цикл		
			Объект.Диагнозы.Получить(ВыделеннаяСтрокаИндекс)[НаименованиеПоля] = ЗначениеТекстаЗаполнения;					
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти

#Область ПланЛеченияСтоматология

&НаКлиенте
Процедура ЗаполнитьПланЛеченияСтоматологияКлиент()
	
	СписокНазначенийКопия = СписокНазначений;
	МедицинскаяДеятельность.ЗагрузитьПланЛеченияСтоматология(СписокНазначенийКопия, Объект.ПервичныйПрием);
	КопироватьДанныеФормы(СписокНазначенийКопия, СписокНазначений);
	
	ПересчитатьСуммыПланаЛечения(ЭтаФорма);
	РазвернутьДеревоНазначений();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНазначениеВыделеннымЗубамСегментам(Назначение)
	
	Если стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты.Количество() > 0 Тогда 
		Для Каждого СтрокаЗуб Из стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты Цикл
			Если СтрокаЗуб.Сегменты.Количество() = 1 Тогда 
				СегментВЗубе = СтрокаЗуб.Сегменты[0];
				ДобавитьНазначение(ЭтаФорма, Назначение, Строка(СтрокаЗуб.ЗубВКарте.УникальныйИдентификатор()), СтрокаЗуб.ЗубВКарте, СегментВЗубе);	
			Иначе
				ДобавитьНазначение(ЭтаФорма, Назначение, Строка(СтрокаЗуб.ЗубВКарте.УникальныйИдентификатор()), СтрокаЗуб.ЗубВКарте);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьНазначение(Форма, Назначение, ИдентификаторГруппы, ЗубВКарте, СегментВЗубе = Неопределено, Количество = Неопределено, Дата = Неопределено, Сотрудник = Неопределено, Комментарий = Неопределено, ВидНазначения = Неопределено)
	
	ГруппаНазначений = НайтиГруппуПланаЛечения(Форма, ИдентификаторГруппы);
	Если ГруппаНазначений = Неопределено Тогда
		НоваяГруппа = Форма.СписокНазначений.ПолучитьЭлементы().Добавить();
		НоваяГруппа.ЗубВКарте = ЗубВКарте;
		НоваяГруппа.Назначение = ЗубВКарте;
		НоваяГруппа.ИдентификаторНазначения = ИдентификаторГруппы;	
		ГруппаНазначений = НоваяГруппа;
	КонецЕсли;
	
	ЭлементыГруппы = ГруппаНазначений.ПолучитьЭлементы();
	
	ЭлементГруппы = ЭлементыГруппы.Добавить();
	ЭлементГруппы.Назначение = Назначение;
	ЭлементГруппы.ВидНазначения = ?(ВидНазначения = Неопределено, ПредопределенноеЗначение("Перечисление.ВидыНазначений.Процедура"), ВидНазначения);
	ЭлементГруппы.ЗубВКарте = ЗубВКарте;
	ЭлементГруппы.СегментВЗубе = СегментВЗубе;
	ЭлементГруппы.ИдентификаторНазначения = Новый УникальныйИдентификатор;
	ЭлементГруппы.Цена = Ценообразование.ПолучитьЦену(Форма.Прейскурант, Назначение, Форма.Объект.Дата).Цена;
	ЭлементГруппы.Количество = ?(Количество = Неопределено, 1, Количество);
	ЭлементГруппы.Комментарий = Комментарий;
	
	ЭлементГруппы.Дата = Дата;
	ЭлементГруппы.ДатаНачалаБезВремени = Дата;
	ЭлементГруппы.Сотрудник = Сотрудник;
	
	#Если Клиент Тогда
	Если НоваяГруппа <> Неопределено Тогда
		Форма.Элементы.Назначения.Развернуть(НоваяГруппа.ПолучитьИдентификатор(), Истина);
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НайтиГруппуПланаЛечения(Форма, ИдентификаторНазначения, ТекущаяГруппа = Неопределено)
	
	ИдентификаторНазначенияСтрокой = Строка(ИдентификаторНазначения);
	
	Для Каждого ГруппаНазначений Из Форма.СписокНазначений.ПолучитьЭлементы() Цикл	
		Если ГруппаНазначений.ИдентификаторНазначения = ИдентификаторНазначенияСтрокой И ГруппаНазначений <> ТекущаяГруппа Тогда
			Возврат ГруппаНазначений;
		КонецЕсли;				
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура НазначенияПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.Назначения.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТекДанные <> Неопределено Тогда
		Элементы.НазначенияКонтекстноеМенюПросмотрВыполнения.Доступность = Элементы.Назначения.ТекущиеДанные.ДокументВыполнения.Количество() <> 0;
	КонецЕсли;
	
	ЭтоЗуб = (ТекДанные.ПолучитьРодителя() = Неопределено);
	Для Каждого Поле Из Элементы.Назначения.ПодчиненныеЭлементы Цикл
		Если Поле.Вид = ВидПоляФормы.ПолеВвода И
			Поле <> Элементы.Назначения.ПодчиненныеЭлементы.НазначенияНазначение И
			Поле <> Элементы.Назначения.ПодчиненныеЭлементы.НазначенияФакт
		Тогда 
			Поле.ТолькоПросмотр = ЭтоЗуб;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.НазначенияНазначение.БыстрыйВыбор = ЭтоЗуб;
	Элементы.НазначенияНазначение.РежимВыбораИзСписка = ЭтоЗуб;
	Элементы.НазначенияНазначение.ИсторияВыбораПриВводе = ?(ЭтоЗуб,ИсторияВыбораПриВводе.НеИспользовать, ИсторияВыбораПриВводе.Авто);
	Элементы.НазначенияНазначение.СписокВыбора.Очистить();
	Если ЭтоЗуб Тогда 
		Для Каждого ЭлементВыбора Из стомДанныеЗубныхКарт.СписокВыбораЗубов Цикл
			Элементы.НазначенияНазначение.СписокВыбора.Добавить(ЭлементВыбора.Значение, ЭлементВыбора.Представление);
		КонецЦикла;
		Элементы.НазначенияНазначение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.стомЗубыКарты");
	Иначе
		Элементы.НазначенияНазначение.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	ТекДанные = Элементы.Назначения.ТекущиеДанные;
	
	Отказ = Истина;
	Если ТекДанные = Неопределено Или (ТекДанные.ПолучитьРодителя() = Неопределено И СписокНазначений.ПолучитьЭлементы().Количество() > 0) Тогда
		
		ТекстВопроса = "Необходимо добавить:";
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(0, "Зуб/конструкцию");
		Если стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты.Количество() > 0 Тогда 
			Кнопки.Добавить(1, "Текущий зуб карты");
			Кнопки.Добавить(3, "Назначение в текущий зуб карты");
		КонецЕсли;
		Если ТекДанные <> Неопределено И Не Копирование Тогда
			Кнопки.Добавить(2, "Назначение");
		КонецЕсли;
		Кнопки.СортироватьПоЗначению();
		
		ДополнительныеПараметры = Новый Структура("Копирование", Копирование);
		Если Кнопки.Количество() > 1 Тогда
			ПоказатьВыборИзМеню(Новый ОписаниеОповещения("НазначенияПослеВыбораИзМеню", ЭтаФорма, ДополнительныеПараметры), Кнопки, Элементы.Назначения);
		Иначе
			НазначенияПослеВыбораИзМеню(Новый Структура("Значение", 0), ДополнительныеПараметры);
		КонецЕсли;
		
	Иначе // Добавление/копирование назначения
		
		Назначение = ?(Копирование, ТекДанные.Назначение, Неопределено);
		СегментВЗубе = Неопределено;	// Проверим, выделен ли сегмент у зуба
		Для Сч=0 по стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты.Количество() - 1 Цикл             
			Если ТекДанные.ЗубВКарте = стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты[Сч].ЗубВКарте 
				И стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты[Сч].Сегменты.Количество() = 1 Тогда
				СегментВЗубе = стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты[Сч].Сегменты[0];
				Прервать;
			КонецЕсли;	
		КонецЦикла;
		Элементы.Назначения.ТекущаяСтрока = ДобавитьНазначениеВПланЛечения(ТекДанные.ПолучитьРодителя(), Назначение, СегментВЗубе);
		Элементы.Назначения.ИзменитьСтроку();
		
		Если Элементы.Назначения.ТекущиеДанные <> Неопределено И Не ЗначениеЗаполнено(Элементы.Назначения.ТекущиеДанные.ЗубВКарте) Тогда 
			Элементы.Назначения.ИзменитьСтроку();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначенияПослеВыбораИзМеню(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		
		Копирование = ДополнительныеПараметры.Копирование;
		РезультатВопроса = Результат.Значение;
		ТекДанные = Элементы.Назначения.ТекущиеДанные;
	
		СписокНазначенийДляКопирования = ?(Копирование, ТекДанные.ПолучитьЭлементы(), Неопределено);		
		Если РезультатВопроса = 0 Тогда
			// Добавление строки с пустым зубом
			Элементы.Назначения.ТекущаяСтрока = ДобавитьЗубВПланЛечения(ЭтаФорма, , СписокНазначенийДляКопирования);
			Элементы.Назначения.Развернуть(Элементы.Назначения.ТекущаяСтрока, Ложь);
			
		ИначеЕсли РезультатВопроса = 1 Тогда
			// Добавление строки с текущим зубом в зубной карте. Если уже есть, переход к его назначениям
			Для Каждого СтрокаЗуб Из стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты Цикл
				Элементы.Назначения.ТекущаяСтрока = ДобавитьЗубВПланЛечения(ЭтаФорма, СтрокаЗуб.ЗубВКарте, СписокНазначенийДляКопирования);
			КонецЦикла;
			
			Элементы.Назначения.Развернуть(Элементы.Назначения.ТекущаяСтрока, Ложь);
			Если СписокНазначений.НайтиПоИдентификатору(Элементы.Назначения.ТекущаяСтрока).ПолучитьЭлементы().Количество() = 0 Тогда
				ТекДанные = Элементы.Назначения.ТекущиеДанные;
				Элементы.Назначения.ТекущаяСтрока = ДобавитьНазначениеВПланЛечения(ТекДанные);
			КонецЕсли;
			
		ИначеЕсли РезультатВопроса = 2 Тогда 
			// Добавление строки назначения
			СегментВЗубе = Неопределено;	// Проверим, выделен ли сегмент у зуба
			Для Сч = 0 по стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты.Количество() - 1 Цикл             
				Если ТекДанные.ЗубВКарте = стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты[Сч].ЗубВКарте 
					И стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты[Сч].Сегменты.Количество() = 1 Тогда
					СегментВЗубе = стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты[Сч].Сегменты[0];
					Прервать;
				КонецЕсли;	
			КонецЦикла;
			Элементы.Назначения.ТекущаяСтрока = ДобавитьНазначениеВПланЛечения(ТекДанные,,СегментВЗубе);
			Элементы.Назначения.ИзменитьСтроку();
		ИначеЕсли РезультатВопроса = 3 Тогда 
			// Добавление строки назначения текущему зубу зубной карты. При необходимости, добавление самого зуба
			Для Каждого ВыделенныйЗуб Из стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты Цикл
				Если ВыделенныйЗуб.Сегменты.Количество() = 1 Тогда
					СегментВЗубе = ВыделенныйЗуб.Сегменты[0];
				Иначе
					СегментВЗубе = Неопределено;
				КонецЕсли;
				ДобавитьНазначениеЗубуДляРедактирования(ВыделенныйЗуб.ЗубВКарте, СегментВЗубе);
				Прервать;
			КонецЦикла;
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Элементы.Назначения.ТекущиеДанные <> Неопределено И Не ЗначениеЗаполнено(Элементы.Назначения.ТекущиеДанные.ЗубВКарте) Тогда 
		Элементы.Назначения.ИзменитьСтроку();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначенияПослеУдаления(Элемент)
	
	ПересчитатьСуммыПланаЛечения(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЛечения(Команда)
	
	Если стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты.Количество() = 0 Тогда
		Предупреждение("Не выбран зуб, для которого подбирается план лечения!", 30);
		Возврат;
	КонецЕсли;
	
	мсСостояния = Новый Массив;
	Для Каждого СтрокаСостояние Из стомДоступныеСостояния.ПолучитьЭлементы() Цикл
		мсСостояния.Добавить(СтрокаСостояние.СостояниеСегмент);
	КонецЦикла;
	
	Оповещение = Новый ОписаниеОповещения("ПодборПланаЛеченияПослеВыбораНазначений", ЭтаФорма);
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор, СписокСостояний", Ложь, Истина, мсСостояния);
	ОткрытьФорму("Документ.Прием.Форма.стомФормаПодбора", ПараметрыФормы,,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПозициюПланаЛечения(Команда)
	
	Если стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты.Количество() = 0 Тогда
		Предупреждение("Не выбран зуб, для которого подбирается план лечения!", 30);
		Возврат;
	КонецЕсли;
	
	Если стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты.Количество() > 0 Тогда 
		ВыделенныйЗуб = стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты[0];
		Если ВыделенныйЗуб.Сегменты.Количество() = 1 Тогда
			СегментВЗубе = ВыделенныйЗуб.Сегменты[0];
		Иначе
			СегментВЗубе = Неопределено;
		КонецЕсли;
		
		ДобавитьНазначениеЗубуДляРедактирования(ВыделенныйЗуб.ЗубВКарте, СегментВЗубе);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНазначениеЗубуДляРедактирования(ЗубВКарте, СегментВЗубе = Неопределено, Назначение = Неопределено)
	
	СтрокаЗубПланаЛечения = ДобавитьЗубВПланЛечения(ЭтаФорма, стомДанныеЗубныхКарт.ВыделенныеЗубыСегменты[0].ЗубВКарте);
	ДанныеСтроки = СписокНазначений.НайтиПоИдентификатору(СтрокаЗубПланаЛечения);
	
	Элементы.Назначения.ТекущаяСтрока = ДобавитьНазначениеВПланЛечения(ДанныеСтроки, Назначение, СегментВЗубе);
	
	Если Не ЗначениеЗаполнено(Назначение) Тогда
		Элементы.Назначения.ИзменитьСтроку();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиПланВФактУслуг(Команда)
	
	ВыделенныеСтроки = Элементы.Назначения.ВыделенныеСтроки;
	
	СтрокиНазначений = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		СтрокаПлана = СписокНазначений.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Если СтрокаПлана = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ГруппаЭлемента = СтрокаПлана.ПолучитьРодителя();
		Если ГруппаЭлемента = Неопределено Тогда // Это зуб.
			
			НазначенияЗуба = СтрокаПлана.ПолучитьЭлементы();
			
			// Если выделен и зуб, и хотя бы одно из назначений по нему, то не обрабатываем зуб, только отдельные строки услуг.
			НеОтрабатыватьЗубЦеликом = Ложь;
			Для Каждого СтрокаСегмент Из НазначенияЗуба Цикл
				Если ВыделенныеСтроки.Найти(СтрокаСегмент.ПолучитьИдентификатор()) <> Неопределено Тогда
					НеОтрабатыватьЗубЦеликом = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если НеОтрабатыватьЗубЦеликом Тогда
				Продолжить;
			КонецЕсли;
			
			// Добавляем назначения зуба к обработке.
			Для Каждого СтрокаСегмент Из НазначенияЗуба Цикл
				Если СтрокаСегмент.Факт < СтрокаСегмент.Количество
					И СтрокиНазначений.Найти(СтрокаСегмент) = Неопределено
				Тогда
					СтрокиНазначений.Добавить(СтрокаСегмент);
				КонецЕсли;
			КонецЦикла;
		Иначе // Это строка назначения.
			Если СтрокаПлана.Факт < СтрокаПлана.Количество
				И СтрокиНазначений.Найти(СтрокаПлана) = Неопределено
			Тогда
				СтрокиНазначений.Добавить(СтрокаПлана);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаСегмент Из СтрокиНазначений Цикл
		
		УидНазначения = Новый УникальныйИдентификатор(СтрокаСегмент.ИдентификаторНазначения);
		СтрокиРабот = Объект.Работы.НайтиСтроки(Новый Структура("Ид, ЗубВКарте, Номенклатура", УидНазначения, СтрокаСегмент.ЗубВКарте, СтрокаСегмент.Назначение));
		
		Если СтрокиРабот.Количество() = 0 Тогда
			СтрокаРаботы = Объект.Работы.Добавить();
			СтрокаРаботы.ЗубВКарте = СтрокаСегмент.ЗубВКарте;
			СтрокаРаботы.СегментВЗубе = СтрокаСегмент.СегментВЗубе;
			СтрокаРаботы.Номенклатура = СтрокаСегмент.Назначение;
			СтрокаРаботы.Количество = 1;
			СтрокаРаботы.Ид = УидНазначения;
		Иначе
			СтрокаРаботы = СтрокиРабот[0];
			Если СтрокаРаботы.Количество = 0 
				Или СтрокаРаботы.Количество < СтрокаСегмент.Количество
			Тогда
				СтрокаРаботы.Количество = СтрокаРаботы.Количество + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если мАвтоматическиЗаполнятьМатериалы Тогда
		ЗаполнитьМатериалыПоНормамРабот();
	КонецЕсли;
	ОбновитьСписокРаботДокумента();
	
	Если СтрокиНазначений.Количество() <> 0 Тогда
		Состояние(НСтр("ru='Услуги добавлены в состав выполненных.'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИсторияЗубов

&НаКлиенте
Процедура СформироватьИсториюЗубов(ВыделенныеЗубы)
	
	СформироватьИсториюЗубовСервер(ВыделенныеЗубы);
	Для Каждого Элемент Из стомИсторияЗубов.ПолучитьЭлементы() Цикл
		Элементы.стомИсторияЗубов.Развернуть(Элемент.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьИсториюЗубовСервер(ВыделенныеЗубы)
	
	мсВыделенныеЗубы = Новый Массив;
	Для Каждого кзЗуб Из ВыделенныеЗубы Цикл
		мсВыделенныеЗубы.Добавить(Справочники.стомЗубыКарты.ПолучитьСсылку(Новый УникальныйИдентификатор(кзЗуб.Ключ)));
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	стомСостоянияЗубов.Регистратор КАК Прием,
	|	стомСостоянияЗубов.Период КАК Дата,
	|	стомСостоянияЗубов.ЗубВКарте КАК ЗубВКарте,
	|	стомСостоянияЗубов.СостояниеСегмента КАК Элемент,
	|	0 КАК ТипИстории,
	|	стомСостоянияЗубов.ЗубВКарте.Наименование КАК ЗубВКартеНаименование
	|ИЗ
	|	РегистрСведений.стомСостоянияЗубов КАК стомСостоянияЗубов
	|ГДЕ
	|	стомСостоянияЗубов.ЗубнаяКарта = &ЗубнаяКарта
	|	И стомСостоянияЗубов.Клиент = &Клиент
	|	И стомСостоянияЗубов.ЗубВКарте В(&ВыделенныеЗубы)
	|	И стомСостоянияЗубов.ВидРедактирования = ЗНАЧЕНИЕ(Перечисление.стомВидыРедактированияЭлементовКарты.Добавление)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Диагнозы.Регистратор,
	|	Диагнозы.Период,
	|	Диагнозы.ЗубВКарте,
	|	Диагнозы.Диагноз,
	|	1,
	|	Диагнозы.ЗубВКарте.Наименование
	|ИЗ
	|	РегистрСведений.Диагнозы КАК Диагнозы
	|ГДЕ
	|	Диагнозы.Регистратор.Клиент = &Клиент
	|	И Диагнозы.Регистратор.ЗубнаяКарта = &ЗубнаяКарта
	|	И Диагнозы.ЗубВКарте В(&ВыделенныеЗубы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриемРаботы.Ссылка,
	|	ПриемРаботы.Ссылка.Дата,
	|	ПриемРаботы.ЗубВКарте,
	|	ПриемРаботы.Номенклатура,
	|	2,
	|	ПриемРаботы.ЗубВКарте.Наименование
	|ИЗ
	|	Документ.Прием.Работы КАК ПриемРаботы
	|ГДЕ
	|	ПриемРаботы.Ссылка.Клиент = &Клиент
	|	И ПриемРаботы.Ссылка.ЗубнаяКарта = &ЗубнаяКарта
	|	И ПриемРаботы.ЗубВКарте В(&ВыделенныеЗубы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗубВКартеНаименование,
	|	ТипИстории,
	|	Дата УБЫВ
	|ИТОГИ ПО
	|	ЗубВКарте,
	|	ТипИстории";
	
	Запрос.УстановитьПараметр("ЗубнаяКарта", Объект.ЗубнаяКарта);
	Запрос.УстановитьПараметр("Клиент", Объект.Клиент);
	Запрос.УстановитьПараметр("ВыделенныеЗубы", мсВыделенныеЗубы);

	ВыборкаЗубы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	мсТипыИстории = Новый Массив;
	мсТипыИстории.Добавить("История состояний");
	мсТипыИстории.Добавить("История диагнозов");
	мсТипыИстории.Добавить("История услуг");
	
	ВерхУровень = стомИсторияЗубов.ПолучитьЭлементы();
	ВерхУровень.Очистить();
	
	ДанныеОВыделенныхЗубах = стомЗубнаяКартаМетоды.ПолучитьДанныеОВыделенныхЗубахСегментах(стомДанныеЗубныхКарт.Адрес,ВыделенныеЗубы);
	
	Пока ВыборкаЗубы.Следующий() Цикл
		
		//добавляем ветвь зуба
		ВетвьЗуб = ВерхУровень.Добавить();
		ВетвьЗуб.ЗубВКарте = ВыборкаЗубы.ЗубВКарте;
		ВетвьЗуб.Наименование = ПолучитьНаименованиеЗуба(ВыборкаЗубы.ЗубВКарте, ДанныеОВыделенныхЗубах);
		ВетвьЗуб.Уровень = 0;
		
		ВыборкаТипИстории = ВыборкаЗубы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВетвиТипИстории = ВетвьЗуб.ПолучитьЭлементы();
		Пока ВыборкаТипИстории.Следующий() Цикл
			
			ВетвьТипИстории = ВетвиТипИстории.Добавить();
			ВетвьТипИстории.Наименование = мсТипыИстории[ВыборкаТипИстории.ТипИстории];
			ВетвьТипИстории.Уровень = 1;
			
			ВетвиЭлементы = ВетвьТипИстории.ПолучитьЭлементы();
			ВыборкаЭлементы = ВыборкаТипИстории.Выбрать();
			Пока ВыборкаЭлементы.Следующий() Цикл
				
				НоваяВетвь = ВетвиЭлементы.Добавить();
				НоваяВетвь.ЗубВКарте = ВыборкаЭлементы.ЗубВКарте;
				НоваяВетвь.Прием = ВыборкаЭлементы.Прием;
				НоваяВетвь.Наименование = ВыборкаЭлементы.Элемент;
				НоваяВетвь.Элемент = ВыборкаЭлементы.Элемент;
				НоваяВетвь.ТипИстории = ВыборкаЭлементы.ТипИстории;
				НоваяВетвь.Уровень = 2;
				
			КонецЦикла;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура стомИсторияЗубовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = стомИсторияЗубов.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если ЗначениеЗаполнено(ТекДанные.Прием) Тогда
		ОткрытьЗначение(ТекДанные.Прием)	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантЗубнойКартыПриИзменении(Элемент)
	
	ИнициализироватьЗубнуюКарту();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьИсториюЗубов()
		
	ИнициализироватьИсториюЗубовСервер();
	Если ЗначениеЗаполнено(стомДанныеЗубныхКарт.ИсторияЗубов.ВыбраннаяДата) Тогда 
		УстановитьДатуИсторииЗубов(Команды.Найти(стомДанныеЗубныхКарт.ИсторияЗубов.ВыбраннаяДата));
	Иначе
		стомКомпонентыКлиент.ОбработатьЗагрузкуПриложения(ЭтаФорма, Элементы[стомДанныеЗубныхКарт.ИсторияЗубов.ИмяЭлемента], стомДанныеЗубныхКарт.ИсторияЗубов);
	КонецЕсли;
			
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьИсториюЗубовСервер()
	
	ИсторияЗубов = стомДанныеЗубныхКарт.ИсторияЗубов;
	
	стомЗубнаяКартаМетоды.ОчиститьИсториюЗубов(ИсторияЗубов);
		
	Пока Элементы.ГруппаКомандыДаты.ПодчиненныеЭлементы.Количество() > 0 Цикл
		ТекЭлемент = Элементы.ГруппаКомандыДаты.ПодчиненныеЭлементы.Количество() - 1;
		Элементы.Удалить(Элементы.ГруппаКомандыДаты.ПодчиненныеЭлементы[ТекЭлемент]);
	КонецЦикла;
		
	мсДатыПриемов = стомСтоматология.ПолучитьСписокДатДокументовДляИсторииЗубов(Объект.ЗубнаяКарта, Объект.Клиент);
	Сч = 0;
	
	ГруппаКнопок = Элементы.ГруппаКомандыДаты;
	Для Каждого ДатаПриема Из мсДатыПриемов Цикл
			
		ИмяКоманды = "КнопкаИстория" + Формат(Сч, "ЧН=0; ЧГ=");
		Если Команды.Найти(ИмяКоманды) = Неопределено Тогда
			НоваяКоманда = Команды.Добавить(ИмяКоманды);
			НоваяКоманда.Заголовок = Формат(ДатаПриема, "ДЛФ=D");
			НоваяКоманда.Подсказка = Формат(ДатаПриема, "ДЛФ=DT");
			НоваяКоманда.Действие = "УстановитьДатуИсторииЗубов";
		КонецЕсли;
		
		Если стомДанныеЗубныхКарт.ИсторияЗубов.ВыбраннаяДата = Неопределено Тогда 
			стомДанныеЗубныхКарт.ИсторияЗубов.ВыбраннаяДата = ИмяКоманды;
		КонецЕсли;
		ИсторияЗубов.ДоступныеДаты.Вставить(ИмяКоманды, Новый Структура("Дата, Адрес", ДатаПриема, ""));
		
		Если Сч = 6 Тогда
			ГруппаКнопокПодменю = Элементы.Добавить("ГруппаКомандыДатыПодменю", Тип("ГруппаФормы"), Элементы.ГруппаКомандыДаты);
			ГруппаКнопокПодменю.Заголовок = "Остальные (" + Строка(мсДатыПриемов.Количество() - Сч) + ")";
			ГруппаКнопокПодменю.Вид = ВидГруппыФормы.Подменю;
			ГруппаКнопок = ГруппаКнопокПодменю;
		КонецЕсли;
		
		НовыйЭлемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаКнопок);
		НовыйЭлемент.ИмяКоманды = ИмяКоманды;
		Если Сч = 0 Тогда
			НовыйЭлемент.Пометка = Истина;
		КонецЕсли;
		Сч = Сч + 1;
		
	КонецЦикла;
	
	ИсторияЗубов.ИмяЭлемента = Элементы.стомЗубнаяКартаHTMLИстория.Имя;
	ИсторияЗубов.Загружена = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДатуИсторииЗубов(Команда)
	
	Если Команда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	стомИсторияЗубов.ПолучитьЭлементы().Очистить();
	Для Каждого ЭлементКнопка Из Элементы.ГруппаКомандыДаты.ПодчиненныеЭлементы Цикл
		Если ТипЗнч(ЭлементКнопка) = Тип("КнопкаФормы") Тогда 
			ЭлементКнопка.Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;
	ГруппаПодменю = Элементы.Найти("ГруппаКомандыДатыПодменю");
	Если ГруппаПодменю <> Неопределено Тогда 
		Для Каждого ЭлементКнопка Из ГруппаПодменю.ПодчиненныеЭлементы Цикл
			Если ТипЗнч(ЭлементКнопка) = Тип("КнопкаФормы") Тогда 
				ЭлементКнопка.Пометка = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ИсторияЗубов = стомДанныеЗубныхКарт.ИсторияЗубов;
	ИсторияЗубов.ВыбраннаяДата = Команда.Имя;
	
	ДатаАдрес = ИсторияЗубов.ДоступныеДаты.Получить(ИсторияЗубов.ВыбраннаяДата);
	
	Если ДатаАдрес = Неопределено Тогда 
		ИсторияЗубов.ВыбраннаяДата = Неопределено;
	КонецЕсли;
	
	ДанныеЗКИстории = Новый Структура("АдресЗК, АдресСостояний", АдресЗКИстории, ДатаАдрес.Адрес);
	ИсторияЗубов.Адрес = стомЗубнаяКартаИнициализация.ИнициализироватьЗубнуюКарту(Объект.ЗубнаяКарта, Объект.Клиент, УникальныйИдентификатор, ДатаАдрес.Дата, Объект.ВариантЗубнойКарты, , ДанныеЗКИстории);
	ИсторияЗубов.СтруктураЗагружена = ЭтоАдресВременногоХранилища(ИсторияЗубов.Адрес);
	
	АдресЗКИстории = ДанныеЗКИстории.АдресЗК;
	ДатаАдрес.Адрес = ДанныеЗКИстории.АдресСостояний;
	
	Элементы[ИсторияЗубов.ВыбраннаяДата].Пометка = ИсторияЗубов.СтруктураЗагружена;
	
	стомКомпонентыКлиент.ОбработатьЗагрузкуПриложения(ЭтаФорма, Элементы[ИсторияЗубов.ИмяЭлемента], ИсторияЗубов);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименованиеЗуба(ЗубВКарте, ДанныеОВыделенныхЗубах)
	
	Для Каждого Элемент Из ДанныеОВыделенныхЗубах.ВариантыЗубов.УстановленныеВарианты Цикл		
		
		Если Элемент.ЗубВКарте = ЗубВКарте Тогда
			Вариант = ЗубВКарте.Зуб.СписокВариантов.Найти(Элемент.Вариант);
			Если Вариант <> Неопределено И ЗначениеЗаполнено(Вариант.Обозначение) Тогда
				Возврат Вариант.Обозначение;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат ЗубВКарте; 
	
КонецФункции

#КонецОбласти

#Область ПараметрыЗубов

&НаКлиенте
Процедура ИнициализироватьПараметрыЗубнойФормулы()
	
	Если Не ЗначениеЗаполнено(Объект.Клиент) Или Не ЗначениеЗаполнено(Объект.ЗубнаяКарта) Тогда 
		Возврат;
	КонецЕсли;
	
	ИнициализироватьПараметрыЗубнойФормулыСервер();
	Для Каждого СтрокаПараметр Из стомДеревоПараметровЗК.ПолучитьЭлементы() Цикл
		Если СтрокаПараметр.РазворачиватьПоУмолчанию Тогда 
			Элементы.стомДеревоПараметровЗКВерх.Развернуть(СтрокаПараметр.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПараметрыЗубнойФормулы()
	
	Объект.стомПараметрыЗубнойФормулы.Очистить();
	Если ЗначениеЗаполнено(Объект.Клиент) И ЗначениеЗаполнено(Объект.ЗубнаяКарта) Тогда
		ЗагрузитьПараметрыЗубнойФормулыСервер();
		ТребуетсяПереинициализацияПараметровЗубов = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПараметрыЗубнойФормулыСервер()
		
	Объект.стомПараметрыЗубнойФормулы.Очистить();
	
	Если Не ЗначениеЗаполнено(Объект.Клиент) Или Не ЗначениеЗаполнено(Объект.ЗубнаяКарта) Тогда 
		Возврат;
	КонецЕсли;
	
	Объект.стомПараметрыЗубнойФормулы.Загрузить(
		стомСтоматология.ПолучитьПараметрыЗубнойФормулыНаДату(Объект.Клиент, Объект.ЗубнаяКарта, Объект.Дата, Объект.Ссылка));
		
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьПараметрыЗубнойФормулыСервер()
	
	ТаблицаПорядок = Новый ТаблицаЗначений;
	ТаблицаПорядок.Колонки.Добавить("НаименованиеЗуба", Новый ОписаниеТипов("Строка", , , , Новый КвалификаторыСтроки(10)));
	ТаблицаПорядок.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
	ТаблицаПорядок.ЗагрузитьКолонку(стомСтоматология.ПолучитьДиапазонЗубовЧелюсти(), "НаименованиеЗуба");
	ДиапазонЗубов = стомСтоматология.ПолучитьДиапазонЗубовЧелюсти();
	Для Сч = 0 По ДиапазонЗубов.Количество() - 1 Цикл
		НоваяСтрока = ТаблицаПорядок.Добавить();
		НоваяСтрока.НаименованиеЗуба = ДиапазонЗубов[Сч];
		НоваяСтрока.Порядок = Сч;
	КонецЦикла;
	
	ОбозначенияЗубов = стомДанныеЗубныхКарт.СписокВыбораЗубов;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокЗубов.НаименованиеЗуба,
	|	ПорядокЗубов.Порядок
	|ПОМЕСТИТЬ ПорядокЗубов
	|ИЗ
	|	&ПорядокЗубов КАК ПорядокЗубов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стомОбластиСегментовСписокПараметров.Ссылка КАК Область,
	|	стомОбластиСегментовСписокПараметров.Параметр.Родитель КАК ГруппаПараметров,
	|	стомОбластиСегментовСписокПараметров.Параметр
	|ПОМЕСТИТЬ ПараметрыПоОбластям
	|ИЗ
	|	Справочник.стомОбластиСегментов.СписокПараметров КАК стомОбластиСегментовСписокПараметров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияПараметров.ЗубВКарте,
	|	ЗначенияПараметров.СегментВЗубе,
	|	ЗначенияПараметров.Параметр,
	|	ЗначенияПараметров.Значение
	|ПОМЕСТИТЬ ЗначенияПараметров
	|ИЗ
	|	&ЗначенияПараметров КАК ЗначенияПараметров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стомЗубыКарты.Ссылка КАК ЗубВКарте,
	|	ВЫБОР
	|		КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[12]_""
	|			ТОГДА ""Верх""
	|		КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[34]_""
	|			ТОГДА ""Низ""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Расположение,
	|	ПорядокЗубов.Порядок
	|ПОМЕСТИТЬ ЗубыКарты
	|ИЗ
	|	Справочник.стомЗубыКарты КАК стомЗубыКарты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорядокЗубов КАК ПорядокЗубов
	|		ПО стомЗубыКарты.Наименование = ПорядокЗубов.НаименованиеЗуба
	|ГДЕ
	|	НЕ стомЗубыКарты.ПометкаУдаления
	|	И стомЗубыКарты.Владелец = &ЗубнаяКарта     
	|	И ВЫБОР
	|			КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[12]_""
	|				ТОГДА ""Верх""
	|			КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[34]_""
	|				ТОГДА ""Низ""
	|			ИНАЧЕ """"
	|		КОНЕЦ <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗубыКарты.ЗубВКарте КАК ЗубВКарте,
	|	стомСегментыЗубов.Ссылка КАК СегментВЗубе,
	|	ПараметрыПоОбластям.Область,
	|	ПараметрыПоОбластям.ГруппаПараметров,
	|	ПараметрыПоОбластям.Параметр КАК Параметр,
	|	ЗубыКарты.Порядок,
	|	ЗубыКарты.Расположение
	|ПОМЕСТИТЬ ПараметрыПоЗубам
	|ИЗ
	|	ЗубыКарты КАК ЗубыКарты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.стомСегментыЗубов КАК стомСегментыЗубов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыПоОбластям КАК ПараметрыПоОбластям
	|			ПО стомСегментыЗубов.Сегмент.Область = ПараметрыПоОбластям.Область
	| 		ПО (НЕ стомСегментыЗубов.ПометкаУдаления
	|			И (стомСегментыЗубов.Владелец = &ЗубнаяКарта
	|				ИЛИ ЗубыКарты.ЗубВКарте.Зуб = стомСегментыЗубов.Владелец))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗубыКарты.ЗубВКарте,
	|	ЗубыКарты.Расположение
	|ИЗ
	|	ЗубыКарты КАК ЗубыКарты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗубыКарты.Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыПоЗубам.ГруппаПараметров КАК ГруппаПараметров,
	|	ПараметрыПоЗубам.Параметр КАК Параметр,
	|	ПараметрыПоЗубам.ЗубВКарте КАК ЗубВКарте,
	|	ПараметрыПоЗубам.Область,
	|	ПараметрыПоЗубам.СегментВЗубе,
	|	ЗначенияПараметров.Значение
	|ИЗ
	|	ПараметрыПоЗубам КАК ПараметрыПоЗубам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПараметров КАК ЗначенияПараметров
	|		ПО ПараметрыПоЗубам.ЗубВКарте = ЗначенияПараметров.ЗубВКарте
	|			И ПараметрыПоЗубам.СегментВЗубе = ЗначенияПараметров.СегментВЗубе
	|			И ПараметрыПоЗубам.Параметр = ЗначенияПараметров.Параметр
	|ИТОГИ ПО
	|	ГруппаПараметров,
	|	Параметр,
	|	ЗубВКарте";
	Запрос.УстановитьПараметр("ЗначенияПараметров", Объект.стомПараметрыЗубнойФормулы.Выгрузить());
	Запрос.УстановитьПараметр("ПорядокЗубов", ТаблицаПорядок);
	Запрос.УстановитьПараметр("ЗубнаяКарта", Объект.ЗубнаяКарта);
	Результат = Запрос.ВыполнитьПакет();
	
	ТипПараметров = Новый ОписаниеТипов(Метаданные.ПланыВидовХарактеристик.стомПараметрыЗубнойФормулы.Тип, "СписокЗначений");
	ТипЗуб = Новый ОписаниеТипов("СправочникСсылка.стомЗубыКарты");
	ТипСегмент = Новый ОписаниеТипов("СправочникСсылка.стомСегментыЗубов");
	ТипТаблица = Новый ОписаниеТипов("ТаблицаЗначений");
	
	ПутьРеквизитов = "стомДеревоПараметровЗК";
	соотвПараметрыСтрокиТаблицы = Новый Соответствие;
	соотвГруппыПараметровСтрокиТаблицы = Новый Соответствие;
	
	соотвГруппыПараметровСтрокиТаблицы.Вставить(ПланыВидовХарактеристик.стомПараметрыЗубнойФормулы.ПустаяСсылка(), стомДеревоПараметровЗК);
	
	Если стомДанныеЗубныхКарт.ПараметрыЗубов.РеквизитыЗагружены Тогда
		
		// Обновляем обозначения зубов
		ОбновитьОбозначенияКолонокПараметровЗубов(ОбозначенияЗубов);
		
	Иначе
		
		// Создаем динамические реквизиты
		ВыборкаЗубы = Результат[5].Выбрать();
		Пока ВыборкаЗубы.Следующий() Цикл
			
			ОбозначениеЗуба = Строка(ВыборкаЗубы.ЗубВКарте);
			элЗуб = ОбозначенияЗубов.НайтиПоЗначению(ВыборкаЗубы.ЗубВКарте);
			Если элЗуб <> Неопределено Тогда
				ОбозначениеЗуба = элЗуб.Представление;
			КонецЕсли;
			
			УидРеквизита = ОбщегоНазначенияКлиентСерверПереопределяемый.УИДВСтроку(ВыборкаЗубы.ЗубВКарте.УникальныйИдентификатор());
			// Реквизиты ТЧ
			СтолбецЗуб = Новый РеквизитФормы("ЗубВКарте" + УидРеквизита, ТипЗуб, ПутьРеквизитов);
			СтолбецСегмент = Новый РеквизитФормы("СегментВЗубе" + УидРеквизита, ТипСегмент, ПутьРеквизитов);
			СтолбецЗначение = Новый РеквизитФормы("Значение" + УидРеквизита, ТипПараметров, ПутьРеквизитов, ОбозначениеЗуба);
			СтолбецСегменты = Новый РеквизитФормы("Сегменты" + УидРеквизита, ТипТаблица, ПутьРеквизитов);
			СтолбецСегментыСегмент = Новый РеквизитФормы("СегментВЗубе", ТипСегмент, ПутьРеквизитов + "." + СтолбецСегменты.Имя);
			СтолбецСегментыЗначение = Новый РеквизитФормы("Значение", ТипПараметров, ПутьРеквизитов + "." + СтолбецСегменты.Имя);
			
			
			мсНовыеРеквизиты = Новый Массив;
			мсНовыеРеквизиты.Добавить(СтолбецЗуб);
			мсНовыеРеквизиты.Добавить(СтолбецСегмент);
			мсНовыеРеквизиты.Добавить(СтолбецЗначение);
			мсНовыеРеквизиты.Добавить(СтолбецСегменты);
			мсНовыеРеквизиты.Добавить(СтолбецСегментыСегмент);
			мсНовыеРеквизиты.Добавить(СтолбецСегментыЗначение);
			
			Попытка
				ИзменитьРеквизиты(мсНовыеРеквизиты);
				
				// Элемент ТЧ
				ЭлементТЧ = Элементы[ПутьРеквизитов + ВыборкаЗубы.Расположение];
				ЭлементЗначение = Элементы.Добавить(ПутьРеквизитов + "Значение" + УидРеквизита, Тип("ПолеФормы"), ЭлементТЧ);
				ЭлементЗначение.Вид = ВидПоляФормы.ПолеВвода;
				ЭлементЗначение.ПутьКДанным = СтолбецЗначение.Путь + "." + СтолбецЗначение.Имя;
				ЭлементЗначение.Заголовок = ОбозначениеЗуба;
				ЭлементЗначение.ТекстПодвала = ОбозначениеЗуба;
				ЭлементЗначение.ШрифтЗаголовка = Новый Шрифт(ЭлементЗначение.ШрифтЗаголовка, , , Истина);
				ЭлементЗначение.ШрифтПодвала = ЭлементЗначение.ШрифтЗаголовка;
				ЭлементЗначение.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Центр;
				ЭлементЗначение.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Центр;
				ЭлементЗначение.Ширина = 1;
				ЭлементЗначение.ВыбиратьТип = Ложь;
				ЭлементЗначение.БыстрыйВыбор = Истина;
				ЭлементЗначение.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
				ЭлементЗначение.УстановитьДействие("НачалоВыбора", "стомДеревоПараметровЗКЗначениеНачалоВыбора");
				ЭлементЗначение.УстановитьДействие("ПриИзменении", "стомДеревоПараметровЗКЗначениеПриИзменении");
				ЭлементЗначение.УстановитьДействие("Регулирование", "стомДеревоПараметровЗКЗначениеРегулирование");
				
				// Связи параметров выбора для параметров с типом "Доп. значения характеристик"
				НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Элементы." + ЭлементТЧ.Имя + ".ТекущиеДанные.Параметр");
				мсСвязиПараметров = Новый Массив;
				мсСвязиПараметров.Добавить(НоваяСвязь);
				ЭлементЗначение.СвязиПараметровВыбора = Новый ФиксированныйМассив(мсСвязиПараметров);
			Исключение КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
	ВерхУровеньПараметров = стомДеревоПараметровЗК.ПолучитьЭлементы();
	ВерхУровеньПараметров.Очистить();
	
	// Заполняем параметры зубов
	ВыборкаГруппыПараметров = Результат[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГруппыПараметров.Следующий() Цикл
		
		НоваяГруппа = ВерхУровеньПараметров.Добавить();
		НоваяГруппа.Параметр = ВыборкаГруппыПараметров.ГруппаПараметров;
		НоваяГруппа.НомерКартинки = 0;
		НоваяГруппа.РазворачиватьПоУмолчанию = ВыборкаГруппыПараметров.ГруппаПараметров.РазворачиватьПоУмолчанию;
		УровеньГруппы = НоваяГруппа.ПолучитьЭлементы();
		
		ВыборкаПараметры = ВыборкаГруппыПараметров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПараметры.Следующий() Цикл
			
			НовыйПараметр = УровеньГруппы.Добавить();
			НовыйПараметр.Параметр = ВыборкаПараметры.Параметр;
			НовыйПараметр.ТипЗначения = ВыборкаПараметры.Параметр.ТипЗначения;
			НовыйПараметр.НомерКартинки = -1;
			НовыйПараметр.Регулирование = ВыборкаПараметры.Параметр.Регулирование;
			
			ЗначениеПоУмолчанию = НовыйПараметр.ТипЗначения.ПривестиЗначение(НовыйПараметр.Параметр.ЗначениеПоУмолчанию);
			
			ВыборкаЗубы = ВыборкаПараметры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаЗубы.Следующий() Цикл
				
				УидРеквизита = ОбщегоНазначенияКлиентСерверПереопределяемый.УИДВСтроку(ВыборкаЗубы.ЗубВКарте.УникальныйИдентификатор());
				НовыйПараметр["ЗубВКарте" + УидРеквизита] = ВыборкаЗубы.ЗубВКарте;
				НовыйПараметр["Значение" + УидРеквизита] = ЗначениеПоУмолчанию;
				
				ТаблицаСегментов = НовыйПараметр["Сегменты" + УидРеквизита];
				
				ВыборкаЗначения = ВыборкаЗубы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				СписокЗначенийПараметров = Новый СписокЗначений;
				Пока ВыборкаЗначения.Следующий() Цикл
					
					ЗначениеПараметра = ?(ЗначениеЗаполнено(ВыборкаЗначения.Значение), ВыборкаЗначения.Значение, ЗначениеПоУмолчанию);
					
					НовоеЗначение = ТаблицаСегментов.Добавить();
					НовоеЗначение.СегментВЗубе = ВыборкаЗначения.СегментВЗубе;
					НовоеЗначение.Значение = ЗначениеПараметра;
					
					СписокЗначенийПараметров.Добавить(ЗначениеПараметра, Формат(ЗначениеПараметра, НовыйПараметр.Параметр.ФорматПредставления));
					
				КонецЦикла;
				
				Если СписокЗначенийПараметров.Количество() = 1 Тогда // Если один параметр, то он сразу редактируется в поле 
					НовыйПараметр["Значение" + УидРеквизита] = СписокЗначенийПараметров[0].Значение;
				Иначе // Иначе выводится список параметров
					НовыйПараметр["Значение" + УидРеквизита] = СписокЗначенийПараметров;
				КонецЕсли;
				НовыйПараметр.СписокПолейДляУсловногоОформления.Добавить("стомДеревоПараметровЗКЗначение" + УидРеквизита);
				
			КонецЦикла;
			
			Если НовыйПараметр.СписокПолейДляУсловногоОформления.Количество() > 0 Тогда
				ДобавитьУсловноеОформлениеПараметраЗуба(НовыйПараметр.Параметр, НовыйПараметр.СписокПолейДляУсловногоОформления);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	стомДанныеЗубныхКарт.ПараметрыЗубов.Загружены = Истина;
	стомДанныеЗубныхКарт.ПараметрыЗубов.РеквизитыЗагружены = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформлениеПараметраЗуба(Параметр, СписокПолей)
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "ПараметрыЗубов";
	Для Каждого Элемент Из СписокПолей Цикл
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элемент.Значение);
	КонецЦикла;
	ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("стомДеревоПараметровЗК.Параметр");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Параметр;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Формат", Параметр.ФорматПредставления);
			
КонецПроцедуры

&НаСервере
Процедура ОбновитьОбозначенияКолонокПараметровЗубов(ОбозначенияЗубов = Неопределено)
	
	Если ОбозначенияЗубов = Неопределено Тогда
		ОбозначенияЗубов = стомЗубнаяКартаМетоды.ПолучитьСписокВыбораЗубов(стомДанныеЗубныхКарт.Адрес, Ложь);
	КонецЕсли;
	
	Для Каждого элЗуб Из ОбозначенияЗубов Цикл
		Попытка
			УидРеквизита = ОбщегоНазначенияКлиентСерверПереопределяемый.УИДВСтроку(элЗуб.Значение.УникальныйИдентификатор());
			КолонкаЗуб = Элементы["стомДеревоПараметровЗКЗначение" + УидРеквизита];
			КолонкаЗуб.Заголовок = элЗуб.Представление;
			КолонкаЗуб.ТекстПодвала = элЗуб.Представление;
			КолонкаЗуб.Подсказка = элЗуб.Представление;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура стомДеревоПараметровЗКПередРазворачиванием(Элемент, Строка, Отказ)
	
	Если стомДанныеЗубныхКарт.ПараметрыЗубов.НеВызыватьОбработчикСворачиванияРазворачивания Тогда
		стомДанныеЗубныхКарт.ПараметрыЗубов.НеВызыватьОбработчикСворачиванияРазворачивания = Ложь;
		Возврат;
	КонецЕсли;
	
	Если стомДеревоПараметровЗК.НайтиПоИдентификатору(Строка) = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	стомДанныеЗубныхКарт.ПараметрыЗубов.НеВызыватьОбработчикСворачиванияРазворачивания = Истина;
	
	Если Элемент = Элементы.стомДеревоПараметровЗКНиз Тогда
		Элементы.стомДеревоПараметровЗКВерх.Развернуть(Строка, Ложь);
	ИначеЕсли Элемент = Элементы.стомДеревоПараметровЗКВерх Тогда 
		Элементы.стомДеревоПараметровЗКНиз.Развернуть(Строка, Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура стомДеревоПараметровЗКПередСворачиванием(Элемент, Строка, Отказ)
	
	Если стомДанныеЗубныхКарт.ПараметрыЗубов.НеВызыватьОбработчикСворачиванияРазворачивания Тогда
		стомДанныеЗубныхКарт.ПараметрыЗубов.НеВызыватьОбработчикСворачиванияРазворачивания = Ложь;
		Возврат;
	КонецЕсли;

	Если стомДеревоПараметровЗК.НайтиПоИдентификатору(Строка) = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	стомДанныеЗубныхКарт.ПараметрыЗубов.НеВызыватьОбработчикСворачиванияРазворачивания = Истина;
	
	Если Элемент = Элементы.стомДеревоПараметровЗКНиз Тогда  
		Элементы.стомДеревоПараметровЗКВерх.Свернуть(Строка);
	ИначеЕсли Элемент = Элементы.стомДеревоПараметровЗКВерх Тогда 
		Элементы.стомДеревоПараметровЗКНиз.Свернуть(Строка);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура стомДеревоПараметровЗКЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЭлементТаблица = ОбщегоНазначенияКлиентСерверПереопределяемый.НайтиТаблицуПоляФормы(Элемент);
	ТекДанные = ЭлементТаблица.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УидПараметра = СтрЗаменить(Элемент.Имя, "стомДеревоПараметровЗКЗначение", "");
	ТаблицаСегментов = ТекДанные["Сегменты" + УидПараметра];
	
	Если ТаблицаСегментов.Количество() > 1 Тогда 
		
		СтандартнаяОбработка = Ложь;
		
		Контекст = Новый Структура("ТаблицаСегментов, Элемент, УидПараметра, ТекДанные", ТаблицаСегментов, Элемент, УидПараметра, ТекДанные);
		ПараметрыФормы = Новый Структура("Параметр, СписокСегментов, ОбозначениеЗуба", ТекДанные.Параметр, ТаблицаСегментов, Элемент.Заголовок);
		Оповещение = Новый ОписаниеОповещения("стомДеревоПараметровЗКЗначениеПослеВыбора", ЭтаФорма, Контекст);
		ОткрытьФорму("Документ.Прием.Форма.стомФормаЗаполненияПараметраЗуба", ПараметрыФормы, , , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура стомДеревоПараметровЗКЗначениеПослеВыбора(ЗначенияПараметра, ДополнительныеПараметры) Экспорт 
	
	Если ЗначенияПараметра = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТаблицаСегментов = ДополнительныеПараметры.ТаблицаСегментов;
	Элемент = ДополнительныеПараметры.Элемент;
	УидПараметра = ДополнительныеПараметры.УидПараметра;
	ТекДанные = ДополнительныеПараметры.ТекДанные;
	
	СписокЗначенийПараметра = Новый СписокЗначений;
	ТаблицаСегментов.Очистить();
	Для Каждого СтрокаСегмент Из ЗначенияПараметра Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаСегментов.Добавить(), СтрокаСегмент);
		СписокЗначенийПараметра.Добавить(СтрокаСегмент.Значение, Формат(СтрокаСегмент.Значение, Элемент.Формат));
	КонецЦикла;
	
	ТекДанные["Значение" + УидПараметра] = СписокЗначенийПараметра;
	стомДеревоПараметровЗКЗначениеПриИзменении(Элемент);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура стомДеревоПараметровЗКЗначениеПриИзменении(Элемент)
	
	ЭлементТаблица = ОбщегоНазначенияКлиентСерверПереопределяемый.НайтиТаблицуПоляФормы(Элемент);
	ТекДанные = ЭлементТаблица.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	УидПараметра = СтрЗаменить(Элемент.Имя, "стомДеревоПараметровЗКЗначение", "");
	ТаблицаСегментов = ТекДанные["Сегменты" + УидПараметра];
	
	ОтборСтрок = Новый Структура("ЗубВКарте, Параметр", ТекДанные["ЗубВКарте" + УидПараметра], ТекДанные.Параметр);
	Если ТаблицаСегментов.Количество() = 1 Тогда // Если только один сегмент, то его значение заполняется из поля 
		ТаблицаСегментов[0].Значение = ТекДанные["Значение" + УидПараметра];
	КонецЕсли;
	
	Для Каждого СтрокаСегмент Из ТаблицаСегментов Цикл 
		
		ОтборСтрок.Вставить("СегментВЗубе", СтрокаСегмент.СегментВЗубе);
		СтрокиПараметры = Объект.стомПараметрыЗубнойФормулы.НайтиСтроки(ОтборСтрок);
		Если СтрокиПараметры.Количество() = 0 Тогда
			СтрокаПараметр = Объект.стомПараметрыЗубнойФормулы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаПараметр, ОтборСтрок);
			СтрокаПараметр.Значение = СтрокаСегмент.Значение;
			СтрокаПараметр.ИзмененоВТекущемПриеме = Истина;
		Иначе
			СтрокиПараметры[0].Значение = СтрокаСегмент.Значение;
			СтрокиПараметры[0].ИзмененоВТекущемПриеме = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура стомДеревоПараметровЗКПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЭтоГруппа = (ТекДанные.НомерКартинки = 0);
	//Элемент.ТолькоПросмотр = ЭтоГруппа;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	СписокРеквизитов = "МинимальноеЗначение, МаксимальноеЗначение, ЗапретРучногоРедактирования, Регулирование, ФорматРедактирования, ФорматПредставления";
	РеквизитыПараметра = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ТекДанные.Параметр, СписокРеквизитов);
		
	Для Каждого ИмяКолонкиЗуб Из ТекДанные.СписокПолейДляУсловногоОформления Цикл
		
		КолонкаЗуб = Элементы[ИмяКолонкиЗуб.Значение];
		
		УидПараметра = СтрЗаменить(КолонкаЗуб.Имя, "стомДеревоПараметровЗКЗначение", "");
	    ТаблицаСегментов = ТекДанные["Сегменты" + УидПараметра];
		
		НесколькоСегментов = (ТаблицаСегментов.Количество() > 1);
		
		КолонкаЗуб.РедактированиеТекста = Не РеквизитыПараметра.ЗапретРучногоРедактирования;
		Если НесколькоСегментов Тогда 
			КолонкаЗуб.КнопкаВыбора = Истина;
		Иначе
			КолонкаЗуб.КнопкаВыбора = ?(РеквизитыПараметра.ЗапретРучногоРедактирования, Ложь, Неопределено);
		КонецЕсли;
		КолонкаЗуб.МинимальноеЗначение = РеквизитыПараметра.МинимальноеЗначение;
		КолонкаЗуб.МаксимальноеЗначение = РеквизитыПараметра.МаксимальноеЗначение;
		КолонкаЗуб.КнопкаРегулирования = ?(РеквизитыПараметра.Регулирование > 0, Не НесколькоСегментов, Неопределено);
		КолонкаЗуб.ФорматРедактирования = РеквизитыПараметра.ФорматРедактирования;
		КолонкаЗуб.Формат = РеквизитыПараметра.ФорматПредставления;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура стомДеревоПараметровЗКЗначениеРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	ЭлементТаблица = ОбщегоНазначенияКлиентСерверПереопределяемый.НайтиТаблицуПоляФормы(Элемент);
	ТекДанные = ЭлементТаблица.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	УидПараметра = СтрЗаменить(Элемент.Имя, "стомДеревоПараметровЗКЗначение", "");
	ИмяКолонки = "Значение" + УидПараметра;
	НовоеЗначение = ТекДанные[ИмяКолонки] + Направление * ТекДанные.Регулирование;
	
	// Проверка выхода за диапазон
	Если Элемент.МинимальноеЗначение <> 0 Или Элемент.МаксимальноеЗначение <> 0 Тогда
		НовоеЗначение = Макс(НовоеЗначение, Элемент.МинимальноеЗначение);
		НовоеЗначение = Мин(НовоеЗначение, Элемент.МаксимальноеЗначение);
	КонецЕсли;
	
	ТекДанные[ИмяКолонки] = НовоеЗначение;		
	стомДеревоПараметровЗКЗначениеПриИзменении(Элемент);
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ВводЗубаПоПодстроке // Платформа не дает ввод по подстроке для составных типов даже в Режиме выбора из списка. Обходим ограничение.

&НаКлиенте
Процедура РаботыЗубВКартеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЗубВКартеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, Элементы.Работы);

КонецПроцедуры

&НаКлиенте
Процедура ДиагнозыЗубВКартеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЗубВКартеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, Элементы.Диагнозы);

КонецПроцедуры

&НаКлиенте
Процедура ЗубВКартеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ТаблицаФормы)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение)
		И Не ЗначениеЗаполнено(Элемент.ОграничениеТипа.ПривестиЗначение(ВыбранноеЗначение))
	Тогда
		ТаблицаФормы.ТекущиеДанные.ЗубВКарте = ВыбранноеЗначение;
		Типы = Новый Массив;
		Типы.Добавить(ТипЗнч(ВыбранноеЗначение));
		Элемент.ОграничениеТипа = Новый ОписаниеТипов(Типы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
