#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПравоДоступа("Чтение", Метаданные.Справочники.СтруктураПодразделений)
	   И ПравоДоступа("Чтение", Метаданные.Справочники.РеестрМедицинскихОрганизаций)
	Тогда
		Если ЗначениеЗаполнено(Объект.Филиал) Тогда
			НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ПолучитьДоступныеПодразделенияМинздрава(Объект.Филиал));
			НовыйМассив = Новый Массив();
			НовыйМассив.Добавить(НовыйПараметр);
			НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
			Элементы.ПодразделениеМинздрава.ПараметрыВыбора = НовыеПараметры;
		КонецЕсли;
	Иначе
		Элементы.ГруппаРеквизитыМедицинскогоПодразделения.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", ПолучитьДоступныеПодразделенияМинздрава(Объект.Филиал));
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ПодразделениеМинздрава.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДоступныеПодразделенияМинздрава(Филиал)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СправочникСтруктураПодразделений.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтруктураПодразделений КАК СправочникСтруктураПодразделений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктураПодразделений.Атрибуты КАК СтруктураПодразделенийАтрибуты
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РеестрМедицинскихОрганизаций КАК РеестрМедицинскихОрганизаций
		|			ПО (СтруктураПодразделенийАтрибуты.Ключ = ""mo_oid"")
		|				И СтруктураПодразделенийАтрибуты.Значение = РеестрМедицинскихОрганизаций.OIDОрганизации
		|		ПО (СтруктураПодразделенийАтрибуты.Ссылка = СправочникСтруктураПодразделений.Ссылка)
		|			И (СправочникСтруктураПодразделений.ТестовыйКонтур = РеестрМедицинскихОрганизаций.ТестовыйКонтур)
		|			И (РеестрМедицинскихОрганизаций.Ссылка = &МедицинскаяОрганизация)";
	
	Запрос.УстановитьПараметр("МедицинскаяОрганизация", Филиал.Организация.МедицинскаяОрганизация);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#КонецОбласти