// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("Печать", "Печать факторов риска");
	
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура формирует печатную форму документа
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Функция Печать(СсылкаНаОбъект, ИмяМакета) Экспорт
	
	Перем ТабДокумент;
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "Печать" Тогда
		ТабДокумент = ПечатьДокумента(СсылкаНаОбъект);
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьДокумента(СсылкаНаОбъект) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	
	Баллы1 = 0;
	Баллы2 = 0;
	Баллы3 = 0;
	Макет = Документы.РасчетФакторовРиска.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасчетФакторовРискаФакторыРиска.ФакторРиска.Наименование КАК ФакторРиска,
	|	РасчетФакторовРискаФакторыРиска.Баллы КАК Баллы,
	|	РасчетФакторовРискаФакторыРиска.ПервыйТриместр КАК ПервыйТриместр,
	|	РасчетФакторовРискаФакторыРиска.ВторойТриместр КАК ВторойТриместр,
	|	РасчетФакторовРискаФакторыРиска.ТретийТриместр КАК ТретийТриместр,
	|	РасчетФакторовРискаФакторыРиска.ФакторРиска КАК ФакторРискаСсылка,
	|	РасчетФакторовРискаФакторыРиска.ФакторРиска.ВозможенВыборНесколькихДочернихЭлементов КАК ВозможенВыборНесколькихДочернихЭлементов
	|ИЗ
	|	Документ.РасчетФакторовРиска.ФакторыРиска КАК РасчетФакторовРискаФакторыРиска
	|ГДЕ
	|	РасчетФакторовРискаФакторыРиска.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФакторРискаСсылка";
	Запрос.Параметры.Вставить("Ссылка", СсылкаНаОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Клиент = ОбщегоНазначения.ФИОФизЛица(СсылкаНаОбъект.Клиент);
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	ОбластьШапкаТаблицы.Параметры.ПервыйТриместр = Формат(СсылкаНаОбъект.ДатаПервыйТриместр,"ДФ=dd.MM.yyyy");
	ОбластьШапкаТаблицы.Параметры.ВторойТриместр = Формат(СсылкаНаОбъект.ДатаВторойТриместр,"ДФ=dd.MM.yyyy");
	ОбластьШапкаТаблицы.Параметры.ТретийТриместр = Формат(СсылкаНаОбъект.ДатаТретийТриместр,"ДФ=dd.MM.yyyy");
	
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьСтрокаГруппа 	= Макет.ПолучитьОбласть("СтрокаГруппа");
	ОбластьСтрокаПодруппа 	= Макет.ПолучитьОбласть("СтрокаПодгруппа");
	ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
	
	ПроверкаВыводаДвухСтрок = Новый Массив;
	ПроверкаВыводаДвухСтрок.Добавить(ОбластьСтрока);
	ПроверкаВыводаДвухСтрок.Добавить(ОбластьСтрока);
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ФакторРискаСсылка.Уровень() = 0 Тогда
			ОбластьСтрокаГруппа.Параметры.НаименованиеГруппы = Выборка.ФакторРиска;
			
			Если Выборка.ВозможенВыборНесколькихДочернихЭлементов
				И Не ТабДок.ПроверитьВывод(ПроверкаВыводаДвухСтрок)
			Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ТабДок.Вывести(ОбластьСтрокаГруппа);
		Иначе
			
			Если Выборка.ФакторРискаСсылка.Уровень() = 1 Тогда
				ОбластьСтр = ОбластьСтрокаПодруппа;
				Если Не ТабДок.ПроверитьВывод(ПроверкаВыводаДвухСтрок) Тогда
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
			Иначе
				ОбластьСтр = ОбластьСтрока;
			КонецЕсли;
			
			ОбластьСтр.Параметры.НаименованиеЭлемента = Выборка.ФакторРиска;
			ОбластьСтр.Параметры.Баллы = Выборка.Баллы;
			Если Выборка.ПервыйТриместр Тогда
				ОбластьСтр.Параметры.Значение1 = "V";
				Баллы1 = Баллы1 + Выборка.Баллы;
			Иначе
				ОбластьСтр.Параметры.Значение1 = "";
			КонецЕсли;
			Если Выборка.ВторойТриместр Тогда
				ОбластьСтр.Параметры.Значение2 = "V";
				Баллы2 = Баллы2 + Выборка.Баллы;
			Иначе
				ОбластьСтр.Параметры.Значение2 = "";
			КонецЕсли;
			
			Если Выборка.ТретийТриместр Тогда
				ОбластьСтр.Параметры.Значение3 = "V";
				Баллы3 = Баллы3 + Выборка.Баллы;
			Иначе
				ОбластьСтр.Параметры.Значение3 = "";
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьСтр);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Балл1 = Баллы1;
	ОбластьПодвал.Параметры.Балл2 = Баллы2;
	ОбластьПодвал.Параметры.Балл3 = Баллы3;
	ОбластьПодвал.Параметры.Риск1 = ПолучитьСтепеньРиска(Баллы1);
	ОбластьПодвал.Параметры.Риск2 = ПолучитьСтепеньРиска(Баллы2);
	ОбластьПодвал.Параметры.Риск3 = ПолучитьСтепеньРиска(Баллы3);
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции

Функция ПолучитьСтепеньРиска(Баллы)
	Если Баллы >= 25 Тогда
		Возврат "Высокий";
	ИначеЕсли Баллы <= 15 Тогда 
		Возврат "Низкий";
	Иначе
		Возврат "Средний";
	КонецЕсли;
КонецФункции
