#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не Отказ Тогда
		ТабДок = Документы.РасчетФакторовРиска.Печать(Ссылка, "Печать");
		ИмяФайла = ПолучитьИмяВременногоФайла();
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.HTML5);
		ТекстHТМЛ = Новый ТекстовыйДокумент;
		ТекстHТМЛ.Прочитать(ИмяФайла);
		Текст = ТекстHТМЛ.ПолучитьТекст();
		Текст = РаботаСHTMLКлиентСервер.ПеренестиСтилиИзHeadВТелоДокументаСЗаменойИменКлассов(Текст);
		
		HTMLПредставление = Новый ХранилищеЗначения(Текст);
		Записать();
		
		Попытка
			УдалитьФайлы(ИмяФайла);
		Исключение КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
