
Процедура ВыполнитьОтправкуФайла(ПараметрыСообщения, АдресРезультата) Экспорт
    
    Результат = Новый Структура;
    Результат.Вставить("Успех", Ложь);
    Результат.Вставить("ТекстОшибки", "");
    
    Попытка
        
        ПутьКФайлу = ПараметрыСообщения.ПутьКФайлу;
		
		Бот = ОБработки.iga_ChatBot.Создать();
		Бот.ИнициализацияОсновныхПараметров();
		
		РезультатОтправки = Бот.ОтправитьВидеоАудиоИзображениеДокумент(ПараметрыСообщения.ИдЧата, 
			ПутьКФайлу, ПараметрыСообщения.Сообщение, ПараметрыСообщения.ИмяФайла);
		
		
        Результат.Успех = Истина;
        
    Исключение
        Информация = ИнформацияОбОшибке();
        Результат.ТекстОшибки = КраткоеПредставлениеОшибки(Информация);
    КонецПопытки;
    
    ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
    
КонецПроцедуры

Процедура ЗагрузитьИсториюСообщений(ДатаНачала, ДатаОкончания) Экспорт
	
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	
	Бот.ПолучитьИОбработатьСообщенияИзИстории(ДатаНачала, ДатаОкончания);
	
КонецПроцедуры

Процедура УстановитьПараметрОбщения(ЧатСсылка, ИмяПараметра, Значение) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПараметрыОбщения.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.iga_ПараметрыОбщения КАК iga_ПараметрыОбщения
	               |ГДЕ
	               |	iga_ПараметрыОбщения.ИмяПараметра = &ИмяПараметра";
	Запрос.УстановитьПараметр("ИмяПараметра", СокрЛП(ИмяПараметра));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПараметрСсылка = Выборка.Ссылка;
	Иначе
		ПараметрОбъект = Справочники.iga_ПараметрыОбщения.СоздатьЭлемент();
		ПараметрОбъект.Наименование = ИмяПараметра;
		ПараметрОбъект.ИмяПараметра = СокрЛП(ИмяПараметра);
		ПараметрОбъект.Записать();
		ПараметрСсылка = ПараметрОбъект.Ссылка;
	КонецЕсли;
	
	ЗаписьПараметра = РегистрыСведений.iga_ПараметрыОбщенияСБотом.СоздатьМенеджерЗаписи();
	ЗаписьПараметра.Чат = ЧатСсылка;
	ЗаписьПараметра.Параметр = ПараметрСсылка;
	ЗаписьПараметра.Значение = Значение;
	ЗаписьПараметра.Записать();
	
КонецПроцедуры

Функция ПолучитьЗначениеПараметраОбщения(ЧатСсылка, ИмяПараметра, БазовоеЗначение = "") Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПараметрыОбщения.Ссылка КАК Ссылка,
	               |	iga_ПараметрыОбщенияСБотом.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.iga_ПараметрыОбщенияСБотом КАК iga_ПараметрыОбщенияСБотом
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.iga_ПараметрыОбщения КАК iga_ПараметрыОбщения
	               |		ПО iga_ПараметрыОбщенияСБотом.Параметр = iga_ПараметрыОбщения.Ссылка
	               |ГДЕ
	               |	iga_ПараметрыОбщения.ИмяПараметра ПОДОБНО &ИмяПараметра
	               |	И iga_ПараметрыОбщенияСБотом.Чат = &Чат";
	Запрос.УстановитьПараметр("ИмяПараметра", СокрЛП(ИмяПараметра));
	Запрос.УстановитьПараметр("Чат", ЧатСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	КонецЕсли;
	
	Возврат БазовоеЗначение;
	
КонецФункции

Функция ПолучитьДатуПоследнегоСообщения(ЧатСсылка, ТолькоВходящие = Ложь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПоследниеСообщенияЧатов.Чат КАК Чат,
	               |	iga_ПоследниеСообщенияЧатов.ДатаСообщения КАК ДатаСообщения
	               |ИЗ
	               |	РегистрСведений.iga_ПоследниеСообщенияЧатов КАК iga_ПоследниеСообщенияЧатов
	               |ГДЕ
	               |	iga_ПоследниеСообщенияЧатов.Чат = &Чат
	               |	И ВЫБОР
	               |			КОГДА &ТолькоВходящие
	               |				ТОГДА iga_ПоследниеСообщенияЧатов.ЭтоВходящее
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаСообщения УБЫВ";
	Запрос.УстановитьПараметр("Чат", ЧатСсылка);
	Запрос.УстановитьПараметр("ТолькоВходящие", ТолькоВходящие);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДатаСообщения;
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;
	
КонецФункции

Функция ПроверитьНомерТелефонаНаВацап(НомерТелефона) Экспорт 
	
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	Результат = Бот.ПроверитьНаличиеWhatsApp(НомерТелефона);
	
	Если Результат = Неопределено Тогда
		Возврат Новый Структура("Успешно, ТекстОшибки", Ложь, "Ошибка сервиса");
	ИначеЕсли Не Результат.Свойство("existsWhatsapp") Или Не Результат.existsWhatsapp = Истина Тогда
		Возврат Новый Структура("Успешно, ТекстОшибки", Ложь, "Аккаунт по номеру не найден");
	Иначе
		Возврат Новый Структура("Успешно", Истина);
	КонецЕсли;
	
КонецФункции

Функция НайтиЧатПоНомеруТелефона(НомерТелефона) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_Чаты.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.iga_Чаты КАК iga_Чаты
	               |ГДЕ
	               |	iga_Чаты.Идентификатор ПОДОБНО ""%"" + &Идентификатор + ""%""";
	Запрос.УстановитьПараметр("Идентификатор", НомерТелефона);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	
КонецФункции

Функция ЗапускСценарияПоТриггеру(ПараметрыПроверки, Сквозной = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ТриггерыЗапускаСценария.АлгоритмПроверки КАК АлгоритмПроверки,
	               |	iga_ТриггерыЗапускаСценария.ЭтапСценария КАК ЭтапСценария,
	               |	iga_ТриггерыЗапускаСценария.АлгоритмПроверки.ИмяАлгоритма КАК АлгоритмПроверкиИмяАлгоритма,
	               |	iga_ТриггерыЗапускаСценария.ВыполнитьЭтап КАК ВыполнитьЭтап,
	               |	iga_ТриггерыЗапускаСценария.АлгоритмПроверки.Алгоритм КАК АлгоритмПроверкиАлгоритм,
	               |	iga_ТриггерыЗапускаСценария.БезОбщенияСБотом КАК БезОбщенияСБотом
	               |ИЗ
	               |	РегистрСведений.iga_ТриггерыЗапускаСценария КАК iga_ТриггерыЗапускаСценария
	               |ГДЕ
	               |	iga_ТриггерыЗапускаСценария.Сквозной = &Сквозной И Активный";
	Запрос.УстановитьПараметр("Сквозной", Сквозной);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Обработчик = Обработки.iga_ОбработчикЭтапов.Создать();
	ВходящиеПараметры = Новый Структура;
	ВходящиеПараметры.Вставить("Чат", ПараметрыПроверки.ЧатСсылка);
	ВходящиеПараметры.Вставить("ИдЧата", ПараметрыПроверки.ИдЧата);
	ВходящиеПараметры.Вставить("ТекстСообщения", ПараметрыПроверки.ТекстСообщения);
	ВходящиеПараметры.Вставить("ВыборКнопки", ПараметрыПроверки.ВыборКнопки);
	ВходящиеПараметры.Вставить("ТипСообщения", ПараметрыПроверки.ТипСообщения);
	ВходящиеПараметры.Вставить("ИдШаблона", ПараметрыПроверки.ИдШаблона);
	ВходящиеПараметры.Вставить("ИдСообщения", ПараметрыПроверки.ИдСообщения);
	ВходящиеПараметры.Вставить("ИдЦитаты", ПараметрыПроверки.ИдЦитаты);
	
	Обработчик.ВходящиеПараметры = ВходящиеПараметры;
	
	Пока Выборка.Следующий() Цикл
		
		СтекВызовов = Новый Массив;
		
		Попытка
			Выполнен = Обработчик.Алгоритм(Выборка.АлгоритмПроверкиИмяАлгоритма,, СтекВызовов);
		Исключение
			
			СтрокаВызововАлгоритма = СтрСоединить(СтекВызовов, "->");
			
			Инфо = ИнформацияОбОшибке();
			ХешОшибки = iga_ОбщегоНазначенияСервер.ПолучитьКлючОшибки(Инфо);
			
			// Вызов функции записи из предыдущего ответа (с передачей готового Хеша)
			iga_ОбщегоНазначенияСервер.ЗарегистрироватьОшибкуБота(ХешОшибки, "Чат: " + ВходящиеПараметры.Чат + "
			|Стек вызовов: " + СтрокаВызововАлгоритма + Символы.ПС + ПодробноеПредставлениеОшибки(Инфо));
			Выполнен = Ложь;
		КонецПопытки;
		
		Если Выполнен = Истина Тогда
			
			Если Не Выборка.ВыполнитьЭтап Тогда
				ЗаписьСостояния = РегистрыСведений.iga_СостояниеБота.СоздатьМенеджерЗаписи();
				ЗаписьСостояния.Чат = ПараметрыПроверки.ЧатСсылка;
				ЗаписьСостояния.ТекущийЭтап = Выборка.ЭтапСценария;
				ЗаписьСостояния.ДатаАктивности = ТекущаяДата();
				ЗаписьСостояния.Записать();
				
				iga_БотСценарииСервер.ОбработатьВходящееСообщение(ПараметрыПроверки.ЧатСсылка, 
					ПараметрыПроверки.ИдЧата, ПараметрыПроверки.ТекстСообщения, ПараметрыПроверки.ВыборКнопки, Выборка.БезОбщенияСБотом, ВходящиеПараметры);
					
			Иначе
				
				iga_БотСценарииСервер.ВыполнитьОбработчикПередЭтапом(Неопределено, ПараметрыПроверки.ЧатСсылка, 
					ПараметрыПроверки.ИдЧата, Выборка.ЭтапСценария, ПараметрыПроверки.ТекстСообщения, 
					ПараметрыПроверки.ВыборКнопки, ВходящиеПараметры);

				iga_БотСценарииСервер.ВыполнитьЭтап(ПараметрыПроверки.ЧатСсылка, ПараметрыПроверки.ИдЧата,,Выборка.ЭтапСценария, ,Выборка.БезОбщенияСБотом, ВходящиеПараметры);
					
			КонецЕсли;
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура УстановитьПараметрСообщения(Чат, ИдСообщения, ИмяПараметра, Значение) Экспорт
	
	ЗаписьПараметра = РегистрыСведений.iga_ПараметрыСообщений.СоздатьМенеджерЗаписи();
	ЗаписьПараметра.Чат = Чат;
	ЗаписьПараметра.IDСообщения = ИдСообщения;
	ЗаписьПараметра.Параметр = ИмяПараметра;
	ЗаписьПараметра.Значение = Значение;
	ЗаписьПараметра.Записать();
	
КонецПроцедуры

Функция ПолучитьПараметрСообщения(Чат, ИдСообщения, ИмяПараметра) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПараметрыСообщений.Параметр КАК Параметр,
	               |	iga_ПараметрыСообщений.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.iga_ПараметрыСообщений КАК iga_ПараметрыСообщений
	               |ГДЕ
	               |	iga_ПараметрыСообщений.Чат = &Чат
	               |	И iga_ПараметрыСообщений.IDСообщения = &IDСообщения
	               |	И iga_ПараметрыСообщений.Параметр ПОДОБНО &Параметр";
	Запрос.УстановитьПараметр("Чат", Чат);
	Запрос.УстановитьПараметр("IDСообщения", ИдСообщения);
	Запрос.УстановитьПараметр("Параметр", ИмяПараметра);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Значение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
