#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоСсылкаИлиОбъектФормы(Объект, ТипСсылки) Экспорт
	
	ТипОбъекта = ТипЗнч(Объект);
	Если ТипОбъекта = ТипСсылки
	 Или ТипОбъекта = Тип("ДанныеФормыСтруктура") И ТипЗнч(Объект.Ссылка) = ТипСсылки Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ВыбратьДокументПоступления(Форма, Объект, ОповещениеПриЗавершении) Экспорт
	
	НовыйОтбор = Новый Структура;
	НовыйОтбор.Вставить("ПометкаУдаления", Ложь);
	
	ПоляОтбора = "Ссылка, Организация, МестоДеятельности, Грузоотправитель, МестоДеятельностиГрузоотправителя";
	Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") Тогда
		ЗначенияОтбораИлиОбъект = Новый Структура(ПоляОтбора);
		ЗаполнитьЗначенияСвойств(ЗначенияОтбораИлиОбъект, Объект);
	Иначе
		ЗначенияОтбораИлиОбъект = Объект;
	КонецЕсли;
	
	Отбор = ИнтеграцияМДЛПМедицинаВызовСервера_БИТ.СтруктураОтбораДляВыбораДокументаПоступления(ЗначенияОтбораИлиОбъект, ПоляОтбора);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(НовыйОтбор, Отбор, Истина);
	
	ОткрытьФорму(
		"Документ.ПоступлениеТоваровУслуг.ФормаВыбора",
		Новый Структура("Отбор", НовыйОтбор),
		Форма,
		,
		,
		,
		ОповещениеПриЗавершении);
	
КонецПроцедуры

Процедура ВыбратьДокументПоступленияДляПеремещения(Форма, Объект, ОповещениеПриЗавершении) Экспорт
	
	НовыйОтбор = Новый Структура;
	НовыйОтбор.Вставить("ПометкаУдаления", Ложь);
	// НовыйОтбор.Вставить("Операция", ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.БезвозмездноеПоступлениеПрочее"));
	
	ЗначенияОтбораИлиОбъект = Неопределено;
	ЗапрашиваемыеПоля = Новый Структура;
	ЗапрашиваемыеПоля.Вставить("Организация");
	ЗапрашиваемыеПоля.Вставить("Ссылка");
	ЗапрашиваемыеПоля.Вставить("МестоДеятельности", "МестоДеятельностиПолучатель");
	ЗапрашиваемыеПоля.Вставить("Грузоотправитель", "Организация");
	ЗапрашиваемыеПоля.Вставить("МестоДеятельностиГрузоотправителя", "МестоДеятельности");
	Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") Тогда
		ЗначенияОтбораИлиОбъект = Новый Структура;
		Для Каждого КлючЗначение Из ЗапрашиваемыеПоля Цикл
			ПутьКПолю = ?(ЗначениеЗаполнено(КлючЗначение.Значение), КлючЗначение.Значение, КлючЗначение.Ключ);
			Значение = ЗначениеРеквизитаФормы(Объект, ПутьКПолю);
			ЗначенияОтбораИлиОбъект.Вставить(КлючЗначение.Ключ, Значение);
		КонецЦикла;
	Иначе
		ЗначенияОтбораИлиОбъект = Объект;
	КонецЕсли;
	
	Отбор = ИнтеграцияМДЛПМедицинаВызовСервера_БИТ.СтруктураОтбораДляВыбораДокументаПоступления(ЗначенияОтбораИлиОбъект, ЗапрашиваемыеПоля);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(НовыйОтбор, Отбор, Истина);
	
	ОткрытьФорму(
		"Документ.ПоступлениеТоваровУслуг.ФормаВыбора",
		Новый Структура("Отбор", НовыйОтбор),
		Форма,
		,
		,
		,
		ОповещениеПриЗавершении);
	
КонецПроцедуры

Процедура ВыбратьДокументПоступленияДляОприходования(Форма, Объект, ОповещениеПриЗавершении) Экспорт
	
	НовыйОтбор = Новый Структура;
	НовыйОтбор.Вставить("ПометкаУдаления", Ложь);
	
	ПоляОтбора = "Ссылка, Организация, МестоДеятельности, Грузоотправитель";
	Если ТипЗнч(Объект) = Тип("ДанныеФормыСтруктура") Тогда
		ЗнаенияОтбораИлиОбъект = Новый Структура(ПоляОтбора);
		ЗаполнитьЗначенияСвойств(ЗнаенияОтбораИлиОбъект, Объект);
	Иначе
		ЗнаенияОтбораИлиОбъект = Объект;
	КонецЕсли;
	
	Отбор = ИнтеграцияМДЛПМедицинаВызовСервера_БИТ.СтруктураОтбораДляВыбораДокументаПоступления(ЗнаенияОтбораИлиОбъект, ПоляОтбора);
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(НовыйОтбор, Отбор, Истина);
	
	ОткрытьФорму(
		"Документ.ПоступлениеТоваровУслуг.ФормаВыбора",
		Новый Структура("Отбор", НовыйОтбор),
		Форма,
		,
		,
		,
		ОповещениеПриЗавершении);
	
КонецПроцедуры

// Возвращает значение реквизита формы по заданному пути.
//
// Параметры:
//  Форма - Неопределено 
//  ПутьКДанным  - Строка - полное имя реквизита формы, содержащего значение. Например "Объект.Контрагент"
//                         или "Объект.Товары[5].Номенклатура"
// Возвращаемое значение:
//	Неопределено - Значение реквизита формы
//
Функция ЗначениеРеквизитаФормы(Знач Форма, Знач ПутьКДанным) Экспорт
	
	ТекущееЗначение = Форма;
	ЧастиПути = СтрЗаменить(СтрЗаменить(ПутьКДанным, " ", ""), ".", Символы.ПС);
	Для Позиция = 1 По СтрЧислоСтрок(ЧастиПути) Цикл
		ВладелецЗначения = ТекущееЗначение;
		ИмяРеквизита = СтрПолучитьСтроку(ЧастиПути, Позиция);
		Если Прав(ИмяРеквизита, 1) = "]" Тогда
			ПозицияСкобки = Найти(ИмяРеквизита, "[");
			Индекс = Число(Сред(Лев(ИмяРеквизита, СтрДлина(ИмяРеквизита) - 1), ПозицияСкобки + 1));
			ИмяРеквизита = Лев(ИмяРеквизита, ПозицияСкобки - 1);
			ТекущееЗначение = ВладелецЗначения[ИмяРеквизита].НайтиПоИдентификатору(Индекс);
		Иначе
			ТекущееЗначение = ВладелецЗначения[ИмяРеквизита];
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТекущееЗначение;
	
КонецФункции

#КонецОбласти