
Процедура Обработчик_ПослеВыбораЯзыка(ЯзыкЧата, ДопПараметры) Экспорт 
	
	Если ЯзыкЧата = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры.Вставить("ЯзыкЧата", ЯзыкЧата);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(ДопПараметры.ОбработчикОповещения, 
		?(ДопПараметры.МодульОповещения = Неопределено, ДопПараметры.Форма, ДопПараметры.МодульОповещения), ДопПараметры);
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, ДопПараметры);

КонецПроцедуры

Асинх Процедура ОтправитьУведомлениеНаНомерТелефона(ПараметрыУведомления)
	
	СостояниеПроверки = iga_ОбработкаДанныхПоЧатамСервер.ПроверкаНомераТелефона(ПараметрыУведомления.НомерТелефона);
	
	Если Не СостояниеПроверки.Успешно Тогда
		ПоказатьПредупреждение(,СостояниеПроверки.ТекстОшибки,, "Отправка уведомления о записи");
		Возврат;
	КонецЕсли;
	
	ЧатСсылка = iga_ОбработкаДанныхПоЧатамСервер.ПолучитьЧатПоНомеру(ПараметрыУведомления.НомерТелефона, 
		ПараметрыУведомления.Клиент);
	
	Если ПараметрыУведомления.СохранитьНомер Тогда
		iga_ОбработкаДанныхПоЧатамСервер.СохранитьНомерВКонтактнойИнформации(ПараметрыУведомления.Клиент, 
			ПараметрыУведомления.НомерТелефона); 
		iga_ОбработкаДанныхПоЧатамСервер.ПривязатьЧатККлиенту(ПараметрыУведомления.Клиент, ЧатСсылка);
		
	КонецЕсли;
	
	ЯзыкЧата = iga_ОбработкаДанныхПоЧатамСервер.ПолучитьЯзыкЧата(ЧатСсылка);
	
	ПараметрыУведомления.Вставить("ЧатСсылка", ЧатСсылка);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВыбораЯзыка", 
		iga_ОбработкаДанныхПоЧатамКлиент, ПараметрыУведомления);
	
	ОткрытьФорму("ОбщаяФорма.iga_ФормаВыбораЯзыка", Новый Структура("ТекущийЯзык", ЯзыкЧата), 
		ПараметрыУведомления.Форма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ПослеВводаНомераТелефона(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НомерТелефона = РезультатЗакрытия;   
	
	ДополнительныеПараметры.Вставить("НомерТелефона", НомерТелефона);
	ДополнительныеПараметры.Вставить("СохранитьНомер", Истина);
	
	ОтправитьУведомлениеНаНомерТелефона(ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ПослеПроверкиНомераТелефона(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.ИсходныйНомер = РезультатЗакрытия Тогда
		СохранитьНомер = Ложь;
	Иначе
		СохранитьНомер = Истина;
	КонецЕсли;
		
	НомерТелефона = РезультатЗакрытия;
	
	ДополнительныеПараметры.Вставить("НомерТелефона", НомерТелефона);
	ДополнительныеПараметры.Вставить("СохранитьНомер", СохранитьНомер);

	ОтправитьУведомлениеНаНомерТелефона(ДополнительныеПараметры);
	
КонецПроцедуры

Процедура ОткрытьФормуВводаНомераТелефона(ПараметрыОткрытия) Экспорт
	
	НомерОповещения = iga_ОбработкаДанныхПоЧатамСервер.ПолучитьНомерМесенджера(ПараметрыОткрытия.Клиент);
	ПараметрыОткрытия.Вставить("ИсходныйНомер", НомерОповещения);
	
	Если НомерОповещения = "" Тогда

		Оповещение = Новый ОписаниеОповещения("ПослеВводаНомераТелефона", iga_ОбработкаДанныхПоЧатамКлиент, 
			ПараметрыОткрытия);
		
		ОткрытьФорму("ОбщаяФорма.iga_ФормаВводаНомераТелефона", , 
			ПараметрыОткрытия.Форма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	Иначе
		
		Оповещение = Новый ОписаниеОповещения("ПослеПроверкиНомераТелефона", iga_ОбработкаДанныхПоЧатамКлиент, 
			ПараметрыОткрытия);
		
		ОткрытьФорму("ОбщаяФорма.iga_ФормаВводаНомераТелефона",  
			Новый Структура("НомерТелефона", НомерОповещения), ПараметрыОткрытия.Форма, , 
				, , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		
	КонецЕсли;

КонецПроцедуры


