#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Добавлено Макеев (
	Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("УправляющийФилиалом") И Не РольДоступна("омг_ТолькоПросмотр") И Не РольДоступна("омг_ОтборПоОрганизацииВОтчетеПоВыработке") Тогда 
		
		Если РольДоступна("омг_Оператор") Тогда  
			
			ОтборПоСотруднику = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоСотруднику.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Регистратор.ДокументОснование.Ответственный");
			ОтборПоСотруднику.ПравоеЗначение = Пользователи.ТекущийПользователь();
			ОтборПоСотруднику.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;     
			
		ИначеЕсли  РольДоступна("омг_Регистратор") Тогда 
			
			ОтборПоСотруднику = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоСотруднику.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Регистратор.Ответственный");
			ОтборПоСотруднику.ПравоеЗначение = Пользователи.ТекущийПользователь();
			ОтборПоСотруднику.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
			
		ИначеЕсли РольДоступна("омг_Врач") Тогда
			
			ОтборПоСотруднику = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоСотруднику.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник");
			ОтборПоСотруднику.ПравоеЗначение = Пользователи.ТекущийПользователь().Сотрудник;
			ОтборПоСотруднику.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 

		Иначе
			
			ОтборПоСотруднику = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоСотруднику.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник");
			ОтборПоСотруднику.ПравоеЗначение = омг_ЗаявкаЛИСОбщиеСервеныеПроцедуры.ПолучитьТекущегоСотрудника();
			ОтборПоСотруднику.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
			
		КонецЕсли;
		
		
	КонецЕсли;   
	
	Если Не РольДоступна("ПолныеПрава") И РольДоступна("омг_ОтборПоОрганизацииВОтчетеПоВыработке") Тогда 
			
			ОтборПоОрганизации = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоОрганизации.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Филиал.Организация");
			ОтборПоОрганизации.ПравоеЗначение = омг_ДополнительныеАлгоритмы.ПолучитьОрганизациюСотрудника();
			ОтборПоОрганизации.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
		
	КонецЕсли;
	// )
	УниверсальныеМеханизмыСервер.ОтчетПриКомпоновкеРезультата(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
