
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	Если Параметры.Свойство("ОтменаНедоступна") Тогда
		Элементы.ФормаОтменить.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.БиоматериалыСканироватьШтрихкодКонтейнера.Доступность = Не Объект.НомерЗаявки = "";
	Элементы.БиоматериалыОчиститьШтрихкод.Доступность = Не Объект.НомерЗаявки = "";;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьНаСервере()
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Асинх Процедура Отменить(Команда)
	
	Ответ = Ждать ВопросАсинх("Отменить заявку?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОтменитьНаСервере();
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗадатьВопросОЗакрытии()
	
	Ответ = Ждать ВопросАсинх("Отменить заявку?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Нет,, КодВозвратаДиалога.Нет);
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	ОтменитьНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Или Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	ЗадатьВопросОЗакрытии();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Асинх Функция СканированиеШтрихкода()
	
	Штрихкод = Ждать ВвестиСтрокуАсинх(, "Введите штрихкод", 50);
	
	Если Штрихкод = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СимволыКЗ = "әіңғ,.үұқ";
	СимволыКЗ = """" + СимволыКЗ + ВРег(СимволыКЗ);
	Числа = "1234567890234567890";
	
	Для НСтроки = 1 По СтрДлина(Штрихкод) Цикл
		СимволШтрихкода = Сред(Штрихкод, НСтроки, 1);
		НСимволаКЗ = СтрНайти(СимволыКЗ, СимволШтрихкода);
		Если НСимволаКЗ > 0 Тогда
			СимволЧисло = Сред(Числа, НСимволаКЗ, 1);
			Штрихкод = СтрЗаменить(Штрихкод, СимволШтрихкода, СимволЧисло);
		КонецЕсли;
	КонецЦикла;

	Возврат Штрихкод;
	
КонецФункции

&НаКлиенте
Асинх Процедура СканироватьЗаявку(Команда)
	
	Штрихкод = Ждать СканированиеШтрихкода();
	
	Если Штрихкод = "" Тогда
		Возврат;
	КонецЕсли;

	Объект.НомерЗаявки = Штрихкод;
	
	Элементы.БиоматериалыСканироватьШтрихкодКонтейнера.Доступность = Истина;
	Элементы.БиоматериалыОчиститьШтрихкод.Доступность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРеквизитСсылки(Ссылка, Реквизит)
	
	Возврат Ссылка[Реквизит];
	
КонецФункции

&НаКлиенте
Асинх Процедура СканироватьШтрихкодКонтейнера(Команда)
	
	ТекущаяСтрока = Элементы.Биоматериалы.ТекущиеДанные;
	
	Если Не ПолучитьРеквизитСсылки(ТекущаяСтрока.Биоматериал, "омг_УчаствуетВУШК") Тогда
		ПоказатьПредупреждение(, "Для данной позиции нельзя назначить штрихкод");
		Возврат;
	КонецЕсли;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Штрихкод = Ждать СканированиеШтрихкода();
	
	Если Штрихкод = "" Тогда
		Возврат;
	КонецЕсли;

	ТекущаяСтрока.Проба = Штрихкод;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьШтрихкод(Команда)
	
	ТекущаяСтрока = Элементы.Биоматериалы.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Проба = "";
	
КонецПроцедуры
