// Получает стандартные наименования коек
// 
// Возвращаемое значение:
//  Массив - массив строковых стандартных наименований коек
//
Функция ПолучитьСтандартныеНаименованияКоек() Экспорт
	
	МассивВозврата = Новый Массив;
	
	МассивВозврата.Добавить("у окна");
	МассивВозврата.Добавить("у двери");
	МассивВозврата.Добавить("слева от двери");
	МассивВозврата.Добавить("справа от двери");
	МассивВозврата.Добавить("слева от окна");
	МассивВозврата.Добавить("справа от окна");
	
	Возврат МассивВозврата;
	
КонецФункции