
&НаСервере
Процедура ЗаписатьОповещениеПоЗаявке(ПараметрыУведомления)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Шаблоны.Шаблон КАК Шаблон,
	               |	Шаблоны.СпустяДней КАК СпустяДней,
	               |	Шаблоны.СпустяЧасов КАК СпустяЧасов,
	               |	Шаблоны.СпустяМинут КАК СпустяМинут,
	               |	Шаблоны.АлгоритмПриОповещении КАК АлгоритмПриОповещении,
	               |	Языки.НомерСтроки КАК НомерСтроки,
	               |	Шаблоны.АлгоритмПередОповещением КАК АлгоритмПередОповещением
	               |ИЗ
	               |	Справочник.iga_ПакетыОповещенийПоВремени.Языки КАК Языки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.iga_ПакетыОповещенийПоВремени.Шаблоны КАК Шаблоны
	               |		ПО Языки.Ссылка = Шаблоны.Ссылка
	               |			И Языки.КодСтроки = Шаблоны.КодСтроки
	               |ГДЕ
	               |	Языки.Ссылка = &Ссылка
	               |	И Языки.Язык = &Язык
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", ПараметрыУведомления.Пакет);
	Запрос.УстановитьПараметр("Язык", ПараметрыУведомления.ЯзыкЧата);
	ЧатСсылка = iga_ОбработкаДанныхПоЧатамСервер.ПолучитьЧатКлиента(ПараметрыУведомления.Клиент);

	iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ЧатСсылка, "Язык", ПараметрыУведомления.ЯзыкЧата);
	
	
	ВыборкаПакета = Запрос.Выполнить().Выбрать();
	
	ЗаписиОповещения = РегистрыСведений.iga_ПлановыеОповещенияПользователей.СоздатьНаборЗаписей();
	ЗаписиОповещения.Отбор.Заявка.Установить(ПараметрыУведомления.Заявка);

	ДатаОтсчета = ТекущаяДата();
	
	Попытка
		
		
		ОбработчикАлгоритмов = Обработки.iga_ОбработчикЭтапов.Создать();
		
		ОбработчикАлгоритмов.ВходящиеПараметры = Новый Структура;
		
		ЗаписиКОповещениюСразу = Новый ТаблицаЗначений;
		ЗаписиКОповещениюСразу.Колонки.Добавить("Заявка", Новый ОписаниеТипов("ДокументСсылка.Заявка"));
		ЗаписиКОповещениюСразу.Колонки.Добавить("Пакет", Новый ОписаниеТипов("СправочникСсылка.iga_ПакетыОповещенийПоВремени"));
		ЗаписиКОповещениюСразу.Колонки.Добавить("ДатаОповещения", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
		
		Пока ВыборкаПакета.Следующий() Цикл
			Запись = ЗаписиОповещения.Добавить();
			Запись.Заявка = ПараметрыУведомления.Заявка;
			Если ВыборкаПакета.СпустяДней + ВыборкаПакета.СпустяЧасов + ВыборкаПакета.СпустяМинут > 0 Тогда 
				Запись.ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(ДатаОтсчета, "ДЕНЬ", ВыборкаПакета.СпустяДней);
				Запись.ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(Запись.ДатаОповещения, "ЧАС", ВыборкаПакета.СпустяЧасов);
				Запись.ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(Запись.ДатаОповещения, "МИНУТА", ВыборкаПакета.СпустяМинут);
				ДатаОтсчета = Запись.ДатаОповещения;
			Иначе
				Запись.ДатаОповещения = ДатаОтсчета;
			КонецЕсли;
			Запись.ШаблонОповещения = ВыборкаПакета.Шаблон;
			Запись.АлгоритмОповещения = ВыборкаПакета.АлгоритмПриОповещении;
			Запись.АлгоритмПередОповещением = ВыборкаПакета.АлгоритмПередОповещением;
			Запись.Пакет = ПараметрыУведомления.Пакет;
			Запись.Чат = ЧатСсылка;
			Если Запись.ДатаОповещения <= ТекущаяДата() Тогда
				Запись.Отправлено = Истина;
				СтруктураОповещения = Новый Структура;
				СтруктураОповещения.Вставить("Заявка", ПараметрыУведомления.Заявка);
				СтруктураОповещения.Вставить("Пакет", ПараметрыУведомления.Пакет);
				СтруктураОповещения.Вставить("ДатаОповещения", Запись.ДатаОповещения);
				ЗаполнитьЗначенияСвойств(ЗаписиКОповещениюСразу.Добавить(), Запись);
			КонецЕсли;
		КонецЦикла;
		ЗаписиОповещения.Записать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗаписиКОповещениюСразу.Заявка КАК Заявка,
		               |	ЗаписиКОповещениюСразу.Пакет КАК Пакет,
		               |	ЗаписиКОповещениюСразу.ДатаОповещения КАК ДатаОповещения
		               |ПОМЕСТИТЬ ВТ_ЗаписиКОповещениюСразу
		               |ИЗ
		               |	&ЗаписиКОповещениюСразу КАК ЗаписиКОповещениюСразу
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	iga_ПлановыеОповещенияПользователей.Заявка КАК Заявка,
		               |	iga_ПлановыеОповещенияПользователей.ДатаОповещения КАК ДатаОповещения,
		               |	iga_ПлановыеОповещенияПользователей.Пакет КАК Пакет,
		               |	iga_ПлановыеОповещенияПользователей.ШаблонОповещения КАК ШаблонОповещения,
		               |	iga_ПлановыеОповещенияПользователей.АлгоритмПередОповещением КАК АлгоритмПередОповещением,
		               |	iga_ПлановыеОповещенияПользователей.АлгоритмОповещения КАК АлгоритмОповещения,
		               |	iga_ПлановыеОповещенияПользователей.Чат КАК Чат,
		               |	iga_ПлановыеОповещенияПользователей.Отправлено КАК Отправлено,
		               |	iga_ПлановыеОповещенияПользователей.Чат.Идентификатор КАК ИдЧата
		               |ИЗ
		               |	ВТ_ЗаписиКОповещениюСразу КАК ВТ_ЗаписиКОповещениюСразу
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ПлановыеОповещенияПользователей КАК iga_ПлановыеОповещенияПользователей
		               |		ПО ВТ_ЗаписиКОповещениюСразу.Заявка = iga_ПлановыеОповещенияПользователей.Заявка
		               |			И ВТ_ЗаписиКОповещениюСразу.Пакет = iga_ПлановыеОповещенияПользователей.Пакет
		               |			И ВТ_ЗаписиКОповещениюСразу.ДатаОповещения = iga_ПлановыеОповещенияПользователей.ДатаОповещения";
		Запрос.УстановитьПараметр("ЗаписиКОповещениюСразу", ЗаписиКОповещениюСразу);
		ВыборкаОповещений = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаОповещений.Следующий() Цикл
			iga_НапоминанияВызовСервера.ВыполнитьОповещениеПакета(ВыборкаОповещений, ОбработчикАлгоритмов, Ложь);
		КонецЦикла;
		
	Исключение
		ВызватьИсключение("Не удалось зафиксировать оповещение!" + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура iga_Обработчик_ПродолжитьОповещениеОЗаписи(Результат, ДопПараметры) Экспорт
	
	Результат.Удалить("Форма");
	Результат.Удалить("МодульОповещения");
	
	ЗаписатьОповещениеПоЗаявке(Результат);

КонецПроцедуры

&НаСервере
Функция ПолучитьКлиентаПоЗаявке(Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Заявка.Клиент КАК Клиент
	               |ИЗ
	               |	Документ.Заявка КАК Заявка
	               |ГДЕ
	               |	Заявка.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Клиент;
	
КонецФункции

&НаКлиенте
Процедура Обработчик_ПослеВыбораПакетаОповещения(Пакет, ДопПараметры) Экспорт
	
	Если Пакет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры.Вставить("Пакет", Пакет);
	ДопПараметры.Вставить("Клиент", ПолучитьКлиентаПоЗаявке(ДопПараметры.Заявка));
	ДопПараметры.Вставить("МодульОповещения", ЭтотОбъект);
	
	ДопПараметры.Вставить("ОбработчикОповещения", "iga_Обработчик_ПродолжитьОповещениеОЗаписи");
	
	iga_ОбработкаДанныхПоЧатамКлиент.ОткрытьФормуВводаНомераТелефона(ДопПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВыбораПакетаОповещения", ЭтотОбъект,
		Новый Структура("Заявка, Форма", ПараметрКоманды, ЭтотОбъект));
	
	ОткрытьФорму("Справочник.iga_ПакетыОповещенийПоВремени.Форма.ФормаВыбора",
		Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Истина), ПараметрыВыполненияКоманды.Источник,,,,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
