
&НаСервере
Процедура НачатьНаСервере()
	Запись = РегистрыСведений.iga_ОчередьРаспределения.СоздатьМенеджерЗаписи();
	Запись.Чат = Чат;
	Запись.Статус = Перечисления.iga_СтатусыОчереди.ОбщениеСБотом;
	Запись.ДатаПоступления = ТекущаяДата();
	Запись.ДатаКонцаБронирования = ТекущаяДата();
	Запись.ДатаПоследнейАктивности = ТекущаяДата();
	Запись.Записать();
	
	Запись = РегистрыСведений.iga_СостояниеБота.СоздатьМенеджерЗаписи();
	Запись.Чат = Чат;
	Запись.ТекущийЭтап = Этап;
	Запись.ДатаАктивности = ТекущаяДата();
	Запись.Записать();
	
	iga_БотСценарииСервер.ВыполнитьЭтап(Чат, Чат.Идентификатор, Этап, Запись);
	
КонецПроцедуры

&НаКлиенте
Процедура Начать(Команда)
	НачатьНаСервере();
КонецПроцедуры
