#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Тип = Перечисления.ТипыСпособовОплат.СертификатНСПК Тогда
		ПроверяемыеРеквизиты.Добавить("ЭквайрингНСПК");
		
		// Проверка, что пользователь создал этот способ оплаты как обычный ЭТ, сменил тип на НСПК и выбрал самого себя.
		Если ЗначениеЗаполнено(ЭквайрингНСПК)
			И ЭквайрингНСПК = Ссылка
		Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недопустимо выбирать этот же элемент в поле ""Эквайринг НСПК""",Ссылка,"ЭквайрингНСПК","Объект.ЭквайрингНСПК", Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Тип <> Перечисления.ТипыСпособовОплат.Эквайринг Тогда
		ИспользоватьЭТАвтономно = Ложь;
		Оборудование.Очистить();
	КонецЕсли;
	Если Тип <> Перечисления.ТипыСпособовОплат.СБП Тогда
		ТорговаяТочкаСБП = Неопределено;
	КонецЕсли;
	Если Тип <> Перечисления.ТипыСпособовОплат.СертификатНСПК Тогда
		ЭквайрингНСПК = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти