
#Область ОбработчикиСобытий

// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ)
	Если НЕ ЭтоНовый()
		И НЕ ОбменДанными.Загрузка
		И НазначениеСвойства <> Ссылка.НазначениеСвойства 
		И ЭтотОбъект.СуществуютСсылки() 
	Тогда
		ТекстСообщения = НСтр("ru='Существуют объекты, которым назначено свойство ""%1"".
		         |Назначение свойства не может быть изменено, элемент не записан.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
			Наименование); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецЕсли;
	
	Наименование = СокрЛП(Наименование);
	
	// Проверка уникальности наименования свойства против "Неоднозначное имя характеристики". 
	// Даже при ОбменДанными.Загрузка = Истина.
	Если Не ЭтоНовый()
		И Наименование <> Ссылка.Наименование
	Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("НазначениеСвойства", НазначениеСвойства);
	    Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СвойстваОбъектов.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов
		|ГДЕ
		|	СвойстваОбъектов.НазначениеСвойства = &НазначениеСвойства
		|	И СвойстваОбъектов.Наименование = &Наименование"
		;
		Результат = Запрос.Выполнить();
		Если Не Результат.Пустой() Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Свойство с таким наименованием уже есть для указанного назначения свойства. Наименование должно быть уникальным!'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ПередУдалением объекта.
//
Процедура ПередУдалением(Отказ)
	Если Предопределенный Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не допускается удаление предопределенных элементов!'"));
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#Область ЭкспортируемыеПроцедурыИФункции

// Функция проверяет, используется ли свойство для задания значений. 
// Или назначения каким-либо объектам.
//
// Возвращаемое значение:
//  Истина, если используется, Ложь, если нет.
//
Функция СуществуютСсылки() Экспорт
	Запрос = Новый Запрос();

	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегистрСведений.ЗначенияСвойствОбъектов.Свойство КАК Свойство
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов
	|
	|ГДЕ
	|	РегистрСведений.ЗначенияСвойствОбъектов.Свойство = &Свойство
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	РегистрСведений.НазначенияСвойствОбъектов.Свойство КАК Свойство
	|ИЗ
	|	РегистрСведений.НазначенияСвойствОбъектов
	|
	|ГДЕ
	|	РегистрСведений.НазначенияСвойствОбъектов.Свойство = &Свойство
	|";

	Запрос.УстановитьПараметр("Свойство", Ссылка);
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

#КонецОбласти

#КонецОбласти
