#Область РазделОписанияПеременных

&НаКлиенте
Перем ЗначенияПараметровПоУмолчанию;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = Параметры.ЗаголовокИнтерфейса;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ТипЗначенияПараметраHTML = Новый ОписаниеТипов(Метаданные.ПланыВидовХарактеристик.ПараметрыHTML.Тип, , , , Новый КвалификаторыСтроки());
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ЗначениеПоУмолчанию", ТипЗначенияПараметраHTML, "ДанныеПараметровПоИменам", "ЗначениеПоУмолчанию"));
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ИдентификаторИнтерфейса = Параметры.ИдентификаторИнтерфейса;
	
	ЗначенияПараметровПоПолям = Новый Соответствие;
	Для Каждого ДанныеПараметраПоля Из Параметры.ПараметрыПолей Цикл
		ЗначенияПараметровПоПолям.Вставить(ДанныеПараметраПоля.ИмяПоля, Новый Структура("Идентификатор, Значение", ДанныеПараметраПоля.Идентификатор, ДанныеПараметраПоля.Значение));
	КонецЦикла;
	
	ДанныеТаблицПараметров = Новый ТаблицаЗначений;
	ДанныеТаблицПараметров.Колонки.Добавить("НомерСтрокиТаблицы");
	ДанныеТаблицПараметров.Колонки.Добавить("Параметр");
	ДанныеТаблицПараметров.Колонки.Добавить("Значение");
	ДанныеТаблицПараметров.Колонки.Добавить("ИдентификаторТаблицы");
	ДанныеТаблицПараметров.Колонки.Добавить("ИдентификаторСтроки");
	ДанныеТаблицПараметров.Колонки.Добавить("ИдентификаторРодительскойСтроки");
	
	ИдентификаторыТаблицПоИменам = Новый Соответствие;
	Для Каждого ТаблицыПараметров Из Параметры.ТаблицыПараметров Цикл
		ИдентификаторыТаблицПоИменам.Вставить(ТаблицыПараметров.ИмяТаблицы, ТаблицыПараметров.Идентификатор);
		Для Каждого ДанныеСтрокиТаблицы Из ТаблицыПараметров.МассивДанныхТаблицы Цикл
			ЗаполнитьЗначенияСвойств(ДанныеТаблицПараметров.Добавить(), ДанныеСтрокиТаблицы);
		КонецЦикла;
	КонецЦикла;
	
	ПоляТаблицыИнтерфейса = РаботаСИнтерфейсамиЗаполненияПараметровКлиентСервер.ПоляТаблицыИнтерфейса(ИдентификаторИнтерфейса);
	
	Для Каждого ПолеИнтерфейса Из ПоляТаблицыИнтерфейса.Поля Цикл
		СтруктураПараметра = ЗначенияПараметровПоПолям.Получить(ПолеИнтерфейса.Имя);
		
		Если СтруктураПараметра = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаПараметра = ДанныеПараметровПоИменам.Добавить();
		НоваяСтрокаПараметра.ИмяПоля = ПолеИнтерфейса.Имя;
		НоваяСтрокаПараметра.Параметр = ПланыВидовХарактеристик.ПараметрыHTML.ПолучитьСсылку(СтруктураПараметра.Идентификатор);
		Если Не НоваяСтрокаПараметра.Параметр.ИспользуетсяВычисляемоеЗначение Тогда
			НоваяСтрокаПараметра.ЗначениеПоУмолчанию = НоваяСтрокаПараметра.Параметр.ЗначениеПоУмолчанию;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТаблицаИнтерфейса Из ПоляТаблицыИнтерфейса.Таблицы Цикл
		ИдентификаторТаблицы = ИдентификаторыТаблицПоИменам.Получить(ТаблицаИнтерфейса.Имя);
		
		Если ИдентификаторТаблицы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрокаТаблицы = ДанныеТаблицПоИменам.Добавить();
		НоваяСтрокаТаблицы.ИмяТаблицы = ТаблицаИнтерфейса.Имя;
		НоваяСтрокаТаблицы.ТаблицаШаблонов = Справочники.ТаблицыШаблоновПриема.ПолучитьСсылку(ИдентификаторТаблицы);
	КонецЦикла;
	
	ЗаполнитьДанные(ЭтотОбъект, ПоляТаблицыИнтерфейса.Иерархия, ЗначенияПараметровПоПолям, ИдентификаторыТаблицПоИменам, ДанныеТаблицПараметров);
	
	Если Параметры.Свойство("ДополнительныеПараметры")
		И ТипЗнч(Параметры.ДополнительныеПараметры) = Тип("Структура")
	Тогда
		Если Параметры.ДополнительныеПараметры.Свойство("Филиал") Тогда
			ТекущийСотрудник = ОтраслевыеДополнения.СотрудникПользователяПоФилиалу(ПараметрыСеанса.ТекущийПользователь, Параметры.ДополнительныеПараметры.Филиал);
		КонецЕсли;
		Если Параметры.ДополнительныеПараметры.Свойство("ВидДокумента") Тогда
			ЗаполнитьДопустимыеДолжности(Параметры.ДополнительныеПараметры.ВидДокумента);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущийСотрудник) Тогда
		СотрудникиПользователя = ОтраслевыеДополнения.СотрудникиПользователя(ПараметрыСеанса.ТекущийПользователь);
		Если СотрудникиПользователя.Количество() > 0 Тогда
			ТекущийСотрудник = СотрудникиПользователя[0];
		КонецЕсли;
	КонецЕсли;
	
	ВидимостьПримечанияПоПрофилю	 = ТаблицыПоляНастроены(ОбщегоНазначенияБИТКлиентСервер.НовыйМассив("ИсследованиеПримечаниеКРезультату", "ИсследованиеДатаПримечания", "ИсследованиеАвторПримечания", "ИсследованиеДолжностьАвтораПримечания"));
	ВидимостьИнтерпретацииРезультата = ТаблицыПоляНастроены(ОбщегоНазначенияБИТКлиентСервер.НовыйМассив("ЛабораторныйТестИнтерпретацияРезультата"));
	ВидимостьКомментарияТеста		 = ТаблицыПоляНастроены(ОбщегоНазначенияБИТКлиентСервер.НовыйМассив("ЛабораторныйТестКомментарий", "ЛабораторныйТестДатаКомментария", "ЛабораторныйТестАвторКомментария", "ЛабораторныйТестДолжностьАвтораКомментария"));
	ВидимостьОказанныхУслуг			 = ТаблицыПоляНастроены(ОбщегоНазначенияБИТКлиентСервер.НовыйМассив("ОказаннаяУслуга", "ОказаннаяУслугаДата"), ОбщегоНазначенияБИТКлиентСервер.НовыйМассив("ОказанныеУслуги"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗначенияПараметровПоУмолчанию = Новый Структура;
	Для Каждого СтрокаПараметра Из ДанныеПараметровПоИменам Цикл
		Если ЗначениеЗаполнено(СтрокаПараметра.ЗначениеПоУмолчанию) Тогда
			ЗначенияПараметровПоУмолчанию.Вставить(СтрокаПараметра.ИмяПоля, СтрокаПараметра.ЗначениеПоУмолчанию);
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьПрофилиИсследований();
	
	ОбновитьДоступностьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	ОбновитьПрофилиИсследований(Истина);
	
	Ошибки = Новый Массив;
	ЗаполнитьОшибкиНаполнения(Ошибки);
	
	Если Ошибки.Количество() > 0 Тогда
		Для Каждого ТекстОшибки Из Ошибки Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЦикла;
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить("ЗакрытьФорму", НСтр("ru='Закрыть форму'"));
		СписокКнопок.Добавить("ВернутьсяНаФорму", НСтр("ru='Вернуться на форму'"));
		Оповещение = Новый ОписаниеОповещения("ПослеВопросаПередСохранением", ЭтотОбъект, Ошибки);
		ПоказатьВопрос(Оповещение, НСтр("ru='Не все обязательные параметры заполнены, некоторые стоки будут отсутствовать в результате'"), СписокКнопок,, "ЗакрытьФорму");
	Иначе
		СохранитьИЗакрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПрофилиЛабораторныхИсследованийПриИзменении(Элемент)
	
	ПредзаполнитьНовуюСтроку(Исследования);
	ОбновитьПрофилиИсследований();
	ОбновитьДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторныеТестыПриИзменении(Элемент)
	
	ПредзаполнитьНовуюСтроку(Элементы.Исследования.ТекущиеДанные.ЛабораторныеТесты);
	ОбновитьДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованноеОборудованиеПриИзменении(Элемент)
	
	ПредзаполнитьНовуюСтроку(Элементы.ЛабораторныеТесты.ТекущиеДанные.ИспользованноеОборудование);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсследованияОказанныеУслугиПриИзменении(Элемент)
	
	ПредзаполнитьНовуюСтроку(Элементы.Исследования.ТекущиеДанные.ОказанныеУслуги);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрофильЛабораторногоИсследованияПриИзменении(Элемент)
	
	ОбновитьДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторныйТестПриИзменении(Элемент)
	
	ОбновитьДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсследованиеВыполненоПриИзменении(Элемент)
	
	ОбновитьДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестВыполненПриИзменении(Элемент)
	
	ОбновитьДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторныеТестыПриАктивизацииСтроки(Элемент)
	
	ОбновитьДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрофилиЛабораторныхИсследованийПриАктивизацииСтроки(Элемент)
	
	ОбновитьДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсследованияИсследованиеПримечаниеКРезультатуПриИзменении(Элемент)
	
	ОбновитьДоступностьВидимость();
	ТекущееИсследование = Элементы.Исследования.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущееИсследование.ИсследованиеПримечаниеКРезультату)
		И Не (ЗначениеЗаполнено(ТекущееИсследование.ИсследованиеДатаПримечания)
			Или ЗначениеЗаполнено(ТекущееИсследование.ИсследованиеАвторПримечания)
			Или ЗначениеЗаполнено(ТекущееИсследование.ИсследованиеДолжностьАвтораПримечания))
	Тогда
		ТекущееИсследование.ИсследованиеДатаПримечания = ТекущаяДата();
		ТекущееИсследование.ИсследованиеАвторПримечания = ТекущийСотрудник;
		ТекущееИсследование.ИсследованиеДолжностьАвтораПримечания = ПолучитьПодходящиеДолжностиСотрудника(ТекущийСотрудник, ДопустимыеДолжности, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсследованияИсследованиеАвторПримечанияПриИзменении(Элемент)
	
	ТекущееИсследование = Элементы.Исследования.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущееИсследование.ИсследованиеАвторПримечания) Тогда
		ТекущееИсследование.ИсследованиеДолжностьАвтораПримечания = ПолучитьПодходящиеДолжностиСотрудника(ТекущееИсследование.ИсследованиеАвторПримечания, ДопустимыеДолжности, Истина);
	Иначе
		ТекущееИсследование.ИсследованиеДолжностьАвтораПримечания = Неопределено;
	КонецЕсли;
	
	ОбновитьДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторныеТестыЛабораторныйТестКомментарийПриИзменении(Элемент)
	
	ОбновитьДоступностьВидимость();
	ТекущийТест = Элементы.ЛабораторныеТесты.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущийТест.ЛабораторныйТестКомментарий)
		И Не (ЗначениеЗаполнено(ТекущийТест.ЛабораторныйТестДатаКомментария)
			Или ЗначениеЗаполнено(ТекущийТест.ЛабораторныйТестАвторКомментария)
			Или ЗначениеЗаполнено(ТекущийТест.ЛабораторныйТестДолжностьАвтораКомментария))
	Тогда
		ТекущийТест.ЛабораторныйТестДатаКомментария = ТекущаяДата();
		ТекущийТест.ЛабораторныйТестАвторКомментария = ТекущийСотрудник;
		ТекущийТест.ЛабораторныйТестДолжностьАвтораКомментария = ПолучитьПодходящиеДолжностиСотрудника(ТекущийСотрудник, ДопустимыеДолжности, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторныеТестыЛабораторныйТестАвторКомментарияПриИзменении(Элемент)
	
	ТекущийТест = Элементы.ЛабораторныеТесты.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущийТест.ЛабораторныйТестАвторКомментария) Тогда
		ТекущийТест.ЛабораторныйТестДолжностьАвтораКомментария = ПолучитьПодходящиеДолжностиСотрудника(ТекущийТест.ЛабораторныйТестАвторКомментария, ДопустимыеДолжности, Истина);
	Иначе
		ТекущийТест.ЛабораторныйТестДолжностьАвтораКомментария = Неопределено;
	КонецЕсли;
	
	ОбновитьДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторныеТестыЛабораторныйТестСотрудникПриИзменении(Элемент)
	
	ТекущийТест = Элементы.ЛабораторныеТесты.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущийТест.ЛабораторныйТестСотрудник) Тогда
		ТекущийТест.ЛабораторныйТестДолжностьСотрудника = ПолучитьПодходящиеДолжностиСотрудника(ТекущийТест.ЛабораторныйТестСотрудник, ДопустимыеДолжности, Истина);
	Иначе
		ТекущийТест.ЛабораторныйТестДолжностьСотрудника = Неопределено;
	КонецЕсли;
	
	ОбновитьДоступностьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторныеТестыЛабораторныйТестДолжностьСотрудникаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	УстановитьДопустимыеДолжности(Элемент, Элементы.ЛабораторныеТесты.ТекущиеДанные.ЛабораторныйТестСотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторныеТестыЛабораторныйТестДолжностьСотрудникаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	УстановитьДопустимыеДолжности(Элемент, Элементы.ЛабораторныеТесты.ТекущиеДанные.ЛабораторныйТестСотрудник);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторныеТестыЛабораторныйТестДолжностьАвтораКомментарияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	УстановитьДопустимыеДолжности(Элемент, Элементы.ЛабораторныеТесты.ТекущиеДанные.ЛабораторныйТестАвторКомментария);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛабораторныеТестыЛабораторныйТестДолжностьАвтораКомментарияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	УстановитьДопустимыеДолжности(Элемент, Элементы.ЛабораторныеТесты.ТекущиеДанные.ЛабораторныйТестАвторКомментария);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсследованияИсследованиеДолжностьАвтораПримечанияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	УстановитьДопустимыеДолжности(Элемент, Элементы.Исследования.ТекущиеДанные.ИсследованиеДолжностьАвтораПримечания);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсследованияИсследованиеДолжностьАвтораПримечанияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	УстановитьДопустимыеДолжности(Элемент, Элементы.Исследования.ТекущиеДанные.ИсследованиеДолжностьАвтораПримечания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВопросаПередСохранением(Ответ, Ошибки) Экспорт
	
	Если Ответ = "ЗакрытьФорму" Тогда
		СохранитьИЗакрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть()
	
	Закрыть(СформироватьРезультат());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОшибкиНаполнения(Ошибки)
	
	Если Не ИсследованияВыполнены Тогда
		Если Не ЗначениеЗаполнено(ПричинаОтменыВыполненияИсследований) Тогда
			Ошибки.Добавить(НСтр("ru='Не заполнена причина отмены исследований'"));
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаИсследования Из Исследования Цикл
		
		ЗаголовокИсследования = СтрШаблон(НСтр("ru='Исследование №%1'"), Исследования.Индекс(СтрокаИсследования) + 1);
		Если ЗначениеЗаполнено(СтрокаИсследования.ИсследованиеПрофиль) Тогда
			ЗаголовокИсследования = СтрШаблон(НСтр("ru='%1 (%2)'"), ЗаголовокИсследования, СтрокаИсследования.ИсследованиеПрофиль);
		//Иначе
		//	Ошибки.Добавить(СтрШаблон(НСтр("ru='Не заполнен профиль исследования %1'"), Исследования.Индекс(СтрокаИсследования) + 1));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаИсследования.ИсследованиеПримечаниеКРезультату) Тогда
			Если Не ЗначениеЗаполнено(СтрокаИсследования.ИсследованиеДатаПримечания) Тогда
				Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не заполнена дата примечания'"), ЗаголовокИсследования));
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаИсследования.ИсследованиеАвторПримечания) Тогда
				Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не заполнен автор примечания'"), ЗаголовокИсследования));
			КонецЕсли;
			Если Не ЗначениеЗаполнено(СтрокаИсследования.ИсследованиеДолжностьАвтораПримечания) Тогда
				Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не заполнена должность автора примечания'"), ЗаголовокИсследования));
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаИсследования.ЛабораторныеТесты.Количество() = 0 Тогда
			Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не указан ни один лабораторный тест'"), ЗаголовокИсследования));
		КонецЕсли;
		
		Для Каждого СтрокаТеста Из СтрокаИсследования.ЛабораторныеТесты Цикл
			
			ЗаголовокТеста = СтрШаблон(НСтр("ru='%1, лаб. тест №%2'"), ЗаголовокИсследования, СтрокаИсследования.ЛабораторныеТесты.Индекс(СтрокаТеста) + 1);
			
			Если ЗначениеЗаполнено(СтрокаТеста.ЛабораторныйТест) Тогда
				ЗаголовокТеста = СтрШаблон("%1 (%2)", ЗаголовокТеста, СтрокаТеста.ЛабораторныйТест);
			Иначе
				Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не указан тест по классификатору'"), ЗаголовокТеста));
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТеста.ЛабораторныйТестДатаВыполнения) Тогда
				Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не указана дата'"), ЗаголовокТеста));
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТеста.ЛабораторныйТестСотрудник) Тогда
				Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не указан сотрудник, проводивший исследование'"), ЗаголовокТеста));
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаТеста.ЛабораторныйТестДолжностьСотрудника) Тогда
				Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не указана должность сотрудника, проводившего исследование'"), ЗаголовокТеста));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТеста.ЛабораторныйТестКомментарий) Тогда
				Если Не ЗначениеЗаполнено(СтрокаТеста.ЛабораторныйТестДатаКомментария) Тогда
					Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не указана дата комментария'"), ЗаголовокТеста));
				КонецЕсли;
				Если Не ЗначениеЗаполнено(СтрокаТеста.ЛабораторныйТестАвторКомментария) Тогда
					Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не указан автор комментария'"), ЗаголовокТеста));
				КонецЕсли;
				Если Не ЗначениеЗаполнено(СтрокаТеста.ЛабораторныйТестДолжностьАвтораКомментария) Тогда
					Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не указана должность автора комментария'"), ЗаголовокТеста));
				КонецЕсли;
			КонецЕсли;
			
			Если СтрокаТеста.ЛабораторныйТестВыполнен Тогда
				Если Не ЗначениеЗаполнено(СтрокаТеста.ЛабораторныйТестЗначение) Тогда
					Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не указано значение результата'"), ЗаголовокТеста));
				КонецЕсли;
				Если Не ЗначениеЗаполнено(СтрокаТеста.ЛабораторныйТестШтрихкод) Тогда
					Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не указан штрихкод'"), ЗаголовокТеста));
				КонецЕсли;
				
				ОборудованиеУказано = Ложь;
				Для Каждого СтрокаОборудования Из СтрокаТеста.ИспользованноеОборудование Цикл
					Если ЗначениеЗаполнено(СтрокаОборудования.Оборудование) Тогда
						ОборудованиеУказано = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Не ОборудованиеУказано Тогда
					Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не указано ни одного использованного оборудования'"), ЗаголовокТеста));
				КонецЕсли;
			Иначе
				Если Не ЗначениеЗаполнено(СтрокаТеста.ЛабораторныйТестПричинаОтмены) Тогда
					Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не указана причина отмены'"), ЗаголовокТеста));
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаУслуги Из СтрокаИсследования.ОказанныеУслуги Цикл
			ЗаголовокУслуги = СтрШаблон(НСтр("ru='%1, услуга №%2'"), ЗаголовокИсследования, СтрокаИсследования.ОказанныеУслуги.Индекс(СтрокаУслуги) + 1);
			
			Если ЗначениеЗаполнено(СтрокаУслуги.ОказаннаяУслуга) Тогда
				ЗаголовокУслуги = СтрШаблон("%1 (%2)", ЗаголовокУслуги, СтрокаУслуги.ОказаннаяУслуга);
			Иначе
				Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не указана номенклатура'"), ЗаголовокУслуги));
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаУслуги.ОказаннаяУслугаДата) Тогда
				Ошибки.Добавить(СтрШаблон(НСтр("ru='%1: не указана дата оказания'"), ЗаголовокУслуги));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредзаполнитьНовуюСтроку(КоллекцияСтрокТекущейТаблицы)
	
	Для Каждого СтрокаТаблицы Из КоллекцияСтрокТекущейТаблицы Цикл
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ИдентификаторСтроки) Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ЗначенияПараметровПоУмолчанию);
			СтрокаТаблицы.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПрофилиИсследований(ПриСохранении = Ложь)
	
	Для Каждого СтрокаИсследования Из Исследования Цикл
		Если ПриСохранении Тогда
			Если Не ЗначениеЗаполнено(СтрокаИсследования.ИсследованиеПрофиль) Тогда
				СтрокаИсследования.ИсследованиеПрофиль = "Отдельные лабораторные тесты";
			КонецЕсли;
		Иначе
			Если ТипЗнч(СтрокаИсследования.ИсследованиеПрофиль) <> Тип("СправочникСсылка.КлассификаторыМинЗдрава") Тогда
				СтрокаИсследования.ИсследованиеПрофиль = ПредопределенноеЗначение("Справочник.КлассификаторыМинЗдрава.ПустаяСсылка");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанные(РодительскийРеквизит, Иерархия, ЗначенияПараметровПоПолям, ИдентификаторыТаблицПоИменам, ДанныеТаблицПараметров, ИдентификаторРодительскойСтроки = "", ОтборПараметров = Неопределено)
	
	Для Каждого ПолеИнтерфейса Из Иерархия.Поля Цикл
		СтруктураПараметра = ЗначенияПараметровПоПолям.Получить(ПолеИнтерфейса.Имя);
		ЗначениеПараметра = Неопределено;
		Если ОтборПараметров = Неопределено Тогда
			ЗначениеПараметра = СтруктураПараметра.Значение;
		Иначе
			ПараметрПоИмениПоля = ПараметрПоИмениПоля(ДанныеПараметровПоИменам, ПолеИнтерфейса.Имя);
			Если ПараметрПоИмениПоля <> Неопределено Тогда
				ОтборПараметров.Вставить("Параметр", ПараметрПоИмениПоля);
				СтрокиПараметра = ДанныеТаблицПараметров.НайтиСтроки(ОтборПараметров);
				Если СтрокиПараметра.Количество() > 0 Тогда
					ЗначениеПараметра = СтрокиПараметра[0].Значение;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		РодительскийРеквизит[ПолеИнтерфейса.Имя] = ЗначениеПараметра;
	КонецЦикла;
	
	Для Каждого ТаблицаИнтерфейса Из Иерархия.Таблицы Цикл
		ИдентификаторТаблицы = Строка(ИдентификаторыТаблицПоИменам.Получить(ТаблицаИнтерфейса.Имя));
		
		СтрокиДанныхТаблицы = ДанныеТаблицПараметров.НайтиСтроки(Новый Структура("ИдентификаторТаблицы, ИдентификаторРодительскойСтроки", Строка(ИдентификаторТаблицы), ИдентификаторРодительскойСтроки));
		
		Если СтрокиДанныхТаблицы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеТекущейТаблицы = ДанныеТаблицПараметров.СкопироватьКолонки();
		Для Каждого СтрокаДанных Из СтрокиДанныхТаблицы Цикл
			ЗаполнитьЗначенияСвойств(ДанныеТекущейТаблицы.Добавить(), СтрокаДанных);
		КонецЦикла;
		
		НомераСтрокТекущейТаблицы = ДанныеТекущейТаблицы.Скопировать();
		НомераСтрокТекущейТаблицы.Свернуть("НомерСтрокиТаблицы, ИдентификаторСтроки");
		НомераСтрокТекущейТаблицы.Сортировать("НомерСтрокиТаблицы");
		
		Для Каждого СтрокаНомераСтроки Из НомераСтрокТекущейТаблицы Цикл
			
			ОтборПоТекущейСтроке = Новый Структура;
			ОтборПоТекущейСтроке.Вставить("ИдентификаторТаблицы",			 Строка(ИдентификаторТаблицы));
			ОтборПоТекущейСтроке.Вставить("ИдентификаторРодительскойСтроки", ИдентификаторРодительскойСтроки);
			ОтборПоТекущейСтроке.Вставить("НомерСтрокиТаблицы",				 СтрокаНомераСтроки.НомерСтрокиТаблицы);
			
			НоваяСтрока = РодительскийРеквизит[ТаблицаИнтерфейса.Имя].Добавить();
			НоваяСтрока.ИдентификаторСтроки = СтрокаНомераСтроки.ИдентификаторСтроки;
			ЗаполнитьДанные(НоваяСтрока, ТаблицаИнтерфейса.Подчиненные, ЗначенияПараметровПоПолям, ИдентификаторыТаблицПоИменам, ДанныеТаблицПараметров, СтрокаНомераСтроки.ИдентификаторСтроки, ОтборПоТекущейСтроке);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьВидимость()
	
	Элементы.ПричинаОтменыВыполненияИсследований.Видимость	= Не ИсследованияВыполнены;
	Элементы.ОписаниеИсследований.Видимость					= ИсследованияВыполнены;
	Элементы.ОписаниеИсследованияПоПрофилю.Видимость		= Исследования.Количество() > 0;
	
	Если Не ИсследованияВыполнены Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанныеПрофиля = Элементы.Исследования.ТекущиеДанные;
	
	Если ТекущиеДанныеПрофиля = Неопределено Тогда
		Элементы.ЛабораторныеТестыПоПрофилю.Видимость	= Ложь;
		Элементы.ПримечаниеПоПрофилю.Видимость			= Ложь;
		Элементы.ОказанныеУслугиПоПрофилю.Видимость		= Ложь;
	Иначе
		Элементы.ЛабораторныеТестыПоПрофилю.Видимость	= Истина;
		Элементы.ПримечаниеПоПрофилю.Видимость			= ВидимостьПримечанияПоПрофилю;
		Элементы.ОказанныеУслугиПоПрофилю.Видимость		= ВидимостьОказанныхУслуг;
		
		Элементы.ИсследованияИсследованиеДолжностьАвтораПримечания.Доступность = ЗначениеЗаполнено(ТекущиеДанныеПрофиля.ИсследованиеАвторПримечания);
		
		Если ТекущиеДанныеПрофиля.ЛабораторныеТесты.Количество() > 0 Тогда
			Элементы.ПараметрыЛабораторногоТеста.Видимость = Истина;
			ТекущиеДанныеТеста = Элементы.ЛабораторныеТесты.ТекущиеДанные;
			Если ТекущиеДанныеТеста <> Неопределено Тогда
				Элементы.КомментарийКТесту.Видимость								= ВидимостьКомментарияТеста;
				Элементы.ЛабораторныеТестыЛабораторныйТестПричинаОтмены.Видимость	= Не ТекущиеДанныеТеста.ЛабораторныйТестВыполнен;
				Элементы.ПараметрыВыполненногоТеста.Видимость						= ТекущиеДанныеТеста.ЛабораторныйТестВыполнен;
				Элементы.ГруппаИспользованноеОборудование.Видимость					= ТекущиеДанныеТеста.ЛабораторныйТестВыполнен;
				Элементы.ПараметрыПримечанияЛабТеста.Видимость						= ЗначениеЗаполнено(ТекущиеДанныеТеста.ЛабораторныйТестКомментарий);
				
				Элементы.ЛабораторныеТестыЛабораторныйТестИнтерпретацияРезультата.Видимость = ТекущиеДанныеТеста.ЛабораторныйТестВыполнен И ВидимостьИнтерпретацииРезультата;
				
				Элементы.ЛабораторныеТестыЛабораторныйТестДолжностьСотрудника.Доступность		 = ЗначениеЗаполнено(ТекущиеДанныеТеста.ЛабораторныйТестСотрудник);
				Элементы.ЛабораторныеТестыЛабораторныйТестДолжностьАвтораКомментария.Доступность = ЗначениеЗаполнено(ТекущиеДанныеТеста.ЛабораторныйТестАвторКомментария);
			КонецЕсли;
		Иначе
			Элементы.ПараметрыЛабораторногоТеста.Видимость = Ложь;
		КонецЕсли;
		Элементы.ПараметрыПримечанияИсследования.Видимость = ЗначениеЗаполнено(ТекущиеДанныеПрофиля.ИсследованиеПримечаниеКРезультату);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьРезультат()
	
	Результат = Новый Структура("МассивДанныхТаблицы, МассивЗначенийПараметров", Новый Массив, Новый Массив);
	ПоляТаблицыИнтерфейса = РаботаСИнтерфейсамиЗаполненияПараметровКлиентСервер.ПоляТаблицыИнтерфейса(ИдентификаторИнтерфейса);
	РекурсивноеЗаполнениеДанных(Результат, ЭтотОбъект, ПоляТаблицыИнтерфейса.Иерархия);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура РекурсивноеЗаполнениеДанных(Результат, РодительскийРеквизит, Иерархия, СтруктураСтрокиТаблицы = Неопределено)
	
	Для Каждого ПолеИнтерфейса Из Иерархия.Поля Цикл
		
		ПараметрПоля = ПараметрПоИмениПоля(ДанныеПараметровПоИменам, ПолеИнтерфейса.Имя);
		Если ПараметрПоля = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗначениеПараметра = РодительскийРеквизит[ПолеИнтерфейса.Имя];
		
		Если СтруктураСтрокиТаблицы = Неопределено Тогда
			Результат.МассивЗначенийПараметров.Добавить(Новый Структура("Параметр, Значение", ПараметрПоля, ЗначениеПараметра));
		Иначе
			СтруктураТекущегоПараметра = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураСтрокиТаблицы);
			СтруктураТекущегоПараметра.Вставить("Параметр", ПараметрПоля);
			СтруктураТекущегоПараметра.Вставить("Значение", ЗначениеПараметра);
			Результат.МассивДанныхТаблицы.Добавить(СтруктураТекущегоПараметра);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТаблицаИнтерфейса Из Иерархия.Таблицы Цикл
		
		СтрокиТаблицы = ДанныеТаблицПоИменам.НайтиСтроки(Новый Структура("ИмяТаблицы", ТаблицаИнтерфейса.Имя));
		Если СтрокиТаблицы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИдентификаторРодительскойСтроки = "";
		Если СтруктураСтрокиТаблицы <> Неопределено Тогда
			ИдентификаторРодительскойСтроки = СтруктураСтрокиТаблицы.ИдентификаторСтроки;
		КонецЕсли;
		
		ТаблицаШаблонов = СтрокиТаблицы[0].ТаблицаШаблонов;
		ТаблицаФормы = РодительскийРеквизит[ТаблицаИнтерфейса.Имя];
		
		Для Каждого СтрокаТаблицы Из ТаблицаФормы Цикл
			СтруктураТекущейСтроки = Новый Структура;
			СтруктураТекущейСтроки.Вставить("ИдентификаторТаблицы",				Строка(ТаблицаШаблонов.УникальныйИдентификатор()));
			СтруктураТекущейСтроки.Вставить("НомерСтрокиТаблицы",				ТаблицаФормы.Индекс(СтрокаТаблицы) + 1);
			СтруктураТекущейСтроки.Вставить("ИдентификаторСтроки",				СтрокаТаблицы.ИдентификаторСтроки);
			СтруктураТекущейСтроки.Вставить("ИдентификаторРодительскойСтроки",	ИдентификаторРодительскойСтроки);
			РекурсивноеЗаполнениеДанных(Результат, СтрокаТаблицы, ТаблицаИнтерфейса.Подчиненные, СтруктураТекущейСтроки);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПараметрПоИмениПоля(ДанныеПараметровПоИменам, ИмяПоля)
	
	СтрокиПараметраПоля = ДанныеПараметровПоИменам.НайтиСтроки(Новый Структура("ИмяПоля", ИмяПоля));
	Если СтрокиПараметраПоля.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтрокиПараметраПоля[0].Параметр;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДопустимыеДолжности(ВидДокумента)
	
	ДопустимыеДолжностиПоВидамЭМД = ИнтеграцияЕГИСЗ_РЭМД.ПолучитьДолжностиПоВидамЭМД(ОбщегоНазначенияБИТКлиентСервер.НовыйМассив(ВидДокумента));
	
	ДопустимыеДолжностиПоВидуДокумента = ДопустимыеДолжностиПоВидамЭМД.НайтиСтроки(Новый Структура("ВидДокумента", ВидДокумента));
	
	Если ДопустимыеДолжностиПоВидуДокумента.Количество() > 0
		И ДопустимыеДолжностиПоВидуДокумента[0].Должности.Количество() > 0
	Тогда
		ДопустимыеДолжности.ЗагрузитьЗначения(ДопустимыеДолжностиПоВидуДокумента[0].Должности);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПодходящиеДолжностиСотрудника(Сотрудник, ДопустимыеДолжности, ВернутьПервое = Ложь)
	
	ПодходящиеДолжности = Новый Массив;
	
	ДолжностиСотрудника = ИнтеграцияЕГИСЗВызовСервера.ДолжностиМЗ(Сотрудник);
	
	Для Каждого ДолжностьСотрудника Из ДолжностиСотрудника Цикл
		Если (ДопустимыеДолжности.Количество() = 0
				Или ДопустимыеДолжности.НайтиПоЗначению(ДолжностьСотрудника) <> Неопределено)
			И ПодходящиеДолжности.Найти(ДолжностьСотрудника) = Неопределено
		Тогда
			ПодходящиеДолжности.Добавить(ДолжностьСотрудника);
		КонецЕсли;
	КонецЦикла;
	
	Если ВернутьПервое Тогда
		Если ПодходящиеДолжности.Количество() = 0 Тогда
			Возврат Неопределено;
		Иначе
			Возврат ПодходящиеДолжности[0];
		КонецЕсли;
	Иначе
		Возврат ПодходящиеДолжности;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановитьДопустимыеДолжности(ЭлементДолжности, СотрудникДолжности)
	
	Если ДопустимыеДолжности.Количество() > 0 Тогда
		ПодходящиеДолжности = ПолучитьПодходящиеДолжностиСотрудника(СотрудникДолжности, ДопустимыеДолжности);
		
		ПараметрыВыбораДолжности = Новый Массив;
		ПараметрыВыбораДолжности.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", ПодходящиеДолжности));
		ЭлементДолжности.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораДолжности);
		ЭлементДолжности.СписокВыбора.ЗагрузитьЗначения(ПодходящиеДолжности);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТаблицыПоляНастроены(ИменаПолей = Неопределено, ИменаТаблиц = Неопределено)
	
	Если ИменаПолей <> Неопределено Тогда
		Для Каждого ИмяПоля Из ИменаПолей Цикл
			Если ДанныеПараметровПоИменам.НайтиСтроки(Новый Структура("ИмяПоля", ИмяПоля)).Количество() = 0 Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ИменаТаблиц <> Неопределено Тогда
		Для Каждого ИмяТаблицы Из ИменаТаблиц Цикл
			Если ДанныеТаблицПоИменам.НайтиСтроки(Новый Структура("ИмяТаблицы", ИмяТаблицы)).Количество() = 0 Тогда
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти