
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МедицинскиеКарты.ВидКарты.ТипКарты КАК ТипКарты,
	               |	МедицинскиеКарты.НомерКарты КАК Код
	               |ИЗ
	               |	Справочник.МедицинскиеКарты КАК МедицинскиеКарты
	               |ГДЕ
	               |	МедицинскиеКарты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Данные.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Стационарная = Выборка.ТипКарты = Перечисления.ТипыМедицинскихКарт.омг_СтационарРК
		Или Выборка.ТипКарты = Перечисления.ТипыМедицинскихКарт.Стационар;
		
	Амбулаторная = Выборка.ТипКарты = Перечисления.ТипыМедицинскихКарт.Амбулаторная;
	
	Если Стационарная Или Амбулаторная Тогда
		СтандартнаяОбработка = Ложь;
		Если Стационарная Тогда
			Представление = "Ст" + Формат(Выборка.Код, "ЧГ=");
		Иначе
			Представление = "Амб" + Формат(Выборка.Код, "ЧГ=");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
