
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Филиалы.Количество() = 0 Тогда  
		
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполните филиал!";
		Сообщение.Сообщить();
		Возврат;
		
	КонецЕсли;
	Движения.омг_НоменклатураВыработки.Записывать = Истина;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_УстановкаВыработкиФилиалы.Филиал КАК Филиал,
		|	омг_УстановкаВыработкиТабличнаяЧастьДолжностиИСотрудники.Должность КАК Должность,
		|	омг_УстановкаВыработкиТабличнаяЧастьДолжностиИСотрудники.Сотрудник КАК Сотрудник,
		|	омг_УстановкаВыработкиНоменклатура.Номенклатура КАК Номенклатура,
		|	омг_УстановкаВыработкиТабличнаяЧастьДолжностиИСотрудники.ИндСтроки КАК ИндСтроки,
		|	омг_УстановкаВыработкиФилиалы.Ссылка.Дата КАК Период,
		|	омг_УстановкаВыработкиНоменклатура.ЭтоИскл КАК ЭтоИскл,
		|	омг_УстановкаВыработкиНоменклатура.Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
		|	омг_УстановкаВыработкиФилиалы.Ссылка.Дата КАК ДатаВвода
		|ИЗ
		|	Документ.омг_УстановкаВыработки.Филиалы КАК омг_УстановкаВыработкиФилиалы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.омг_УстановкаВыработки.ТабличнаяЧастьДолжностиИСотрудники КАК омг_УстановкаВыработкиТабличнаяЧастьДолжностиИСотрудники
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.омг_УстановкаВыработки.Номенклатура КАК омг_УстановкаВыработкиНоменклатура
		|			ПО омг_УстановкаВыработкиТабличнаяЧастьДолжностиИСотрудники.ИндСтроки = омг_УстановкаВыработкиНоменклатура.ИндСтроки
		|		ПО омг_УстановкаВыработкиФилиалы.Ссылка = омг_УстановкаВыработкиТабличнаяЧастьДолжностиИСотрудники.Ссылка
		|ГДЕ
		|	омг_УстановкаВыработкиФилиалы.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Филиал,
		|	Должность,
		|	Сотрудник,
		|	Номенклатура"; 
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	НомерЗаписи = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
	//Если не ВыборкаДетальныеЗаписи.ЭтоГруппа Тогда
		НомерЗаписи = НомерЗаписи + 1;
		новЗапись = Движения.омг_НоменклатураВыработки.Добавить();
		ЗаполнитьЗначенияСвойств(новЗапись,ВыборкаДетальныеЗаписи); 
		новЗапись.НомерЗаписи = НомерЗаписи; 
	//Иначе
	//	
	//	Для каждого строка из ВернутьНоменклатуруПоПапке(ВыборкаДетальныеЗаписи.Номенклатура) Цикл
	//		
	//		СтрДвижения = Движения.омг_НоменклатураВыработки.Добавить();	
	//		ЗаполнитьЗначенияСвойств(СтрДвижения,ВыборкаДетальныеЗаписи);
	//		СтрДвижения.Номенклатура = строка;
	//	
	//	КонецЦикла;	
	//		
	//КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры     


Функция ВернутьНоменклатуруПоПапке(Папка)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&Папка)
		|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура.Ссылка";
	
	Запрос.УстановитьПараметр("Папка", Папка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции	
