
Процедура ОбъектПриЧтенииНаСервере(Форма, ТекущийОбъект) Экспорт
	
	Если ИзменениеЗапрещено(ТекущийОбъект) Тогда
		
		Если ТипЗнч(ТекущийОбъект) = Тип("ДокументОбъект.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС") Тогда
			Форма.Элементы.ГруппаНомерИдентификатор.ТолькоПросмотр = Истина;
			Форма.Элементы.ГруппаНомерЗаявкиДатаСтатус.ТолькоПросмотр = Истина;
			Форма.Элементы.Филиал.ТолькоПросмотр = Истина;
			Форма.Элементы.ДокументОснование.ТолькоПросмотр = Истина;
			Форма.Элементы.ГруппаОсновныеДанныеЗаявки.ТолькоПросмотр = Истина;
			Форма.Элементы.ГруппаДополнительныеПоляИсследования.ТолькоПросмотр = Истина;
			Форма.Элементы.ГруппаБиоматериалыИКонтейнеры.ТолькоПросмотр = Истина;
			Форма.Элементы.КонтейнерыПодобратьКонтейнеры.Доступность = Ложь;
			Форма.Элементы.ДополнительныеСведенияОбновитьДополнительныеПоля.Доступность = Ложь;
			Форма.Элементы.ЗакрытьЗаявку.Доступность = Ложь;
			Форма.Элементы.ОтменитьЗаявку.Доступность = Ложь;
			Форма.Элементы.ФормаПроизвестиЗаборМатериалов.Доступность = Ложь;
			Форма.Элементы.ФормаОбновитьСостояниеПоДаннымЛИС.Доступность = Ложь;
		Иначе
			Форма.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстЗапросаДатыЗапрета()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ЕСТЬNULL(Пользователи.Родитель, НЕОПРЕДЕЛЕНО) КАК Родитель1,
	               |	ЕСТЬNULL(Пользователи.Родитель.Родитель, НЕОПРЕДЕЛЕНО) КАК Родитель2,
	               |	ЕСТЬNULL(Пользователи.Родитель.Родитель.Родитель, НЕОПРЕДЕЛЕНО) КАК Родитель3,
	               |	ЕСТЬNULL(Пользователи.Родитель.Родитель.Родитель.Родитель, НЕОПРЕДЕЛЕНО) КАК Родитель4,
	               |	ЕСТЬNULL(Пользователи.Родитель.Родитель.Родитель.Родитель.Родитель, НЕОПРЕДЕЛЕНО) КАК Родитель5
	               |ПОМЕСТИТЬ ВТ_Родители
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.Ссылка = &ТекущийПользователь
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГруппыПользователейСостав.Ссылка КАК Пользователь
	               |ПОМЕСТИТЬ ВТ_Пользователи
	               |ИЗ
	               |	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	               |ГДЕ
	               |	ГруппыПользователейСостав.Пользователь = &ТекущийПользователь
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Родители.Родитель1
	               |ИЗ
	               |	ВТ_Родители КАК ВТ_Родители
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Родители.Родитель2
	               |ИЗ
	               |	ВТ_Родители КАК ВТ_Родители
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Родители.Родитель3
	               |ИЗ
	               |	ВТ_Родители КАК ВТ_Родители
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Родители.Родитель4
	               |ИЗ
	               |	ВТ_Родители КАК ВТ_Родители
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_Родители.Родитель5
	               |ИЗ
	               |	ВТ_Родители КАК ВТ_Родители
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	омг_ДатыЗапретаИзменения.Объект КАК Объект,
	               |	омг_ДатыЗапретаИзменения.ДатаЗапрета КАК ДатаЗапрета,
	               |	омг_ДатыЗапретаИзменения.Пользователь КАК Пользователь,
	               |	ВЫБОР
	               |		КОГДА омг_ДатыЗапретаИзменения.Пользователь.Предопределенный
	               |			ТОГДА 1
	               |		КОГДА НЕ омг_ДатыЗапретаИзменения.Пользователь.Предопределенный
	               |			ТОГДА 2
	               |		КОГДА омг_ДатыЗапретаИзменения.Пользователь.ЭтоГруппа
	               |			ТОГДА 3
	               |		ИНАЧЕ 4
	               |	КОНЕЦ КАК Порядок
	               |ИЗ
	               |	ВТ_Пользователи КАК ВТ_Пользователи
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.омг_ДатыЗапретаИзменения КАК омг_ДатыЗапретаИзменения
	               |		ПО (ВТ_Пользователи.Пользователь = омг_ДатыЗапретаИзменения.Пользователь
	               |				ИЛИ омг_ДатыЗапретаИзменения.Пользователь = &ТекущийПользователь
	               |				ИЛИ омг_ДатыЗапретаИзменения.Пользователь = ЗНАЧЕНИЕ(Справочник.ГруппыПользователей.ВсеПользователи))
	               |			И (омг_ДатыЗапретаИзменения.Объект В (&ОбъектыЗапрета)
	               |				ИЛИ омг_ДатыЗапретаИзменения.Объект = НЕОПРЕДЕЛЕНО)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Объект,
	               |	Порядок
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ИзменениеЗапрещено(Данные) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Типзнч(Данные) = Тип("ДокументОбъект.Заявка") Тогда
		ДатаПроверки = НачалоДня(Данные.ДатаНачала);
	ИначеЕсли Типзнч(Данные) = Тип("ДокументОбъект.УстановкаГрафиковРаботы") Тогда
		ДатаПроверки = НачалоДня(Данные.ПлДата);
	Иначе
		ДатаПроверки = НачалоДня(Данные.Дата);
	КонецЕсли;
	
	МетаданныеОбъекта = Данные.Метаданные();
	
	ОбъектыЗапрета = Новый Массив;
	
	Если Не МетаданныеОбъекта.Реквизиты.Найти("Филиал") = Неопределено Тогда
		ОбъектыЗапрета.Добавить(Данные.Филиал);
	КонецЕсли;
	Если Не МетаданныеОбъекта.Реквизиты.Найти("Организация") = Неопределено Тогда
		ОбъектыЗапрета.Добавить(Данные.Организация);
	КонецЕсли;
	Если Не МетаданныеОбъекта.Реквизиты.Найти("омг_Организация") = Неопределено Тогда
		ОбъектыЗапрета.Добавить(Данные.омг_Организация);
	КонецЕсли;
	Если Не МетаданныеОбъекта.ТабличныеЧасти.Найти("омг_Филиалы") = Неопределено Тогда
		Для Каждого СтрокаТаблицы Из Данные.омг_Филиалы Цикл
			ОбъектыЗапрета.Добавить(СтрокаТаблицы.Филиал);
		КонецЦикла;
		
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("ОбъектыЗапрета", ОбъектыЗапрета);
	Запрос.Текст =  ТекстЗапросаДатыЗапрета();
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВыборкаДат = РезультатЗапроса.Выбрать();
	
	МассивЗапретов = Новый Массив;
	ОбщаяДатаЗапрета = Дата(1,1,1);
	
	Отказ = Ложь;
	
	СоответствиеЗапретов = Новый Соответствие;
	
	Пока ВыборкаДат.Следующий() Цикл
		Если ВыборкаДат.Объект = Неопределено И ЗначениеЗаполнено(ВыборкаДат.ДатаЗапрета) Тогда
			ОбщаяДатаЗапрета = ВыборкаДат.ДатаЗапрета;
		КонецЕсли;
		Если Не ВыборкаДат.Объект = Неопределено И Не ВыборкаДат.Объект.Пустая() И ЗначениеЗаполнено(ВыборкаДат.ДатаЗапрета) Тогда
			СоответствиеЗапретов.Вставить(ВыборкаДат.Объект, ВыборкаДат.ДатаЗапрета);
		КонецЕсли;
	КонецЦикла;
	
	ИтоговаяДатаЗапрета = Дата(1,1,1);
	
	Для Каждого Объект Из ОбъектыЗапрета Цикл
		
		ДатаЗапрета = СоответствиеЗапретов.Получить(Объект);
		
		Если ЗначениеЗаполнено(ДатаЗапрета) Тогда
			ИтоговаяДатаЗапрета = Макс(ИтоговаяДатаЗапрета, ДатаЗапрета);
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ИтоговаяДатаЗапрета) Тогда
		ИтоговаяДатаЗапрета = ОбщаяДатаЗапрета;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИтоговаяДатаЗапрета) И ИтоговаяДатаЗапрета >= НачалоДня(ДатаПроверки) Тогда 
		
		////////////////////////////////////////////////////////////
		// ОМГ +
		Если Типзнч(Данные) = Тип("ДокументОбъект.ЛистОжидания") Тогда

		иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Изменение данного документа запрещено. Установлена дата запрета редактирования для пользователя по  """ + Формат(ИтоговаяДатаЗапрета, "ДЛФ=DD") + """ включительно.";
		Сообщение.УстановитьДанные(Данные);
		Сообщение.Сообщить();
		
		Отказ = Истина;
		КонецЕсли;
		// ОМГ -
		////////////////////////////////////////////////////////////
	КонецЕсли;
	
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Отказ;
	
КонецФункции

Процедура омг_ПередЗаписьюДокументаДатаЗапретаРедактировавнияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	
	Если Источник.ОбменДанными.Загрузка
		Или Источник.ДополнительныеСвойства.Свойство("ПропускПроверкиДатыЗапрета") 
		Или (ТипЗнч(Источник) = Тип("ДокументОбъект.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС") 
			И Источник.Статус = Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ЕстьБракованныеПробы) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = ИзменениеЗапрещено(Источник);
	
КонецПроцедуры
