&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    
    // Очищаем старые данные
    ТекущийОбъект.Поля.Очистить();
    ТекущийОбъект.Параметры.Очистить();
    
    Если ПустаяСтрока(ТекущийОбъект.ТекстЗапроса) Тогда 
        Возврат; 
    КонецЕсли;
    
    СхемаЗапроса = Новый СхемаЗапроса;
    Попытка
        // Платформа сама проанализирует текст
        СхемаЗапроса.УстановитьТекстЗапроса(ТекущийОбъект.ТекстЗапроса);
    Исключение
        // Если в запросе синтаксическая ошибка, пропускаем разбор
        Возврат;
    КонецПопытки;
    
    // 1. Заполняем параметры
    Для Каждого Пар Из СхемаЗапроса.НайтиПараметры() Цикл
        НоваяСтрока = ТекущийОбъект.Параметры.Добавить();
        НоваяСтрока.ИмяПараметра = Пар.Имя;
    КонецЦикла;
    
    // 2. Заполняем поля (берем колонки из ПОСЛЕДНЕГО пакета запроса)
    // Последний пакет используется на случай, если запрос использует временные таблицы
    ВсегоПакетов = СхемаЗапроса.ПакетЗапросов.Количество();
    Если ВсегоПакетов > 0 Тогда
        ПоследнийПакет = СхемаЗапроса.ПакетЗапросов[ВсегоПакетов - 1];
        Для Каждого Колонка Из ПоследнийПакет.Колонки Цикл
            НоваяСтрока = ТекущийОбъект.Поля.Добавить();
            // Используем Алиас (синоним), так как именно под ним поле будет в Выборке
            НоваяСтрока.ИмяПоля = Колонка.Псевдоним; 
        КонецЦикла;
    КонецЕсли;
    
КонецПроцедуры