#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЛистокНетрудоспособности") Тогда
		// Заполнение шапки
		Цель = Документы.ВрачебнаяКомиссия.ПолучитьЭлементЭкспертизаВременнойНетрудоспособоности();
		
		Клиент = ДанныеЗаполнения.Клиент;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Основание = ДанныеЗаполнения;
		МедицинскаяКарта = ДанныеЗаполнения.МедицинскаяКарта;

		// Данные ЛН
		ДанныеЛН = Документы.ЛистокНетрудоспособности.ПолучитьПоследниееДанныеЛН(ДанныеЗаполнения);	
		СтрокаЛН = ДанныеЛН.НомерСтроки;
		ДатаНачалаНетрудоспособности = ДанныеЛН.ДатаНачала;
		ДатаОкончанияНетрудоспособности = ДанныеЛН.ДатаОкончания;
		ПредседательКомиссии = ДанныеЛН.ПредседательВК;
		Заключение = НСтр("ru='Продлить лист нетрудоспособности с '") 
					+ Формат(ДатаНачалаНетрудоспособности,"ДФ=dd.MM.yyyy") + " по "
					+ Формат(ДатаОкончанияНетрудоспособности,"ДФ=dd.MM.yyyy");
		
		// Состав комиссии
		ВрачЛН = ДанныеЛН.Врач;
		Если ЗначениеЗаполнено(ВрачЛН) И ПредседательКомиссии<>ВрачЛН Тогда
			СтрокаСотрудника = СоставКомиссии.Добавить();
			СтрокаСотрудника.Сотрудник = ВрачЛН;	
		КонецЕсли; 			
		
		// Диагноз
		СтрокаДиагноза = Диагнозы.Добавить();
		СтрокаДиагноза.Диагноз = ДанныеЗаполнения.ДиагнозПоМКБ10;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Прием") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Основание = ДанныеЗаполнения;
		МедицинскаяКарта = ДанныеЗаполнения.МедицинскаяКарта;
		
		// Состав комиссии
		СтрокаСотрудника = СоставКомиссии.Добавить();
		СтрокаСотрудника.Сотрудник = ДанныеЗаполнения.Врач;
		
		// Диагнозы
		Для каждого СтрокаДиагноза Из ДанныеЗаполнения.Диагнозы Цикл
			НоваяСтрока = Диагнозы.Добавить();
			НоваяСтрока.Диагноз = СтрокаДиагноза.Диагноз;
			НоваяСтрока.СтепеньОбоснованности = СтрокаДиагноза.Классификация1;
			НоваяСтрока.ВидНозологическойЕдиницы = СтрокаДиагноза.Классификация3;
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ОтсортироватьДиагнозы();
	
	Если (Проведен И РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения)
		Или РежимЗаписи = РежимЗаписиДокумента.Проведение
	Тогда
		СформироватьHTMLПредставление();
	Иначе
		HTMLПредставление = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтсортироватьДиагнозы()
	
	ТаблДиагнозы = Диагнозы.Выгрузить();
	ТаблДиагнозы.Колонки.Добавить("Приоритет",Новый ОписаниеТипов("Число"));
	Для Каждого СтрокаДиагнозы Из ТаблДиагнозы Цикл
		СтрокаДиагнозы.Приоритет = УстановитьПриоритетДиагноза(СтрокаДиагнозы.ВидНозологическойЕдиницы);	
	КонецЦикла; 
	ТаблДиагнозы.Сортировать("Приоритет, Диагноз");
	Диагнозы.Очистить();
	Для Каждого СтрокаДиагнозы Из ТаблДиагнозы Цикл
		НоваяСтрока = Диагнозы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДиагнозы);
	КонецЦикла; 
	
КонецПроцедуры

Функция УстановитьПриоритетДиагноза(ВидДиагноза)
	Если ВидДиагноза = Перечисления.КлассификацииДиагнозов.ОсновноеЗаболевание Тогда
		Возврат 1;
	ИначеЕсли ВидДиагноза = Перечисления.КлассификацииДиагнозов.ОсложнениеОсновногоЗаболевания Тогда 
		Возврат 2;	
	ИначеЕсли ВидДиагноза = Перечисления.КлассификацииДиагнозов.СопутствующееЗаболевание Тогда 
		Возврат 3;
	ИначеЕсли ВидДиагноза = Перечисления.КлассификацииДиагнозов.ОсложнениеСопутствующегоЗаболевания Тогда 
		Возврат 4;
	ИначеЕсли ВидДиагноза = Перечисления.КлассификацииДиагнозов.КонкурирующееЗаболевание Тогда 
		Возврат 5;
	ИначеЕсли ВидДиагноза = Перечисления.КлассификацииДиагнозов.ФоновоеЗаболевание Тогда 
		Возврат 6;
	ИначеЕсли ВидДиагноза = Перечисления.КлассификацииДиагнозов.ВнешняяПричина Тогда 
		Возврат 7;
	Иначе
		ВОзврат 8;
	КонецЕсли; 		
КонецФункции
 
#Область ШаблонHTML

Процедура СформироватьHTMLПредставление()
	
	СтруктураДокумента = ОбщегоНазначенияСервер.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	СтруктураДокумента.Вставить("Диагнозы", Диагнозы.Выгрузить());
	СтруктураДокумента.Вставить("СоставКомиссии", СоставКомиссии.Выгрузить());
	
	ТабДок = Документы.ВрачебнаяКомиссия.Печать(СтруктураДокумента, "ПротоколВКК_ДляМедкарты");
	HTMLПредставление = ТабДок.Получитьтекст();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПодписанЭП = Ложь;
	
	Если ЗначениеЗаполнено(ОбъектКопирования.Цель) 
		И ТипЗнч(ОбъектКопирования.Цель) = Тип("СправочникСсылка.удалитьЦелиПроведенияВК")
		И ЗначениеЗаполнено(ОбъектКопирования.Цель.УИДЕГИСЗ)
	Тогда
		Цель = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(ОбъектКопирования.Цель.УИДЕГИСЗ, Перечисления.ВидыКлассификаторовМинЗдрава.ЦелиПроведенияВК)
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти