				  
Функция ПолучитьТекстПоляРедактораКода() Экспорт
	
	ТекстHTML = Обработки.iga_ОбработчикЭтапов.ПолучитьМакет("ТекстПоляHTML").ПолучитьТекст();
	
	Текст_CM_JS   = Обработки.iga_ОбработчикЭтапов.ПолучитьМакет("codemirror_min_js").ПолучитьТекст();
	Текст_CM_CSS  = Обработки.iga_ОбработчикЭтапов.ПолучитьМакет("codemirror_min_css").ПолучитьТекст();
	Текст_Simple_JS = Обработки.iga_ОбработчикЭтапов.ПолучитьМакет("simple_min_js").ПолучитьТекст();	

	ТекстHTML = СтрЗаменить(ТекстHTML, "%CodeMirrorCSS%", Текст_CM_CSS);
    ТекстHTML = СтрЗаменить(ТекстHTML, "%CodeMirrorJS%",  Текст_CM_JS);
    ТекстHTML = СтрЗаменить(ТекстHTML, "%SimpleJS%",      Текст_Simple_JS);    

	Возврат ТекстHTML;
	
КонецФункции