
Перем ВходящиеПараметры Экспорт;
Перем ПараметрыОбщения;

Функция ВычислитьАлгоритм(ТекстКода, ТаблицаПараметров, СтекВызовов, СсылкаНаАлгоритм, ДопПараметры = Неопределено) Экспорт
    
    // 1. Защита от зацикливания
    Если ЗначениеЗаполнено(СсылкаНаАлгоритм) Тогда
        Если СтекВызовов.Найти(СсылкаНаАлгоритм) <> Неопределено Тогда
            ВызватьИсключение "Обнаружено зацикливание! Алгоритм: " + Строка(СсылкаНаАлгоритм);
        КонецЕсли;
        СтекВызовов.Добавить(СсылкаНаАлгоритм);
    КонецЕсли;
    
    // Используем спец. префиксы "внутр_", чтобы наши локальные переменные
    // случайно не совпали с именами параметров, которые задаст пользователь.
    внутр_Параметры = Новый Структура;
    внутр_Инициализация = "";
    внутр_ИтоговыйКод = ТекстКода;
    
    // 2. Разбор параметров и формирование кода
    Для Каждого СтрокаПараметра Из ТаблицаПараметров Цикл
        
        внутр_Имя = СтрокаПараметра.ИмяПараметра;
        внутр_Значение = СтрокаПараметра.Значение;
        
        // Если параметр - это другой алгоритм, запускаем рекурсию
        Если ТипЗнч(внутр_Значение) = Тип("СправочникСсылка.iga_Алгоритмы") И ЗначениеЗаполнено(внутр_Значение) Тогда
            // Для вложенных алгоритмов берем данные уже из базы
            внутр_РассчитанноеЗначение = ВычислитьАлгоритм(внутр_Значение.Алгоритм, внутр_Значение.ПараметрыАлгоритма, СтекВызовов, внутр_Значение, ДопПараметры);
        Иначе
            внутр_РассчитанноеЗначение = внутр_Значение;
        КонецЕсли;
        
        внутр_Параметры.Вставить(внутр_Имя, внутр_РассчитанноеЗначение);
        
        // Пишем строку инициализации для оператора Выполнить: ИмяПараметра = внутр_Параметры.ИмяПараметра;
        внутр_Инициализация = внутр_Инициализация + внутр_Имя + " = внутр_Параметры." + внутр_Имя + ";" + Символы.ПС;
        
        // Заменяем в тексте пользователя {ИмяПараметра} на ИмяПараметра
        внутр_ИтоговыйКод = СтрЗаменить(внутр_ИтоговыйКод, "{" + внутр_Имя + "}", внутр_Имя);
        
    КонецЦикла;
    
    // Переменная, куда алгоритм пользователя должен записать итог
    Результат = Неопределено; 
    
    внутр_КодКВыполнению = внутр_Инициализация + Символы.ПС + внутр_ИтоговыйКод;
    
    // 3. Динамическое выполнение кода
    Выполнить(внутр_КодКВыполнению);
    
    // 4. Очистка стека при выходе из текущего уровня рекурсии
    Если ЗначениеЗаполнено(СсылкаНаАлгоритм) Тогда
        СтекВызовов.Удалить(СтекВызовов.ВГраница());
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции

Функция ПоИмени(ИмяАлгоритма) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_Алгоритмы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.iga_Алгоритмы КАК iga_Алгоритмы
	               |ГДЕ
	               |	iga_Алгоритмы.ИмяАлгоритма = &ИмяАлгоритма";
	Запрос.УстановитьПараметр("ИмяАлгоритма", ИмяАлгоритма);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

Функция Алгоритм(ИмяАлгоритмаИлиСсылка, ДопПараметры = Неопределено, СтекВызовов = Неопределено) Экспорт
	
	Если ТипЗнч(ИмяАлгоритмаИлиСсылка) = Тип("Строка") Тогда
		СсылкаНаАлгоритм = ПоИмени(ИмяАлгоритмаИлиСсылка);
	Иначе
		СсылкаНаАлгоритм = ИмяАлгоритмаИлиСсылка;
	КонецЕсли;
	
	Если СтекВызовов = Неопределено Тогда
		СтекВызовов = Новый Массив;
	КонецЕсли;
	
	Возврат ВычислитьАлгоритм(СсылкаНаАлгоритм.Алгоритм, СсылкаНаАлгоритм.ПараметрыАлгоритма, СтекВызовов, СсылкаНаАлгоритм, ДопПараметры);
	
КонецФункции

Функция ВыполнитьАлгоритмВИсключении(ИмяАлгоритмаИлиСсылка, ДопПараметры = Неопределено, СтекВызовов = Неопределено) Экспорт
	
	Попытка
		
		Если ТипЗнч(ИмяАлгоритмаИлиСсылка) = Тип("Строка") Тогда
			СсылкаНаАлгоритм = ПоИмени(ИмяАлгоритмаИлиСсылка);
		Иначе
			СсылкаНаАлгоритм = ИмяАлгоритмаИлиСсылка;
		КонецЕсли;
		
		Если СтекВызовов = Неопределено Тогда
			СтекВызовов = Новый Массив;
		КонецЕсли;
		
		Результат =  ВычислитьАлгоритм(СсылкаНаАлгоритм.Алгоритм, СсылкаНаАлгоритм.ПараметрыАлгоритма, СтекВызовов, СсылкаНаАлгоритм, ДопПараметры);
		
	Исключение
		Инфо = ИнформацияОбОшибке();
		ХешОшибки = iga_ОбщегоНазначенияСервер.ПолучитьКлючОшибки(Инфо);
		
		// Вызов функции записи из предыдущего ответа (с передачей готового Хеша)
		iga_ОбщегоНазначенияСервер.ЗарегистрироватьОшибкуБота(ХешОшибки, 
		"Начальный алгоритм: " + СсылкаНаАлгоритм + Символы.ПС + ПодробноеПредставлениеОшибки(Инфо));
		ВызватьИсключение("Ошибка алгоритма. Проверьте журнал ошибок.");
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПараметрЧата(ИмяПараметра)
	
	Возврат iga_МетодыРаботыСБотом.ПолучитьЗначениеПараметраОбщения(ВходящиеПараметры.Чат, ИмяПараметра);
	
КонецФункции

Функция ВыполнитьОбработчикСУчетомАлгоритмов(КодОбработчика) Экспорт
	
	Результат = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыОбщения = ТекущиеПараметрыОбщения(ВходящиеПараметры.Чат);
	
	Попытка
		Выполнить(КодОбработчика);
	Исключение
		Инфо = ИнформацияОбОшибке();
		ХешОшибки = iga_ОбщегоНазначенияСервер.ПолучитьКлючОшибки(Инфо);
		
		// Вызов функции записи из предыдущего ответа (с передачей готового Хеша)
		iga_ОбщегоНазначенияСервер.ЗарегистрироватьОшибкуБота(ХешОшибки, "Чат: " +  ВходящиеПараметры.Чат + "
		|Начальный алгоритм: " + КодОбработчика + Символы.ПС + ПодробноеПредставлениеОшибки(Инфо));
		ВызватьИсключение("Ошибка алгоритма. Проверьте журнал ошибок.");
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции   

Процедура УстановитьПараметр(ИмяПараметра, Значение)
	
	iga_МетодыРаботыСБотом.УстановитьПараметрОбщения(ВходящиеПараметры.Чат, ИмяПараметра, Значение);
	Если ПараметрыОбщения = Неопределено Тогда
		ПараметрыОбщения = Новый Структура;
	КонецЕсли;
	
	ПараметрыОбщения.Вставить(ИмяПараметра, Значение);
	
КонецПроцедуры


Функция ТекущиеПараметрыОбщения(Чат)
	
	СтруктураЗначений = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ПараметрыОбщенияСБотом.Чат КАК Чат,
	               |	iga_ПараметрыОбщенияСБотом.Параметр КАК Параметр,
	               |	iga_ПараметрыОбщенияСБотом.Значение КАК Значение,
	               |	iga_ПараметрыОбщенияСБотом.Параметр.ИмяПараметра КАК ПараметрИмяПараметра
	               |ИЗ
	               |	РегистрСведений.iga_ПараметрыОбщенияСБотом КАК iga_ПараметрыОбщенияСБотом
	               |ГДЕ
	               |	iga_ПараметрыОбщенияСБотом.Чат = &Чат";
	Запрос.УстановитьПараметр("Чат", Чат);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураЗначений.Вставить(Выборка.ПараметрИмяПараметра, Выборка.Значение);
	КонецЦикла;
	
	Возврат СтруктураЗначений;
	
КонецФункции

Функция ТекстЗапроса(Идентификатор)
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	iga_ТекстыЗапросов.Ссылка КАК Ссылка,
	              |	iga_ТекстыЗапросов.ТекстЗапроса КАК ТекстЗапроса
	              |ИЗ
	              |	Справочник.iga_ТекстыЗапросов КАК iga_ТекстыЗапросов
	              |ГДЕ
	              |	iga_ТекстыЗапросов.Код = &Код";
	Запрос.УстановитьПараметр("Код", Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ТекстЗапроса;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПолучитьПараметрСообщения(ИмяПараметра, ИдСообщения = "")
	
	Если ИдСообщения = "" Тогда
		Значение = iga_МетодыРаботыСБотом.ПолучитьПараметрСообщения(ВходящиеПараметры.Чат, ВходящиеПараметры.ИдСообщения, ИмяПараметра)
	Иначе
		Значение = iga_МетодыРаботыСБотом.ПолучитьПараметрСообщения(ВходящиеПараметры.Чат, ИдСообщения, ИмяПараметра)
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Процедура УстановитьПараметрСообщения(ИмяПараметра, Значение, ИдСообщения = "")
	
	Если ИдСообщения = "" Тогда
		iga_МетодыРаботыСБотом.УстановитьПараметрСообщения(ВходящиеПараметры.Чат, ВходящиеПараметры.ИдСообщения, ИмяПараметра, Значение);
	Иначе
		iga_МетодыРаботыСБотом.УстановитьПараметрСообщения(ВходящиеПараметры.Чат, ИдСообщения, ИмяПараметра, Значение);
	КонецЕсли;
	
КонецПроцедуры

Функция ШаблонПоСпециальнойМетке(Метка)
	
	Если Не ЗначениеЗаполнено(ВходящиеПараметры.ИдШаблона) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ШаблоныСообщений.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.iga_ШаблоныСообщений КАК iga_ШаблоныСообщений
	               |ГДЕ
	               |	iga_ШаблоныСообщений.СпециальнаяМетка.Наименование = &Наименование
	               |	И iga_ШаблоныСообщений.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", ВходящиеПараметры.ИдШаблона);
	Запрос.УстановитьПараметр("Наименование", Метка);
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
