// Изменяет/создает записи регистра с указанными параметрами
//
// Параметры:
//  Койки		 - Массив						 - Массив коек на перемещение
//  Палата		 - СправочникСсылка.Палаты		 - Палаты, куда перемещаются койки
//  Статус		 - ПеречислениеСсылка.СостоянияКоек	 - Присваимое койкам состояние
//  Комментарий	 - Строка(250)	 - Присваиваемый комментарий
//	СозданиеКоек - Булево	     - При создании коек устанавливается период Дата(1900, 1, 1) 
// 
// Возвращаемое значение:
//  Массив - Массив недоступных для перемещения коек
//
Функция ВыполнитьДвижениеКоечногоФонда(Койки, Палата = Неопределено, Статус = Неопределено, Комментарий = "", СозданиеКоек = Ложь) Экспорт
	
	НедоступныеКойки = Новый Массив;
	Период = ?(СозданиеКоек,  Дата(1900, 1, 1), ТекущаяДата());
	ЗанятостьКоек = РегистрыСведений.СостояниеКойкоМеста.ПолучитьЗанятыеКойки(Период);
	
	Для Каждого Койка Из Койки Цикл
		
		Если ЗанятостьКоек.Найти(Койка) = Неопределено Тогда
			
			Запись = РегистрыСведений.ДвижениеКоечногоФонда.СоздатьМенеджерЗаписи();
			Запись.Койка = Койка;
			Запись.Период = Период;  
			
			Если ЗначениеЗаполнено(Палата) Тогда
				
				Если Палата = Справочники.Палаты.Хранение Тогда
					Комментарий = Комментарий + Символы.ПС + "Перенесено из палаты: " + Койка.Владелец;
					Запись.Подразделение = Койка.Владелец.Подразделение;
				Иначе
					Запись.Подразделение = Палата.Подразделение;
				КонецЕсли;
				
				Запись.Палата = Палата;
				ЗаписьКойка = Койка.ПолучитьОбъект();
				ЗаписьКойка.Владелец = Палата;
				ЗаписьКойка.Записать();
				
			Иначе
				Запись.Палата = Койка.Владелец;
				Запись.Подразделение = Койка.Владелец.Подразделение;
			КонецЕсли;
			
			Запись.Статус = Статус;
			Запись.Комментарий = Комментарий;
			Запись.Ответственный = Пользователи.ТекущийПользователь();
			Запись.Записать();
			
		Иначе
			НедоступныеКойки.Добавить(Койка);				
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат НедоступныеКойки;
	
КонецФункции

Функция ПолучитьДвижениеКойки(Койка, Дата = Неопределено) Экспорт
	
	Дата = ?(Дата = Неопределено, ТекущаяДата(), Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДвижениеКоечногоФондаСрезПоследних.Койка КАК Койка,
	               |	ДвижениеКоечногоФондаСрезПоследних.Палата КАК Палата,
	               |	ДвижениеКоечногоФондаСрезПоследних.Статус КАК Статус,
	               |	ДвижениеКоечногоФондаСрезПоследних.Комментарий КАК Комментарий,
	               |	ДвижениеКоечногоФондаСрезПоследних.Подразделение КАК Подразделение
	               |ИЗ
	               |	РегистрСведений.ДвижениеКоечногоФонда.СрезПоследних(&Период, ) КАК ДвижениеКоечногоФондаСрезПоследних
	               |ГДЕ
	               |	ДвижениеКоечногоФондаСрезПоследних.Койка = &Койка";
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Койка", Койка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции