
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	ДиалогВыбораФайла.Фильтр = "(*.xml)|*.xml";
	ДиалогВыбораФайла.Заголовок = НСтр("Выберите файл");
	Если ПараметрКоманды.Количество() = 1 Тогда
		ДиалогВыбораФайла.ПолноеИмяФайла = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыВИмениФайла(Строка(ПараметрКоманды[0]), " ");
	КонецЕсли;
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		
		ДвоичныеДанныеФайла = ЭкспортироватьСервер(ПараметрКоманды);
		ДвоичныеДанныеФайла.Записать(ДиалогВыбораФайла.ПолноеИмяФайла);
		
		ПоказатьПредупреждение(, НСтр("ru='Операция завершена!'"));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЭкспортироватьСервер(ПараметрКоманды)
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
	Справочники.ШаблоныHTML.Экспортировать(ПараметрКоманды, ВременныйФайл);
	Возврат Новый ДвоичныеДанные(ВременныйФайл);
	
КонецФункции