#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Сотрудник) Тогда
		Сотрудник = Параметры.Сотрудник;
		ТекущийЭлемент = Элементы.Дата;
	КонецЕсли;
	
	Дата = Параметры.Дата;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора",, Элементы.Сотрудник, ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("Сотрудник", Сотрудник);
	Результат.Вставить("Дата", Дата);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти
