
&НаСервере
Процедура iga_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Если Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.ВидыСобытий.iga_ДиалогWhatsApp") Тогда
		ДопСвойства.Вставить("ХранилищеСсылки", Параметры.Основание.ХранилищеСсылки);
	КонецЕсли;
	Элементы.ВидСобытия.СписокВыбора.Добавить(Перечисления.ВидыСобытий.iga_ДиалогWhatsApp);
	
КонецПроцедуры

&НаКлиенте
Процедура iga_ПриЗакрытииПосле(ЗавершениеРаботы)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Ключ.Пустая() И ДопСвойства.Свойство("ХранилищеСсылки") Тогда
		ПоместитьВоВременноеХранилище(Параметры.Ключ, ДопСвойства.ХранилищеСсылки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&После("НастроитьВидимостьДоступность")
Процедура iga_НастроитьВидимостьДоступность()
	
	ЭтоЗвонок = (Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.ВидыСобытий.ВходящийЗвонок")
		Или Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.ВидыСобытий.ИсходящийЗвонок")
		Или Объект.ВидСобытия = ПредопределенноеЗначение("Перечисление.ВидыСобытий.iga_ДиалогWhatsApp"));

	// Звонки
	Элементы.ГруппаЗвонок.Доступность = ЭтоЗвонок;
	Элементы.ФормаНачатьРазговор.Доступность = ЭтоЗвонок И ИспользоватьCallЦентр И Не Объект.ЗвонокНачат;
	Элементы.ФормаНачатьРазговорМонитор.Доступность = Элементы.ФормаНачатьРазговор.Доступность;	
	Элементы.ДлительностьВремя.Доступность = ЭтоЗвонок И ИспользоватьCallЦентр;
	
КонецПроцедуры


