
&НаКлиенте
Процедура ТестыПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Тесты.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ТестыСвойства.ОтборСтрок = Новый ФиксированнаяСтруктура(
		Новый Структура("Ключ", ТекущаяСтрока.Ключ));
	
КонецПроцедуры

&НаКлиенте
Процедура ТестыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущаяСтрока = Элементы.Тесты.ТекущиеДанные;
		
		ТекущаяСтрока.Ключ = Новый УникальныйИдентификатор;
		
		Элементы.ТестыСвойства.ОтборСтрок = Новый ФиксированнаяСтруктура(
			Новый Структура("Ключ", ТекущаяСтрока.Ключ));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестыПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.Тесты.ТекущиеДанные;
	
	НайденныеСтроки = Объект.ТестыСвойства.НайтиСтроки(Новый Структура("Ключ", ТекущаяСтрока.Ключ));
	
	Для Каждого СтрокаСвойств Из НайденныеСтроки Цикл
		Объект.ТестыСвойства.Удалить(СтрокаСвойств);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТестыСвойстваПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока ТОгда
		ТекущаяСтрокаСвойств = Элементы.ТестыСвойства.ТекущиеДанные;
		ТекущаяСтрокаТест = Элементы.Тесты.ТекущиеДанные;
		ТекущаяСтрокаСвойств.Ключ = ТекущаяСтрокаТест.Ключ;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТестыСвойстваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Элементы.Тесты.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
