
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если Параметры.Свойство("Данные") Тогда
        
        ПереданнаяСтруктура = Параметры.Данные;
        ТекСтрокаДействия = ПереданнаяСтруктура.ТипДействия; 
		Если ТекСтрокаДействия = "Конференция открыта" Тогда
			Элементы.ГруппаКомнатаСоздана.Видимость = Истина;
			Элементы.ГруппаКомнатаЗакрыта.Видимость = Ложь;
		ИначеЕсли ТекСтрокаДействия = "Конференция завершена" Тогда
			Элементы.ГруппаКомнатаСоздана.Видимость = Ложь;
			Элементы.ГруппаКомнатаЗакрыта.Видимость = Истина;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Хорошо(Команда)
	Закрыть();
КонецПроцедуры
