&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура БессрочноеПриИзменении(Элемент)
    Если Объект.Бессрочное Тогда
        Объект.ДатаОкончания = '00010101';
    КонецЕсли;
    УправлениеФормойКлиент();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормойКлиент()
    Элементы.ДатаОкончания.Доступность = НЕ Объект.Бессрочное;
    Элементы.ДатаОкончания.АвтоОтметкаНезаполненного = НЕ Объект.Бессрочное;
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
    Элементы.ДатаОкончания.Доступность = НЕ Объект.Бессрочное;
    Элементы.ДатаОкончания.АвтоОтметкаНезаполненного = НЕ Объект.Бессрочное;
КонецПроцедуры

&НаКлиенте
Процедура МедицинскийЦентрПриИзменении(Элемент)

    Если НЕ ЗначениеЗаполнено(Объект.АдресПроизводственнойБазы) Тогда
        Объект.АдресПроизводственнойБазы = ПолучитьАдресМедцентра(Объект.МедицинскийЦентр);
    КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьАдресМедцентра(МедицинскийЦентр)

       Возврат "";

КонецФункции