
#Область ПрограммныйИнтерфейс

// Возвращает текущую дату, приведенную к часовому поясу сеанса.
// Предназначена для использования вместо функции ТекущаяДата().
//
// Возвращаемое значение:
//{{MRG[ <-> ]
//  Дата.
//}}MRG[ <-> ]
//{{MRG[ <-> ]
////  Результат - текущая дата.
//}}MRG[ <-> ]
//
Функция ДатаСеанса() Экспорт
//{{MRG[ <-> ]
//	
//	Возврат ТекущаяДата();
//}}MRG[ <-> ]
	
КонецФункции

#Область ОборудованиеККТ

// Переопределяет доступное ККТ для фискализации чека
// Параметры:
//  РеквизитыЧека - Структура - реквизиты фискального чека
//  СписокУстройств - Массив - список доступных ККТ для фискализации
//  ИдентификаторУстройстваККТ - СправочникСсылка.ПодключаемоеОборудование - выбранное ККТ для фискализации
//  СтандартнаяОбработка - Булево - выполнение стандартной обработки
//
Процедура ДоступноеККТДляФискализации(РеквизитыЧека, СписокУстройств, ИдентификаторУстройстваККТ, СтандартнаяОбработка = Истина) Экспорт

КонецПроцедуры

// Событие при открытии смены на ККТ 
// Параметры:
//  ИдентификаторУстройстваККТ - СправочникСсылка.ПодключаемоеОборудование - выбранное ККТ
//  ПараметрыРегистрации - Структура - Параметры регистрации ФН
//
Процедура ПриОткрытииСменыНаККТ(ИдентификаторУстройстваККТ, ПараметрыРегистрации) Экспорт

КонецПроцедуры

// Переопределяет печать слип чека алкогольной продукции. 
// Параметры:
//  ПечатьСлипЧека - Булево - Печатается слип чек алкогольной продукции 
//  СтандартнаяОбработка - Булево - выполнение стандартной обработки
//
Процедура ПечатьСлипЧекаАлкогольнойПродукции(ПечатьСлипЧека, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры     

// Переопределяет печать слип чека эквайринговой операции. 
// Параметры:
//  ПечатьСлипЧека - Булево - Определяет будет ли распечатан слип-чек, по умолчанию Истина.  
//  ПолныйСлипЧек  - Булево - Определяет какой слип-чек будет распечатан полный или короткий, по умолчанию Истина. 
//  СтандартнаяОбработка - Булево - выполнение стандартной обработки.
//
Процедура ПечатьСлипЧекаЭквайринговойОперации(ПечатьСлипЧека, ПолныйСлипЧек, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры   

// Переопределяет вывод QR-кода чека на дисплей покупателя после фискализации. 
// Параметры:
//  ВыводQRКодаЧека - Булево - Вывод QR-кода чека на дисплей покупателя 
//  СтандартнаяОбработка - Булево - выполнение стандартной обработки
//
Процедура ВыводQRКодаЧекаНаДисплейПокупателяПослеФискализации(ВыводQRКодаЧека, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ВыводQRКодаЧека = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ЧекКММВыводитьQRКодНаДисплейПокупателя");
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойЭкземпляраОборудования

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПриОткрытии".
//
// Параметры:
//  Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  Отказ - Булево - признак отказа.
//
Процедура ЭкземплярОборудованияПриОткрытии(Объект, ЭтаФорма, Отказ) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗакрытием".
//
//
// Параметры:
//  Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  Отказ - Булево - признак отказа.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ЭкземплярОборудованияПередЗакрытием(Объект, ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПередЗаписью".
//
// Параметры:
//  Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  Отказ - Булево - признак отказа.
//  ПараметрыЗаписи - Структура - параметры записи оборудования.
//
Процедура ЭкземплярОборудованияПередЗаписью(Объект, ЭтаФорма, Отказ, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ПослеЗаписи".
//
// Параметры:
//  Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  ПараметрыЗаписи - Структура - параметры записи оборудования.
//
Процедура ЭкземплярОборудованияПослеЗаписи(Объект, ЭтаФорма, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ОбработкаНавигационнойСсылки".
//
// Параметры:
//  Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  НавигационнаяСсылкаФорматированнойСтроки - Строка - навигационная ссылка.
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ЭкземплярОборудованияОбработкаНавигационнойСсылки(Объект, ЭтаФорма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Дополнительные переопределяемые действия с управляемой формой в Экземпляре оборудования
// при событии "ТипОборудованияОбработкаВыбора".
//
// Параметры:
//  Объект - СправочникОбъект.ПодключаемоеОборудование - объект подключаемого оборудования.
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма владелец.
//  ЭтотОбъект - СправочникОбъект.ПодключаемоеОборудование - текущий объект подключаемого оборудования.
//  Элемент - Элемент - изменяемый элемент.
//  ВыбранноеЗначение - ПеречислениеСсылка.ТипыПодключаемогоОборудования - выбранное значение.
//
Процедура ЭкземплярОборудованияТипОборудованияВыбор(Объект, ЭтаФорма, ЭтотОбъект, Элемент, ВыбранноеЗначение) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область РаспределеннаяФискализации

// Переопределяемые действия после открытия чека в очереди чеков.
//
// Параметры:
//  ПараметрыВыполнения - Структура - Параметры выполнения команды
//  ДополнительныеПараметры - Произвольный
//
Процедура ФискализацияЧековВОчередиПослеОткрытияЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

// Переопределяемые действия после ошибки печати чека в очереди чеков.
//
// Параметры:
//  ПараметрыВыполнения - Структура - Параметры выполнения команды
//  ДополнительныеПараметры - Произвольный
//
Процедура ФискализацияЧековВОчередиПослеОшибкиПечатиЧека(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

#КонецОбласти


// Функция возвращает объект обработчика драйвера по его наименованию.
//
// Параметры:
//  ОбработчикДрайвера  - Перечисление, ссылка на обработчик драйвера подключаемого оборудования.
//  ЗагружаемыйДрайвер  - Булево, признак, что драйвер загружаемый
//  ТипОборудованияИмя  - Строка, представление типа оборудования
//
// Возвращаемое значение:
//  Результат - Используемый модуль обработчика драйвера.
//
Функция ПолучитьОбработчикДрайвера(ОбработчикДрайвера, ЗагружаемыйДрайвер, ТипОборудованияИмя) Экспорт

// Используем универсальный обработчик драйвера по стандарту "1С:Совместимо".
#Если ВебКлиент Тогда
	Результат = ПодключаемоеОборудованиеУниверсальныйДрайверАсинхронноКлиент; 
#Иначе
	Результат = ПодключаемоеОборудованиеУниверсальныйДрайверКлиент;
#КонецЕсли
	
	// Обработчики драйверов не удовлетворяющие стандарту "1С:Совместимо".
	Если Не ЗагружаемыйДрайвер И ОбработчикДрайвера <> Неопределено Тогда
		
		// Сканеры штрихкода
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.Обработчик1ССканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудование1ССканерыШтрихкодаКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодСканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудованиеСканкодСканерыШтрихкодаКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолСканерыШтрихкода") Тогда
			Возврат ПодключаемоеОборудованиеАтолСканерыШтрихкодаКлиент;
		КонецЕсли;
		// Конец Сканеры штрихкода
		
		// Фискальные регистраторы
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеАтолФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикВерсияТФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеВерсияТФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикККСФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеККСФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеШтрихМФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикОРИОНФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеОРИОНФискальныеРегистраторыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикWebkassaФискальныеРегистраторы") Тогда
			Возврат ПодключаемоеОборудованиеWebkassaФискальныеРегистраторыКлиент;	
		КонецЕсли;   
		
		// Конец Фискальные регистраторы.
		
				
		// Терминалы сбора данных
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикАтолТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеАтолТерминалыСбораДанныхКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикШтрихМТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеШтрихМТерминалыСбораДанныхКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканкодТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеСканкодТерминалыСбораДанныхКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСканситиТерминалыСбораДанных") Тогда
			Возврат ПодключаемоеОборудованиеСканситиТерминалыСбораДанныхКлиент;
		КонецЕсли;
		// Конец Терминалы сбора данных.
		
		// Эквайринговые терминалы
		Если ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикСБРФЭквайринговыеТерминалы") Тогда
			Возврат ПодключаемоеОборудованиеСБРФЭквайринговыеТерминалыКлиент;
		ИначеЕсли ОбработчикДрайвера = ПредопределенноеЗначение("Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикИНПАСЭквайринговыеТерминалыSmart") Тогда
			Возврат ПодключаемоеОборудованиеИНПАСЭквайринговыеТерминалыSmartКлиент;
		КонецЕсли;
		// Конец Эквайринговые терминалы.
				
				
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура отправляет электронное сообщение на электронную почта и абонентский номер.
//
Процедура НачатьОтправкуЭлектронногоЧека(ПараметрыЧека, ТекстСообщения, ПокупательEmail, ПокупательНомер) Экспорт
	
	
	
КонецПроцедуры

// Начинает рассылку или ставит задачу на рассылку нефискальных документов.
// Которые заданы в шаблоне чека.
Процедура НачатьРассылкуНефискальныхДокументов(Параметры) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФормойЭкземпляраФискальныеОперации

// Устарела: больше не используется.
// Дополнительные переопределяемые действия с управляемой формой в Фискальные операции
// при событии "ОбработкаНавигационнойСсылки".
//
// Параметры:
//  Запись - РегистрСведенийМенеджерЗаписи.ФискальныеОперации
//  ЭтаФорма - Форма
//  НавигационнаяСсылкаФорматированнойСтроки - Строка
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ФормаЗаписиФискальныеОперацииОбработкаНавигационнойСсылки(Запись, ЭтаФорма, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СообщениеВТехническуюПоддержку

// В процедуре можно разрешить, либо запретить отправку сообщений БПО в тех. поддержку
//
// Параметры:
//  Отправлять - Булево - при стандартной обработке Истина
//  СтандартнаяОбработка - Булево - признак стандартной обработки.
//
Процедура ОтправлятьСообщенияВТехПоддержку(Отправлять, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Подготовка текста сообщения в службу технической поддержки
//
// Параметры:
//  ТекстСообщения - Строка - текст сообщения который будет вставлен в поле "Шаблон сообщения" на сайте.
//  ТекстОшибки - Строка - текст ошибки, переданный в процедуру отправки сообщения.
//
Процедура ПодготовитьТекстСообщенияВТехПоддержку(ТекстСообщения, ТекстОшибки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ПакетнаяОбработка

// Процедура в которой можно сформировать текстовое содержание слип-чека
//
// Параметры:
//   Тип - Строка - Тип слип-чека: 
//         "Обычный"     - обычный слип-чек, печатаемый в теле фискального чека;
//         "Электронный" - слип-чек, печатаемый в случае электронного фискального чека;
//         "Отказ"       - слип-чек, печатаемый в случае отказа выполнения эквайринговой операции,
//                         или же выполнения аварийной отмены эквайринговой операции.
//   ДанныеДляШаблона - Структура - данные для формирования слип-чека:
//     * ПараметрыФискализацииЧека - См. ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыОперацииФискализацииЧека
//     * ПараметрыВыполненияЭквайринговойОперации - См. ОборудованиеПлатежныеСистемыКлиентСервер.ПараметрыВыполненияЭквайринговойОперации
//     * РезультатВыполненияЭквайринговойОперации - См. МенеджерОборудованияКлиентСервер.ПараметрыВыполненияОперацииНаОборудовании
//     * ДополнительныеПараметры - Структура - Дополнительные параметры переданные ранее в процедуру 
//                                 "НачатьФискализациюЧекаСОплатойКартой".
//   Текст - Строка - Текст слип чека который будет выведен в теле фискального чека, может быть переопределен
//   СтандартнаяОбработка - Булево - Если передано Ложь, тогда слип-чек нужно сформировать самостоятельно
//                          заполнив массив "ПараметрыФискализацииЧека.ПозицииЧека".
Процедура СформироватьШаблонСлипЧека(Тип, ДанныеДляШаблона, Текст, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

#КонецОбласти

// Переопределяет формат события от устройств ввода.
// Параметры:
//  НовыйФормат - Булево - Событие от устройств ввода работают в новом формате 
//  СтандартнаяОбработка - Булево - выполнение стандартной обработки
//
Процедура СобытиеУстройствВводаНовыйФормат(НовыйФормат, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Устанавливает режим требуется ли установка расширения 1С для работы в браузере
// 
// Параметры:
//  Режим - Булево - если Истина, тогда будет требуется установка расширения
//
Процедура УстановитьРежимПодключенияРасширенияИнформацииОКомпьютере(Режим) Экспорт
	
КонецПроцедуры

// Выполнить установку расширения 1С для работы в веб-клиенте.
// 
// Параметры:
//  Оповещение - Описание оповещения которое требуется вызвать после установки расширения
//  Текст - Рекомендуемый текст для отображения при запросе установки расширения
//  СтандартнаяОбработка - Булево - если Истина, тогда библиотека сама задаст вопрос 
//                         пользователю и выполнить установку расширения
//
Процедура ВыполнитьУстановкуРасширения(Оповещение, Текст, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Функция ПолучитьНомераЧековСторно(ПараметрыФискализации) Экспорт
	
	СтрокаНомеровЧековСторно = "";
	Если ПараметрыФискализации.Свойство("ЧекиКоррекцииСторно") Тогда 
		
		Для Каждого ЧекКоррекцииСторно Из ПараметрыФискализации.ЧекиКоррекцииСторно Цикл
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(СтрокаНомеровЧековСторно, ЧекКоррекцииСторно.НомерЧекаККТ, "; ");
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтрокаНомеровЧековСторно; 
	
КонецФункции

#Область УстаревшиеПроцедурыИФункции

// Устарела: больше не используется
// Обработчик события получения идентификатора клиента для рабочегоМеста.
//
// Параметры:
//  ИдентификаторКлиента - Строка, Неопределено - Идентификатор клиента
//  СтандартнаяОбработка - Булево
//
Процедура ИдентификаторКлиентаДляРабочегоМеста(ИдентификаторКлиента, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Устарела: для обратной совместимости.
Процедура ОбработатьСобытие() Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

// Начать подключение необходимых типов оборудования при открытии формы.
//
// Параметры:
// Форма - УправляемаяФорма
// ПоддерживаемыеТипыПодключаемогоОборудования - Строка
//  Содержит перечень типов подключаемого оборудования, разделенных запятыми.
//
Процедура НачатьПодключениеОборудованиеПриОткрытииФормы(Форма, ПоддерживаемыеТипыПодключаемогоОборудования) Экспорт
	
	ОповещениеПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", МенеджерОборудованияКлиентПереопределяемый);
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(
		ОповещениеПриПодключении,
		Форма,
		ПоддерживаемыеТипыПодключаемогоОборудования);
	
КонецПроцедуры

Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При подключении оборудования произошла ошибка:""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// Начать отключать оборудование по типу при закрытии формы.
//
Процедура НачатьОтключениеОборудованиеПриЗакрытииФормы(Форма) Экспорт
	
	ОповещениеПриОтключении = Новый ОписаниеОповещения("ОтключитьОборудованиеЗавершение", МенеджерОборудованияКлиентПереопределяемый);
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(ОповещениеПриОтключении, Форма);
	
КонецПроцедуры

Процедура ОтключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если НЕ РезультатВыполнения.Результат Тогда
		ТекстСообщения = НСтр( "ru = 'При отключении оборудования произошла ошибка: ""%ОписаниеОшибки%"".'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%" , РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
