
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Инкассирование)
	ТабДок = Новый ТабличныйДокумент;
	Инкассирование(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура Инкассирование(ТабДок, ПараметрКоманды)
	Документы.РасходныйКассовыйОрдер.Инкассирование(ТабДок, ПараметрКоманды);
КонецПроцедуры
