
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресКартинки = Параметры.СсылкаНаИзображение;
	
КонецПроцедуры

&НаСервере
Функция СформироватьHTMLПоМакету(URLКартинки)
    
    // Получаем сам объект (документ/справочник/обработку), чтобы добраться до его макетов
    // Получаем макет (Укажите здесь точное имя вашего макета!)
    Макет = ПолучитьОбщийМакет("iga_ПросмотрИзображения"); 
    
    // Читаем весь текст из макета
    ТекстМакета = Макет.ПолучитьТекст();
    
    // Подставляем реальную ссылку вместо нашего шаблона
    ГотовыйHTML = СтрЗаменить(ТекстМакета, "[URL_КАРТИНКИ]", URLКартинки);
    
    Возврат ГотовыйHTML;
    
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    ТекстHTML = СформироватьHTMLПоМакету(АдресКартинки);
КонецПроцедуры


