
#Область ПрограммныйИнтерфейс

// Возвращает имя реквизита склада, с которого выбывает товар, по складскому документу.
//
// Параметры:
//  Объект	 - ДокументОбъект, ОбъектМетаданных	 - документ или его метаданные.
// 
// Возвращаемое значение:
//  Строка - имя реквизита склада отправителя, если он есть в объекте, иначе Неопределено.
//
Функция ИмяРеквизитаСкладОтправитель(Объект) Экспорт
	
	Если ТипЗнч(Объект) = Тип("ОбъектМетаданных") Тогда
		МетаданныеОбъекта = Объект;
	Иначе
		МетаданныеОбъекта = Объект.Метаданные();
	КонецЕсли;
	
	Возврат СкладыБИТПовтИсп.ИмяРеквизитаСкладОтправитель(МетаданныеОбъекта.ПолноеИмя());
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
