
&НаКлиенте
Процедура ПодборФилиала(Команда)
	
	ОткрытьФорму("Справочник.Филиалы.ФормаВыбора", 
		Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Ложь), ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если Список.НайтиСтроки(Новый Структура("Измерение", 
		ВыбранноеЗначение)).Количество() > 0 Тогда 
		Возврат;
	КонецЕсли;
	
	СтрокаТаблицы = Список.Добавить();
	
	СтрокаТаблицы.Измерение = ВыбранноеЗначение;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Филиалы") Тогда
		СтрокаТаблицы.Тип = "Филиалы";
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Сотрудники") Тогда
		СтрокаТаблицы.Тип = "Врачи";
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		СтрокаТаблицы.Тип = "Работы";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборВрача(Команда)
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора", 
		Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Ложь), ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборРаботы(Команда)
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", 
		Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Ложь), ЭтаФорма,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
