#Область ПрограммныйИнтерфейс

// Соответствие назначений и параметров приема, отнесённых к ним..
//
// Параметры:
//  ПустойРезультатПриОтсутствииПравДоступа	 - Булево - если у пользователя нет прав, предполагающих ввода медицинских документов, то дать пустой результат.
// 
// Возвращаемое значение:
//  Соответствие - где Ключ - ПланВидовХарактеристикСсылка.ПараметрыHTML, Значение - ПеречислениеСсылка.ВидыКлассификаторовМинЗдрава.
//
Функция ПараметрыШаблоновСвязанныхНазначенийПараметров(ПустойРезультатПриОтсутствииПравДоступа = Ложь) Экспорт
	
	Результат = Новый Соответствие;
	
	// Заполнение, если выполнение без учета прав ввода или требуется полный результат в любом случае.
	Если Не ПустойРезультатПриОтсутствииПравДоступа
		Или ПравоДоступа("Редактирование", Метаданные.Документы.Прием)
	Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПараметрыHTML.Ссылка КАК Параметр,
		|	ПараметрыHTML.Назначение КАК Назначение
		|ИЗ
		|	ПланВидовХарактеристик.ПараметрыHTML КАК ПараметрыHTML
		|ГДЕ
		|	ПараметрыHTML.Назначение <> НЕОПРЕДЕЛЕНО
		|ИТОГИ ПО
		|	Назначение"
		;
		ВыборкаНазначения = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНазначения.Следующий() Цикл
			
			Параметры = Новый Массив; // Массив параметров шаблона по этому назначению.
			Выборка = ВыборкаНазначения.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Параметры.Добавить(Выборка.Параметр);
			КонецЦикла;
			
			Результат.Вставить(ВыборкаНазначения.Назначение, Параметры);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти