
// Возвращает уникальный идентификатор первой актуальной МЧД пользователя
//
// Параметры:
//  ОГРН		 - Число, Строка				 - ОГРН
//  Пользователь - СправочникСсылка.Пользователи - Пользвоатель
// 
// Возвращаемое значение:
//  Строка, Неопределено - строка УИД, если действующая МЧД найдена, иначе Неопределено
//
Функция ПолучитьУИДМЧД(ОГРН, Полномочия = Неопределено, Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МашиночитаемыеДоверенности.УИД КАК УИД
		|ИЗ
		|	Справочник.МашиночитаемыеДоверенности КАК МашиночитаемыеДоверенности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МашиночитаемыеДоверенности.Полномочия КАК ПолномочияМЧД
		|		ПО (ПолномочияМЧД.Ссылка = МашиночитаемыеДоверенности.Ссылка)
		|			И (&Полномочия = НЕОПРЕДЕЛЕНО
		|				ИЛИ ПолномочияМЧД.Полномочие = &Полномочия)
		|			И (НЕ МашиночитаемыеДоверенности.ПометкаУдаления)
		|			И (МашиночитаемыеДоверенности.Пользователь = &Пользователь)
		|			И (&Дата МЕЖДУ МашиночитаемыеДоверенности.ДатаВыдачи И МашиночитаемыеДоверенности.ДатаОкончания)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО (Организации.Ссылка = МашиночитаемыеДоверенности.Организация)
		|			И (Организации.ОГРН = &ОГРН)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организации.ПометкаУдаления,
		|	МашиночитаемыеДоверенности.ДатаВыдачи";
	
	Запрос.УстановитьПараметр("ОГРН",			Формат(ОГРН,"ЧГ=0"));
	Запрос.УстановитьПараметр("Пользователь",	Пользователь);
	Запрос.УстановитьПараметр("Дата",			ТекущаяДата());
	Запрос.УстановитьПараметр("Полномочия",		Полномочия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.УИД;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции