Функция СформироватьСтроковоеПредставлениеСостояния()
	
	Возврат "+" + Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор()) + ":" + ЭтотОбъект.Наименование + ":" + ЭтотОбъект.ЦветHex + ";";	
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	Если ЭтотОбъект.Ссылка.Пустая() Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ПерваяЗапись", Истина);
	Иначе
		ЭтотОбъект.СтроковоеПредставление = СформироватьСтроковоеПредставлениеСостояния();	
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ПерваяЗапись") Тогда
		ДополнительныеСвойства.Удалить("ПерваяЗапись");
		ЭтотОбъект.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЭтотОбъект.ЦветHex = "#FFFFFFFF";
	
КонецПроцедуры
