#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	///////////////////////////
	// омг
		
	Если ЗначениеЗаполнено(Параметры.Заявка) Тогда
		
		Заявка = Параметры.Заявка;
		
		Если ТипЗнч(Параметры.ПриемыЗаявки) = Тип("Массив")	Тогда
			ЗначениеОтбора = Новый СписокЗначений;
			ЗначениеОтбора.ЗагрузитьЗначения(Параметры.ПриемыЗаявки);
			
			РаботаСФормамиКлиент.УстановитьОтборСписка("Ссылка", ЗначениеОтбора, Список);
			
		ИначеЕсли Параметры.Свойство("ОказанияЗаявки") Тогда
			Элементы.СписокОказания.Видимость = Истина;
			Элементы.Список.Видимость = Ложь;
			ЗначениеОтбора = Новый СписокЗначений;
			ЗначениеОтбора.ЗагрузитьЗначения(Параметры.ОказанияЗаявки);
			
			РаботаСФормамиКлиент.УстановитьОтборСписка("Ссылка", ЗначениеОтбора, СписокОказания);
			
			// омг  
			///////////////////////////
		Иначе		
			РаботаСФормамиКлиент.УстановитьОтборСписка("ДокументОснование", Заявка, Список);
		КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьПрием(Команда)
	
	///////////////////////////
	// омг
	Если Элементы.СписокОказания.Видимость Тогда
		ЗначенияЗаполнения = Новый Структура("ДокументОснование", Заявка);
		ОткрытьФорму("Документ.ОказаниеУслуг.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения),,Заявка);
		
		Закрыть();
		
	иначе
		ЗначенияЗаполнения = Новый Структура("ДокументОснование, Врач", Заявка, Параметры.Сотрудник);
		ОткрытьФорму("Документ.Прием.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения),,Заявка);
		
		Закрыть();
	КонецЕсли;
	// омг  
	///////////////////////////

КонецПроцедуры

#КонецОбласти