
&НаКлиенте
Процедура ВидРасчетаПриИзменении(Элемент)
	НастроитьСпискиВыбораНаСервере();
КонецПроцедуры

&НаСервере
Процедура НастроитьСпискиВыбораНаСервере()
	
	мсСписокВидовРасчета = Новый Массив;
	Если ЗначениеЗаполнено(Запись.ПоказательЗУП) Тогда
		Если Запись.ПоказательЗУП.ЭтоВидВремени Тогда 
			мсСписокВидовРасчета.Добавить(Перечисления.ВидыПараметровРасчетаНачислений.ДанныеТабеля);	
		Иначе
			мсСписокВидовРасчета.Добавить(Перечисления.ВидыПараметровРасчетаНачислений.КатегорияВыработки);
			мсСписокВидовРасчета.Добавить(Перечисления.ВидыПараметровРасчетаНачислений.ВсеТовары);
			мсСписокВидовРасчета.Добавить(Перечисления.ВидыПараметровРасчетаНачислений.ВсеУслуги);
		КонецЕсли;
	КонецЕсли;
	Элементы.ВидРасчета.СписокВыбора.ЗагрузитьЗначения(мсСписокВидовРасчета);
	
	Масс = Новый Массив;
	Если Запись.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ДанныеТабеля Тогда
		
		Масс.Добавить(Перечисления.ПоказателиРасчетаНачислений.КоличествоДнейПоТабелю);
		Масс.Добавить(Перечисления.ПоказателиРасчетаНачислений.КоличествоЧасовПоТабелю);
		
	ИначеЕсли Запись.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.КатегорияВыработки Или
		Запись.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ВсеТовары Или 
		Запись.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ВсеУслуги Тогда
		
		Масс.Добавить(Перечисления.ПоказателиРасчетаНачислений.Количество);
		Масс.Добавить(Перечисления.ПоказателиРасчетаНачислений.СуммаБезСкидок);
		Масс.Добавить(Перечисления.ПоказателиРасчетаНачислений.Себестоимость);
		Масс.Добавить(Перечисления.ПоказателиРасчетаНачислений.Сумма);
		Масс.Добавить(Перечисления.ПоказателиРасчетаНачислений.СтоимостьПоПрайсу);
		
	КонецЕсли;
	Элементы.ПоказательРасчета.СписокВыбора.ЗагрузитьЗначения(Масс);
	
	Если Запись.ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.КатегорияВыработки Тогда
		
		Элементы.ЗначениеПараметра.Доступность = Истина;
		
	Иначе
		
		Элементы.ЗначениеПараметра.Доступность = Ложь;
		Запись.ЗначениеПараметра = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	НастроитьСпискиВыбораНаСервере();
 
КонецПроцедуры

&НаКлиенте
Процедура ПоказательЗУППриИзменении(Элемент)
	НастроитьСпискиВыбораНаСервере();
КонецПроцедуры
