#Область ПрограммныйИнтерфейс

// Возвращает данные для выбора услуг продажи по выполненным за день вакцинациям в виде таблицы значений с колонками "Клиент", "Номенклатура", "Количество".
//
// Параметры:
//  ПараметрыВыбора	 - Структура - Структура с ключом "Дата" и необязательным ключом "Клиент".
// 
// Возвращаемое значение:
//   - ТаблизаЗначений.
//
Функция ПолучитьДанныеДляПродажиПоВакцинациям(ПараметрыВыбора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата",	 НачалоДня(ПараметрыВыбора.Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(ПараметрыВыбора.Дата));
	Если ПараметрыВыбора.Свойство("Клиент") И ЗначениеЗаполнено(ПараметрыВыбора.Клиент) Тогда
		Запрос.УстановитьПараметр("Клиент", ПараметрыВыбора.Клиент);
	Иначе
		Запрос.УстановитьПараметр("Клиент", Неопределено);
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Вакцинации.Номенклатура КАК Номенклатура,
	               |	Вакцинации.Клиент КАК Клиент,
	               |	Вакцинации.Вакцинация КАК Вакцинация,
	               |	1 КАК Количество,
	               |	Вакцинации.ПодтвердившийПользователь.Сотрудник КАК Сотрудник,
	               |	Вакцинации.Вакцинация.Представление КАК Комментарий
	               |ИЗ
	               |	РегистрСведений.ВакцинацияПациентов КАК Вакцинации
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(Вакцинации.ФактическаяДата, ДЕНЬ) = НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	               |	И НЕ Вакцинации.ВыполненаВСтороннейОрганизации
	               |	И Вакцинации.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |	И (Вакцинации.Клиент = &Клиент
	               |			ИЛИ &Клиент = НЕОПРЕДЕЛЕНО)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
