
Функция ПолучениеРасписанияПолучитьДанные(Запрос)
	
	Сообщение = Запрос.ПолучитьТелоКакСтроку("UTF-8");
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Сообщение);
	ДанныеЗаписи = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Метод = Запрос.Параметрыurl.Получить("metod"); 
	Метод = ВРег(Метод);
	Если Метод = "POST" Тогда
		
		Если не ДанныеЗаписи.Свойство("doctor") или 
			не ДанныеЗаписи.Свойство("appointment") или
			не ДанныеЗаписи.Свойство("medcenter") или
			не ДанныеЗаписи.Свойство("patient")    или
			не ДанныеЗаписи.Свойство("event") 
			Тогда
			Ответ = Новый HTTPСервисОтвет(400); 
		иначе
			
			ЧасНачало = Сред(ДанныеЗаписи.appointment.startAt,12,2);
			МинутаНачало = Сред(ДанныеЗаписи.appointment.startAt,15,2); 
			
			ЧасКонец = Сред(ДанныеЗаписи.appointment.endAt,12,2);
			МинутаКонец = Сред(ДанныеЗаписи.appointment.endAt,15,2);
			
			НаДату =  Дата(Лев(СтрЗаменить(ДанныеЗаписи.appointment.startAt,"-",""),8));
			
			ВремяНачала = Дата(1,1,1,ЧасНачало,МинутаНачало,0);
			ВремяОкончания = Дата(1,1,1,ЧасКонец,МинутаКонец,0);
			Если ДанныеЗаписи.event = "booking.created" или ДанныеЗаписи.event = "booking.rebooked" Тогда
				 РазрешитьСоздание = омг_idoctor.ПроверитьРасписаниеНаСервере(ДанныеЗаписи.doctor.id,ДанныеЗаписи.medcenter.id,ВремяНачала,ВремяОкончания,НаДату)
			КонецЕсли;	
				
			Если  ДанныеЗаписи.event = "booking.created" и РазрешитьСоздание или ДанныеЗаписи.event = "booking.cancelled" или ДанныеЗаписи.event = "booking.rebooked" Тогда
				омг_idoctor.СоздатьЗаявкуНаСервере(ДанныеЗаписи.doctor.id,ДанныеЗаписи.medcenter.id,ДанныеЗаписи.patient.iin,ДанныеЗаписи.patient.phone,ДанныеЗаписи.patient.fullName,ВремяНачала,ВремяОкончания,НаДату,ДанныеЗаписи.event,ДанныеЗаписи.bookingCode,ДанныеЗаписи.bookingId,ДанныеЗаписи.comment +Символы.ПС+ ДанныеЗаписи.source+Символы.ПС+ДанныеЗаписи.createdAt ); 
				Ответ = Новый HTTPСервисОтвет(200)
				
			иначе  
				
				Ответ = Новый HTTPСервисОтвет(409)
				
			КонецЕсли;
			
		КонецЕсли;
		
	иначе 
		
		Ответ = Новый HTTPСервисОтвет(400)
		
	КонецЕсли;  
	
	Возврат Ответ;
	
КонецФункции
