#Область ПрограммныйИнтерфейс

Функция ЗапуститьОбработкуОбновления() Экспорт
	
	Результат = доп_ОбновлениеИнформационнойБазы.ВыполнитьОбновление();
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда // Обновление было.
		
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ЗавершитьРаботуСистемы(Ложь);
		КонецЕсли;
		
		// Открытие формы описания обновлений.
		Если  Результат.ДокументОписаниеОбновленийВысотаТаблицы > 0 Тогда
			ФормаОписаниеОбновлений = ОткрытьФорму("Обработка.ОбновлениеИнформационнойБазы.Форма.ОписаниеОбновленийУпр");
			ФормаОписаниеОбновлений.ДокументОписаниеОбновлений = Результат.ДокументОписаниеОбновлений;
		КонецЕсли;
		
		ВыполнитьДействияОбновления(Результат.ТекущаяВерсияИБ, Результат.НоваяВерсияИБ);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьДействияОбновления(ТекущаяВерсияИБ, НоваяВерсияИБ)
	
	Если РелизБолееРанний(ТекущаяВерсияИБ, "2.1.25.32") Тогда
		ОткрытьФорму("РегистрСведений.АдресныеОбъекты.Форма.ФормаНеобходимостиОбновленияКлассификатора");
	КонецЕсли;
	
КонецФункции

// Локальная функция, краткая в написании
Функция РелизБолееРанний(РелизПроверяемый,РелизПроверяющий)
	Возврат ОбщегоНазначенияБИТКлиентСервер.РелизБолееРанний(РелизПроверяемый,РелизПроверяющий);
КонецФункции

#КонецОбласти