&НаКлиенте
Перем Филиал;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Филиал = УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя();
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	НастроитьРеквизитыТабличныхЧастей();	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект, Ложь, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	НастроитьРеквизитыТабличныхЧастей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланированиеПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Не Копирование Тогда	
		Элемент.ТекущиеДанные.ЦФО = Филиал;	
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_ВывестиДвиженияДокумента(Команда)
	
	РаботаСДиалогамиКлиент.ВывестиДвиженияДокумента(Объект.Ссылка, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.Период = НачалоМесяца(Объект.Период);

КонецПроцедуры

&НаКлиенте
Процедура ПериодРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Попытка
		Объект.Период = НачалоМесяца(ДобавитьМесяц(Объект.Период, Направление));
	Исключение 
	КонецПопытки;
	
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ПланированиеПоказательПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Планирование.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда  
		ДанныеПоказателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущиеДанные.Показатель, 
			"Учет_Специализация, Учет_Сотрудник, Учет_Номенклатура");
		СтрокаПланирование = Объект.Планирование[ТекущиеДанные.НомерСтроки-1];
		ЗаполнитьЗначенияСвойств(СтрокаПланирование, ДанныеПоказателя); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьРеквизитыТабличныхЧастей()

	Для Каждого СтрокаПланирование Из Объект.Планирование Цикл   
		ДанныеПоказателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаПланирование.Показатель, 
			"Учет_Специализация, Учет_Сотрудник, Учет_Номенклатура");
		ЗаполнитьЗначенияСвойств(СтрокаПланирование, ДанныеПоказателя);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры

#КонецОбласти