
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();

	СтруктураПараметров = РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);
	
	Подбор.Параметры.УстановитьЗначениеПараметра("Филиал", Объект.Филиал);
	ОсновнойПрейскурант = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойПрейскурант");
	Подбор.Параметры.УстановитьЗначениеПараметра("ОсновнойПрейскурант", ОсновнойПрейскурант);

	Если Параметры.Ключ.Пустая() Тогда 
		
		Объект.ЭквайринговыйТерминал = РаботаСТорговымОборудованием.ПолучитьЭквайринговыйТерминал(, Объект.Филиал, Объект.Касса);
	КонецЕсли;
	
	Элементы.Врач.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	Элементы.Врач.ДоступныеТипы = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	Элементы.Статус.ТолькоПросмотр = Не РольДоступна("ПолныеПрава") И Не РольДоступна("омг_ПравоРедактированияСтатусаЗаявкиВЛИС");
	Элементы.ИдентификаторЛИС.ТолькоПросмотр = Не РольДоступна("ПолныеПрава") И Не РольДоступна("омг_ПравоРедактированияСтатусаЗаявкиВЛИС");
	
	УстановитьДоступность(ЭтаФорма);   
	УстановитьПараметрыСписков();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСписков()
	
	БланкиРезультатовИсследования.Параметры.УстановитьЗначениеПараметра("Заявка", Параметры.Ключ);
	Ошибки.Параметры.УстановитьЗначениеПараметра("Заявка", Параметры.Ключ);
	ОшибкиОбновленияСтатуса.Параметры.УстановитьЗначениеПараметра("Документ", Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоЗаписейТаблиц(Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ омг_БланкиРезультатовИсследованийЛИС.ИдентификаторБланка) КАК КоличествоБланки,
	               |	омг_БланкиРезультатовИсследованийЛИС.Заявка КАК Заявка
	               |ИЗ
	               |	РегистрСведений.омг_БланкиРезультатовИсследованийЛИС КАК омг_БланкиРезультатовИсследованийЛИС
	               |ГДЕ
	               |	омг_БланкиРезультатовИсследованийЛИС.Заявка = &Заявка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	омг_БланкиРезультатовИсследованийЛИС.Заявка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ омг_ОшибкиОтправкиЗаявокЛИС.Период) КАК КоличествоОшибки,
	               |	омг_ОшибкиОтправкиЗаявокЛИС.Заявка КАК Заявка
	               |ИЗ
	               |	РегистрСведений.омг_ОшибкиОтправкиЗаявокЛИС КАК омг_ОшибкиОтправкиЗаявокЛИС
	               |ГДЕ
	               |	омг_ОшибкиОтправкиЗаявокЛИС.Заявка = &Заявка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	омг_ОшибкиОтправкиЗаявокЛИС.Заявка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ омг_ЖурналЗапросовПоЗаявкамЛИС.Период) КАК КоличествоЖурнал,
	               |	омг_ЖурналЗапросовПоЗаявкамЛИС.Заявка КАК Заявка
	               |ИЗ
	               |	РегистрСведений.омг_ЖурналЗапросовПоЗаявкамЛИС КАК омг_ЖурналЗапросовПоЗаявкамЛИС
	               |ГДЕ
	               |	омг_ЖурналЗапросовПоЗаявкамЛИС.Заявка = &Заявка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	омг_ЖурналЗапросовПоЗаявкамЛИС.Заявка";
	Запрос.УстановитьПараметр("Заявка", Заявка);
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураКоличества = Новый Структура("КоличествоБланки, КоличествоОшибки, КоличествоЖурнал", 0, 0, 0);
	
	Для Каждого РезультатЗапроса Из ПакетРезультатов Цикл
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураКоличества, Выборка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураКоличества;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьКоличествоДляЗаголовковСтраниц(ЭтаФорма)
	
	СтруктураКоличества = ПолучитьКоличествоЗаписейТаблиц(ЭтаФорма.Объект.Ссылка);
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураКоличества);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЖурналЗапросов(Заявка)
	
	МассивЗаписей = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_ЖурналЗапросовПоЗаявкамЛИС.Период КАК Дата,
	               |	омг_ЖурналЗапросовПоЗаявкамЛИС.Детали КАК Детали
	               |ИЗ
	               |	РегистрСведений.омг_ЖурналЗапросовПоЗаявкамЛИС КАК омг_ЖурналЗапросовПоЗаявкамЛИС
	               |ГДЕ
	               |	омг_ЖурналЗапросовПоЗаявкамЛИС.Заявка = &Заявка";
	Запрос.УстановитьПараметр("Заявка", Заявка);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеЗаписи = Выборка.Детали.Получить();
			Если ДанныеЗаписи = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			СтруктураЗаписи = Новый Структура("Дата, ТекстЗапроса, ТекстОтвета", Выборка.Дата);
			
			ЗаполнитьЗначенияСвойств(СтруктураЗаписи, ДанныеЗаписи);
			МассивЗаписей.Добавить(СтруктураЗаписи);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивЗаписей;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступность(ЭтаФорма)
	
	ЗаявкаЗакрыта = ЭтаФорма.Объект.Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Закрыта")
		Или ЭтаФорма.Объект.Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Отменена");
		
	ОбъектЗаписан = Не ЭтаФорма.Параметры.Ключ.Пустая();
		
	ЭтаФорма.Элементы.ОтменитьЗаявку.Доступность = Не ЗаявкаЗакрыта И ЭтаФорма.Элементы.ФормаПроизвестиЗаборМатериалов.Доступность;
	ЭтаФорма.Элементы.ЗакрытьЗаявку.Доступность = Не ЗаявкаЗакрыта И ЭтаФорма.Элементы.ФормаПроизвестиЗаборМатериалов.Доступность;
	ЭтаФорма.Элементы.ГруппаРезультатыЛИС.Доступность = ОбъектЗаписан;
	ЭтаФорма.Элементы.ГруппаЖурнал.Доступность = ОбъектЗаписан;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтоги()
	
	Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ПересчитатьИтоги(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АнализыПриИзменении(Элемент)
	
	ПересчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура СкидкаПриИзменении(Элемент)
	ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ДопСкидка1ПриИзменении(Элемент)
	ПересчитатьИтоги();;
КонецПроцедуры

&НаКлиенте
Процедура ДопСкидка2ПриИзменении(Элемент)
	ПересчитатьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ПодборВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Подбор.ТекущиеДанные;
	
	Если Объект.Анализы.НайтиСтроки(Новый Структура("Номенклатура", ТекущиеДанные.Номенклатура)).Количество() = 0 Тогда
		СтрокаАнализов = Объект.Анализы.Добавить();
		СтрокаАнализов.Номенклатура = ТекущиеДанные.Номенклатура;
		СтрокаАнализов.Цена = ТекущиеДанные.Цена;
		
		ПересчитатьИтоги();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПациентПриИзменении(Элемент)
	
	ДанныеПациента = ПолучитьДанныеПациента(Объект.Пациент);

	ЗаполнитьЗначенияСвойств(Объект, ДанныеПациента);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСкидкуПоНомеру()
	
	Объект.Скидка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.НомерКарты, "ВидКарты");
	
КонецПроцедуры

&НаКлиенте
Процедура НомерКартыПриИзменении(Элемент)
	
	ЗаполнитьСкидкуПоНомеру();
	ПересчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоИИН(Команда)

	ОткрытьФорму("ОбщаяФорма.ФормаПоискаКлиентаУпр",,ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	Подбор.Параметры.УстановитьЗначениеПараметра("Филиал", Объект.Филиал);
КонецПроцедуры

&НаКлиенте
Процедура ПодборИерархияПриАктивизацииСтроки(Элемент)
	
	ЭлементОтбора = Неопределено;
	Если Элементы.ПодборИерархия.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементОтбора Из Подбор.Отбор.Элементы Цикл
		Если ЭлементОтбора.Представление = "#ОтборПоГруппе" Тогда 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭлементОтбора = Неопределено Или Не ЭлементОтбора.Представление = "#ОтборПоГруппе" Тогда 
		ЭлементОтбора = Подбор.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ПравоеЗначение = Элементы.ПодборИерархия.ТекущиеДанные.Ссылка;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
		ЭлементОтбора.Представление = "#ОтборПоГруппе";
	Иначе
		ЭлементОтбора.ПравоеЗначение = Элементы.ПодборИерархия.ТекущиеДанные.Ссылка;
		ЭлементОтбора.Представление = "#ОтборПоГруппе";
	КонецЕсли;
	
КонецПроцедуры

#Область ОплатаПоДокументу

&НаКлиенте
Асинх Процедура Чек(Команда, ПроверятьНСПК = Истина)

	//Если Омг_ПроверкаСмешаннойОплаты() Тогда
	//	ПоказатьПредупреждение(,НСтр("ru='Смешанная оплата запрещена!'"));
	//	Возврат;	
	//КонецЕсли;	

	Если не Объект.Проведен Тогда
		Попытка 
			ЭтотОбъект.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение))
		Исключение
			Сообщить("Перед печатью чека необходимо провести документ!",СтатусСообщения.Важное);
			Возврат;
		КонецПопытки;	
	КонецЕсли;
	
	СуммаОперации	= 0;
	НомерЧекаЭТ		= "";

	ОсуществленАсинхронныйВызовОплатыНАЭТ = Ложь;

	ОписаниеОшибки = "";
	Если Объект.НомерЧекаККМ <> 0 Тогда
		//ТекстСообщения = НСтр("ru = 'Чек уже пробит на фискальном регистраторе!'");
		ТекстСообщения = "";
		РаботаСДокументамиКлиент.ПредложитьПечатьКопииЧекаПоДокументу(Объект.Ссылка, УникальныйИдентификатор, ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	//Если Не Объект.Проведен Тогда
	//	ПоказатьПредупреждение(,НСтр("ru = 'Перед пробитием чека на фискальном регистраторе документ необходимо провести!'"));
	//	Возврат;
	//КонецЕсли;
	
	//Если Не РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтаФорма, Истина) Тогда
	//	ПоказатьПредупреждение(,НСтр("ru = 'Перед пробитием чека на фискальном регистраторе документ необходимо провести!'"));
	//	Возврат;	
	//КонецЕсли;
	
	// Проверки при совместной работе нескольких пользователей над документом
	Если Не РаботаСДокументамиКлиент.КонтрольИзмененийДанныхВДругихСеансахКлиент(ЭтаФорма)Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим-перезаполним табличную часть чеков 
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Изменено ЛИ 
	//ОбновитьЧеки(); 
	// Изменено ЛИ
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//СохранитьИзмененияОбъектаФормы();
	//ОбновитьВидимостьЧеков();
	//
	//Если Объект.Чеки.Количество() > 1 
	//	И ЗначениеЗаполнено(Объект.ИдентификаторКорзиныНСПК) 
	//Тогда
	//	ПоказатьПредупреждение(,"В документе с электронными сертификатами НСПК может быьт не более одного чека (позиции только по одной системе налогообложения)!");
	//	Возврат;		
	//КонецЕсли;  

	Омг_Подтверждение();
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// Изменено ЛИ
	// Если табличная часть чеков не пуста, проверяем, есть ли в ней непробитые чеки.	
	//Если Объект.Чеки.Количество() > 0 Тогда
	//	ВсеЧекиПробиты = Истина;
	//	Для Каждого СтрокаЧек Из Объект.Чеки Цикл
	//		Если СтрокаЧек.НомерЧека = 0 Тогда
	//			ВсеЧекиПробиты = Ложь;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	Если ВсеЧекиПробиты Тогда
	//		ТекстСообщения = НСтр("ru = 'Чек уже пробит на фискальном регистраторе!'");
	//		РаботаСДокументамиКлиент.ПредложитьПечатьКопииЧекаПоДокументу(Объект.Ссылка, УникальныйИдентификатор, ТекстСообщения);
	//		Возврат;	
	//	КонецЕсли;     		
	//	РаботаСДокументамиКлиент.ВыполнитьОперациюОПКВПК(ЭтаФорма); // Печать чеков.
	//КонецЕсли;
	// Изменено ЛИ
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
КонецПроцедуры 

&НаСервере	
Функция омг_ПолучитьIPАдресТерминала(ЭТ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭквайринговыеТерминалы.омг_АдресТерминала КАК АдресТерминала,
	               |	ЭквайринговыеТерминалы.омг_ПортТерминала КАК ПортТерминала,
	               |	ЭквайринговыеТерминалы.омг_ИспользуемыйТерминал КАК ИспользуемыйТерминал,
	               |	ЭквайринговыеТерминалы.омг_ИнтеграцияОплатаНаТерминал КАК ИнтеграцияОплатаНаТерминал,
	               |	ЭквайринговыеТерминалыОборудование.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	               |ИЗ
	               |	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭквайринговыеТерминалы.Оборудование КАК ЭквайринговыеТерминалыОборудование
	               |		ПО (ЭквайринговыеТерминалыОборудование.Ссылка = ЭквайринговыеТерминалы.Ссылка)
	               |			И (ЭквайринговыеТерминалыОборудование.ПодключаемоеОборудование.ТипОборудования = &ТипОборудования
	               |				И ЭквайринговыеТерминалыОборудование.ПодключаемоеОборудование.УстройствоИспользуется)
	               |ГДЕ
	               |	ЭквайринговыеТерминалы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ЭТ);
	Запрос.УстановитьПараметр("ТипОборудования", Перечисления.ТипыПодключаемогоОборудования.ЭквайринговыйТерминал);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	СтруктураТерминала = Новый Структура("АдресТерминала, ПортТерминала, 
							|ИспользуемыйТерминал, ИнтеграцияОплатаНаТерминал, ПодключаемоеОборудование");
	ЗаполнитьЗначенияСвойств(СтруктураТерминала, Выборка);
	
	Возврат СтруктураТерминала;
	
КонецФункции 

&НаКлиенте
Процедура омг_ВыполнитьИзменениеСостоянияПослеОплаты(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено 
		И Не ВРЕГ(Результат) = "НЕТ" Тогда
		
		Если Не ВРЕГ(Результат) = "ДА" Тогда
			Объект.НомерЧекаЭТ         					= Результат;
			Объект.омг_НомерТранзакцииТерминала         = Результат;
		КонецЕсли;
		Объект.СостояниеЧековККМ = ПредопределенноеЗначение("Перечисление.СостоянияЧековККМ.ЧекиПробиты");
		Объект.Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Оплачена");
		Для Каждого СтрокаЧека Из Объект.Чеки Цикл
			СтрокаЧека.НомерЧека = 1;
			СтрокаЧека.ФискальноеУстройство = ДополнительныеПараметры.ПодключаемоеОборудование;
		КонецЦикла;
		
		Записать(); 
		
		Если  Не ВРЕГ(Результат) = "НЕТ" или Объект.НомерЧекаККМ = 0 Тогда
			НапечататьЧек(Истина); 
		КонецЕсли;  
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Омг_Подтверждение()
	Нал = Ложь;	
	ЭтоПродажа = Истина; 
	ВидОплаты = "";
	Если  Объект.СуммаДокумента - Объект.ПолученоНаличными > 0 и Объект.ПолученоНаличными  > 0 Тогда
		ВидОплаты = "Смешанный";		
	иначеЕсли  Объект.ПолученоНаличными > 0 Тогда
		ВидОплаты = "Наличными" 
	иначе
		ВидОплаты = "Безналичными";	
	КонецЕсли;
	
	//ЭтоПродажа = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОказанияУслуг.ПродажаКлиенту");
	
	Оповещение = Новый ОписаниеОповещения("Омг_ПослеЗакрытияВопроса",
	ЭтотОбъект,ВидОплаты);	
	Если ЭтоПродажа Тогда
		ПоказатьВопрос(Оповещение,
			"ПРИНЯТЬ ОПЛАТУ?",
			РежимДиалогаВопрос.ДаНетОтмена,
			0, // таймаут в секундах
			КодВозвратаДиалога.Да, 
			"К оплате " + Объект.СуммаДокумента + " тг."+ Символы.ПС+
			//"ОПЛАЧЕНО: "+ Объект.СуммаДокумента +" тг."+Символы.ПС+
			ВидОплаты +" " + Объект.СуммаДокумента +" тг."+ Символы.ПС+
			"ИТОГО "+ Объект.СуммаДокумента+" тг." 
			);     
	иначе
		ПоказатьВопрос(Оповещение,
			"Сделать возврат?",
			РежимДиалогаВопрос.ДаНетОтмена,
			0, // таймаут в секундах
			КодВозвратаДиалога.Да, 
			"К возврату " + Объект.СуммаДокумента + " тг."+ Символы.ПС+
			//"ВЕРНЕТСЯ: "+ Объект.СуммаДокумента +" тг."+Символы.ПС+
			ВидОплаты +" " + Объект.СуммаДокумента +" тг."+ Символы.ПС+
			"ИТОГО "+ Объект.СуммаДокумента+" тг." 
			);  
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура Омг_ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если Параметры = "Смешанный" или Параметры = "Безналичными" Тогда	
			// Добавлено Макеев 			
			ДанныеТерминалаИнтеграция = омг_ПолучитьIPАдресТерминала(Объект.ЭквайринговыйТерминал);
			
			Если Объект.ОплаченоБезналичным > 0 И Не ДанныеТерминалаИнтеграция.АдресТерминала = "" 
				И ДанныеТерминалаИнтеграция.ИнтеграцияОплатаНаТерминал Тогда
				ПараметрыФормы = Новый Структура;
				ПараметрыФормы.Вставить("ДанныеТерминалаИнтеграция", ДанныеТерминалаИнтеграция); 
				ПараметрыФормы.Вставить("Сумма",               Объект.ОплаченоБезналичным);
				ПараметрыФормы.Вставить("ВидОперации", "Продажа");
				ПараметрыФормы.Вставить("НомерТранзакцииТерминала",      Объект.омг_НомерТранзакцииТерминала);
				
				Объект.омг_ИспользуемыйТерминал = ДанныеТерминалаИнтеграция.ИспользуемыйТерминал;
				Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("Документ", ЭтаФорма);
				ДополнительныеПараметры.Вставить("ПодключаемоеОборудование", ДанныеТерминалаИнтеграция.ПодключаемоеОборудование);
				ДополнительныеПараметры.Вставить("ВидОплаты", Параметры);
				
				ОбработчикОповещения = Новый ОписаниеОповещения("омг_ВыполнитьИзменениеСостоянияПослеОплаты", ЭтотОбъект, ДополнительныеПараметры);
				
				ОткрытьФорму("ОбщаяФорма.омг_ОжиданиеОтветаТерминала", ПараметрыФормы,,,,, ОбработчикОповещения, Режим);
				Возврат;
			КонецЕсли;

			// )
		иначе	
			НапечататьЧек();	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры   

&НаКлиенте
Функция Омг_ПроверкаСмешаннойОплаты() 
	
	Возврат	?(Объект.ОплаченоБезналичным > 0 и Объект.ПолученоНаличными > 0,Истина,Ложь);
	
КонецФункции  

&НаКлиенте
Процедура НапечататьЧек(Пробить=Ложь)
	
	ОчиститьСообщения();
	
	ОписаниеОшибки = "";
	
	Если Объект.НомерЧекаККМ <> 0 Тогда
		ТекстСообщения = НСтр("ru = 'Чек уже пробит на фискальном регистраторе!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);		
		Возврат;
	КонецЕсли;
			
	Если МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда 
			Контекст = Новый Структура(); 			
			ОписаниеОповещения   = Новый ОписаниеОповещения("ВыборФискальногоУстройстваЗавершение",ЭтотОбъект,Контекст);
			ПоддерживаемыеТипыВО = Новый Массив();
			ПоддерживаемыеТипыВО.Добавить("ФискальныйРегистратор");
			ПоддерживаемыеТипыВО.Добавить("ПринтерЧеков");			
			МенеджерОборудованияКлиент.ПредложитьВыбратьУстройство(ОписаниеОповещения, ПоддерживаемыеТипыВО,
			НСтр("ru = 'Выберите фискальное устройство'"), НСтр("ru = 'Фискальное устройство не подключено.'"),Пробить);
		Иначе
			ТекстСообщения = НСтр("ru = 'Предварительно необходимо выбрать рабочее место внешнего оборудования текущего сеанса.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФискальногоУстройстваЗавершение(ИдентификаторУстройства, Параметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторУстройства) Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Вставить("ИдентификаторУстройства", ИдентификаторУстройства);
	
	ДанныеУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьДанныеУстройства(ИдентификаторУстройства);
	ТипУстройства = ?(ДанныеУстройства.Свойство("ТипОборудованияИмя"), ДанныеУстройства.ТипОборудованияИмя, "ККТ");
	
	Если ТипУстройства = "ККТ" Тогда
		ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПолучитьПараметрыЗавершение", ЭтотОбъект, Параметры);
		МенеджерОборудованияКлиент.НачатьПолучениеПараметровФискальногоУстройства(ОповещениеПриЗавершении, УникальныйИдентификатор , ИдентификаторУстройства, Ложь);
	Иначе
		ПолучитьПараметрыЗавершение(Неопределено, Параметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПараметрыЗавершение(ПараметрыФискальногоУстройства, Параметры,Пробить=Ложь) Экспорт
	
	ОписаниеОшибки = "";
	Если ПараметрыФискальногоУстройства =  Неопределено Тогда
		ВерсияФормата = "1.1.0.0";
	ИначеЕсли НЕ ПараметрыФискальногоУстройства.Результат Тогда 
		ОписаниеОшибки = ПараметрыФискальногоУстройства.ОписаниеОшибки;
	Иначе
		ВерсияФормата = омг_WebKassa.ПолучитьВерсиюФФД(ПараметрыФискальногоУстройства.ВыходныеПараметры.ВерсияФФДФН, ПараметрыФискальногоУстройства.ВыходныеПараметры.ВерсияФФДККТ);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ПараметрыУстройства = МенеджерОборудованияКлиентПовтИсп.ПолучитьПараметрыУстройства(Параметры.ИдентификаторУстройства);
		НомерСекции         = ?(ПараметрыУстройства.Свойство("НомерСекции"), ПараметрыУстройства.НомерСекции, 0);
		
		МассивЧеков = ПодготовитьДанныеДляПробитияЧека(НомерСекции, ВерсияФормата, ОписаниеОшибки);
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		ТекстСообщения = НСтр("ru = 'При подключении устройства произошла ошибка.
		|Чек не напечатан на фискальном устройстве.
		|Дополнительное описание:
		|%ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", ОписаниеОшибки);		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	ИначеЕсли МассивЧеков.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(Объект.НомерЧекаЭТ) и ЗначениеЗаполнено(Объект.омг_НомерТранзакцииТерминала) Тогда
		Пробить = Истина;	
		КонецЕсли; 	
			НапечататьЧекКлиент(МассивЧеков, Параметры.ИдентификаторУстройства, ВерсияФормата, Пробить);
	КонецЕсли;   
	
КонецПроцедуры 

&НаКлиенте
Процедура НапечататьЧекКлиент(МассивЧеков, ИдентификаторУстройства, ВерсияФормата,Пробить=Ложь)
	
	НомерСекции = 0;
	
	ЭтаФорма.Доступность = Ложь;
	Контекст = Новый Структура("ИдентификаторУстройства", ИдентификаторУстройства);
	Оповещение = Новый ОписаниеОповещения("НапечататьЧекКлиентЗавершение", ЭтотОбъект, Контекст);
	
	ПодключенноеОборудование = Новый Структура("Терминал, ФискальныеУстройства");
	ПодключенноеОборудование.ФискальныеУстройства = Новый Массив; 
	ПодключенноеОборудование.ФискальныеУстройства.Добавить(ИдентификаторУстройства);
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("ДокументСсылка", Объект.Ссылка);
	ПараметрыОперации.Вставить("Организация", омг_WebKassa.ПолучитьОрганизацию(Объект.Филиал));
	ПараметрыОперации.Вставить("Партнер", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
	ПараметрыОперации.Вставить("ПодключенноеОборудование", ПодключенноеОборудование);
	ПараметрыОперации.Вставить("ТорговыйОбъект", Неопределено);
	ПараметрыОперации.Вставить("Пробить", Пробить);
	
	ОткрытьФорму(
		"Обработка.ПечатьЧека.Форма",
		ПараметрыОперации,
		ЭтотОбъект,,,,
		Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьЧекКлиентЗавершение(РезультатВыполнения, ПараметрыОперации) Экспорт
	
	Если РезультатВыполнения = КодВозвратаДиалога.Отмена ИЛИ РезультатВыполнения = Неопределено Тогда
		// Отмена в форме печати чека
		ЭтаФорма.Доступность = Истина;
	ИначеЕсли РезультатВыполнения.Свойство("Результат") И РезультатВыполнения.Результат Тогда
		// Установить полученное значение номера чека реквизиту документа.
		ЭтаФорма.Доступность = Истина;
		Объект.НомерЧекаККМ = РезультатВыполнения.ВыходныеПараметры[1];
		Модифицированность  = Истина;
		РезультатЗаписи = Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	Иначе
		ЭтаФорма.Доступность = Истина;
		ТекстСообщения = НСтр("ru = 'При печати чека произошла ошибка.
		|Чек не напечатан на фискальном устройстве.
		|Дополнительное описание: %ДополнительноеОписание%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ДополнительноеОписание%", РезультатВыполнения.ОписаниеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
	//ФискальнаяОперацияОбновитьСтатус();
	//УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Функция ПодготовитьДанныеДляПробитияЧека(Знач НомерСекции, Знач ВерсияФормата, ОписаниеОшибки)

	Возврат Документы.ОказаниеУслуг.СобратьДанныеЧеков(Объект.Ссылка, НомерСекции, ВерсияФормата, ОписаниеОшибки);

КонецФункции    

&НаКлиенте
Функция ПараметрыВыбораЭТ(ТекущийЭТ)
	
	Перем ПараметрыВыбораЗначения;
	
	ПараметрыВыбораЗначения = Новый Структура;
	
	РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();		
	Если ЗначениеЗаполнено(РабочееМесто) Тогда
		ПараметрыВыбораЗначения.Вставить("РабочееМесто", РабочееМесто);
	КонецЕсли;
	
	Если Значениезаполнено(Объект.Касса) Тогда
		ДопустимыеКассы = ОбщегоНазначенияКлиентСервер.НовыйМассив(Объект.Касса, ПредопределенноеЗначение("Справочник.Кассы.ПустаяСсылка"));
		ПараметрыВыбораЗначения.Вставить("Касса", Новый ФиксированныйМассив(ДопустимыеКассы));
	КонецЕсли;
		
	ПараметрыВыбораЗначения.Вставить("Филиал", Объект.Филиал);
	ПараметрыВыбораЗначения.Вставить("ТекущаяСтрока", ТекущийЭТ);
	
	Возврат ПараметрыВыбораЗначения;
	
КонецФункции

&НаКлиенте
Процедура ЭкваринговыйТерминалПриИзменении(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкваринговыйТерминалПослеВыбора(ЭТ, ДополнительныеПараметры) Экспорт
	
	Если ЭТ <> Неопределено Тогда
		Объект.ЭквайринговыйТерминал = ЭТ;
		ЭкваринговыйТерминалПриИзменении(Элементы.ЭкваринговыйТерминал);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкваринговыйТерминалНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.НомерЧекаЭТ)
		И ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал)
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нельзя изменять эквайринговый терминал, если уже пробит чек'"));
		Возврат; // Запретим изменять эквайринговые терминалы если уже пробит чек.	
	КонецЕсли;
	
	ПараметрыВыбораЗначения = ПараметрыВыбораЭТ(Объект.ЭквайринговыйТерминал);
	Если ПараметрыВыбораЗначения <> Неопределено Тогда
		Оповещение = Новый ОписаниеОповещения("ЭкваринговыйТерминалПослеВыбора", ЭтотОбъект);
		ОткрытьФорму("Справочник.ЭквайринговыеТерминалы.ФормаВыбора", ПараметрыВыбораЗначения,,,,, Оповещение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура омг_ВидОплатыПриИзменении(Элемент)
	Если Объект.ВидОплаты = ПредопределенноеЗначение("Перечисление.ВидыОплаты.Безналичные") Тогда
		Объект.ОплаченоБезналичным = Объект.СуммаДокумента;
		Объект.ПолученоНаличными = 0;
	Иначе
		Объект.ОплаченоБезналичным = 0;
		Объект.ПолученоНаличными = Объект.СуммаДокумента;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтогиПриЧтении()
	
	ИтогоСоСкидкой = 0;
	СуммаСкидки = 0;
	
	Для Каждого СтрокаТаблицы Из Объект.Анализы Цикл
		
		СуммаСкидки = СуммаСкидки + СтрокаТаблицы.СуммаСкидки;
		ИтогоСоСкидкой = ИтогоСоСкидкой + СтрокаТаблицы.Цена;
		
	КонецЦикла;
	
	ИтогоСоСкидкой = ИтогоСоСкидкой - СуммаСкидки;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЖурналПоЗаявке(Заявка, Журнал)
	
	Журнал.Очистить();
	МассивЗаписей = ПолучитьЖурналЗапросов(Заявка);
	Для Каждого ЗаписьЖурнала Из МассивЗаписей Цикл
		СтрокаЖурнала = Журнал.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаЖурнала, ЗаписьЖурнала);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПересчитатьИтогиПриЧтении();
	ОбновитьВременныеРеквизитыТабличныхЧастей(Объект);
	ПарольЗаявки = ТекущийОбъект.ПарольЗаявки.Получить();
	Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ОбновитьЖурнал(ТекущийОбъект, Объект);
	
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	ОшибкиОбновленияСтатуса.Параметры.УстановитьЗначениеПараметра("Документ", Объект.Ссылка);
	
	ОбновитьСостояниеКартинкиОшибкиНаФорме(ЭтаФорма, Объект);
	
	ЗаполнитьЖурналПоЗаявке(Объект.Ссылка, ЖурналЗапросов);
	
	ЗаполнитьКоличествоДляЗаголовковСтраниц(ЭтаФорма);
	
	УстановитьПараметрыСписков();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПациента(Пациент)
	
	СтруктураДанных = Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ПолучитьДанныеПациента(Пациент);
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Клиенты") Тогда
		
		ДанныеПациента = ПолучитьДанныеПациента(ВыбранноеЗначение);

		ЗаполнитьЗначенияСвойств(Объект, ДанныеПациента);
		
	КонецЕсли;

	ПересчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеВыбораБиоматериалов(МассивБиоматериалов, ДопПараметры) Экспорт
	
	Если МассивБиоматериалов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуБиоматериаловПоАнализам(МассивБиоматериалов);
	
	ОбновитьВременныеРеквизитыТабличныхЧастей(Объект); 
	
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеОтветаНаВопросОПодбореКонтейнеров(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	МассивУслуг = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из Объект.Анализы Цикл
		
		МассивУслуг.Добавить(Новый Структура("Номенклатура, Проба", СтрокаТаблицы.Номенклатура, СтрокаТаблицы.Проба));
		
	КонецЦикла;

	омг_ЗаявкаЛИСОбщиеКлиентскиеПроцедуры.ПоказатьВыборБиоматериалов(ЭтаФорма, МассивУслуг);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьБиоматериалы(Команда)
	
	ТекстВопроса = "Заполнить список контейнеров? Таблица будет перезаполнена";
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросОПодбореКонтейнеров", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура БиоматериалыПередУдалением(Элемент, Отказ)
	
	//Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура БиоматериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//Отказ = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВременныеРеквизитыТабличныхЧастей(Объект)
	
	СтруктураПоиска = Новый Структура("КодСтроки");
	Для Каждого СтрокаТаблицы Из Объект.Биоматериалы Цикл
		СтруктураПоиска.КодСтроки = СтрокаТаблицы.КодСтроки;
		НайденныеСтроки = Объект.АнализыПоКонтейнерам.НайтиСтроки(СтруктураПоиска);
		СтрокаТаблицы.Состав = "Выбрано (" + НайденныеСтроки.Количество() + ")";
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьВременныеРеквизитыТабличныхЧастей(Объект);
	Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ОбновитьЖурнал(ТекущийОбъект, Объект);
	ОшибкиОбновленияСтатуса.Параметры.УстановитьЗначениеПараметра("Документ", Объект.Ссылка);
	
	ОбновитьСостояниеКартинкиОшибкиНаФорме(ЭтаФорма, Объект);
	
	БланкиРезультатовИсследования.Параметры.УстановитьЗначениеПараметра("Заявка", Параметры.Ключ);
	УстановитьДоступность(ЭтаФорма);
	ЗаполнитьЖурналПоЗаявке(Объект.Ссылка, ЖурналЗапросов);
	
	ЗаполнитьКоличествоДляЗаголовковСтраниц(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеОтметкиАнализовДляКонтейнеров(СписокЗначений, ДопПараметры) Экспорт
	
	Если СписокЗначений = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("КодСтроки", Элементы.Биоматериалы.ТекущиеДанные.КодСтроки);
	
	НайденныеСтроки = Объект.АнализыПоКонтейнерам.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
		НайденноеЗначение = СписокЗначений.НайтиПоЗначению(СтрокаТаблицы.Номенклатура);
		Если НайденноеЗначение = Неопределено Или Не НайденноеЗначение.Пометка Тогда
			Объект.АнализыПоКонтейнерам.Удалить(СтрокаТаблицы);
		КонецЕсли;                                             
		
	КонецЦикла;
	
	Для Каждого ПозицияСписка Из СписокЗначений Цикл
		Если ПозицияСписка.Пометка Тогда
			
			
			Для Каждого СтрокаТаблицы Из НайденныеСтроки Цикл
				Если СтрокаТаблицы.Номенклатура = ПозицияСписка.Значение Тогда
					ПозицияСписка.Пометка = Ложь;
				КонецЕсли;
			КонецЦикла;
			
			Если ПозицияСписка.Пометка Тогда
				СтрокаТаблицы = Объект.АнализыПоКонтейнерам.Добавить();
				СтрокаТаблицы.КодСтроки = СтруктураПоиска.КодСтроки;
				СтрокаТаблицы.Номенклатура = ПозицияСписка.Значение;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла; 
	
	ОбновитьВременныеРеквизитыТабличныхЧастей(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура БиоматериалыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.БиоматериалыСостав Тогда
		
		СтруктураПоиска = Новый Структура("КодСтроки", Элементы.Биоматериалы.ТекущиеДанные.КодСтроки);
		
		СписокВыбора = Новый СписокЗначений;
		
		Для Каждого СтрокаТаблицы Из Объект.АнализыПоКонтейнерам Цикл
			Если СписокВыбора.НайтиПоЗначению(СтрокаТаблицы.Номенклатура) = Неопределено Тогда 
				СписокВыбора.Добавить(СтрокаТаблицы.Номенклатура);
			КонецЕсли;
		КонецЦикла;
		
		ОтмеченныеСтроки = Объект.АнализыПоКонтейнерам.НайтиСтроки(СтруктураПоиска);
		Для Каждого СтрокаТаблицы Из ОтмеченныеСтроки Цикл
			НайденноеЗначение = СписокВыбора.НайтиПоЗначению(СтрокаТаблицы.Номенклатура);
			Если Не НайденноеЗначение = Неопределено Тогда
				НайденноеЗначение.Пометка = Истина;
			Иначе 
				СтрокаТаблицы.КодСтроки = -1;
			КонецЕсли;
		КонецЦикла;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтметкиАнализовДляКонтейнеров", ЭтаФорма);
		СписокВыбора.ПоказатьОтметкуЭлементов(ОписаниеОповещения, "Анализы");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтправитьЗаявкуВЛИС(Заявка)
	
	Возврат омг_ИнтеграцияСЛИС.СоздатьЗаявкуВЛИСИПолучитьКонтейнеры(Заявка);
	
КонецФункции

&НаКлиенте
Процедура Обработчик_ПослеОтветаНаВопросОбОтправкеВЛИС(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	омг_ЗаявкаЛИСОбщиеКлиентскиеПроцедуры.Обработчик_ПослеОтветаНаВопросОбОтправкеВЛИС(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвестиЗаборМатериалов(Команда)
	
	ТекстВопроса = "Выполнить отправку данных в ЛИС? Заявка будет закрыта и отправлена в лабораторию.";
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросОбОтправкеВЛИС", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудника();
	 Пользователь = Пользователи.ТекущийПользователь();
	 Медсестра =  Пользователь.Сотрудник;
     Возврат Медсестра;
КонецФункции

&НаКлиенте
Процедура КонтейнерыПередУдалением(Элемент, Отказ)
	
	//Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтейнерыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//Отказ = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьБланкНаСервере(ПутьКФайлу)
	
	ДвоичныеДанные = омг_ИнтеграцияСЛИС.ПрочитатьФайлИзFTP(ПутьКФайлу);
	
	Возврат ДвоичныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьБланк(Команда)
	
	ПутьКФайлу = Элементы.БланкиРезультатовИсследования.ТекущиеДанные.Файл;
	
	ДвоичныеДанные = ПолучитьБланкНаСервере(ПутьКФайлу);
	
	Если ДвоичныеДанные = Неопределено Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось открыть файл результата. Возможно он был удален, либо результат еще не получен
			|Попробуйте позднее, либо обратитесь к администратору.";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	Расширение = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ПутьКФайлу);
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ЗапуститьПриложение(ИмяВременногоФайла);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьСостояниеПоДаннымЛИСНаСервере(Заявка)
	
	омг_ИнтеграцияСЛИС.ОбновлениеСостоянияОтправленныхЗаявокВЛИС(Заявка);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеОтветаНаВопросООбновленииЛИС(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ОбновитьСостояниеПоДаннымЛИСНаСервере(Объект.Ссылка);
	
	Прочитать();
	
	ОбновитьСостояниеКартинкиОшибкиНаФорме(ЭтаФорма, Объект);
	
	ПоказатьПредупреждение(, "Операция обновления завершена.");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояниеПоДаннымЛИС(Команда)
	
	ТекстВопроса = "Выполнить обновления по данным ЛИС?";
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросООбновленииЛИС", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ОплаченоБезналичнымПриИзменении(Элемент)
	
	мБылаРучнаяПравкаОплаты = Истина;
	ВидОплатыБезнал = ПредопределенноеЗначение("Перечисление.ВидыОплаты.Безналичные");
	СтрокиБезнал = Оплата_СтрокиОплатыБезналом();
	Если СтрокиБезнал.Количество() <> 0 Тогда
		СтрокаБезнал = СтрокиБезнал[0];
		Если Объект.ОплаченоБезналичным = 0 Тогда 
			Объект.Оплата.Удалить(Объект.Оплата.Индекс(СтрокаБезнал));
		Иначе
			СтрокаБезнал.Сумма = Объект.ОплаченоБезналичным;
		КонецЕсли;
	Иначе
		Если Объект.ОплаченоБезналичным <> 0 Тогда
			СтрокаБезнал = Объект.Оплата.Добавить();
			СтрокаБезнал.Сумма = Объект.ОплаченоБезналичным;
			СтрокаБезнал.ВидОплаты = ВидОплатыБезнал;
			СтрокаБезнал.ЭквайринговыйТерминал = Объект.ЭквайринговыйТерминал;
		КонецЕсли;
	КонецЕсли;
	
	РаботаСДокументамиКлиентСервер.РассчитатьОплатуСдачуПоПолученнымНаличным(Объект);
	//РаботаСФормамиКлиент.ОплатаПриОкончанииРедактирования(ЭтаФорма,Неопределено, Неопределено, Неопределено);
	ОбнулениеОплатыНаличными();
	
	////////////////////////////////////////////////////////////////////
	// ОМГ
	Если Объект.СуммаДокумента <> Объект.ОплаченоБезналичным + Объект.ПолученоНаличными Тогда
		Разница = Объект.СуммаДокумента - Объект.ОплаченоБезналичным;
		
		Если Разница < 0  Тогда
			Объект.ОплаченоБезналичным = Объект.СуммаДокумента;	
			Объект.ПолученоНаличными = 0;
		иначе	
			Объект.ПолученоНаличными = Разница;
		КонецЕсли;
	КонецЕсли;    
	омг_ПроверкаСуммыОплаты();
	// ОМГ 
	////////////////////////////////////////////////////////////////////
	
КонецПроцедуры

 &НаКлиенте
Функция Оплата_СтрокиОплатыБезналом()
	
	СтрокиОплаты = Новый Массив;
	
	Для Каждого СтрокаОплаты Из Объект.Оплата Цикл
		Если Оплата_ЭтоОбычныйБезнал(СтрокаОплаты) Тогда
			СтрокиОплаты.Добавить(СтрокаОплаты)
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрокиОплаты;

КонецФункции

&НаКлиенте
Функция Оплата_ЭтоОбычныйБезнал(СтрокаОплаты)
	
	Возврат	  СтрокаОплаты.ВидОплаты = ПредопределенноеЗначение("Перечисление.ВидыОплаты.Безналичные")
			И Оплаты_ЭтоСтрокаОплатыНеНСПК(СтрокаОплаты)

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция Оплаты_ЭтоСтрокаОплатыНеНСПК(СтрокаОплаты)
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбнулениеОплатыНаличными()
	
	Если Объект.ПолученоНаличными = Объект.Сдача Тогда
		ПолученоНаличнымиОткрытие(Объект.ПолученоНаличными, Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолученоНаличнымиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СуммаПрочихВидовОплаты = 0;
	Для Каждого СтрокаОплаты Из Объект.Оплата Цикл
		Если СтрокаОплаты.ВидОплаты <> ПредопределенноеЗначение("Перечисление.ВидыОплаты.Наличными") Тогда
			СуммаПрочихВидовОплаты = СуммаПрочихВидовОплаты + СтрокаОплаты.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.ПолученоНаличными <> Объект.СуммаДокумента - СуммаПрочихВидовОплаты Тогда
		Объект.ПолученоНаличными = Объект.СуммаДокумента - СуммаПрочихВидовОплаты;
		ПолученоНаличнымиПриИзменении(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученоНаличнымиПриИзменении(Элемент)
	
	РаботаСДокументамиКлиентСервер.РассчитатьОплатуСдачуПоПолученнымНаличным(Объект);
	//РаботаСФормамиКлиент.ОплатаПриОкончанииРедактирования(ЭтаФорма,Неопределено, Неопределено, Неопределено);
	мБылаРучнаяПравкаОплаты = Истина;   
	
	////////////////////////////////////////////////////////////////////
	// ОМГ
	Если Объект.СуммаДокумента <> Объект.ОплаченоБезналичным + Объект.ПолученоНаличными Тогда
		Разница = Объект.СуммаДокумента - Объект.ПолученоНаличными;
		
		Если Разница < 0  Тогда
			Объект.ПолученоНаличными = Объект.СуммаДокумента;	
			Объект.ОплаченоБезналичным = 0;
		иначе	
			Объект.ОплаченоБезналичным = Разница;
		КонецЕсли;
	КонецЕсли;  
	омг_ПроверкаСуммыОплаты();
	// ОМГ 

	
КонецПроцедуры

&НаКлиенте  
Процедура омг_ПроверкаСуммыОплаты()
	
	Если Объект.НомерЧекаККМ = 0 Тогда   
		СуммаОплаты = 0
	КонецЕсли;	
	Объект.СуммаДокумента = Окр(Объект.СуммаДокумента);
	омг_ПересчитатьОплаты();
	
КонецПроцедуры	

&НаКлиенте  
Процедура омг_ПересчитатьОплаты()
	
	//Если ЗначениеЗаполнено(Объект.омг_СтраховаяПрограмма) Тогда
	//	Объект.СуммаДокумента = 0;
	//	Объект.ОплаченоБезналичным = 0;
	//    Объект.ПолученоНаличными = 0;	
	//Иначе
		Если Объект.СуммаДокумента <> Объект.ОплаченоБезналичным + Объект.ПолученоНаличными Тогда
			Если ЗначениеЗаполнено(Объект.ЭквайринговыйТерминал) Тогда
				Объект.ОплаченоБезналичным = Объект.СуммаДокумента;	
				Объект.ПолученоНаличными = 0;
			иначе
				Объект.ОплаченоБезналичным = 0;	
				Объект.ПолученоНаличными = Объект.СуммаДокумента;
			КонецЕсли;
		КонецЕсли;	
	//КонецЕсли;

КонецПроцедуры	  

&НаКлиенте
Процедура ОплаченоБезналичнымНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПеренестиРеальнуюОплатуНаВид(ПредопределенноеЗначение("Перечисление.ВидыОплаты.Безналичные"));
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиРеальнуюОплатуНаВид(ВидОплаты)
	
	НуженБезнал = ВидОплаты = ПредопределенноеЗначение("Перечисление.ВидыОплаты.Безналичные");
	
	ИзымаемыйВид = ?(НуженБезнал, ПредопределенноеЗначение("Перечисление.ВидыОплаты.Наличными"), ПредопределенноеЗначение("Перечисление.ВидыОплаты.Безналичные"));
	ИзымаемаяСтрока = Неопределено;
	ЦелеваяСтрокаОплаты = Неопределено;
	
	СуммаПрочие = 0;
	Для Каждого СтрокаОплаты Из Объект.Оплата Цикл
		
		Если Не Оплаты_ЭтоСтрокаОплатыНеНСПК(СтрокаОплаты) Тогда
			СуммаПрочие = СуммаПрочие + СтрокаОплаты.Сумма;
			
		ИначеЕсли СтрокаОплаты.ВидОплаты = ИзымаемыйВид Тогда
			ИзымаемаяСтрока = СтрокаОплаты;
		ИначеЕсли СтрокаОплаты.ВидОплаты = ВидОплаты Тогда
			ЦелеваяСтрокаОплаты = СтрокаОплаты;
		Иначе
			СуммаПрочие = СуммаПрочие + СтрокаОплаты.Сумма;
		КонецЕсли;
	КонецЦикла;
	
	Если ИзымаемаяСтрока <> Неопределено Тогда
		Объект.Оплата.Удалить(ИзымаемаяСтрока);
	КонецЕсли;
	
	СуммаДляОплаты = 0;
	Если СуммаПрочие < Объект.СуммаДокумента Тогда
		СуммаДляОплаты = Объект.СуммаДокумента - СуммаПрочие;
		Если ЦелеваяСтрокаОплаты = Неопределено Тогда
			ЦелеваяСтрокаОплаты = Объект.Оплата.Добавить();
			ЦелеваяСтрокаОплаты.ВидОплаты = ВидОплаты;
			Если НуженБезнал Тогда
				ЦелеваяСтрокаОплаты.ЭквайринговыйТерминал = Объект.ЭквайринговыйТерминал;
			КонецЕсли;
		КонецЕсли;
		ЦелеваяСтрокаОплаты.Сумма = СуммаДляОплаты;
	КонецЕсли;
	
	Если НуженБезнал Тогда
		Объект.ПолученоНаличными = 0;
		Объект.ОплаченоБезналичным = СуммаДляОплаты;
	Иначе 
		Объект.ПолученоНаличными = СуммаДляОплаты;
		Объект.ОплаченоБезналичным = 0;
	КонецЕсли;
	Объект.Сдача = 0;
	
	ЗаполнитьОплатуПоСуммеДокумента(Объект, мУчетнаяПолитика, 1, Объект.ОплаченоБезналичным);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьОплатуПоСуммеДокумента(Объект, мУчетнаяПолитика, СуммаОплаты, ОплаченоБезналичным)
	
	Если Объект.Оплата.Количество()<2 Тогда
		Если Объект.Оплата.Количество() = 0 Тогда
			СтрокаОплаты = Объект.Оплата.Добавить();
			СтрокаОплаты.ВидОплаты = мУчетнаяПолитика.ОсновнойВидОплаты;
		Иначе 
			СтрокаОплаты = Объект.Оплата[0];
		КонецЕсли;
		
		Если СтрокаОплаты.ВидОплаты = ПредопределенноеЗначение("Перечисление.ВидыОплаты.Наличными") Тогда
			Если Объект.Сдача = 0 Тогда
				СтрокаОплаты.Сумма = Объект.СуммаДокумента;
				Объект.ПолученоНаличными  = СтрокаОплаты.Сумма;
			КонецЕсли;
		Иначе
			СтрокаОплаты.Сумма = Объект.СуммаДокумента;
		КонецЕсли;
		
		// Автоподстановка эквайирнгового терминала.
		Если СтрокаОплаты.ВидОплаты = ПредопределенноеЗначение("Перечисление.ВидыОплаты.Безналичные") Тогда
			
			Объект.ОплаченоБезналичным = СтрокаОплаты.Сумма;
			
			Если Не ЗначениеЗаполнено(СтрокаОплаты.ЭквайринговыйТерминал) Тогда
				РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
				СтрокаОплаты.ЭквайринговыйТерминал = РаботаСТорговымОборудованием.ПолучитьЭквайринговыйТерминал(РабочееМесто, Объект.Филиал, Объект.Касса);
				Объект.ОплаченоБезналичным = СтрокаОплаты.Сумма;
			КонецЕсли;
		КонецЕсли;
		
		Отказ = Ложь;
		//СуммаОплаты = ПолучитьИтогОплаты(Объект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученоНаличнымиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПеренестиРеальнуюОплатуНаВид(ПредопределенноеЗначение("Перечисление.ВидыОплаты.Наличными"));
КонецПроцедуры

&НаКлиенте
Процедура СканироватьКодПробы(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВводаШтрихкодаЗаявки", ЭтаФорма);
	ПоказатьВводСтроки(ОписаниеОповещения,, "Штрихкод", 100, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеВводаШтрихкодаЗаявки(Штрихкод, ДопПараметры) Экспорт 
	
	Если Не ЗначениеЗаполнено(Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущийЭлемент = Элементы.Анализы Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана позиция анализа для подвязки штрихкода!";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	Элементы.Анализы.ТекущиеДанные.Проба = Штрихкод;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Не ТипЗнч(Данные) = Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийЭлемент = Элементы.НомерЗаявки Тогда
		Объект.НомерЗаявки = Данные;
	ИначеЕсли ТекущийЭлемент = Элементы.Анализы Тогда
		Элементы.Анализы.ТекущиеДанные.Проба = Данные;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаявку(Команда)
	
	омг_ЗаявкаЛИСОбщиеКлиентскиеПроцедуры.ВыполнитьОтменуЗаявки(Объект.Ссылка, ЭтаФорма);
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьСтатусОтмены()
	СтатусОтменена = Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Отменена; 
	Возврат СтатусОтменена; 
КонецФункции 

&НаСервере
Процедура ЗаполнитьТаблицуБиоматериаловПоАнализам(МассивБиоматериалов);
	
	Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ЗаполнитьТаблицуБиоматериаловПоАнализам(Объект, МассивБиоматериалов);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерЗаявкиПриИзменении(Элемент)
	
	Для Каждого СтрокаАнализа Из Объект.Анализы Цикл
		Если ЗначениеЗаполнено(СтрокаАнализа.Проба) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаАнализа.Проба = Объект.НомерЗаявки;
	КонецЦикла;
	
	
	Для Каждого СтрокаАнализа Из Объект.Биоматериалы Цикл
		Если ЗначениеЗаполнено(СтрокаАнализа.Проба) Тогда
			Продолжить;
		КонецЕсли;
		СтрокаАнализа.Проба = Объект.НомерЗаявки;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДополнительныеПоляНаСервере()
	
	Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ОбновитьДополнительныеПоля(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДополнительныеПоля(Команда)
	ОбновитьДополнительныеПоляНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПарольПоЗаявке(Команда)
	ПоказатьПредупреждение(, ПарольЗаявки);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ЗаписатьЖурнал(ТекущийОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ЖурналЗапросов.ТекущиеДанные;
	Если Поле.Имя = "ЖурналЗапросовТекстОтвета" Или Поле.Имя = "ЖурналЗапросовТекстЗапроса" Тогда
		
		ОткрытьФорму("ОбщаяФорма.ВводМногострочногоТекстаТабличнойЧасти", Новый Структура("Текст", ТекущиеДанные[СтрЗаменить(Поле.Имя, "ЖурналЗапросов", "")]));
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура АнализыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Исследования добавляются только через подбор!";
	Сообщение.Сообщить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокБиоматериаловДляУдаленияСтрок(МассивУслуг, Филиал)
	
	СписокБиоматериалов = Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ПолучитьСписокКонтейнеров(МассивУслуг, Филиал);

	Возврат СписокБиоматериалов;
	
КонецФункции

&НаКлиенте
Процедура Обработчик_ПослеОтветаНаВопросУдалениеАнализа(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Анализы.Удалить(Элементы.Анализы.ТекущиеДанные);
	
	МассивУслуг = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из Объект.Анализы Цикл
		
		МассивУслуг.Добавить(Новый Структура("Номенклатура, Проба", СтрокаТаблицы.Номенклатура, СтрокаТаблицы.Проба));
		
	КонецЦикла;
	СписокБиоматериалов = ПолучитьСписокБиоматериаловДляУдаленияСтрок(МассивУслуг, Объект.Филиал);

	УдаляемыеСтроки = Новый Массив;
	Для Каждого СтрокаТаблицыАнализов Из Объект.АнализыПоКонтейнерам Цикл
		УдалитьАнализ = Истина;
		Для Каждого ДанныеБиоматериала Из СписокБиоматериалов Цикл
			Для Каждого СтрокаАнализовБиоматерила Из ДанныеБиоматериала.Анализы Цикл
				Если СтрокаАнализовБиоматерила.Номенклатура = СтрокаТаблицыАнализов.Номенклатура Тогда
					УдалитьАнализ = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		Если УдалитьАнализ Тогда
			УдаляемыеСтроки.Добавить(СтрокаТаблицыАнализов);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТаблицыАнализов Из УдаляемыеСтроки Цикл
		Объект.АнализыПоКонтейнерам.Удалить(СтрокаТаблицыАнализов);
	КонецЦикла;
	
	УдаляемыеСтроки.Очистить();
	
	СтруктураПоиска = Новый Структура("КодСтроки");
	
	Для Каждого СтрокаБиоматериалов Из Объект.Биоматериалы Цикл
		СтруктураПоиска.КодСтроки = СтрокаБиоматериалов.КодСтроки;
		Если Объект.АнализыПоКонтейнерам.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
			УдаляемыеСтроки.Добавить(СтрокаБиоматериалов);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаБиоматериалов Из УдаляемыеСтроки Цикл
		Объект.Биоматериалы.Удалить(СтрокаБиоматериалов);
	КонецЦикла;
	
	ОбновитьВременныеРеквизитыТабличныхЧастей(Объект);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура АнализыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекстВопроса = "При удалении строки будут исключены биоматериалы не связанные ни с одним исследованием. Продолжить?";
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросУдалениеАнализа", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеЗакрытияФормыОшибки(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСостояниеКартинкиОшибкиНаФорме(ЭтаФорма, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОшибкиКартинкаНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеЗакрытияФормыОшибки", ЭтаФорма);
	
	ОткрытьФорму("Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Форма.ФормаПросмотраОшибки", 
		Новый Структура("Документ", Объект.Ссылка), ЭтаФорма, УникальныйИдентификатор,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьОшибкиОбновленияСтатуса(Ссылка)
	
	Возврат омг_ИнтеграцияСЛИС.ЕстьОшибкиОбновленияСтатуса(Ссылка);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьСостояниеКартинкиОшибкиНаФорме(Форма, Объект)
	
	ЕстьОшибкиСтатусов = ЕстьОшибкиОбновленияСтатуса(Объект.Ссылка);
	Форма.Элементы.ДекорацияОшибкиКартинка.Видимость = ЕстьОшибкиСтатусов;
	Форма.Элементы.ДекорацияОшибкиНадпись.Видимость = ЕстьОшибкиСтатусов;
	
КонецПроцедуры

&НаКлиенте
Процедура ОшибкиОбновленияСтатусаПослеУдаления(Элемент)
	ОбновитьСостояниеКартинкиОшибкиНаФорме(ЭтаФорма, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеОтветаНаВопросОЗакрытииЗаявки(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Закрыта");
	Записать();
	УстановитьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоПолныеПрава()
	
	Возврат РольДоступна("ПолныеПрава");
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьЗаявку(Команда)
	
	Если Не ЭтоПолныеПрава() И
		Не Объект.Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ПолученРезультатИзЛИС") Тогда
		ПоказатьПредупреждение(, "Закрытие заявки доступно только в статусе ""Получен результат из ЛИС""");
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "Установить статус заявки ""Закрыта""?";
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросОЗакрытииЗаявки", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
	
КонецПроцедуры


&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	УстановитьДоступность(ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура БланкиРезультатовИсследованияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура БланкиРезультатовИсследованияПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ОшибкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ОшибкиПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ЖурналЗапросовПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ЖурналЗапросовПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ОшибкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура БланкиРезультатовИсследованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ПерезаполнитьПробуИсследования(Команда)
	
	Для Каждого СтрокаАнализа Из Объект.Анализы Цикл
		СтрокаАнализа.Проба = Объект.НомерЗаявки;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПерезаполнитьПробуБиоматериалы(Команда)
	
	Для Каждого СтрокаАнализа Из Объект.Биоматериалы Цикл
		СтрокаАнализа.Проба = Объект.НомерЗаявки;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура БиоматериалыПриИзменении(Элемент)
	ОбновитьВременныеРеквизитыТабличныхЧастей(Объект);
КонецПроцедуры

&НаКлиенте
Асинх Функция СканированиеШтрихкода()
	
	Штрихкод = Ждать ВвестиСтрокуАсинх(, "Введите штрихкод", 50);
	
	Если Не ЗначениеЗаполнено(Штрихкод) Тогда
		Возврат "";
	КонецЕсли;
	
	СимволыКЗ = "әіңғ,.үұқ";
	СимволыКЗ = """" + СимволыКЗ + ВРег(СимволыКЗ);
	Числа = "1234567890234567890";
	
	Для НСтроки = 1 По СтрДлина(Штрихкод) Цикл
		СимволШтрихкода = Сред(Штрихкод, НСтроки, 1);
		НСимволаКЗ = СтрНайти(СимволыКЗ, СимволШтрихкода);
		Если НСимволаКЗ > 0 Тогда
			СимволЧисло = Сред(Числа, НСимволаКЗ, 1);
			Штрихкод = СтрЗаменить(Штрихкод, СимволШтрихкода, СимволЧисло);
		КонецЕсли;
	КонецЦикла;

	Возврат Штрихкод;
	
КонецФункции

&НаКлиенте
Асинх Процедура СканироватьШтрихкодЗаявки(Команда)
	
    Штрихкод = Ждать СканированиеШтрихкода();
	
	Если Штрихкод = "" Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НомерЗаявки = Штрихкод;
	
	Записать();
	
КонецПроцедуры


&НаКлиенте
Асинх Процедура СканироватьШтрихкодКонтейнера(Команда)
	
	Если Элементы.Биоматериалы.ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Штрихкод = Ждать СканированиеШтрихкода();
	
	Если Штрихкод = "" Тогда
		Возврат;
	КонецЕсли;

	Элементы.Биоматериалы.ТекущиеДанные.Проба = Штрихкод;
	
	Модифицированность = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьШтрихкод(Команда)
	Если Элементы.Биоматериалы.ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	Элементы.Биоматериалы.ТекущиеДанные.Проба = "";
КонецПроцедуры

