#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыИФункцииДляОбеспеченияПроведения

Процедура ПроверитьЗаполнениеТабличныхЧастей(ТаблицаПоТоварам, ТаблицаПоСертификатам, ТаблицаПоСпециализациям, Отказ)
	
	ШаблонОшибки = НСтр("ru='В строке табличной части %1 Номенклатура номер %2 табличной части'");
	
	// Общую процедуру проверки в этом документе звать нельзя, потому что номер строки в форме документа
	// отличается от системного.
	Для Каждого СтрокаТаблицы Из ТаблицаПоТоварам Цикл

		СтрокаНачалаСообщенияОбОшибке = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонОшибки, НСтр("ru='Номенклатура'"),
				СокрЛП(таблицаПоТоварам.Индекс(СтрокаТаблицы) + 1)
			);
		СтрокаНачалаСообщенияОбОшибке = СтрокаНачалаСообщенияОбОшибке + " ";
		// Номенклатура.
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не заполнена Номенклатура.'"), Отказ);
		КонецЕсли;

		// Единица для товаров.
		Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура)		И
		  Не ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения)	И 
		  	 СтрокаТаблицы.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал
		Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не заполнена единица измерения.'"), Отказ);
		КонецЕсли;
	КонецЦикла;     
	
	Для Каждого СтрокаТаблицы Из ТаблицаПоСертификатам Цикл

		СтрокаНачалаСообщенияОбОшибке = 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонОшибки, НСтр("ru='Сертификаты'"),
				СокрЛП(ТаблицаПоСертификатам.Индекс(СтрокаТаблицы) + 1)
			);
		СтрокаНачалаСообщенияОбОшибке = СтрокаНачалаСообщенияОбОшибке + " ";
		// Сертификат.
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + НСтр("ru='не заполнен Сертификат.'"), Отказ);
		КонецЕсли;

	КонецЦикла;
	
	// Проверка таблиы специализаций
	Если ТаблицаПоСпециализациям.НайтиСтроки(Новый Структура("Специализация", Справочники.КатегорииВыработки.ПустаяСсылка())).Количество() > 1 Тогда
		ТекстОшибки = НСтр("ru='В табличной части ""Специализации"" допускается не более одной строки с не указанной специализацией.'");
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура омг_ПерезаполнитьТаблицу(Таблица)

	НоваяТаблица = Таблица.СкопироватьКолонки();
	Для Каждого СтрокаТаблицыПрейскурантов Из омг_Филиалы Цикл
		Для Каждого СтрокаТаблицыИсточник Из Таблица Цикл
			НоваяСтрока = НоваяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыИсточник);
			НоваяСтрока.омг_Филиал = СтрокаТаблицыПрейскурантов.Филиал;
		КонецЦикла;
	КонецЦикла;
	Таблица = НоваяТаблица.Скопировать();
	
КонецПроцедуры

Процедура омг_ПерезаполнитьТаблицуПоПрейскурантам(Таблица)

	НоваяТаблица = Таблица.СкопироватьКолонки();
	Для Каждого СтрокаТаблицыПрейскурантов Из омг_Прейскуранты Цикл
		Для Каждого СтрокаТаблицыИсточник Из Таблица Цикл
			НоваяСтрока = НоваяТаблица.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыИсточник);
			НоваяСтрока.Прейскурант = СтрокаТаблицыПрейскурантов.Прейскурант;
			Если ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограммаНаборы Тогда
			Если ЗначениеЗаполнено(СтрокаТаблицыИсточник.омг_СоглашенияСтрахования)   Тогда 
			НоваяСтрока.Прейскурант = СтрокаТаблицыИсточник.омг_СоглашенияСтрахования;	
		КонецЕсли;
		КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Таблица = НоваяТаблица.Скопировать();
	
КонецПроцедуры

Функция омг_ПолучитьИсточнникДанныхДляБлокировки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	УстановкаЦеномг_Филиалы.Филиал КАК Филиал,
	               |	УстановкаЦеномг_Филиалы.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ФилиалыДокумента
	               |ИЗ
	               |	Документ.УстановкаЦен.омг_Филиалы КАК УстановкаЦеномг_Филиалы
	               |ГДЕ
	               |	УстановкаЦеномг_Филиалы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ФилиалыДокумента.Филиал КАК Филиал
	               |ИЗ
	               |	ВТ_ФилиалыДокумента КАК ВТ_ФилиалыДокумента";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Возврат Запрос.Выполнить();
	
КонецФункции

Процедура ДвиженияПоРегистрам(ТаблицаПоТоварам, ТаблицаПоСертификатам, ТаблицаПоСпециализациям, Отказ)
	
	// Изменения Макеев 12-01-2026 (
	НаборДвижений   = Движения.ЦеныНоменклатуры;
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	
	НаборДвиженийСп	  = Движения.ЦеныСпециализаций;
	ТаблицаДвиженийСП = НаборДвиженийСп.Выгрузить();
	
	// Добавлено Макеев (
	омг_ПерезаполнитьТаблицу(ТаблицаПоТоварам);
	омг_ПерезаполнитьТаблицуПоПрейскурантам(ТаблицаПоТоварам);
	//омг_ПерезаполнитьТаблицу(ТаблицаПоСертификатам);
	//омг_ПерезаполнитьТаблицу(ТаблицаПоСпециализациям);
	// )
 	// Формирование движений по т/ч "Номенклатура"
	// Реализована управляемая блокировка по списку товаров установки цен
	//  Автоматическая блокировка для регистра отключена.
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.ЦеныНоменклатуры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = омг_ПолучитьИсточнникДанныхДляБлокировки();
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("омг_Филиал", "Филиал");
	ЭлементБлокировки.УстановитьЗначение("Период", НачалоДня(Дата));
	БлокировкаДанных.Заблокировать();
		
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
	
	// Изменено Макеев (
	Если ВидОперации <> Перечисления.ВидыОперацийУстановкиЦен.ЦеныКонтрагентов 
		И ВидОперации <> Перечисления.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограмма
		И ВидОперации <> Перечисления.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограммаНаборы
		Тогда
	// )
 		// Формирование движений по т/ч "Сертификаты"
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоСертификатам, ТаблицаДвижений);
		
	 	// Формирование движений по т/ч "Специализации"
        ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоСпециализациям, ТаблицаДвиженийСП);
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////
	// ОМГ
	ТаблицаДвижений =  омг_РаботаСРеестрамиСервер.УдалитьДублиСтрокТаблицыЗначений(ТаблицаДвижений, "Активность,ЕдиницаИзмерения,Номенклатура,Период,Прейскурант,Регистратор,ХарактеристикаНоменклатуры,омг_Набор,омг_Филиал,Цена");
	ТаблицаДвижений.Свернуть("Активность, ЕдиницаИзмерения, Номенклатура, Период, Прейскурант, Регистратор, ХарактеристикаНоменклатуры,  омг_Набор, омг_Филиал","Цена");
	// ОМГ
    ///////////////////////////////////////////////////////////////////
	
	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
	
	НаборДвиженийСП.мПериод          = Дата;
	НаборДвиженийСП.мТаблицаДвижений = ТаблицаДвиженийСП;

	Если Не Отказ Тогда
		НаборДвижений.ВыполнитьДвижения();
		НаборДвиженийСп.ВыполнитьДвижения();
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрам

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		Для Каждого СтрокаПоступления Из Основание.Товары Цикл
			СтрокаЦен = Номенклатура.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЦен,СтрокаПоступления);
		КонецЦикла;
		
		Для Каждого СтрокаПоступления Из Основание.Услуги Цикл
			СтрокаЦен = Номенклатура.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЦен,СтрокаПоступления);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		
		Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		НесколькоКонтрагентов = Ложь;
		
		Для Каждого СтрокаПоступления Из Основание.Товары Цикл
			
			СтрокаЦен = Номенклатура.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЦен,СтрокаПоступления);
			Если Контрагент <> СтрокаПоступления.Поставщик
				И ЗначениеЗаполнено(Контрагент)
			Тогда
				НесколькоКонтрагентов = Истина;
			ИначеЕсли Не ЗначениеЗаполнено(Контрагент) Тогда
				Контрагент = СтрокаПоступления.Поставщик;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не НесколькоКонтрагентов
			И ЗначениеЗаполнено(Контрагент)
		Тогда
			ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.ЦеныКонтрагентов;
			Прейскурант = Контрагент;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ОприходованиеТоваров") Тогда
		
		ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.ЦеныПрейскурантов;
		
		Для Каждого СтрокаПоступления Из Основание.Товары Цикл
			
			СтрокаЦен = Номенклатура.Добавить();
			СтрокаЦен.Номенклатура = СтрокаПоступления.Номенклатура;
			СтрокаЦен.ХарактеристикаНоменклатуры = СтрокаПоступления.ХарактеристикаНоменклатуры;
			СтрокаЦен.ЕдиницаИзмерения = СтрокаПоступления.ЕдиницаИзмерения;
			СтрокаЦен.Цена = СтрокаПоступления.Цена;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Укажем обязательные к заполнению поля:
	Заголовок = НСтр("ru='Проведение документа'") + " """ + СокрЛП(Ссылка) + """: ";
	
	СтруктураОбязательныхПолей = Новый Структура();
	// Изменено Макеев (
	//Если ВидОперации <> Перечисления.ВидыОперацийУстановкиЦен.ЦеныКонтрагентов Тогда
	//	СтруктураОбязательныхПолей.Вставить("Прейскурант");
	//КонецЕсли;
	// )
	ПроведениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура",					"Номенклатура");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры",	"ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("Цена",							"Цена");
	СтруктураПолей.Вставить("ЕдиницаИзмерения",				"ЕдиницаИзмерения");
	СтруктураПолей.Вставить("Прейскурант",					"Ссылка.Прейскурант");
	// Добавлено Бит Макеев (
	СтруктураПолей.Вставить("омг_Филиал",					"Ссылка.Филиал");
	// )
	
	СтруктураПолейСертификаты = Новый Структура;
	СтруктураПолейСертификаты.Вставить("Номенклатура",	"ВидСертификата");
    СтруктураПолейСертификаты.Вставить("Цена",			"Цена");
	СтруктураПолейСертификаты.Вставить("Прейскурант",	"Ссылка.Прейскурант");
	
	СтруктураПолейСпециализации = Новый Структура;
	СтруктураПолейСпециализации.Вставить("Специализация",	"Специализация");
    СтруктураПолейСпециализации.Вставить("Цена",			"Цена");
	СтруктураПолейСпециализации.Вставить("Прейскурант",		"Ссылка.Прейскурант");

	// Изменено Макеев (
	Если Не ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_ЦеныНаборов 
		и Не ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограммаНаборы
		Тогда
		РезультатЗапросаПоТоварам = ПроведениеДокументов.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Номенклатура", СтруктураПолей);
		ТаблицаПоТоварам          = РезультатЗапросаПоТоварам.Выгрузить();
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_СтраховаяПрограммаНаборы Тогда
		РезультатЗапросаПоТоварам = Документы.УстановкаЦен.омг_СформироватьЗапросПоНаборам(ЭтотОбъект,Истина);
		ТаблицаПоТоварам          = РезультатЗапросаПоТоварам.Выгрузить();	
	Иначе
		РезультатЗапросаПоТоварам = Документы.УстановкаЦен.омг_СформироватьЗапросПоНаборам(ЭтотОбъект);
		ТаблицаПоТоварам          = РезультатЗапросаПоТоварам.Выгрузить();
	КонецЕсли;
	// )
	
	РезультатЗапросаПоСертификатам	= ПроведениеДокументов.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Сертификаты", СтруктураПолейСертификаты);
	ТаблицаПоСертификатам			= РезультатЗапросаПоСертификатам.Выгрузить();
	
	РезультатЗапросаПоСертификатам	= ПроведениеДокументов.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Специализации", СтруктураПолейСпециализации);
	ТаблицаПоСпециализациям			= РезультатЗапросаПоСертификатам.Выгрузить();

	ПроверитьЗаполнениеТабличныхЧастей(ТаблицаПоТоварам, ТаблицаПоСертификатам, ТаблицаПоСпециализациям, Отказ);

	Если Не Отказ Тогда
		ДвиженияПоРегистрам(ТаблицаПоТоварам, ТаблицаПоСертификатам, ТаблицаПоСпециализациям, Отказ);
	КонецЕсли;

КонецПроцедуры	// ОбработкаПроведения.

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗначениеЗаполнено(Прейскурант) И омг_Прейскуранты.Найти(Прейскурант, "Прейскурант") = Неопределено Тогда
		омг_Прейскуранты.Добавить().Прейскурант = Прейскурант;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти   

