Функция ВерсияКлиентаЛицензирования() Экспорт
	Возврат "2.0.1.2";
КонецФункции
Функция МинимальнаяВерсияСервераЛицензий() Экспорт
	МинимальнаяВерсияСервераЛицензий = Новый Массив;
	МинимальнаяВерсияСервераЛицензий.Добавить(2);
	МинимальнаяВерсияСервераЛицензий.Добавить(0);
	МинимальнаяВерсияСервераЛицензий.Добавить(0);
	МинимальнаяВерсияСервераЛицензий.Добавить(175);
	Возврат МинимальнаяВерсияСервераЛицензий;
КонецФункции
Функция СоздатьРезультат(КодРезультата = 0, Комментарий = "", Данные = Неопределено, Ресурс = "", ДлительностьИсполнения = -1, ДлительностьИсполненияВызова = -1) Экспорт
	Описание = ПолучитьОписаниеПоКодуРезультата(КодРезультата);
	Возврат TApiResult(КодРезультата, Описание, Комментарий, Данные, Ресурс, ДлительностьИсполнения, ДлительностьИсполненияВызова);
КонецФункции
Функция ПолучитьОписаниеПоКодуРезультата(КодРезультата) Экспорт
	Описание = НСтр("ru = 'Описание не найдено';");
	Если КодРезультата = 0 Тогда
		Описание = НСтр("ru = 'Нет ошибок.';");
	ИначеЕсли КодРезультата = 1000 Тогда
		Описание = НСтр("ru = '';");
	ИначеЕсли КодРезультата = 1001 Тогда
		Описание = НСтр("ru = 'Не удалось установить соединение с сервером лицензий.';");
	ИначеЕсли КодРезультата = 1002 Тогда
		Описание = НСтр("ru = 'При разборе JSON строки возникла ошибка.';");
	ИначеЕсли КодРезультата = 1003 Тогда
		Описание = НСтр("ru = 'При обращении к серверу получен неожиданный HTTP код результата.';");
	ИначеЕсли КодРезультата = 1005 Тогда
		Описание = НСтр("ru = 'Возникла ошибка при формировании JSON объекта.';");
	ИначеЕсли КодРезультата = 1006 Тогда
		Описание = НСтр("ru = 'Передан не поддерживаемый вид HTTP запроса.';");
	ИначеЕсли КодРезультата = 1008 Тогда
		Описание = НСтр("ru = 'Ожидался другой JSON объект.';");
	ИначеЕсли КодРезультата = 1009 Тогда
		Описание = НСтр("ru = 'Не удалось подготовить пакет для отправки.';");
	ИначеЕсли КодРезультата = 1010 Тогда
		Описание = НСтр("ru = 'Получение лицензии на текущую версию продукта требует наличия подписки на технологическое сопровождение.';");
	ИначеЕсли КодРезультата = 1011 Тогда
		Описание = НСтр("ru = 'Не удалось подготовить данные для отправки в сервер лицензий';");
	ИначеЕсли КодРезультата = 1012 Тогда
		Описание = НСтр("ru = 'Не удалось обработать данные, полученные от сервера лицензий.';");
	ИначеЕсли КодРезультата = 1013 Тогда
		Описание = НСтр("ru = 'Данные лицензии по запрошенному продукту отсутствуют в данных автономной лицензии.';");
	ИначеЕсли КодРезультата = 1014 Тогда
		Описание = НСтр("ru = 'Срок действия автономной лицензии истек.';");
	ИначеЕсли КодРезультата = 1015 Тогда
		Описание = НСтр("ru = 'Достигнут предел по числу сеансов, доступных в автономной лицензии.';");
	ИначеЕсли КодРезультата = 1016 Тогда
		Описание = НСтр("ru = 'Запрошенный параметр отсутствует в автономной лицензии.';");
	ИначеЕсли КодРезультата = 1017 Тогда
		Описание = НСтр("ru = 'Запрошенная подписка отсутствует в автономной лицензии.';");
	ИначеЕсли КодРезультата = 1018 Тогда
		Описание = НСтр("ru = 'Используемая версия firstBit.Сервера лицензий не поддерживается, необходимо обновить сервер лицензий.';");
	КонецЕсли;
	Возврат Описание;
КонецФункции
Процедура ЗарегистрироватьОшибкуВЖурналРегистрации(Комментарий, КатегорияОшибки = "Общее", ОбъектМетаданных = Неопределено, Данные = Неопределено) Экспорт
	ЗаписьЖурналаРегистрации("firstBit.Клиент лицензирования v2." + ?(КатегорияОшибки <> "", КатегорияОшибки, "Общее"), УровеньЖурналаРегистрации.Ошибка, ОбъектМетаданных, Данные, Комментарий);
КонецПроцедуры
Функция НачатьЗамерВремени(СтруктураЗамера = Неопределено) Экспорт
	Если СтруктураЗамера = Неопределено Тогда
		СтруктураЗамера = Новый Структура;
		СтруктураЗамера.Вставить("НачалоЗамера", 0);
		СтруктураЗамера.Вставить("Длительность", 0);
	КонецЕсли;
	СтруктураЗамера.НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Возврат СтруктураЗамера;
КонецФункции
Функция ЗавершитьЗамерВремени(СтруктураЗамера) Экспорт
	СтруктураЗамера.Длительность = ТекущаяУниверсальнаяДатаВМиллисекундах() - СтруктураЗамера.НачалоЗамера;
	Возврат СтруктураЗамера.Длительность;
КонецФункции
Функция UUID(ЗаключитьВСкобки = Ложь, ИсключитьРазделители = Ложь, ВерхнийРегистр = Ложь) Экспорт
	Результат = Строка(Новый УникальныйИдентификатор);
	Если ИсключитьРазделители Тогда
		Результат = СтрЗаменить(Результат, "-", "");
	КонецЕсли;
	Если ЗаключитьВСкобки Тогда
		Результат = "{" + Результат + "}";
	КонецЕсли;
	Если ВерхнийРегистр Тогда
		Результат = ВРег(Результат);
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция ЗначениеОпределено(Значение)
	Возврат Значение <> Неопределено;
КонецФункции
Функция СериализоватьДанные(ДанныеСериализации, ДобавитьОтступы = Ложь) Экспорт
	Результат = "";
	Запись = Новый ЗаписьJSON;
	Запись.ПроверятьСтруктуру = Истина;
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.СериализовыватьМассивыКакОбъекты = Ложь;
	НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	Если ДобавитьОтступы Тогда
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(Неопределено, "  ");
		Запись.УстановитьСтроку(ПараметрыЗаписи);
	Иначе
		Запись.УстановитьСтроку();
	КонецЕсли;
	ЗаписатьJSON(Запись, ДанныеСериализации, НастройкиСериализации);
	Результат = Запись.Закрыть();
	Возврат Результат;
КонецФункции
Функция ДесериализоватьДанные(СтрокаJSON) Экспорт
	Результат = Неопределено;
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	Результат = ПрочитатьJSON(Чтение, Ложь);
	Возврат Результат;
КонецФункции
Функция ТипПлатформыНаСервере() Экспорт
	СисИнфо = Новый СистемнаяИнформация;
	Возврат сл2_Общий.ПолучитьПредставлениеПлатформы(СисИнфо.ТипПлатформы);
КонецФункции
Функция ВычислитьРазницуМеждуДатамиВИзмеренииСуток(ЛеваяДатаISO8601, ПраваяДатаISO8601)
	ЛеваяДата = Преобразование_ISO8601_ДатаВремя(ЛеваяДатаISO8601);
	ПраваяДата = Преобразование_ISO8601_ДатаВремя(ПраваяДатаISO8601);
	РазницаВСекундах = ПраваяДата - ЛеваяДата;
	РазницаВДнях = 0;
	Если РазницаВСекундах > 0 Тогда
		РазницаВДнях = Окр(РазницаВСекундах / 60 / 60 / 24, 2);
	КонецЕсли;
	Возврат РазницаВДнях;
КонецФункции
Функция СерверЛицензийДавноНеСинхронизировался(РазницаДатВСутках)
	Возврат РазницаДатВСутках >= 4;
КонецФункции
Функция ОпределитьДоступностьСборкиПоДатеВыпускаИСрокуДействияПодписки(РежимПроверкиПодписки, ДатаСборкиПродуктаISO8601, ДанныеПодписки, ДатаСервераЛицензийISO8601)
	ДатаСборкиПродукта = Преобразование_ISO8601_ДатаВремя(ДатаСборкиПродуктаISO8601);
	ДатаСервераЛицензий = Преобразование_ISO8601_ДатаВремя(ДатаСервераЛицензийISO8601);
	Если ЗначениеОпределено(ДанныеПодписки) Тогда
		ДатаИстеченияПодписки = Неопределено;
		Если ЗначениеОпределено(ДанныеПодписки.expirationDate) Тогда
			ДатаИстеченияПодписки = Преобразование_ISO8601_ДатаВремя(ДанныеПодписки.expirationDate);
		КонецЕсли;
		Если РежимПроверкиПодписки = 1 Тогда
			Возврат Не ЗначениеЗаполнено(ДатаИстеченияПодписки) Или ДатаСборкиПродукта < ДатаИстеченияПодписки;
		ИначеЕсли РежимПроверкиПодписки = 2 Тогда
			Возврат Не ЗначениеЗаполнено(ДатаИстеченияПодписки) Или ДатаСборкиПродукта < ДатаИстеченияПодписки + 2592000;
		Иначе
			Возврат Истина;
		КонецЕсли;
	Иначе
		Если РежимПроверкиПодписки = 1 Или РежимПроверкиПодписки = 2 Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
КонецФункции
Функция ПреобразоватьБуфер(Буфер, ВернутьДвоичныеДанные = Ложь)
	Результат = Неопределено;
	Если ТипЗнч(Буфер) = Тип("ДвоичныеДанные") Тогда
		ЦелевойБуфер = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(Буфер);
	Иначе
		ЦелевойБуфер = Буфер;
	КонецЕсли;
	БуферМаски = Новый БуферДвоичныхДанных(ЦелевойБуфер.Размер);
	Н = 100;
	Для итератор = 0 По ЦелевойБуфер.Размер - 1 Цикл
		БуферМаски.Установить(итератор, Н);
		Н = Н + 1;
		Если Н = 256 Тогда
			Н = 10;
		КонецЕсли;
	КонецЦикла;
	ЦелевойБуфер.ЗаписатьПобитовоеИсключительноеИли(0, БуферМаски, БуферМаски.Размер);
	Если ВернутьДвоичныеДанные Тогда
		Возврат ПолучитьДвоичныеДанныеИзБуфераДвоичныхДанных(ЦелевойБуфер);
	КонецЕсли;
КонецФункции
Функция ПолучитьИмяКомпьютера()
	Возврат ВРег(ИмяКомпьютера());
КонецФункции
Функция ПолучитьИмяЦелевойИБ()
	Возврат НРег(СтрокаСоединенияИнформационнойБазы());
КонецФункции
Функция ПроверитьВерсиюСервераЛицензий(ВерсияСервераЛицензий) Экспорт
	Результат = Истина;
	МинимальнаяВерсияСервераЛицензий = МинимальнаяВерсияСервераЛицензий();
	МассивКомпонентовВерсииСервера = СтрРазделить(ВерсияСервераЛицензий, ".", Истина);
	ПредыдущийРазрядБольше = Ложь;
	Для итератор = 0 По 3 Цикл
		Минимально = МинимальнаяВерсияСервераЛицензий[итератор];
		Получено = Число(МассивКомпонентовВерсииСервера[итератор]);
		Если Минимально > Получено Тогда
			Результат = Ложь;
			Прервать;
		ИначеЕсли Минимально < Получено Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции
Функция РазобратьСтрокуСоединения(СтрокаПодключения)
	Сервер = "127.0.0.1";
	Порт = 10700;
	ЧастиСтрокиПодключенияМассив = СтрРазделить(СтрокаПодключения, ":", Ложь);
	Если ЧастиСтрокиПодключенияМассив.Количество() > 0 Тогда
		Сервер = СокрЛП(ЧастиСтрокиПодключенияМассив[0]);
	КонецЕсли;
	Если ЧастиСтрокиПодключенияМассив.Количество() > 1 Тогда
		Попытка
			Порт = Число(СокрЛП(ЧастиСтрокиПодключенияМассив[1]));
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат Новый Структура("Сервер,Порт", Сервер, Порт);
КонецФункции
Функция ПлатформаНеНиже(В1, В2 = Неопределено, В3 = Неопределено, В4 = Неопределено, ТекущаяВерсияПлатформыМассив = Неопределено)
	Если ЗначениеОпределено(ТекущаяВерсияПлатформыМассив) Тогда
		ТекущаяВерсияПлатформы = ТекущаяВерсияПлатформыМассив;
	Иначе
		ТекущаяВерсияПлатформы = сл2_СерверКэшируемый.ПолучитьВерсиюПлатформы();
	КонецЕсли;
	Если ТекущаяВерсияПлатформы[0] < В1 Тогда
		Возврат Ложь;
	ИначеЕсли ТекущаяВерсияПлатформы[0] > В1 Тогда
		Возврат Истина;
	КонецЕсли;
	Если ЗначениеОпределено(В2) Тогда
		Если ТекущаяВерсияПлатформы[1] < В2 Тогда
			Возврат Ложь;
		ИначеЕсли ТекущаяВерсияПлатформы[1] > В2 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеОпределено(В3) Тогда
		Если ТекущаяВерсияПлатформы[2] < В3 Тогда
			Возврат Ложь;
		ИначеЕсли ТекущаяВерсияПлатформы[2] > В3 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеОпределено(В4) Тогда
		Если ТекущаяВерсияПлатформы[3] < В4 Тогда
			Возврат Ложь;
		ИначеЕсли ТекущаяВерсияПлатформы[3] > В4 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
КонецФункции
Функция ПолучитьОбъектКомпоненты(МестоположениеКомпоненты, Класс = "AddIn.LSCL.CryptoExtension")
	ОписаниеОшибки = "";
	Попытка
		Если ПлатформаНеНиже(8, 3, 21) Тогда
			СтрокаПодключенияБиблиотеки = "ПодключитьВнешнююКомпоненту(""" + МестоположениеКомпоненты + """, ""LSCL"", ТипВнешнейКомпоненты.Native, ТипПодключенияВнешнейКомпоненты.NotIsolated)";
			Результат = Вычислить(СтрокаПодключенияБиблиотеки);
		Иначе
			Результат = ПодключитьВнешнююКомпоненту(МестоположениеКомпоненты, "LSCL", ТипВнешнейКомпоненты.Native);
		КонецЕсли;
		Если Результат Тогда
			Возврат Новый(Класс, Неопределено);
		КонецЕсли;
	Исключение
		Результат = Ложь;
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	Если Не Результат Тогда
		ЗарегистрироватьОшибкуВЖурналРегистрации(?(ЗначениеЗаполнено(ОписаниеОшибки), ОписаниеОшибки, "Ошибка подключения библиотеки"), "lscl-native-lib");
	КонецЕсли;
КонецФункции
Функция napi_Зашифровать(Данные, МестоположениеКомпоненты = "ОбщийМакет.сл2", Ключ = Неопределено)
	КлючШифрованияДвоичныеДанные = Неопределено;
	ДобавитьПодпись = Истина;
	Если сл2_СерверКэшируемый.ПлатформаWindowsИлиLinux() Тогда
		Если ЗначениеЗаполнено(Ключ) Тогда
			КлючШифрованияДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(Ключ, КодировкаТекста.ANSI, Ложь);
		КонецЕсли;
		ДвоичныеДанные = Преобразование_Данные_ДвоичныеДанные(Данные);
		Шифрование = ПолучитьОбъектКомпоненты(МестоположениеКомпоненты);
		Результат = Шифрование.ЗашифроватьAES128CBC(ДвоичныеДанные, КлючШифрованияДвоичныеДанные, ДобавитьПодпись);
		Возврат Результат;
	Иначе
		ВызватьИсключение "На данный момент не поддерживается файловая база, запущенная через тонкий клиент на операционной системе MacOS.";
	КонецЕсли;
КонецФункции
Функция napi_Расшифровать(Данные, МестоположениеКомпоненты = "ОбщийМакет.сл2", Ключ = Неопределено, ПривестиКСтроке = Ложь)
	КлючШифрованияДвоичныеДанные = Неопределено;
	ПроверятьПодпись = Истина;
	Если сл2_СерверКэшируемый.ПлатформаWindowsИлиLinux() Тогда
		Если ЗначениеЗаполнено(Ключ) Тогда
			КлючШифрованияДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(Ключ, КодировкаТекста.ANSI, Ложь);
		КонецЕсли;
		ДвоичныеДанные = Преобразование_Данные_ДвоичныеДанные(Данные);
		Шифрование = ПолучитьОбъектКомпоненты(МестоположениеКомпоненты);
		Результат = Шифрование.РасшифроватьAES128CBC(ДвоичныеДанные, КлючШифрованияДвоичныеДанные, ПроверятьПодпись);
		Если ПривестиКСтроке Тогда
			Результат = ПолучитьСтрокуИзДвоичныхДанных(Результат);
		КонецЕсли;
		Возврат Результат;
	Иначе
		ВызватьИсключение "На данный момент не поддерживается файловая база, запущенная через тонкий клиент на операционной системе MacOS.";
	КонецЕсли;
КонецФункции
Функция ПротестироватьБиблиотеку() Экспорт
	Текст = "test";
	ЗамерВремени = НачатьЗамерВремени();
	ЗашифрованныеДвоичныеДанные = napi_Зашифровать(Текст);
	РасшифрованныеДанные = napi_Расшифровать(ЗашифрованныеДвоичныеДанные, , , Истина);
	ЗавершитьЗамерВремени(ЗамерВремени);
	Если Текст <> РасшифрованныеДанные Тогда
		ВызватьИсключение "Что-то пошло не так.";
	КонецЕсли;
	Возврат ЗамерВремени.Длительность;
КонецФункции
Функция ПолучитьКлючНастроекСеансовыхДанных(НомерСеанса = Неопределено)
	Если ЗначениеОпределено(НомерСеанса) Тогда
		Возврат "sd-" + Формат(НомерСеанса, "ЧГ=0");
	Иначе
		Возврат "sd-" + Формат(НомерСеансаИнформационнойБазы(), "ЧГ=0");
	КонецЕсли;
КонецФункции
Функция ПолучитьСеансовыеДанные(КлючНастроек = Неопределено)
	Если Не ЗначениеОпределено(КлючНастроек) Тогда
		КлючНастроек = ПолучитьКлючНастроекСеансовыхДанных();
	КонецЕсли;
	Результат = ХранилищеОбщихНастроек.Загрузить("сл2", КлючНастроек, , "");
	Если ЗначениеОпределено(Результат) Тогда
		Попытка
			АвтономныйРежим = ХранилищеОбщихНастроек.Загрузить("сл2", "ар", , "") = Истина;
			Если АвтономныйРежим Тогда
				НастройкиДвоичныеДанные = ПреобразоватьБуфер(Результат, Истина);
				РасшифрованныеСеансовыеДанные = ПолучитьСтрокуИзДвоичныхДанных(НастройкиДвоичныеДанные);
			Иначе
				РасшифрованныеСеансовыеДанные = napi_Расшифровать(Результат, , , Истина);
			КонецЕсли;
			Результат = ДесериализоватьДанные(РасшифрованныеСеансовыеДанные);
		Исключение
			ЗарегистрироватьОшибкуВЖурналРегистрации(ОписаниеОшибки(), "Сеансовые данные.Загрузка");
			Результат = TClientSessionData();
			УстановитьСеансовыеДанные(Результат);
		КонецПопытки;
	Иначе
		Результат = TClientSessionData();
		УстановитьСеансовыеДанные(Результат);
	КонецЕсли;
	Возврат Результат;
КонецФункции
Процедура УстановитьСеансовыеДанные(СеансовыеДанныеСтруктура, КлючНастроек = Неопределено)
	Если Не ЗначениеОпределено(КлючНастроек) Тогда
		КлючНастроек = ПолучитьКлючНастроекСеансовыхДанных();
	КонецЕсли;
	Попытка
		АвтономныйРежим = ХранилищеОбщихНастроек.Загрузить("сл2", "ар", , "") = Истина;
		Если АвтономныйРежим Тогда
			СериализованныеДанные = СериализоватьДанные(СеансовыеДанныеСтруктура);
			СериализованныеДанныеДвДанные = ПолучитьДвоичныеДанныеИзСтроки(СериализованныеДанные);
			ЗашифрованныеСеансовыеДанные = ПреобразоватьБуфер(СериализованныеДанныеДвДанные, Истина);
		Иначе
			ЗашифрованныеСеансовыеДанные = napi_Зашифровать(СеансовыеДанныеСтруктура);
		КонецЕсли;
		ХранилищеОбщихНастроек.Сохранить("сл2", КлючНастроек, ЗашифрованныеСеансовыеДанные, , "");
	Исключение
		ЗарегистрироватьОшибкуВЖурналРегистрации(ОписаниеОшибки(), "Сеансовые данные.Сохранение");
	КонецПопытки;
КонецПроцедуры
Процедура ПочиститьУстаревшиеСеансовыеДанные()
	СеансыИнформационнойБазы = ПолучитьСеансыИнформационнойБазы();
	НомерТекущегоСеансаИБ = НомерСеансаИнформационнойБазы();
	МассивАктуальныхСеансовыхДанных = Новый Массив;
	Для каждого ЭлементЗн Из СеансыИнформационнойБазы Цикл
		Если ЭлементЗн.ИмяПриложения = "1CV8" Или ЭлементЗн.ИмяПриложения = "1CV8C" Или ЭлементЗн.ИмяПриложения = "WebClient" Тогда
			КлючНастроек = ПолучитьКлючНастроекСеансовыхДанных(ЭлементЗн.НомерСеанса);
			МассивАктуальныхСеансовыхДанных.Добавить(КлючНастроек);
		КонецЕсли;
	КонецЦикла;
	СеансовыеДанныеСписокЗначений = ХранилищеОбщихНастроек.ПолучитьСписок("сл2", "");
	Для каждого ИмяНастроек Из СеансовыеДанныеСписокЗначений Цикл
		Если Лев(ИмяНастроек.Значение, 3) = "sd-" Тогда
			Если Не ЗначениеОпределено(МассивАктуальныхСеансовыхДанных.Найти(ИмяНастроек.Значение)) Тогда
				Попытка
					Попытка 	Если сл2_СерверКэшируемый.ЭтоСервернаяБаза() Тогда
							СеансовыеДанные = ПолучитьСеансовыеДанные(ИмяНастроек.Значение);
							Для каждого СостояниеЛицензированияПродукта Из СеансовыеДанные.СостоянияЛицензированияПродуктов Цикл
								ОсвободитьЛицензиюНаСеанс(СостояниеЛицензированияПродукта.productInfo, СостояниеЛицензированияПродукта.lockedSession.poolCId, СостояниеЛицензированияПродукта.lockedSession.sessionId, Ложь, Неопределено, СостояниеЛицензированияПродукта.connectionSettingsSnapshot, СеансовыеДанные.ДанныеАвтономногоРежима);
							КонецЦикла;
						КонецЕсли;
					Исключение
					КонецПопытки;
					ХранилищеОбщихНастроек.Удалить("сл2", ИмяНастроек.Значение, "");
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
Процедура ОбновитьСтруктуруНастроек(Настройки)
	Если ЗначениеОпределено(Настройки) Тогда
		НастройкиБылиОбновлены = Ложь;
		Если ЗначениеОпределено(Настройки) Тогда
			Если Настройки.structureVersion = 1 Тогда
				СкрытыеУведомления = Новый Структура("СрокДействияПодпискиИстекает, СрокДействияПодпискиИстек", Неопределено, Неопределено);
				Настройки.Вставить("СкрытыеУведомления", СкрытыеУведомления);
				Настройки.structureVersion = 1.01;
				НастройкиБылиОбновлены = Истина;
			КонецЕсли;
			Если Настройки.structureVersion = 1.01 Тогда
				Настройки.Вставить("ПереопределениеИзПараметраЗапуска", Неопределено);
				Настройки.structureVersion = 1.02;
				НастройкиБылиОбновлены = Истина;
			КонецЕсли;
			Если Настройки.structureVersion = 1.02 Тогда
				Если Настройки.Свойство("ПереопределениеИзПараметраЗапуска") Тогда
					Настройки.Удалить("ПереопределениеИзПараметраЗапуска");
				КонецЕсли;
				Настройки.Вставить("НастройкамиУправляетОблачныйХостер", Ложь);
				Настройки.structureVersion = 1.03;
				НастройкиБылиОбновлены = Истина;
			КонецЕсли;
		КонецЕсли;
		Если НастройкиБылиОбновлены Тогда
			Если Настройки.ДляВсехПользователей Тогда
				УстановитьОбщиеНастройки(Настройки);
			Иначе
				УстановитьПерсональныеНастройки(Настройки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
Функция ПолучитьОбщиеНастройки() Экспорт
	Попытка
		ОбщиеНастройкиСтруктура = ХранилищеОбщихНастроек.Загрузить("сл2", "ОбщиеНастройки", , "");
	Исключение
		Если Не ЗначениеОпределено(ОбщиеНастройкиСтруктура) Тогда
			ОбщиеНастройкиСтруктура = TClientSettings(Истина);
			УстановитьОбщиеНастройки(ОбщиеНастройкиСтруктура);
		КонецЕсли;
	КонецПопытки;
	Если ЗначениеОпределено(ОбщиеНастройкиСтруктура) Тогда
		ОбщиеНастройкиСтруктура.ДляВсехПользователей = Истина;
	КонецЕсли;
	ОбновитьСтруктуруНастроек(ОбщиеНастройкиСтруктура);
	Возврат ОбщиеНастройкиСтруктура;
КонецФункции
Функция ПолучитьПерсональныеНастройки(ИмяПользователя = Неопределено) Экспорт
	Попытка
		ПерсональныеНастройкиСтруктура = ХранилищеОбщихНастроек.Загрузить("сл2", "ПерсональныеНастройки", , ИмяПользователя);
	Исключение
	КонецПопытки;
	Если Не ЗначениеОпределено(ПерсональныеНастройкиСтруктура) Тогда
		ПерсональныеНастройкиСтруктура = TClientSettings(Ложь);
		ХранилищеОбщихНастроек.Сохранить("сл2", "ПерсональныеНастройки", ПерсональныеНастройкиСтруктура, , ИмяПользователя);
	КонецЕсли;
	ПерсональныеНастройкиСтруктура.ДляВсехПользователей = Ложь;
	ОбновитьСтруктуруНастроек(ПерсональныеНастройкиСтруктура);
	Возврат ПерсональныеНастройкиСтруктура;
КонецФункции
Функция РегламентноеЗаданиеОтключено() Экспорт
	Результат = Ложь;
	РЗМетаданные = Метаданные.РегламентныеЗадания.Найти("сл2_МенеджерСеансов");
	Если ЗначениеОпределено(РЗМетаданные) Тогда
		РЗ = РегламентныеЗадания.НайтиПредопределенное(РЗМетаданные);
		Результат = Не РЗ.Использование;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Процедура НастроитьРегламентноеЗадание()
	РЗМетаданные = Метаданные.РегламентныеЗадания.Найти("сл2_МенеджерСеансов");
	Если ЗначениеОпределено(РЗМетаданные) Тогда
		РЗ = РегламентныеЗадания.НайтиПредопределенное(РЗМетаданные);
		Месяцы = Новый Массив;
		Для итератор = 1 По 12 Цикл
			Месяцы.Добавить(итератор);
		КонецЦикла;
		Дни = Новый Массив;
		Для итератор = 1 По 7 Цикл
			Дни.Добавить(итератор);
		КонецЦикла;
		РасписаниеРЗ = Новый РасписаниеРегламентногоЗадания;
		РасписаниеРЗ.ПериодНедель = 1;
		РасписаниеРЗ.ПериодПовтораДней = 1;
		РасписаниеРЗ.ПериодПовтораВТечениеДня = 20;
		РасписаниеРЗ.Месяцы = Месяцы;
		РасписаниеРЗ.ДниНедели = Дни;
		РЗ.ИнтервалПовтораПриАварийномЗавершении = 0;
		РЗ.КоличествоПовторовПриАварийномЗавершении = 0;
		РЗ.Расписание = РасписаниеРЗ;
		РЗ.Использование = сл2_СерверКэшируемый.ЭтоСервернаяБаза();
		РЗ.Записать();
	КонецЕсли;
КонецПроцедуры
Процедура РегламентноеЗаданиеМенеджерСеансов() Экспорт
	Если сл2_СерверКэшируемый.ЭтоСервернаяБаза() Тогда
		ПочиститьУстаревшиеСеансовыеДанные();
	КонецЕсли;
КонецПроцедуры
Процедура ФоновоеЗаданиеМенеджерСеансов(КлючНастроек) Экспорт
	СохранитьИзменения = Ложь;
	СеансовыеДанные = ПолучитьСеансовыеДанные(КлючНастроек);
	ПриоритетнаяСтрокаСоединения = СеансовыеДанные.ПриоритетнаяСтрокаСоединения;
	Для каждого СостояниеЛицензированияПродукта Из СеансовыеДанные.СостоянияЛицензированияПродуктов Цикл
		Если ЗначениеОпределено(СостояниеЛицензированияПродукта.lockedSession) Тогда
			МассивСеансов = Новый Массив;
			МассивСеансов.Добавить(СостояниеЛицензированияПродукта.lockedSession.sessionId);
			СоответствиеПулМассивСеансов = Новый Соответствие;
			СоответствиеПулМассивСеансов.Вставить(СостояниеЛицензированияПродукта.lockedSession.poolCId, МассивСеансов);
			РезультатВызова = lsAPI_TouchLicenseSessions(СостояниеЛицензированияПродукта.productInfo.productId, СостояниеЛицензированияПродукта.productInfo.productVersion, СостояниеЛицензированияПродукта.productInfo.productKey, СостояниеЛицензированияПродукта.productInfo.productKeyAddon, СоответствиеПулМассивСеансов, ПриоритетнаяСтрокаСоединения, СеансовыеДанные.ДанныеАвтономногоРежима);
			Если НетОшибок(РезультатВызова) Тогда
				Если РезультатВызова.data.responseData.invalidSessionIds.Количество() = 1 Тогда
					РезультатВызова = lsAPI_LockLicenseSession(СостояниеЛицензированияПродукта.productInfo.productId, СостояниеЛицензированияПродукта.productInfo.productVersion, СостояниеЛицензированияПродукта.productInfo.productKey, СостояниеЛицензированияПродукта.productInfo.productKeyAddon, ПриоритетнаяСтрокаСоединения, СеансовыеДанные.ДанныеАвтономногоРежима);
					Если НетОшибок(РезультатВызова) Тогда
						СостояниеЛицензированияПродукта.error = Неопределено;
						СостояниеЛицензированияПродукта.lockedSession = РезультатВызова.data.responseData;
					Иначе
						СостояниеЛицензированияПродукта.error = РезультатВызова;
						СостояниеЛицензированияПродукта.lockedSession = Неопределено;
						ТребуетсяОткрытьФормуКлиентаЛицензирования = Истина;
					КонецЕсли;
					СохранитьИзменения = Истина;
				КонецЕсли;
			Иначе
				СостояниеЛицензированияПродукта.error = РезультатВызова;
				СостояниеЛицензированияПродукта.lockedSession = Неопределено;
				СохранитьИзменения = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если СеансовыеДанные.ПриоритетнаяСтрокаСоединения <> ПриоритетнаяСтрокаСоединения Тогда
		СеансовыеДанные.ПриоритетнаяСтрокаСоединения = ПриоритетнаяСтрокаСоединения;
		СохранитьИзменения = Истина;
	КонецЕсли;
	Если СохранитьИзменения Тогда
		УстановитьСеансовыеДанные(СеансовыеДанные, КлючНастроек);
	КонецЕсли;
КонецПроцедуры
Процедура ОбработчикОжиданияФайловойБазы() Экспорт
	ИдентификаторФЗ = Неопределено;
	ФЗ = Неопределено;
	Попытка
		ИдентификаторФЗ = ХранилищеОбщихНастроек.Загрузить("сл2", "ИдентификаторФЗ");
	Исключение
	КонецПопытки;
	Если ЗначениеОпределено(ИдентификаторФЗ) Тогда
		ФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФЗ);
		Если ЗначениеОпределено(ФЗ) И ФЗ.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			ФЗ.Отменить();
		КонецЕсли;
	КонецЕсли;
	ПараметрыФЗ = Новый Массив;
	КлючНастроек = ПолучитьКлючНастроекСеансовыхДанных();
	ПараметрыФЗ.Добавить(КлючНастроек);
	ФЗ = ФоновыеЗадания.Выполнить("сл2_Сервер.ФоновоеЗаданиеМенеджерСеансов", ПараметрыФЗ);
	ХранилищеОбщихНастроек.Сохранить("сл2", "ИдентификаторФЗ", ФЗ.УникальныйИдентификатор);
КонецПроцедуры
Функция Преобразование_ДатаВремя_ISO8601(ДатаВремя, ВремяВUTC = Ложь, ЧасовойПоясЧасы = Неопределено, ЧасовойПоясМинуты = Неопределено) Экспорт
	ДатаВремяСтрока = Формат(ДатаВремя, "ДФ=гггг-ММ-ддTЧЧ:мм:сс");
	Если ВремяВUTC Тогда
		ДатаВремяСтрока = ДатаВремяСтрока + "Z";
	ИначеЕсли ЧасовойПоясЧасы <> Неопределено Или ЧасовойПоясМинуты <> Неопределено Тогда
		Если ЧасовойПоясЧасы <> Неопределено Тогда
			ДатаВремяСтрока = ДатаВремяСтрока + ?(ЧасовойПоясЧасы > 0, "+", "-") + Формат(ЧасовойПоясЧасы, "ЧЦ=2; ЧДЦ=; ЧН=0; ЧВН=; ЧГ=0") + ":";
		Иначе
			ДатаВремяСтрока = ДатаВремяСтрока + ?(ЧасовойПоясМинуты > 0, "+", "-") + "00:";
		КонецЕсли;
		Если ЧасовойПоясМинуты <> Неопределено Тогда
			ДатаВремяСтрока = ДатаВремяСтрока + Формат(ЧасовойПоясМинуты, "ЧЦ=2; ЧДЦ=; ЧН=0; ЧВН=; ЧГ=0");
		Иначе
			ДатаВремяСтрока = ДатаВремяСтрока + "00";
		КонецЕсли;
	КонецЕсли;
	Возврат ДатаВремяСтрока;
КонецФункции
Функция Преобразование_ISO8601_ДатаВремя(ISO8601) Экспорт
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку("{""date"": """ + ISO8601 + """}");
	Возврат ПрочитатьJSON(Чтение, Ложь, "date", ФорматДатыJSON.ISO).date;
КонецФункции
Функция Преобразование_Данные_ДвоичныеДанные(Данные) Экспорт
	Результат = Неопределено;
	Если ТипЗнч(Данные) = Тип("Строка") Тогда
		Результат = ПолучитьДвоичныеДанныеИзСтроки(Данные, КодировкаТекста.UTF8, Ложь);
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура") Тогда
		СериализованнаяСтруктура = СериализоватьДанные(Данные);
		Результат = ПолучитьДвоичныеДанныеИзСтроки(СериализованнаяСтруктура, КодировкаТекста.UTF8, Ложь);
	ИначеЕсли ТипЗнч(Данные) = Тип("БуферДвоичныхДанных") Тогда
		Результат = ПолучитьДвоичныеДанныеИзБуфераДвоичныхДанных(Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
		Возврат Данные;
	Иначе
		ВызватьИсключение "Неподдерживаемый тип данных";
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция TApiResult(КодРезультата, Описание, Комментарий = "", Данные = Неопределено, Ресурс = "", ДлительностьИсполнения = -1, ДлительностьИсполненияВызова = -1) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("type", "TApiResult");
	Результат.Вставить("structureVersion", 1);
	Результат.Вставить("code", КодРезультата);
	Результат.Вставить("description", Описание);
	Результат.Вставить("comment", Комментарий);
	Результат.Вставить("data", Данные);
	Результат.Вставить("resource", Ресурс);
	Результат.Вставить("executionTime", ДлительностьИсполнения);
	Результат.Вставить("executionTimeHttp", ДлительностьИсполненияВызова);
	Возврат Результат;
КонецФункции
Функция TClientInitializationSettings() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("type", "TClientInitializationSettings");
	Результат.Вставить("structureVersion", 1);
	Результат.Вставить("ДоступенВыборВерсииПродукта", Ложь);
	Возврат Результат;
КонецФункции
Функция TLicenseServerInfo(ИнформацияСервераЛицензий, АвтономныеДанные = Неопределено)
	Результат = Новый Структура;
	Результат.Вставить("type", "TLicenseServerInfo");
	Результат.Вставить("structureVersion", 1);
	Результат.Вставить("info", ИнформацияСервераЛицензий);
	Результат.Вставить("ХэшИстекающихЛицензий", Неопределено);
	Результат.Вставить("ХэшИстекшихЛицензий", Неопределено);
	Результат.Вставить("ХэшИстекающихПодписок", Неопределено);
	Результат.Вставить("ХэшИстекшихПодписок", Неопределено);
	Результат.Вставить("СерверЛицензийДавноНеСинхронизировался", Ложь);
	Если Не ЗначениеОпределено(АвтономныеДанные) Тогда
		РазницаДатВСутках = ВычислитьРазницуМеждуДатамиВИзмеренииСуток(ИнформацияСервераЛицензий.syncDate, ИнформацияСервераЛицензий.serverTime);
		Результат.СерверЛицензийДавноНеСинхронизировался = СерверЛицензийДавноНеСинхронизировался(РазницаДатВСутках);
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция TClientSettings(ДляВсехПользователей = Ложь, МетаданныеСервераЛицензий = Неопределено) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("type", "TClientSettings");
	Результат.Вставить("structureVersion", 1.03);
	Результат.Вставить("АдресСервераЛицензий", "127.0.0.1");
	Результат.Вставить("ИспользоватьПроксиСервер", Ложь);
	Результат.Вставить("ПолучатьЛицензиюПриЗапуске", Истина);
	Результат.Вставить("ОпределенныйПулЛицензий", Ложь);
	Результат.Вставить("ПулыЛицензий", "");
	Результат.Вставить("ДляВсехПользователей", ДляВсехПользователей);
	Результат.Вставить("МетаданныеСервераЛицензий", МетаданныеСервераЛицензий);
	Результат.Вставить("НастройкамиУправляетОблачныйХостер", Ложь);
	СкрытыеУведомления = Новый Структура("СрокДействияПодпискиИстекает, СрокДействияПодпискиИстек", Неопределено, Неопределено);
	Результат.Вставить("СкрытыеУведомления", СкрытыеУведомления);
	Возврат Результат;
КонецФункции
Функция TClientConnectionSettings(НастройкиКлиентаЛицензирования = Неопределено, ПриоритетнаяСтрокаСоединения = Неопределено)
	Если Не ЗначениеОпределено(НастройкиКлиентаЛицензирования) Тогда
		НастройкиКлиентаЛицензирования = ПолучитьНастройки();
	КонецЕсли;
	ИспользоватьПроксиСервер = НастройкиКлиентаЛицензирования.ИспользоватьПроксиСервер;
	МассивСтрокСоединения = СтрРазделить(НастройкиКлиентаЛицензирования.АдресСервераЛицензий, ";", Ложь);
	СтрокиСоединенияСерверовЛицензий = Новый Массив;
	Если ЗначениеОпределено(ПриоритетнаяСтрокаСоединения) Тогда
		СтрокиСоединенияСерверовЛицензий.Добавить(ПриоритетнаяСтрокаСоединения);
	ИначеЕсли МассивСтрокСоединения.Количество() = 0 Тогда
		СтрокиСоединенияСерверовЛицензий.Добавить("127.0.0.1:10700");
	КонецЕсли;
	Для каждого СтрокаСоединения Из МассивСтрокСоединения Цикл
		СтрокаСоединенияСокрЛП = СокрЛП(СтрокаСоединения);
		Если СтрокаСоединенияСокрЛП <> ПриоритетнаяСтрокаСоединения Тогда
			СтрокиСоединенияСерверовЛицензий.Добавить(СтрокаСоединенияСокрЛП);
		КонецЕсли;
	КонецЦикла;
	Пулы = Новый Массив;
	Если НастройкиКлиентаЛицензирования.ОпределенныйПулЛицензий Тогда
		Пулы = СтрРазделить(НастройкиКлиентаЛицензирования.ПулыЛицензий, ";", Ложь);
	КонецЕсли;
	Результат = Новый Структура;
	Результат.Вставить("type", "TClientConnectionSettings");
	Результат.Вставить("structureVersion", 1.01);
	Результат.Вставить("СтрокиСоединенияСерверовЛицензий", СтрокиСоединенияСерверовЛицензий);
	Результат.Вставить("SSL", Ложь);
	Результат.Вставить("Логин", "");
	Результат.Вставить("Пароль", "");
	Результат.Вставить("ПулыЛицензий", Пулы);
	Результат.Вставить("ProxyИспользуется", НастройкиКлиентаЛицензирования.ИспользоватьПроксиСервер);
	Результат.Вставить("ProxyНастройкиИзСистемы", Истина);
	Результат.Вставить("ProxyИспользоватьАутентификациюОС", Ложь);
	Результат.Вставить("ProxyСервер", "");
	Результат.Вставить("ProxyПорт", Неопределено);
	Результат.Вставить("ProxyЛогин", "");
	Результат.Вставить("ProxyПароль", "");
	Результат.Вставить("ProxyИспользоватьДляЛокальныхАдресов", Ложь);
	Возврат Результат;
КонецФункции
Функция TClientSessionData()
	Результат = Новый Структура;
	Результат.Вставить("type", "TClientSessionData");
	Результат.Вставить("structureVersion", 1.01);
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	СеансИнформационнойБазыСтруктура = Новый Структура;
	СеансИнформационнойБазыСтруктура.Вставить("УникальныйНомерСеанса", ТекущийСеансИнформационнойБазы.НомерСеанса);
	СеансИнформационнойБазыСтруктура.Вставить("НачалоСеанса", ТекущийСеансИнформационнойБазы.НачалоСеанса);
	СеансИнформационнойБазыСтруктура.Вставить("ИмяКомпьютера", ТекущийСеансИнформационнойБазы.ИмяКомпьютера);
	Результат.Вставить("СеансИнформационнойБазы", СеансИнформационнойБазыСтруктура);
	Результат.Вставить("ДоступенВыборВерсииПродукта", Ложь);
	Результат.Вставить("СерверЛицензийДоступен", Ложь);
	Результат.Вставить("СостоянияЛицензированияПродуктов", Новый Массив);
	Результат.Вставить("ДанныеАвтономногоРежима", Неопределено);
	Результат.Вставить("ПриоритетнаяСтрокаСоединения", Неопределено);
	Возврат Результат;
КонецФункции
Функция TClientProductLicenseStatus(МетаданныеПродукта, ДанныеСессииСервераЛицензий = Неопределено, СостояниеПодписки = Неопределено, СнимокНастроекПодключения = Неопределено, Ошибка = Неопределено)
	Результат = Новый Структура;
	Результат.Вставить("type", "TClientProductLicenseStatus");
	Результат.Вставить("structureVersion", 1.01);
	Результат.Вставить("productInfo", МетаданныеПродукта);
	Результат.Вставить("lockedSession", ДанныеСессииСервераЛицензий);
	Результат.Вставить("lockSessionCacheExpireDateISO8601", Неопределено);
	Результат.Вставить("subscriptionStatus", СостояниеПодписки);
	Результат.Вставить("subscriptionCheckNotAvailable", Истина);
	Результат.Вставить("connectionSettingsSnapshot", СнимокНастроекПодключения);
	Результат.Вставить("error", Ошибка);
	Возврат Результат;
КонецФункции
Функция TLicensedProductInfo(ПолноеНаименование, ВерсияПродукта, ДатаСборки, ИдентификаторПродукта, КлючШифрования, ИдентификаторВидаПодпискиТС = Неопределено, РежимПроверкиПодписки = 4) Экспорт
	ДатаСборкиISO8601 = Преобразование_ДатаВремя_ISO8601(Дата(СокрЛП(ДатаСборки)), Ложь);
	Результат = Новый Структура;
	Результат.Вставить("type", "TLicensedProductInfo");
	Результат.Вставить("structureVersion", 1);
	Результат.Вставить("productId", НРег(СокрЛП(ИдентификаторПродукта)));
	Результат.Вставить("productVersion", НРег(СокрЛП(ВерсияПродукта)));
	Результат.Вставить("productReleaseDate", ДатаСборкиISO8601);
	Результат.Вставить("productKey", СокрЛП(КлючШифрования));
	SHA256 = Новый ХешированиеДанных(ХешФункция.SHA256);
	SHA256.Добавить(ПолучитьДвоичныеДанныеИзСтроки(Результат.productId, КодировкаТекста.ANSI, Ложь));
	ИдентификаторПродуктаSHA256 = ПолучитьHexСтрокуИзДвоичныхДанных(SHA256.ХешСумма);
	Результат.Вставить("productKeyAddon", НРег(ИдентификаторПродуктаSHA256));
	Результат.Вставить("productName", СокрЛП(ПолноеНаименование));
	Результат.Вставить("maintenanceSubscriptionId", ИдентификаторВидаПодпискиТС);
	Результат.Вставить("maintenanceSubscriptionCheckMode", РежимПроверкиПодписки);
	Возврат Результат;
КонецФункции
Функция TGateRequest(НаименованиеМетода, ИдентификаторПродукта, ВерсияПродукта, ДанныеЗапроса)
	МетаданныеМетода = Новый Структура("methodName,requestId", НаименованиеМетода, UUID());
	ДанныеКлиентаЛицензирования = Новый Структура;
	ДанныеКлиентаЛицензирования.Вставить("clientName", "lscl-1c");
	ДанныеКлиентаЛицензирования.Вставить("clientVersion", ВерсияКлиентаЛицензирования());
	ДанныеКлиентаЛицензирования.Вставить("softwareProductId", ИдентификаторПродукта);
	ДанныеКлиентаЛицензирования.Вставить("softwareProductVersion", ВерсияПродукта);
	ДанныеКлиентаЛицензирования.Вставить("userName", Строка(ПользователиИнформационнойБазы.ТекущийПользователь()));
	Результат = Новый Структура;
	Результат.Вставить("type", "TGateRequest");
	Результат.Вставить("structureVersion", 1);
	Результат.Вставить("requestInfo", МетаданныеМетода);
	Результат.Вставить("clientInfo", ДанныеКлиентаЛицензирования);
	Результат.Вставить("requestData", ДанныеЗапроса);
	Возврат Результат;
КонецФункции
Функция TGateRequestLockLicenseSession(МассивЦелевыхПулов, ОсвобождатьСеансВручную = Ложь)
	Результат = Новый Структура;
	Результат.Вставить("type", "TGateRequestLockLicenseSession");
	Результат.Вставить("structureVersion", 1);
	Результат.Вставить("manualRelease", ОсвобождатьСеансВручную);
	Результат.Вставить("poolCIds", МассивЦелевыхПулов);
	Возврат Результат;
КонецФункции
Функция TGateRequestTouchLicenseSessions(СоответствиеПулМассивСеансов)
	Результат = Новый Структура;
	Результат.Вставить("type", "TGateRequestTouchLicenseSessions");
	Результат.Вставить("structureVersion", 1);
	Результат.Вставить("pools", Новый Массив);
	Для каждого ЭлементЗн Из СоответствиеПулМассивСеансов Цикл
		СеансыПула = Новый Структура;
		СеансыПула.Вставить("poolCId", ЭлементЗн.Ключ);
		СеансыПула.Вставить("sessionIds", ЭлементЗн.Значение);
		Результат.pools.Добавить(СеансыПула);
	КонецЦикла;
	Возврат Результат;
КонецФункции
Функция TGateRequestReleaseLicenseSession(ИдентификаторПулаЛицензий, ИдентификаторСеанса)
	Результат = Новый Структура;
	Результат.Вставить("type", "TGateRequestReleaseLicenseSession");
	Результат.Вставить("structureVersion", 1);
	Результат.Вставить("poolCId", ИдентификаторПулаЛицензий);
	Результат.Вставить("sessionId", ИдентификаторСеанса);
	Возврат Результат;
КонецФункции
Функция TGateRequestGetLicenseParameter(МассивЦелевыхПулов, ИдентификаторПараметра)
	Результат = Новый Структура;
	Результат.Вставить("type", "TGateRequestGetLicenseParameter");
	Результат.Вставить("structureVersion", 1);
	Результат.Вставить("poolCIds", МассивЦелевыхПулов);
	Результат.Вставить("parameterId", ИдентификаторПараметра);
	Возврат Результат;
КонецФункции
Функция TGateRequestGetSubscriptionDetails(ИдентификаторВидаПодписки)
	Результат = Новый Структура;
	Результат.Вставить("type", "TGateRequestGetSubscriptionDetails");
	Результат.Вставить("structureVersion", 1);
	Результат.Вставить("subscriptionTypeId", ИдентификаторВидаПодписки);
	Возврат Результат;
КонецФункции
Функция TGateRequestCheckProductAvailability(МассивЦелевыхПулов, ИдентификаторыПродуктов)
	Результат = Новый Структура;
	Результат.Вставить("type", "TGateRequestCheckProductAvailability");
	Результат.Вставить("structureVersion", 1);
	Результат.Вставить("poolCIds", МассивЦелевыхПулов);
	Результат.Вставить("productIds", ИдентификаторыПродуктов);
	Возврат Результат;
КонецФункции
Функция lsAPI_Выполнить(НастройкиСоединения, ИспользованнаяСтрокаСоединения = Неопределено, ТелоЗапросаДвоичныеДанные = Неопределено, ЗаголовкиЗапроса, КлючШифрования = Неопределено, КлючШифрованияДополнение = "", Ресурс = "/api/v1/gate")
	ОбщийЗамер = НачатьЗамерВремени();
	Результат = СоздатьРезультат();
	НачалоИсполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	OpenSSL = Новый ЗащищенноеСоединениеOpenSSL;
	Если НастройкиСоединения.ProxyИспользуется Тогда
		Если НастройкиСоединения.ProxyНастройкиИзСистемы Тогда
			Прокси = Новый ИнтернетПрокси(Истина);
		Иначе
			Прокси = Новый ИнтернетПрокси(Ложь);
			Прокси.Установить(?(НастройкиСоединения.SSL, "https", "http"), НастройкиСоединения.ProxyСервер, НастройкиСоединения.ProxyПорт, НастройкиСоединения.ProxyЛогин, НастройкиСоединения.ProxyПароль, НастройкиСоединения.ProxyИспользоватьАутентификациюОС);
			Прокси.НеИспользоватьПроксиДляЛокальныхАдресов = Не НастройкиСоединения.ProxyИспользоватьДляЛокальныхАдресов;
		КонецЕсли;
	Иначе
		Прокси = Новый ИнтернетПрокси(Ложь);
		Прокси.НеИспользоватьПроксиДляЛокальныхАдресов = Истина;
	КонецЕсли;
	ИсходящиеЗаголовки = ?(ЗаголовкиЗапроса = Неопределено, Новый Соответствие, ЗаголовкиЗапроса);
	Если ЗначениеОпределено(КлючШифрования) Тогда
		ИсходящиеЗаголовки.Вставить("Content-Encoding-LS", "ls2.v1");
		ИсходящиеЗаголовки.Вставить("Content-Location", КлючШифрованияДополнение);
	КонецЕсли;
	Запрос = Новый HTTPЗапрос(Ресурс, ИсходящиеЗаголовки);
	Если ЗначениеОпределено(ТелоЗапросаДвоичныеДанные) Тогда
		Если ЗначениеОпределено(КлючШифрования) Тогда
			Попытка
				ТелоЗапросаДвоичныеДанные = napi_Зашифровать(ТелоЗапросаДвоичныеДанные, , КлючШифрования);
			Исключение
				Результат = СоздатьРезультат(1011);
			КонецПопытки;
		КонецЕсли;
		Если НетОшибок(Результат) Тогда
			Запрос.УстановитьТелоИзДвоичныхДанных(ТелоЗапросаДвоичныеДанные);
		КонецЕсли;
	КонецЕсли;
	Если НетОшибок(Результат) Тогда
		Для каждого СтрокаСоединения Из НастройкиСоединения.СтрокиСоединенияСерверовЛицензий Цикл
			Результат = СоздатьРезультат();
			АдресСервера = РазобратьСтрокуСоединения(СтрокаСоединения);
			Соединение = Новый HTTPСоединение(АдресСервера.Сервер, АдресСервера.Порт, НастройкиСоединения.Логин, НастройкиСоединения.Пароль, Прокси, 4, ?(НастройкиСоединения.SSL, OpenSSL, Неопределено), Ложь);
			НачалоИсполненияHttp = ТекущаяУниверсальнаяДатаВМиллисекундах();
			Попытка
				HTTPОтвет = Соединение.ОтправитьДляОбработки(Запрос);
			Исключение
				Результат = СоздатьРезультат(1001, ОписаниеОшибки());
			КонецПопытки;
			Результат.executionTimeHttp = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоИсполненияHttp;
			Если Результат.code <> 1001 Тогда
				ИспользованнаяСтрокаСоединения = СтрокаСоединения;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если НетОшибок(Результат) Тогда
		ЗаголовкиОтвета = Новый Соответствие;
		Для каждого КлючИЗначение Из HTTPОтвет.Заголовки Цикл
			ЗаголовкиОтвета.Вставить(НРег(КлючИЗначение.Ключ), НРег(КлючИЗначение.Значение));
		КонецЦикла;
		ТипКонтентаОтвета = ЗаголовкиОтвета.Получить("content-type");
		Если HTTPОтвет.КодСостояния = 200 Тогда
			Если ЗначениеОпределено(ТипКонтентаОтвета) И Лев(ТипКонтентаОтвета, 16) = "application/json" Тогда
				ТелоОтветаДвоичныеДанные = HTTPОтвет.ПолучитьТелоКакДвоичныеДанные();
				Если ЗаголовкиОтвета.Получить("content-encoding-ls") = "ls2.v1" Тогда
					Попытка
						ТелоОтветаДвоичныеДанные = napi_Расшифровать(ТелоОтветаДвоичныеДанные, , КлючШифрования);
					Исключение
						Результат = СоздатьРезультат(1012);
					КонецПопытки;
				КонецЕсли;
				Если НетОшибок(Результат) Тогда
					ТелоОтветаКакСтрока = ПолучитьСтрокуИзДвоичныхДанных(ТелоОтветаДвоичныеДанные, КодировкаТекста.UTF8);
					Попытка
						Результат.data = ДесериализоватьДанные(ТелоОтветаКакСтрока);
					Исключение
						Результат = СоздатьРезультат(1002, ОписаниеОшибки());
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Результат = СоздатьРезультат(1003, "HTTP " + Формат(HTTPОтвет.КодСостояния, "ЧН=0; ЧГ=0"), , Ресурс, , Результат.executionTimeHttp);
			Если ЗначениеОпределено(ТипКонтентаОтвета) И Лев(ТипКонтентаОтвета, 16) = "application/json" Тогда
				Попытка
					ТелоОтветаДвоичныеДанные = HTTPОтвет.ПолучитьТелоКакДвоичныеДанные();
					Если ЗаголовкиОтвета.Получить("content-encoding-ls") = "ls2.v1" Тогда
						ТелоОтветаДвоичныеДанные = napi_Расшифровать(ТелоОтветаДвоичныеДанные, , КлючШифрования);
					КонецЕсли;
					ТелоОтветаКакСтрока = ПолучитьСтрокуИзДвоичныхДанных(ТелоОтветаДвоичныеДанные, КодировкаТекста.UTF8);
					ОписаниеОшибкиJSON = ДесериализоватьДанные(ТелоОтветаКакСтрока);
					Если ОписаниеОшибкиJSON.Свойство("code") Тогда
						Результат.code = ОписаниеОшибкиJSON.code;
						Результат.description = ПолучитьОписаниеПоКодуРезультата(Результат.code);
					КонецЕсли;
					Если ОписаниеОшибкиJSON.Свойство("description") Тогда
						Результат.description = ОписаниеОшибкиJSON.description;
					КонецЕсли;
					Если ОписаниеОшибкиJSON.Свойство("comment") Тогда
						Результат.comment = ОписаниеОшибкиJSON.comment;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ЗавершениеИсполнения = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Результат.executionTime = ЗавершениеИсполнения - НачалоИсполнения;
	Возврат Результат;
КонецФункции
Функция lsAPI_LockLicenseSession(ИдентификаторПродукта, ВерсияПродукта, КлючШифрования, КлючШифрованияДополнение, ПриоритетнаяСтрокаСоединения = Неопределено, АвтономныеДанные = Неопределено)
	Результат = СоздатьРезультат();
	НастройкиКлиентаЛицензирования = ПолучитьНастройки();
	НастройкиСоединения = TClientConnectionSettings(НастройкиКлиентаЛицензирования, ПриоритетнаяСтрокаСоединения);
	Если ЗначениеОпределено(АвтономныеДанные) Тогда
		Возврат offline_LockLicenseSession(АвтономныеДанные, ИдентификаторПродукта, ВерсияПродукта);
	КонецЕсли;
	lsMetadata = НастройкиКлиентаЛицензирования.МетаданныеСервераЛицензий;
	Если ЗначениеОпределено(lsMetadata) И Не ПроверитьВерсиюСервераЛицензий(lsMetadata.info.version) Тогда
		Возврат СоздатьРезультат(1018, "Минимальная поддерживаемая версия: " + СтрСоединить(МинимальнаяВерсияСервераЛицензий(), "."));
	КонецЕсли;
	НаименованиеМетода = "lock-license-session";
	ДанныеМетода = TGateRequestLockLicenseSession(НастройкиСоединения.ПулыЛицензий, сл2_СерверКэшируемый.ЭтоСервернаяБаза());
	СтруктураЗапроса = TGateRequest(НаименованиеМетода, ИдентификаторПродукта, ВерсияПродукта, ДанныеМетода);
	Попытка
		ТелоЗапросаДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(СериализоватьДанные(СтруктураЗапроса), КодировкаТекста.UTF8, Ложь);
	Исключение
		Результат = СоздатьРезультат(1005, ОписаниеОшибки());
	КонецПопытки;
	Если НетОшибок(Результат) Тогда
		ЗаголовкиЗапроса = Новый Соответствие;
		ЗаголовкиЗапроса.Вставить("Content-Type", "application/json; charset=utf-8");
		Результат = lsAPI_Выполнить(НастройкиСоединения, ПриоритетнаяСтрокаСоединения, ТелоЗапросаДвоичныеДанные, ЗаголовкиЗапроса, КлючШифрования, КлючШифрованияДополнение);
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция lsAPI_TouchLicenseSessions(ИдентификаторПродукта, ВерсияПродукта, КлючШифрования, КлючШифрованияДополнение, СоответствиеПулМассивСеансов, ПриоритетнаяСтрокаСоединения = Неопределено, АвтономныеДанные = Неопределено)
	Результат = СоздатьРезультат();
	НастройкиКлиентаЛицензирования = ПолучитьНастройки();
	НастройкиСоединения = TClientConnectionSettings(НастройкиКлиентаЛицензирования, ПриоритетнаяСтрокаСоединения);
	Если ЗначениеОпределено(АвтономныеДанные) Тогда
		Возврат offline_TouchLicenseSessions(АвтономныеДанные, ИдентификаторПродукта, ВерсияПродукта, СоответствиеПулМассивСеансов);
	КонецЕсли;
	lsMetadata = НастройкиКлиентаЛицензирования.МетаданныеСервераЛицензий;
	Если ЗначениеОпределено(lsMetadata) И Не ПроверитьВерсиюСервераЛицензий(lsMetadata.info.version) Тогда
		Возврат СоздатьРезультат(1018, "Минимальная поддерживаемая версия: " + СтрСоединить(МинимальнаяВерсияСервераЛицензий(), "."));
	КонецЕсли;
	НаименованиеМетода = "touch-license-sessions";
	ДанныеМетода = TGateRequestTouchLicenseSessions(СоответствиеПулМассивСеансов);
	СтруктураЗапроса = TGateRequest(НаименованиеМетода, ИдентификаторПродукта, ВерсияПродукта, ДанныеМетода);
	Попытка
		ТелоЗапросаДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(СериализоватьДанные(СтруктураЗапроса), КодировкаТекста.UTF8, Ложь);
	Исключение
		Результат = СоздатьРезультат(1005, ОписаниеОшибки());
	КонецПопытки;
	Если НетОшибок(Результат) Тогда
		ЗаголовкиЗапроса = Новый Соответствие;
		ЗаголовкиЗапроса.Вставить("Content-Type", "application/json; charset=utf-8");
		Результат = lsAPI_Выполнить(НастройкиСоединения, ПриоритетнаяСтрокаСоединения, ТелоЗапросаДвоичныеДанные, ЗаголовкиЗапроса, КлючШифрования, КлючШифрованияДополнение);
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция lsAPI_ReleaseLicenseSession(ИдентификаторПродукта, ВерсияПродукта, КлючШифрования, КлючШифрованияДополнение, ИдентификаторПулаЛицензий, ИдентификаторСеанса, СнимокНастроекСоединения = Неопределено, АвтономныеДанные = Неопределено)
	Результат = СоздатьРезультат();
	НастройкиКлиентаЛицензирования = ПолучитьНастройки();
	НастройкиСоединения = ?(ЗначениеОпределено(СнимокНастроекСоединения), СнимокНастроекСоединения, TClientConnectionSettings(НастройкиКлиентаЛицензирования));
	Если ЗначениеОпределено(АвтономныеДанные) Тогда
		Возврат offline_ReleaseLicenseSession(АвтономныеДанные, ИдентификаторПродукта, ВерсияПродукта, ИдентификаторПулаЛицензий, ИдентификаторСеанса);
	КонецЕсли;
	lsMetadata = НастройкиКлиентаЛицензирования.МетаданныеСервераЛицензий;
	Если ЗначениеОпределено(lsMetadata) И Не ПроверитьВерсиюСервераЛицензий(lsMetadata.info.version) Тогда
		Возврат СоздатьРезультат(1018, "Минимальная поддерживаемая версия: " + СтрСоединить(МинимальнаяВерсияСервераЛицензий(), "."));
	КонецЕсли;
	НаименованиеМетода = "release-license-session";
	ДанныеМетода = TGateRequestReleaseLicenseSession(ИдентификаторПулаЛицензий, ИдентификаторСеанса);
	СтруктураЗапроса = TGateRequest(НаименованиеМетода, ИдентификаторПродукта, ВерсияПродукта, ДанныеМетода);
	Попытка
		ТелоЗапросаДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(СериализоватьДанные(СтруктураЗапроса), КодировкаТекста.UTF8, Ложь);
	Исключение
		Результат = СоздатьРезультат(1005, ОписаниеОшибки());
	КонецПопытки;
	Если НетОшибок(Результат) Тогда
		ЗаголовкиЗапроса = Новый Соответствие;
		ЗаголовкиЗапроса.Вставить("Content-Type", "application/json; charset=utf-8");
		Результат = lsAPI_Выполнить(НастройкиСоединения, Неопределено, ТелоЗапросаДвоичныеДанные, ЗаголовкиЗапроса, КлючШифрования, КлючШифрованияДополнение);
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция lsAPI_GetLicenseParameter(ИдентификаторПродукта, ВерсияПродукта, КлючШифрования, КлючШифрованияДополнение, ИдентификаторПараметра, ПриоритетнаяСтрокаСоединения = Неопределено, АвтономныеДанные = Неопределено)
	Результат = СоздатьРезультат();
	НастройкиКлиентаЛицензирования = ПолучитьНастройки();
	НастройкиСоединения = TClientConnectionSettings(НастройкиКлиентаЛицензирования, ПриоритетнаяСтрокаСоединения);
	Если ЗначениеОпределено(АвтономныеДанные) Тогда
		Возврат offline_GetLicenseParameter(АвтономныеДанные, ИдентификаторПродукта, ВерсияПродукта, ИдентификаторПараметра);
	КонецЕсли;
	lsMetadata = НастройкиКлиентаЛицензирования.МетаданныеСервераЛицензий;
	Если ЗначениеОпределено(lsMetadata) И Не ПроверитьВерсиюСервераЛицензий(lsMetadata.info.version) Тогда
		Возврат СоздатьРезультат(1018, "Минимальная поддерживаемая версия: " + СтрСоединить(МинимальнаяВерсияСервераЛицензий(), "."));
	КонецЕсли;
	НаименованиеМетода = "get-license-parameter";
	ДанныеМетода = TGateRequestGetLicenseParameter(НастройкиСоединения.ПулыЛицензий, ИдентификаторПараметра);
	СтруктураЗапроса = TGateRequest(НаименованиеМетода, ИдентификаторПродукта, ВерсияПродукта, ДанныеМетода);
	Попытка
		ТелоЗапросаДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(СериализоватьДанные(СтруктураЗапроса), КодировкаТекста.UTF8, Ложь);
	Исключение
		Результат = СоздатьРезультат(1005, ОписаниеОшибки());
	КонецПопытки;
	Если НетОшибок(Результат) Тогда
		ЗаголовкиЗапроса = Новый Соответствие;
		ЗаголовкиЗапроса.Вставить("Content-Type", "application/json; charset=utf-8");
		Результат = lsAPI_Выполнить(НастройкиСоединения, ПриоритетнаяСтрокаСоединения, ТелоЗапросаДвоичныеДанные, ЗаголовкиЗапроса, КлючШифрования, КлючШифрованияДополнение);
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция lsAPI_GetSubscriptionDetails(ИдентификаторПродукта, ВерсияПродукта, КлючШифрования, КлючШифрованияДополнение, ИдентификаторВидаПодписки, ПриоритетнаяСтрокаСоединения = Неопределено, АвтономныеДанные = Неопределено)
	Результат = СоздатьРезультат();
	НастройкиКлиентаЛицензирования = ПолучитьНастройки();
	НастройкиСоединения = TClientConnectionSettings(НастройкиКлиентаЛицензирования, ПриоритетнаяСтрокаСоединения);
	Если ЗначениеОпределено(АвтономныеДанные) Тогда
		Возврат offline_GetSubscriptionDetails(АвтономныеДанные, ИдентификаторПродукта, ВерсияПродукта, ИдентификаторВидаПодписки);
	КонецЕсли;
	lsMetadata = НастройкиКлиентаЛицензирования.МетаданныеСервераЛицензий;
	Если ЗначениеОпределено(lsMetadata) И Не ПроверитьВерсиюСервераЛицензий(lsMetadata.info.version) Тогда
		Возврат СоздатьРезультат(1018, "Минимальная поддерживаемая версия: " + СтрСоединить(МинимальнаяВерсияСервераЛицензий(), "."));
	КонецЕсли;
	НаименованиеМетода = "get-subscription-details";
	ДанныеМетода = TGateRequestGetSubscriptionDetails(ИдентификаторВидаПодписки);
	СтруктураЗапроса = TGateRequest(НаименованиеМетода, ИдентификаторПродукта, ВерсияПродукта, ДанныеМетода);
	Попытка
		ТелоЗапросаДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(СериализоватьДанные(СтруктураЗапроса), КодировкаТекста.UTF8, Ложь);
	Исключение
		Результат = СоздатьРезультат(1005, ОписаниеОшибки());
	КонецПопытки;
	Если НетОшибок(Результат) Тогда
		ЗаголовкиЗапроса = Новый Соответствие;
		ЗаголовкиЗапроса.Вставить("Content-Type", "application/json; charset=utf-8");
		Результат = lsAPI_Выполнить(НастройкиСоединения, ПриоритетнаяСтрокаСоединения, ТелоЗапросаДвоичныеДанные, ЗаголовкиЗапроса, КлючШифрования, КлючШифрованияДополнение);
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция lsAPI_CheckProductAvailability(ИдентификаторПродукта, ВерсияПродукта, КлючШифрования, КлючШифрованияДополнение, ИдентификаторыПродуктов, ПриоритетнаяСтрокаСоединения = Неопределено, АвтономныеДанные = Неопределено)
	Результат = СоздатьРезультат();
	НастройкиКлиентаЛицензирования = ПолучитьНастройки();
	НастройкиСоединения = TClientConnectionSettings(НастройкиКлиентаЛицензирования, ПриоритетнаяСтрокаСоединения);
	Если ЗначениеОпределено(АвтономныеДанные) Тогда
		Возврат offline_CheckProductAvailability(АвтономныеДанные, ИдентификаторПродукта, ВерсияПродукта, ИдентификаторыПродуктов);
	КонецЕсли;
	lsMetadata = НастройкиКлиентаЛицензирования.МетаданныеСервераЛицензий;
	Если ЗначениеОпределено(lsMetadata) И Не ПроверитьВерсиюСервераЛицензий(lsMetadata.info.version) Тогда
		Возврат СоздатьРезультат(1018, "Минимальная поддерживаемая версия: " + СтрСоединить(МинимальнаяВерсияСервераЛицензий(), "."));
	КонецЕсли;
	НаименованиеМетода = "check-product-availability";
	ДанныеМетода = TGateRequestCheckProductAvailability(НастройкиСоединения.ПулыЛицензий, ИдентификаторыПродуктов);
	СтруктураЗапроса = TGateRequest(НаименованиеМетода, ИдентификаторПродукта, ВерсияПродукта, ДанныеМетода);
	Попытка
		ТелоЗапросаДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(СериализоватьДанные(СтруктураЗапроса), КодировкаТекста.UTF8, Ложь);
	Исключение
		Результат = СоздатьРезультат(1005, ОписаниеОшибки());
	КонецПопытки;
	Если НетОшибок(Результат) Тогда
		ЗаголовкиЗапроса = Новый Соответствие;
		ЗаголовкиЗапроса.Вставить("Content-Type", "application/json; charset=utf-8");
		Результат = lsAPI_Выполнить(НастройкиСоединения, ПриоритетнаяСтрокаСоединения, ТелоЗапросаДвоичныеДанные, ЗаголовкиЗапроса, КлючШифрования, КлючШифрованияДополнение);
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция lsAPI_Info(НастройкиСоединения = Неопределено, ПриоритетнаяСтрокаСоединения = Неопределено, АвтономныеДанные = Неопределено)
	Если Не ЗначениеОпределено(НастройкиСоединения) Тогда
		НастройкиСоединения = TClientConnectionSettings(Неопределено, ПриоритетнаяСтрокаСоединения);
	КонецЕсли;
	Если ЗначениеОпределено(АвтономныеДанные) Тогда
		Возврат offline_Info(АвтономныеДанные);
	КонецЕсли;
	Результат = lsAPI_Выполнить(НастройкиСоединения, ПриоритетнаяСтрокаСоединения, , , , , "/api");
	Возврат Результат;
КонецФункции
Функция offline_LockLicenseSession(АвтономныеДанные, ИдентификаторПродукта, ВерсияПродукта)
	Результат = СоздатьРезультат();
	НайденныйПродукт = Неопределено;
	Для каждого Продукт Из АвтономныеДанные.Продукты Цикл
		Если Продукт.productId = ИдентификаторПродукта Тогда
			НайденныйПродукт = Продукт;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не ЗначениеОпределено(НайденныйПродукт) Тогда
		Результат = СоздатьРезультат(1013);
	КонецЕсли;
	ПараметрСрокДействия = Неопределено;
	ПараметрЧислоСеансов = Неопределено;
	Если НетОшибок(Результат) Тогда
		Для каждого Параметр Из НайденныйПродукт.parameters Цикл
			Если Параметр.parameterId = "eab43d61-10c7-49cd-9aa3-d6150b2b8a24" Тогда
				ПараметрСрокДействия = Параметр;
			ИначеЕсли Параметр.parameterId = "8cf910ef-2d24-4999-8879-0a8f9d204e0b" Тогда
				ПараметрЧислоСеансов = Параметр;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если НетОшибок(Результат) Тогда
		Если ЗначениеОпределено(ПараметрСрокДействия) И ЗначениеОпределено(ПараметрСрокДействия.data.value) Тогда
			СрокДействияАвтономнойЛицензии = Преобразование_ISO8601_ДатаВремя(ПараметрСрокДействия.data.value);
			Если ТекущаяДата() > СрокДействияАвтономнойЛицензии Тогда
				Результат = СоздатьРезультат(1014);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если НетОшибок(Результат) Тогда
		Если ЗначениеОпределено(ПараметрЧислоСеансов) И ЗначениеОпределено(ПараметрЧислоСеансов.data.value) Тогда
			СеансыИб = ПолучитьСеансыИнформационнойБазы();
			ЧислоТекущихСеансов = 0;
			Для каждого Сеанс Из СеансыИб Цикл
				Если Сеанс.ИмяПриложения = "1CV8" Или Сеанс.ИмяПриложения = "1CV8C" Или Сеанс.ИмяПриложения = "WebClient" Тогда
					ЧислоТекущихСеансов = ЧислоТекущихСеансов + 1;
				КонецЕсли;
			КонецЦикла;
			Если ЧислоТекущихСеансов > ПараметрЧислоСеансов.data.value Тогда
				Результат = СоздатьРезультат(1015);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если НетОшибок(Результат) Тогда
		АвтономныеДанныеМетода = Новый Структура("type, structureVersion", "TGateResponse", 1);
		АвтономныеДанныеМетода.Вставить("requestInfo", Новый Структура("methodName, requestId", "lock-license-session", UUID()));
		АвтономныеДанныеМетода.Вставить("responseData", Новый Структура("type, structureVersion, poolCId, sessionId", "TGateRequestLockLicenseSessionResult", 1, "00000", UUID()));
		Результат.data = АвтономныеДанныеМетода;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция offline_TouchLicenseSessions(АвтономныеДанные, ИдентификаторПродукта, ВерсияПродукта, СоответствиеПулМассивСеансов)
	Результат = СоздатьРезультат();
	АвтономныеДанныеМетода = Новый Структура("type, structureVersion", "TGateResponse", 1);
	АвтономныеДанныеМетода.Вставить("requestInfo", Новый Структура("methodName, requestId", "touch-license-sessions", UUID()));
	АвтономныеДанныеМетода.Вставить("responseData", Новый Структура("type, structureVersion, invalidSessionIds", "TGateRequestTouchLicenseSessionsResult", 1, Новый Массив));
	Результат.data = АвтономныеДанныеМетода;
	Возврат Результат;
КонецФункции
Функция offline_ReleaseLicenseSession(АвтономныеДанные, ИдентификаторПродукта, ВерсияПродукта, ИдентификаторПулаЛицензий, ИдентификаторСеанса)
	Результат = СоздатьРезультат();
	АвтономныеДанныеМетода = Новый Структура("type, structureVersion", "TGateResponse", 1);
	АвтономныеДанныеМетода.Вставить("requestInfo", Новый Структура("methodName, requestId", "touch-license-sessions", UUID()));
	АвтономныеДанныеМетода.Вставить("responseData", Неопределено);
	Результат.data = АвтономныеДанныеМетода;
	Возврат Результат;
КонецФункции
Функция offline_GetLicenseParameter(АвтономныеДанные, ИдентификаторПродукта, ВерсияПродукта, ИдентификаторПараметра)
	Результат = СоздатьРезультат();
	НайденныйПродукт = Неопределено;
	Для каждого Продукт Из АвтономныеДанные.Продукты Цикл
		Если Продукт.productId = ИдентификаторПродукта Тогда
			НайденныйПродукт = Продукт;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не ЗначениеОпределено(НайденныйПродукт) Тогда
		Результат = СоздатьРезультат(1013);
	КонецЕсли;
	ИскомыйПараметр = Неопределено;
	Если НетОшибок(Результат) Тогда
		Для каждого Параметр Из НайденныйПродукт.parameters Цикл
			Если Параметр.parameterId = ИдентификаторПараметра Тогда
				ИскомыйПараметр = Параметр;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ЗначениеОпределено(ИскомыйПараметр) Тогда
			Результат = СоздатьРезультат(1016);
		КонецЕсли;
	КонецЕсли;
	Если НетОшибок(Результат) Тогда
		АвтономныеДанныеМетода = Новый Структура("type, structureVersion", "TGateResponse", 1);
		АвтономныеДанныеМетода.Вставить("requestInfo", Новый Структура("methodName, requestId", "get-license-parameter", UUID()));
		АвтономныеДанныеМетода.Вставить("responseData", ИскомыйПараметр.data);
		Результат.data = АвтономныеДанныеМетода;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция offline_GetSubscriptionDetails(АвтономныеДанные, ИдентификаторПродукта, ВерсияПродукта, ИдентификаторВидаПодписки)
	Результат = СоздатьРезультат();
	НайденнаяПодписка = Неопределено;
	Для каждого Подписка Из АвтономныеДанные.Подписки Цикл
		Если Подписка.subscriptionId = ИдентификаторВидаПодписки Тогда
			НайденнаяПодписка = Подписка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не ЗначениеОпределено(НайденнаяПодписка) Тогда
		Результат = СоздатьРезультат(1017);
	КонецЕсли;
	Если НетОшибок(Результат) Тогда
		Если ЗначениеОпределено(НайденнаяПодписка.data.expirationDate) Тогда
			ОсталосьДней = 0;
			Активна = Ложь;
			СрокДействияПодписки = Преобразование_ISO8601_ДатаВремя(НайденнаяПодписка.data.expirationDate);
			МоментПроверкиПодписки = ТекущаяДата();
			Если СрокДействияПодписки > МоментПроверкиПодписки Тогда
				Активна = Истина;
				ОсталосьДней = Окр((СрокДействияПодписки - МоментПроверкиПодписки) / 86400, 0);
			КонецЕсли;
		Иначе
			ОсталосьДней = Неопределено;
			Активна = Истина;
		КонецЕсли;
		АвтономныеДанныеМетода = Новый Структура("type, structureVersion", "TGateResponse", 1);
		АвтономныеДанныеМетода.Вставить("requestInfo", Новый Структура("methodName, requestId", "get-subscription-details", UUID()));
		АвтономныеДанныеМетода.Вставить("responseData", Новый Структура("type, structureVersion, expirationDate, daysLeft, active", "TGateRequestGetSubscriptionDetailsResult", 1, НайденнаяПодписка.data.expirationDate, ОсталосьДней, Активна));
		Результат.data = АвтономныеДанныеМетода;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция offline_CheckProductAvailability(АвтономныеДанные, ИдентификаторПродукта, ВерсияПродукта, ИдентификаторыПродуктов)
	Результат = СоздатьРезультат();
	ПодходящиеИдентификаторыПродуктов = Новый Массив;
	Для каждого ПроверяемыйИдентификаторПродукта Из ИдентификаторыПродуктов Цикл
		Для каждого Продукт Из АвтономныеДанные.Продукты Цикл
			Если Продукт.productId = ПроверяемыйИдентификаторПродукта Тогда
				Если ПодходящиеИдентификаторыПродуктов.Найти(Продукт.productId) = Неопределено Тогда
					ПодходящиеИдентификаторыПродуктов.Добавить(Продукт.productId);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	АвтономныеДанныеМетода = Новый Структура("type, structureVersion", "TGateResponse", 1);
	АвтономныеДанныеМетода.Вставить("requestInfo", Новый Структура("methodName, requestId", "check-product-availability", UUID()));
	АвтономныеДанныеМетода.Вставить("responseData", Новый Структура("type, structureVersion, productIds", "TGateRequestCheckProductAvailabilityResult", 1, ПодходящиеИдентификаторыПродуктов));
	Результат.data = АвтономныеДанныеМетода;
	Возврат Результат;
КонецФункции
Функция offline_Info(АвтономныеДанные)
	Результат = СоздатьРезультат();
	АвтономныеДанныеМетода = Новый Структура;
	АвтономныеДанныеМетода.Вставить("apiVersions", Новый Массив);
	АвтономныеДанныеМетода.Вставить("architecture", "");
	АвтономныеДанныеМетода.Вставить("computerName", ПолучитьИмяКомпьютера());
	АвтономныеДанныеМетода.Вставить("name", "firstBit.License client");
	АвтономныеДанныеМетода.Вставить("platform", "");
	АвтономныеДанныеМетода.Вставить("serverTime", Неопределено);
	АвтономныеДанныеМетода.Вставить("syncDate", Неопределено);
	АвтономныеДанныеМетода.Вставить("syncRequired", Ложь);
	АвтономныеДанныеМетода.Вставить("version", "");
	АвтономныеДанныеМетода.Вставить("offlineData", Истина);
	Результат.data = АвтономныеДанныеМетода;
	Возврат Результат;
КонецФункции
Процедура ПреИнициализация() Экспорт
	КлючНастроек = ПолучитьКлючНастроекСеансовыхДанных();
	ХранилищеОбщихНастроек.Удалить("сл2", КлючНастроек, "");
	ХранилищеОбщихНастроек.Удалить("сл2", "ар", "");
	ПочиститьУстаревшиеСеансовыеДанные();
	КэшАвтономногоРежима = ПроверитьКэшАвтономногоРежима();
	Если КэшАвтономногоРежима.АвтономныйРежимАктивен Тогда
		ХранилищеОбщихНастроек.Сохранить("сл2", "ар", Истина, , "");
		СеансовыеДанные = TClientSessionData();
		СеансовыеДанные.ДанныеАвтономногоРежима = Новый Структура("Продукты, Подписки", КэшАвтономногоРежима.Продукты, КэшАвтономногоРежима.Подписки);
		УстановитьСеансовыеДанные(СеансовыеДанные);
	КонецЕсли;
КонецПроцедуры
Функция Инициализация(ПараметрыИнициализации) Экспорт
	РезультатИнициализации = Истина;
	НастроитьРегламентноеЗадание();
	РегламентноеЗаданиеВПорядке = Не сл2_СерверКэшируемый.ЭтоСервернаяБаза() Или Не РегламентноеЗаданиеОтключено();
	СеансовыеДанные = ПолучитьСеансовыеДанные();
	СеансовыеДанные.ДоступенВыборВерсииПродукта = ПараметрыИнициализации.ДоступенВыборВерсииПродукта;
	Настройки = ПолучитьНастройки();
	Если Настройки.ПолучатьЛицензиюПриЗапуске Тогда
		РезультатИнициализации = ИнициализироватьСостояниеЛицензирования(СеансовыеДанные);
	КонецЕсли;
	УстановитьСеансовыеДанные(СеансовыеДанные);
	Возврат РегламентноеЗаданиеВПорядке И РезультатИнициализации;
КонецФункции
Функция ИнициализироватьСостояниеЛицензирования(СеансовыеДанные)
	Результат = Истина;
	ПриоритетнаяСтрокаСоединения = СеансовыеДанные.ПриоритетнаяСтрокаСоединения;
	РезультатВызова = lsAPI_Info(Неопределено, ПриоритетнаяСтрокаСоединения, СеансовыеДанные.ДанныеАвтономногоРежима);
	Если НетОшибок(РезультатВызова) Тогда
		СеансовыеДанные.СерверЛицензийДоступен = Истина;
		МетаданныеСервераЛицензий = TLicenseServerInfo(РезультатВызова.data, СеансовыеДанные.ДанныеАвтономногоРежима);
		ПерсональныеНастройки = ПолучитьПерсональныеНастройки();
		ПерсональныеНастройки.МетаданныеСервераЛицензий = МетаданныеСервераЛицензий;
		УстановитьПерсональныеНастройки(ПерсональныеНастройки);
		ТребуетсяОбязательнаяСинхронизация = МетаданныеСервераЛицензий.info.syncRequired;
		Если ТребуетсяОбязательнаяСинхронизация Или МетаданныеСервераЛицензий.СерверЛицензийДавноНеСинхронизировался Тогда
			Результат = Ложь;
		КонецЕсли;
	Иначе
		СеансовыеДанные.СерверЛицензийДоступен = Ложь;
	КонецЕсли;
	Для каждого СостояниеЛицензированияПродукта Из СеансовыеДанные.СостоянияЛицензированияПродуктов Цикл
		СостояниеЛицензированияПродукта.lockedSession = Неопределено;
		ПодпискаПозволяетПолучитьЛицензию = Истина;
		Если НетОшибок(РезультатВызова) Тогда
			Если ЗначениеЗаполнено(СостояниеЛицензированияПродукта.productInfo.maintenanceSubscriptionId) Тогда
				РезультатПолученияПодписки = lsAPI_GetSubscriptionDetails(СостояниеЛицензированияПродукта.productInfo.productId, СостояниеЛицензированияПродукта.productInfo.productVersion, СостояниеЛицензированияПродукта.productInfo.productKey, СостояниеЛицензированияПродукта.productInfo.productKeyAddon, СостояниеЛицензированияПродукта.productInfo.maintenanceSubscriptionId, ПриоритетнаяСтрокаСоединения, СеансовыеДанные.ДанныеАвтономногоРежима);
				СостояниеЛицензированияПродукта.subscriptionCheckNotAvailable = Ложь;
				Если НетОшибок(РезультатПолученияПодписки) Тогда
					РезультатПолученияПодписки.data = РезультатПолученияПодписки.data.responseData;
					СостояниеЛицензированияПродукта.subscriptionStatus = РезультатПолученияПодписки.data;
				Иначе
					СостояниеЛицензированияПродукта.subscriptionStatus = Неопределено;
					Если РезультатПолученияПодписки.code = 4513 Тогда
						СостояниеЛицензированияПродукта.subscriptionCheckNotAvailable = Истина;
					КонецЕсли;
				КонецЕсли;
				Если СостояниеЛицензированияПродукта.productInfo.maintenanceSubscriptionCheckMode <= 2 Или СостояниеЛицензированияПродукта.productInfo.maintenanceSubscriptionCheckMode = 4 Тогда
					Если ЗначениеОпределено(СостояниеЛицензированияПродукта.subscriptionStatus) Тогда
						НастройкиСкрытияУведомлений = ПолучитьПерсональныеНастройки().СкрытыеУведомления;
						Если Не СостояниеЛицензированияПродукта.subscriptionStatus.active И (Не ЗначениеОпределено(НастройкиСкрытияУведомлений.СрокДействияПодпискиИстек) Или ТекущаяДата() > НастройкиСкрытияУведомлений.СрокДействияПодпискиИстек) Тогда
							Результат = Ложь;
						КонецЕсли;
						Если ЗначениеОпределено(СостояниеЛицензированияПродукта.subscriptionStatus.daysLeft) И СостояниеЛицензированияПродукта.subscriptionStatus.daysLeft <= 7 И (Не ЗначениеОпределено(НастройкиСкрытияУведомлений.СрокДействияПодпискиИстекает) Или ТекущаяДата() > НастройкиСкрытияУведомлений.СрокДействияПодпискиИстекает) Тогда
							Результат = Ложь;
						КонецЕсли;
					Иначе
						Результат = Ложь;
					КонецЕсли;
				КонецЕсли;
				ПодпискаПозволяетПолучитьЛицензию = ОпределитьДоступностьСборкиПоДатеВыпускаИСрокуДействияПодписки(СостояниеЛицензированияПродукта.productInfo.maintenanceSubscriptionCheckMode, СостояниеЛицензированияПродукта.productInfo.productReleaseDate, СостояниеЛицензированияПродукта.subscriptionStatus, ?(ЗначениеОпределено(СеансовыеДанные.ДанныеАвтономногоРежима), Преобразование_ДатаВремя_ISO8601(ТекущаяДата()), МетаданныеСервераЛицензий.info.serverTime));
			КонецЕсли;
		КонецЕсли;
		Если НетОшибок(РезультатВызова) Тогда
			Если Не ПодпискаПозволяетПолучитьЛицензию Тогда
				РезультатВызова = СоздатьРезультат(1010);
			КонецЕсли;
			Если НетОшибок(РезультатВызова) Тогда
				РезультатВызова = lsAPI_LockLicenseSession(СостояниеЛицензированияПродукта.productInfo.productId, СостояниеЛицензированияПродукта.productInfo.productVersion, СостояниеЛицензированияПродукта.productInfo.productKey, СостояниеЛицензированияПродукта.productInfo.productKeyAddon, ПриоритетнаяСтрокаСоединения, СеансовыеДанные.ДанныеАвтономногоРежима);
			КонецЕсли;
		КонецЕсли;
		Если НетОшибок(РезультатВызова) Тогда
			СостояниеЛицензированияПродукта.error = Неопределено;
			СостояниеЛицензированияПродукта.lockedSession = РезультатВызова.data.responseData;
		Иначе
			СостояниеЛицензированияПродукта.error = РезультатВызова;
			СостояниеЛицензированияПродукта.lockedSession = Неопределено;
			Результат = Ложь;
		КонецЕсли;
		СостояниеЛицензированияПродукта.connectionSettingsSnapshot = TClientConnectionSettings(Неопределено, ПриоритетнаяСтрокаСоединения);
		Если РезультатВызова.code <> 1001 Тогда
			РезультатВызова = СоздатьРезультат();
		КонецЕсли;
	КонецЦикла;
	Если СеансовыеДанные.ПриоритетнаяСтрокаСоединения <> ПриоритетнаяСтрокаСоединения Тогда
		СеансовыеДанные.ПриоритетнаяСтрокаСоединения = ПриоритетнаяСтрокаСоединения;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция ПолучитьСостояниеЛицензирования() Экспорт
	СеансовыеДанные = ПолучитьСеансовыеДанные();
	ПерсональныеНастройки = ПолучитьПерсональныеНастройки();
	Результат = Новый Структура;
	Результат.Вставить("ДоступенВыборВерсииПродукта", СеансовыеДанные.ДоступенВыборВерсииПродукта);
	Результат.Вставить("МетаданныеСервераЛицензий", ПерсональныеНастройки.МетаданныеСервераЛицензий);
	Результат.Вставить("ПоказыватьСведенияСервераЛицензий", Не ЗначениеОпределено(СеансовыеДанные.ДанныеАвтономногоРежима));
	Результат.Вставить("ЛицензируемыеПродукты", Новый Массив);
	Результат.Вставить("СистемнаяИнформация", "");
	Для каждого СостояниеЛицензированияПродукта Из СеансовыеДанные.СостоянияЛицензированияПродуктов Цикл
		РежимПроверкиПодписки = СостояниеЛицензированияПродукта.productInfo.maintenanceSubscriptionCheckMode;
		ПродуктИмеетПодписку = ЗначениеЗаполнено(СостояниеЛицензированияПродукта.productInfo.maintenanceSubscriptionId) И Не СостояниеЛицензированияПродукта.subscriptionCheckNotAvailable И РежимПроверкиПодписки <> 3;
		СводныеДанные = Новый Структура;
		СводныеДанные.Вставить("НаименованиеПродукта", СостояниеЛицензированияПродукта.productInfo.productName);
		СводныеДанные.Вставить("ДатаСборкиПродукта", Преобразование_ISO8601_ДатаВремя(СостояниеЛицензированияПродукта.productInfo.productReleaseDate));
		СводныеДанные.Вставить("Ошибка", СостояниеЛицензированияПродукта.error);
		СводныеДанные.Вставить("ПулЛицензий", Неопределено);
		СводныеДанные.Вставить("ЛицензияПолучена", Ложь);
		СводныеДанные.Вставить("ПродуктИмеетПодписку", ПродуктИмеетПодписку);
		СводныеДанные.Вставить("СвойстваПодписки", Неопределено);
		Если ЗначениеОпределено(СостояниеЛицензированияПродукта.lockedSession) Тогда
			СводныеДанные.ПулЛицензий = СостояниеЛицензированияПродукта.lockedSession.poolCId;
			СводныеДанные.ЛицензияПолучена = Истина;
		КонецЕсли;
		Если ПродуктИмеетПодписку И РежимПроверкиПодписки <> 3 И СеансовыеДанные.СерверЛицензийДоступен Тогда
			СвойстваПодписки = Новый Структура("Отсутствует, СрокДействияИстек, Бессрочная, ОсталосьДней, СкороИстекает, ДатаОкончания", Ложь, Ложь, Ложь, "", Ложь, "");
			СвойстваПодписки.Отсутствует = Не ЗначениеОпределено(СостояниеЛицензированияПродукта.subscriptionStatus);
			Если Не СвойстваПодписки.Отсутствует Тогда
				СвойстваПодписки.СрокДействияИстек = Не СостояниеЛицензированияПродукта.subscriptionStatus.active;
				СвойстваПодписки.Бессрочная = СостояниеЛицензированияПродукта.subscriptionStatus.daysLeft = Неопределено;
				Если Не СвойстваПодписки.Бессрочная Тогда
					СвойстваПодписки.ОсталосьДней = СостояниеЛицензированияПродукта.subscriptionStatus.daysLeft;
					СвойстваПодписки.СкороИстекает = Не СвойстваПодписки.СрокДействияИстек И СостояниеЛицензированияПродукта.subscriptionStatus.daysLeft <= 7;
					Если ЗначениеОпределено(СостояниеЛицензированияПродукта.subscriptionStatus.expirationDate) Тогда
						СвойстваПодписки.ДатаОкончания = Преобразование_ISO8601_ДатаВремя(СостояниеЛицензированияПродукта.subscriptionStatus.expirationDate);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			СводныеДанные.СвойстваПодписки = СвойстваПодписки;
		КонецЕсли;
		Результат.ЛицензируемыеПродукты.Добавить(СводныеДанные);
	КонецЦикла;
	СистемнаяИнформация = Новый Структура;
	СистемнаяИнформация.Вставить("РежимЗапуска", "Режим запуска: " + ?(сл2_СерверКэшируемый.ЭтоСервернаяБаза(), "Клиент-серверный", "Файловый"));
	СистемнаяИнформация.Вставить("ТипПлатформыСервер", ?(сл2_СерверКэшируемый.ЭтоСервернаяБаза(), "Тип платформы (сервер): " + ТипПлатформыНаСервере(), Неопределено));
	СистемнаяИнформация.Вставить("КлиентЛицензирования", "Клиент лицензирования: " + ВерсияКлиентаЛицензирования());
	СистемнаяИнформация.Вставить("СерверЛицензий", Неопределено);
	Если ЗначениеОпределено(Результат.МетаданныеСервераЛицензий) И Результат.МетаданныеСервераЛицензий.Свойство("info") Тогда
		info = Результат.МетаданныеСервераЛицензий.info;
		Если Результат.ПоказыватьСведенияСервераЛицензий Тогда
			Если Не info.Свойство("offlineData") Или Не info.offlineData Тогда
				СистемнаяИнформация.СерверЛицензий = "Сервер лицензий: " + info.version + " " + info.architecture + " " + ?(info.Свойство("debug") И info.debug, "debug ", " ") + "(" + info.platform + ")";
			КонецЕсли;
		Иначе
			СистемнаяИнформация.СерверЛицензий = "Автономный режим";
		КонецЕсли;
	КонецЕсли;
	Результат.СистемнаяИнформация = СистемнаяИнформация;
	Возврат Результат;
КонецФункции
Функция ЕстьПравоИзмененияОбщихНастроек() Экспорт
	Возврат ЗначениеОпределено(Метаданные.Роли.Найти("сл2_Администратор")) И РольДоступна("сл2_Администратор") Или ЗначениеОпределено(Метаданные.Роли.Найти("ПолныеПрава")) И РольДоступна("ПолныеПрава") Или ЗначениеОпределено(Метаданные.Роли.Найти("доп_ПолныеПрава")) И РольДоступна("доп_ПолныеПрава") Или ПользователиИнформационнойБазы.ТекущийПользователь().Имя = "";
КонецФункции
Процедура ОбновитьСостояниеЛицензирования() Экспорт
	СеансовыеДанные = ПолучитьСеансовыеДанные();
	СеансовыеДанные.ПриоритетнаяСтрокаСоединения = Неопределено;
	Для каждого СостояниеЛицензированияПродукта Из СеансовыеДанные.СостоянияЛицензированияПродуктов Цикл
		Если ЗначениеОпределено(СостояниеЛицензированияПродукта.lockedSession) Тогда
			ОсвободитьЛицензиюНаСеанс(СостояниеЛицензированияПродукта.productInfo, СостояниеЛицензированияПродукта.lockedSession.poolCId, СостояниеЛицензированияПродукта.lockedSession.sessionId, Ложь, Неопределено, СостояниеЛицензированияПродукта.connectionSettingsSnapshot, СеансовыеДанные.ДанныеАвтономногоРежима);
		КонецЕсли;
		СостояниеЛицензированияПродукта.error = Неопределено;
		СостояниеЛицензированияПродукта.lockedSession = Неопределено;
		СостояниеЛицензированияПродукта.connectionSettingsSnapshot = Неопределено;
	КонецЦикла;
	ИнициализироватьСостояниеЛицензирования(СеансовыеДанные);
	УстановитьСеансовыеДанные(СеансовыеДанные);
КонецПроцедуры
Функция УстановитьДанныеАвтономногоРежима(Знач ДвоичныеДанныеОтвета) Экспорт
	Попытка
		Буфер = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(ДвоичныеДанныеОтвета);
		ПреобразоватьБуфер(Буфер);
		СериализованныйОтвет = ПолучитьСтрокуИзБуфераДвоичныхДанных(Буфер);
		ДесериализованныйОтвет = ДесериализоватьДанные(СериализованныйОтвет);
	Исключение
		Сообщить("Некорректный файл.");
		Возврат Ложь;
	КонецПопытки;
	Если ДесериализованныйОтвет.type <> "TLicenseClientOfflineDataResponse" Тогда
		Сообщить("Некорректный тип структуры.");
		Возврат Ложь;
	КонецЕсли;
	ХешПривязки = Новый ХешированиеДанных(ХешФункция.SHA256);
	ХешПривязки.Добавить(ПолучитьИмяКомпьютера());
	ХешПривязки.Добавить(ПолучитьИмяЦелевойИБ());
	ХешПривязки.Добавить("approved");
	ХешПривязкиСтрока = ПолучитьHexСтрокуИзДвоичныхДанных(ХешПривязки.ХешСумма);
	Если ДесериализованныйОтвет.bindHash <> ХешПривязкиСтрока Тогда
		Сообщить("Файл не подошел для текущего экземпляра информационной базы или компьютера");
		Возврат Ложь;
	КонецЕсли;
	Константы.сл2_Кэш.Установить(Новый ХранилищеЗначения(ДвоичныеДанныеОтвета));
	Возврат Истина;
КонецФункции
Функция ПроверитьКэшАвтономногоРежима(КэшАвтономногоРежимаДвоичныеДанные = Неопределено) Экспорт
	Результат = Новый Структура("АвтономныеДанныеУстановлены,АвтономныйРежимАктивен,Продукты,Подписки", Ложь, Ложь);
	КэшАвтономногоЛицензированияДвоичныеДанные = ?(ЗначениеЗаполнено(КэшАвтономногоРежимаДвоичныеДанные), КэшАвтономногоРежимаДвоичныеДанные, Константы.сл2_Кэш.Получить().Получить());
	Если ЗначениеОпределено(КэшАвтономногоЛицензированияДвоичныеДанные) Тогда
		Результат.АвтономныеДанныеУстановлены = Истина;
		Попытка
			Буфер = ПолучитьБуферДвоичныхДанныхИзДвоичныхДанных(КэшАвтономногоЛицензированияДвоичныеДанные);
			ПреобразоватьБуфер(Буфер);
			СериализованныйОтвет = ПолучитьСтрокуИзБуфераДвоичныхДанных(Буфер);
			ДесериализованныйОтвет = ДесериализоватьДанные(СериализованныйОтвет);
		Исключение
		КонецПопытки;
		Результат.АвтономныйРежимАктивен = ДесериализованныйОтвет.pcName = ПолучитьИмяКомпьютера() И ДесериализованныйОтвет.dbPath = ПолучитьИмяЦелевойИБ();
		Результат.Продукты = ДесериализованныйОтвет.products;
		Результат.Подписки = ДесериализованныйОтвет.subscriptions;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция НетОшибок(СтруктураРезультата) Экспорт
	Возврат СтруктураРезультата.code = 0;
КонецФункции
Функция АвтономноеЛицензирование() Экспорт
	СеансовыеДанные = ПолучитьСеансовыеДанные();
	Возврат ЗначениеОпределено(СеансовыеДанные.ДанныеАвтономногоРежима);
КонецФункции
Функция ОписаниеРезультата(СтруктураРезультата) Экспорт
	Перем ОтчетПоРезультату;
	ОтчетПоРезультату = "Код: " + Формат(СтруктураРезультата.code, "ЧН=0; ЧГ=0") + Символы.ПС + "Описание: " + СтруктураРезультата.description + ?(СтруктураРезультата.comment <> "", Символы.ПС + "Комментарий: " + СтруктураРезультата.comment, "");
	Возврат ОтчетПоРезультату;
КонецФункции
Процедура ЛицензироватьПродукт(Знач МетаданныеПродукта) Экспорт
	СеансовыеДанные = ПолучитьСеансовыеДанные();
	Для каждого СостояниеЛицензированияПродукта Из СеансовыеДанные.СостоянияЛицензированияПродуктов Цикл
		Если СостояниеЛицензированияПродукта.productInfo.productId = МетаданныеПродукта.productId Тогда
			ПродуктУжеЗарегистрирован = Истина;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеОпределено(СеансовыеДанные.ДанныеАвтономногоРежима) Тогда
		МетаданныеПродукта.productKey = "";
		МетаданныеПродукта.productKeyAddon = "";
	КонецЕсли;
	СеансовыеДанные.СостоянияЛицензированияПродуктов.Добавить(TClientProductLicenseStatus(МетаданныеПродукта));
	УстановитьСеансовыеДанные(СеансовыеДанные);
КонецПроцедуры
Процедура ПереключитьВерсиюПродукта(МетаданныеТекущегоПродуктаИлиВерсии, Знач МетаданныеНовогоПродуктаИлиВерсии) Экспорт
	Если МетаданныеТекущегоПродуктаИлиВерсии.productId = МетаданныеНовогоПродуктаИлиВерсии.productId Тогда
		Возврат;
	КонецЕсли;
	ИндексСеансовыхДанных = Неопределено;
	ПродуктУжеЗарегистрирован = Ложь;
	СеансовыеДанные = ПолучитьСеансовыеДанные();
	Для итератор = 0 По СеансовыеДанные.СостоянияЛицензированияПродуктов.Количество() - 1 Цикл
		СостояниеЛицензированияПродукта = СеансовыеДанные.СостоянияЛицензированияПродуктов[итератор];
		Если СостояниеЛицензированияПродукта.productInfo.productId = МетаданныеТекущегоПродуктаИлиВерсии.productId Тогда
			ИндексСеансовыхДанных = итератор;
			Если ЗначениеОпределено(СостояниеЛицензированияПродукта.lockedSession) Тогда
				ОсвободитьЛицензиюНаСеанс(СостояниеЛицензированияПродукта.productInfo, СостояниеЛицензированияПродукта.lockedSession.poolCId, СостояниеЛицензированияПродукта.lockedSession.sessionId, Ложь, Неопределено, СостояниеЛицензированияПродукта.connectionSettingsSnapshot, СеансовыеДанные.ДанныеАвтономногоРежима);
			КонецЕсли;
		КонецЕсли;
		Если СостояниеЛицензированияПродукта.productInfo.productId = МетаданныеНовогоПродуктаИлиВерсии.productId Тогда
			ПродуктУжеЗарегистрирован = Истина;
		КонецЕсли;
	КонецЦикла;
	Если Не ПродуктУжеЗарегистрирован Тогда
		СтатусЛицензированияПродукта = TClientProductLicenseStatus(МетаданныеНовогоПродуктаИлиВерсии);
		Если ЗначениеОпределено(ИндексСеансовыхДанных) Тогда
			СеансовыеДанные.СостоянияЛицензированияПродуктов[ИндексСеансовыхДанных] = СтатусЛицензированияПродукта;
		Иначе
			СеансовыеДанные.СостоянияЛицензированияПродуктов.Добавить(СтатусЛицензированияПродукта);
		КонецЕсли;
	Иначе
		СеансовыеДанные.СостоянияЛицензированияПродуктов.Удалить(ИндексСеансовыхДанных);
	КонецЕсли;
	УстановитьСеансовыеДанные(СеансовыеДанные);
КонецПроцедуры
Функция ПолучитьЛицензиюНаСеанс(МетаданныеПродукта, ВходящиеСеансовыеДанные = Неопределено, ПерсональныеНастройки = Неопределено) Экспорт
	СеансовыеДанные = Неопределено;
	СостояниеЛицензированияПродукта = Неопределено;
	ПодпискаПозволяетПолучитьЛицензию = Истина;
	РезультатВызова = СоздатьРезультат();
	СуществующийСеансАктуален = Ложь;
	МетаданныеСервераЛицензийАктуальны = Ложь;
	Если Не ЗначениеОпределено(ПерсональныеНастройки) Тогда
		ПерсональныеНастройки = ПолучитьПерсональныеНастройки();
	Иначе
		МетаданныеСервераЛицензийАктуальны = Истина;
	КонецЕсли;
	Если ЗначениеОпределено(ВходящиеСеансовыеДанные) Тогда
		СеансовыеДанные = ВходящиеСеансовыеДанные;
	Иначе
		СеансовыеДанные = ПолучитьСеансовыеДанные();
	КонецЕсли;
	ПриоритетнаяСтрокаСоединения = СеансовыеДанные.ПриоритетнаяСтрокаСоединения;
	Для каждого ЛицензируемыйПродукт Из СеансовыеДанные.СостоянияЛицензированияПродуктов Цикл
		Если ЛицензируемыйПродукт.productInfo.productId = МетаданныеПродукта.productId Тогда
			СостояниеЛицензированияПродукта = ЛицензируемыйПродукт;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не ЗначениеОпределено(СостояниеЛицензированияПродукта) Тогда
		Если Не ЗначениеОпределено(СостояниеЛицензированияПродукта) Тогда
			СостояниеЛицензированияПродукта = TClientProductLicenseStatus(МетаданныеПродукта);
			СеансовыеДанные.СостоянияЛицензированияПродуктов.Добавить(СостояниеЛицензированияПродукта);
		КонецЕсли;
	КонецЕсли;
	Если НетОшибок(РезультатВызова) И ЗначениеЗаполнено(СостояниеЛицензированияПродукта.lockedSession) Тогда
		Если ЗначениеОпределено(СостояниеЛицензированияПродукта.lockSessionCacheExpireDateISO8601) И Преобразование_ISO8601_ДатаВремя(СостояниеЛицензированияПродукта.lockSessionCacheExpireDateISO8601) >= ТекущаяДата() Тогда
			Результат = СоздатьРезультат(, , СостояниеЛицензированияПродукта.lockedSession);
			Возврат Результат;
		КонецЕсли;
		СоответствиеПулСеансы = Новый Соответствие;
		ИдентификаторыСеансов = Новый Массив;
		ИдентификаторыСеансов.Добавить(СостояниеЛицензированияПродукта.lockedSession.sessionId);
		СоответствиеПулСеансы.Вставить(СостояниеЛицензированияПродукта.lockedSession.poolCId, ИдентификаторыСеансов);
		РезультатВызова = ПродлитьВремяЖизниСеансов(МетаданныеПродукта, СоответствиеПулСеансы, ПриоритетнаяСтрокаСоединения, СеансовыеДанные.ДанныеАвтономногоРежима);
		Если НетОшибок(РезультатВызова) Тогда
			СуществующийСеансАктуален = РезультатВызова.data.invalidSessionIds.Найти(СостояниеЛицензированияПродукта.lockedSession.sessionId) = Неопределено;
			Если СуществующийСеансАктуален Тогда
				СостояниеЛицензированияПродукта.lockSessionCacheExpireDateISO8601 = Преобразование_ДатаВремя_ISO8601(ТекущаяДата() + 8);
				Если Не ЗначениеОпределено(ВходящиеСеансовыеДанные) Тогда
					УстановитьСеансовыеДанные(СеансовыеДанные);
				КонецЕсли;
				Результат = СоздатьРезультат(, , СостояниеЛицензированияПродукта.lockedSession);
				Результат.executionTimeHttp = РезультатВызова.executionTimeHttp;
				Результат.executionTime = РезультатВызова.executionTime;
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеОпределено(ПерсональныеНастройки.МетаданныеСервераЛицензий) Или Не СеансовыеДанные.СерверЛицензийДоступен Тогда
		РезультатВызова = lsAPI_Info(Неопределено, ПриоритетнаяСтрокаСоединения, СеансовыеДанные.ДанныеАвтономногоРежима);
		Если НетОшибок(РезультатВызова) Тогда
			СеансовыеДанные.СерверЛицензийДоступен = Истина;
			ПерсональныеНастройки.МетаданныеСервераЛицензий = TLicenseServerInfo(РезультатВызова.data, СеансовыеДанные.ДанныеАвтономногоРежима);
			УстановитьПерсональныеНастройки(ПерсональныеНастройки);
			МетаданныеСервераЛицензийАктуальны = Истина;
		КонецЕсли;
	КонецЕсли;
	Если НетОшибок(РезультатВызова) Тогда
		Если ЗначениеОпределено(СостояниеЛицензированияПродукта.productInfo.maintenanceSubscriptionId) И (СостояниеЛицензированияПродукта.productInfo.maintenanceSubscriptionCheckMode = 1 Или СостояниеЛицензированияПродукта.productInfo.maintenanceSubscriptionCheckMode = 2 Или СостояниеЛицензированияПродукта.productInfo.maintenanceSubscriptionCheckMode = 4) Тогда
			Если Не ЗначениеОпределено(СостояниеЛицензированияПродукта.subscriptionStatus) Тогда
				РезультатПолученияПодписки = lsAPI_GetSubscriptionDetails(СостояниеЛицензированияПродукта.productInfo.productId, СостояниеЛицензированияПродукта.productInfo.productVersion, СостояниеЛицензированияПродукта.productInfo.productKey, СостояниеЛицензированияПродукта.productInfo.productKeyAddon, СостояниеЛицензированияПродукта.productInfo.maintenanceSubscriptionId, ПриоритетнаяСтрокаСоединения, СеансовыеДанные.ДанныеАвтономногоРежима);
				СостояниеЛицензированияПродукта.subscriptionCheckNotAvailable = Ложь;
				Если НетОшибок(РезультатПолученияПодписки) Тогда
					РезультатПолученияПодписки.data = РезультатПолученияПодписки.data.responseData;
					СостояниеЛицензированияПродукта.subscriptionStatus = РезультатПолученияПодписки.data;
				Иначе
					СостояниеЛицензированияПродукта.subscriptionStatus = Неопределено;
					Если РезультатПолученияПодписки.code = 4513 Тогда
						СостояниеЛицензированияПродукта.subscriptionCheckNotAvailable = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ПодпискаПозволяетПолучитьЛицензию = ОпределитьДоступностьСборкиПоДатеВыпускаИСрокуДействияПодписки(СостояниеЛицензированияПродукта.productInfo.maintenanceSubscriptionCheckMode, СостояниеЛицензированияПродукта.productInfo.productReleaseDate, СостояниеЛицензированияПродукта.subscriptionStatus, ?(ЗначениеОпределено(СеансовыеДанные.ДанныеАвтономногоРежима), Преобразование_ДатаВремя_ISO8601(ТекущаяДата()), ПерсональныеНастройки.МетаданныеСервераЛицензий.info.serverTime));
		КонецЕсли;
	КонецЕсли;
	Если НетОшибок(РезультатВызова) Тогда
		Если Не ПодпискаПозволяетПолучитьЛицензию Тогда
			РезультатВызова = СоздатьРезультат(1010);
		КонецЕсли;
		Если НетОшибок(РезультатВызова) Тогда
			РезультатВызова = lsAPI_LockLicenseSession(МетаданныеПродукта.productId, МетаданныеПродукта.productVersion, МетаданныеПродукта.productKey, МетаданныеПродукта.productKeyAddon, ПриоритетнаяСтрокаСоединения, СеансовыеДанные.ДанныеАвтономногоРежима);
		КонецЕсли;
		Если НетОшибок(РезультатВызова) Тогда
			РезультатВызова.data = РезультатВызова.data.responseData;
		КонецЕсли;
	КонецЕсли;
	Если НетОшибок(РезультатВызова) Тогда
		СостояниеЛицензированияПродукта.error = Неопределено;
		СостояниеЛицензированияПродукта.lockedSession = РезультатВызова.data;
		СостояниеЛицензированияПродукта.lockSessionCacheExpireDateISO8601 = Преобразование_ДатаВремя_ISO8601(ТекущаяДата() + 8);
	Иначе
		СостояниеЛицензированияПродукта.error = РезультатВызова;
		СостояниеЛицензированияПродукта.lockedSession = Неопределено;
		СостояниеЛицензированияПродукта.lockSessionCacheExpireDateISO8601 = Неопределено;
	КонецЕсли;
	СостояниеЛицензированияПродукта.connectionSettingsSnapshot = TClientConnectionSettings(Неопределено, ПриоритетнаяСтрокаСоединения);
	Если СеансовыеДанные.ПриоритетнаяСтрокаСоединения <> ПриоритетнаяСтрокаСоединения Тогда
		СеансовыеДанные.ПриоритетнаяСтрокаСоединения = ПриоритетнаяСтрокаСоединения;
	КонецЕсли;
	Если Не ЗначениеОпределено(ВходящиеСеансовыеДанные) Тогда
		УстановитьСеансовыеДанные(СеансовыеДанные);
	КонецЕсли;
	Возврат РезультатВызова;
КонецФункции
Функция ПолучитьПараметрЛицензии(МетаданныеПродукта, ИдентификаторПараметра) Экспорт
	СеансовыеДанные = ПолучитьСеансовыеДанные();
	ПриоритетнаяСтрокаСоединения = СеансовыеДанные.ПриоритетнаяСтрокаСоединения;
	РезультатВызова = lsAPI_GetLicenseParameter(МетаданныеПродукта.productId, МетаданныеПродукта.productVersion, МетаданныеПродукта.productKey, МетаданныеПродукта.productKeyAddon, ИдентификаторПараметра, ПриоритетнаяСтрокаСоединения, СеансовыеДанные.ДанныеАвтономногоРежима);
	Если НетОшибок(РезультатВызова) Тогда
		РезультатВызова.data = РезультатВызова.data.responseData;
	КонецЕсли;
	Если СеансовыеДанные.ПриоритетнаяСтрокаСоединения <> ПриоритетнаяСтрокаСоединения Тогда
		СеансовыеДанные.ПриоритетнаяСтрокаСоединения = ПриоритетнаяСтрокаСоединения;
		УстановитьСеансовыеДанные(СеансовыеДанные);
	КонецЕсли;
	Возврат РезультатВызова;
КонецФункции
Функция ПолучитьСведенияОПодписке(МетаданныеПродукта, ИдентификаторВидаПодписки) Экспорт
	СеансовыеДанные = ПолучитьСеансовыеДанные();
	ПриоритетнаяСтрокаСоединения = СеансовыеДанные.ПриоритетнаяСтрокаСоединения;
	РезультатВызова = lsAPI_GetSubscriptionDetails(МетаданныеПродукта.productId, МетаданныеПродукта.productVersion, МетаданныеПродукта.productKey, МетаданныеПродукта.productKeyAddon, ИдентификаторВидаПодписки, ПриоритетнаяСтрокаСоединения, СеансовыеДанные.ДанныеАвтономногоРежима);
	Если НетОшибок(РезультатВызова) Тогда
		РезультатВызова.data = РезультатВызова.data.responseData;
	КонецЕсли;
	Если СеансовыеДанные.ПриоритетнаяСтрокаСоединения <> ПриоритетнаяСтрокаСоединения Тогда
		СеансовыеДанные.ПриоритетнаяСтрокаСоединения = ПриоритетнаяСтрокаСоединения;
		УстановитьСеансовыеДанные(СеансовыеДанные);
	КонецЕсли;
	Возврат РезультатВызова;
КонецФункции
Функция ПроверитьДоступностьПродуктов(МетаданныеПродукта, ИдентификаторыПродуктов) Экспорт
	СеансовыеДанные = ПолучитьСеансовыеДанные();
	ПриоритетнаяСтрокаСоединения = СеансовыеДанные.ПриоритетнаяСтрокаСоединения;
	РезультатВызова = lsAPI_CheckProductAvailability(МетаданныеПродукта.productId, МетаданныеПродукта.productVersion, МетаданныеПродукта.productKey, МетаданныеПродукта.productKeyAddon, ИдентификаторыПродуктов, ПриоритетнаяСтрокаСоединения, СеансовыеДанные.ДанныеАвтономногоРежима);
	Если НетОшибок(РезультатВызова) Тогда
		РезультатВызова.data = РезультатВызова.data.responseData;
	КонецЕсли;
	Если СеансовыеДанные.ПриоритетнаяСтрокаСоединения <> ПриоритетнаяСтрокаСоединения Тогда
		СеансовыеДанные.ПриоритетнаяСтрокаСоединения = ПриоритетнаяСтрокаСоединения;
		УстановитьСеансовыеДанные(СеансовыеДанные);
	КонецЕсли;
	Возврат РезультатВызова;
КонецФункции
Функция СведенияСервераЛицензий(СтрокаПодключения = "") Экспорт
	СеансовыеДанные = ПолучитьСеансовыеДанные();
	ПриоритетнаяСтрокаСоединения = Неопределено;
	НастройкиСоединения = Неопределено;
	Если СтрокаПодключения <> "" Тогда
		НастройкиКлиентаЛицензирования = ПолучитьНастройки();
		НастройкиКлиентаЛицензирования.АдресСервераЛицензий = СтрокаПодключения;
		НастройкиСоединения = TClientConnectionSettings(НастройкиКлиентаЛицензирования);
		Результат = lsAPI_Info(НастройкиСоединения, ПриоритетнаяСтрокаСоединения, СеансовыеДанные.ДанныеАвтономногоРежима);
	Иначе
		ПриоритетнаяСтрокаСоединения = СеансовыеДанные.ПриоритетнаяСтрокаСоединения;
		Результат = lsAPI_Info(НастройкиСоединения, ПриоритетнаяСтрокаСоединения, СеансовыеДанные.ДанныеАвтономногоРежима);
		Если СеансовыеДанные.ПриоритетнаяСтрокаСоединения <> ПриоритетнаяСтрокаСоединения Тогда
			СеансовыеДанные.ПриоритетнаяСтрокаСоединения = ПриоритетнаяСтрокаСоединения;
			УстановитьСеансовыеДанные(СеансовыеДанные);
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Функция ПолучитьНастройки(ПринудительноПолучитьПерсональные = Ложь, ИмяПользователя = Неопределено) Экспорт
	Если ПринудительноПолучитьПерсональные Тогда
		Результат = ПолучитьПерсональныеНастройки(ИмяПользователя);
	Иначе
		Попытка
			ПерсональныеНастройкиСтруктура = ХранилищеОбщихНастроек.Загрузить("сл2", "ПерсональныеНастройки", , ИмяПользователя);
			ОбщиеНастройкиСтруктура = ХранилищеОбщихНастроек.Загрузить("сл2", "ОбщиеНастройки", , "");
			Если Не ЗначениеОпределено(ПерсональныеНастройкиСтруктура) И Не ЗначениеОпределено(ОбщиеНастройкиСтруктура) Тогда
				ОбщиеНастройкиСтруктура = TClientSettings(Истина);
				УстановитьОбщиеНастройки(ОбщиеНастройкиСтруктура);
				ПерсональныеНастройкиСтруктура = TClientSettings(Ложь);
				УстановитьПерсональныеНастройки(ПерсональныеНастройкиСтруктура);
			КонецЕсли;
		Исключение
		КонецПопытки;
		Результат = ПолучитьОбщиеНастройки();
		Если Не ЗначениеОпределено(Результат) Тогда
			Результат = ПолучитьПерсональныеНастройки(ИмяПользователя);
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции
Процедура УстановитьОбщиеНастройки(Знач ОбщиеНастройкиСтруктура) Экспорт
	ХранилищеОбщихНастроек.Сохранить("сл2", "ОбщиеНастройки", ОбщиеНастройкиСтруктура, , "");
КонецПроцедуры
Процедура УстановитьПерсональныеНастройки(Знач ПерсональныеНастройкиСтруктура, ИмяПользователя = Неопределено) Экспорт
	ХранилищеОбщихНастроек.Сохранить("сл2", "ПерсональныеНастройки", ПерсональныеНастройкиСтруктура, , ИмяПользователя);
КонецПроцедуры
Функция ПродлитьВремяЖизниСеансов(МетаданныеПродукта, СоответствиеПулМассивСеансов, ПриоритетнаяСтрокаСоединения = Неопределено, АвтономныеДанные = Неопределено) Экспорт
	Если Не ЗначениеОпределено(ПриоритетнаяСтрокаСоединения) Тогда
		СеансовыеДанные = ПолучитьСеансовыеДанные();
		ПриоритетнаяСтрокаСоединения = СеансовыеДанные.ПриоритетнаяСтрокаСоединения;
	КонецЕсли;
	РезультатВызова = lsAPI_TouchLicenseSessions(МетаданныеПродукта.productId, МетаданныеПродукта.productVersion, МетаданныеПродукта.productKey, МетаданныеПродукта.productKeyAddon, СоответствиеПулМассивСеансов, ПриоритетнаяСтрокаСоединения, АвтономныеДанные);
	Если НетОшибок(РезультатВызова) Тогда
		РезультатВызова.data = РезультатВызова.data.responseData;
	КонецЕсли;
	Возврат РезультатВызова;
КонецФункции
Функция ОсвободитьЛицензиюНаСеанс(МетаданныеПродукта, ИдентификаторПулаЛицензий, ИдентификаторСеанса, ЗавершитьЛицензирование = Ложь, ВходящиеСеансовыеДанные = Неопределено, СнимокНастроекСоединения = Неопределено, АвтономныеДанные = Неопределено) Экспорт
	РезультатВызова = lsAPI_ReleaseLicenseSession(МетаданныеПродукта.productId, МетаданныеПродукта.productVersion, МетаданныеПродукта.productKey, МетаданныеПродукта.productKeyAddon, ИдентификаторПулаЛицензий, ИдентификаторСеанса, СнимокНастроекСоединения, АвтономныеДанные);
	Если ЗавершитьЛицензирование Тогда
		СеансовыеДанные = ВходящиеСеансовыеДанные;
		Если Не ЗначениеОпределено(СеансовыеДанные) Тогда
			СеансовыеДанные = ПолучитьСеансовыеДанные();
			ИндексУдаляемойЗаписи = Неопределено;
			Для итератор = 0 По СеансовыеДанные.СостоянияЛицензированияПродуктов.Количество() - 1 Цикл
				СостояниеЛицензирования = СеансовыеДанные.СостоянияЛицензированияПродуктов[итератор];
				Если СостояниеЛицензирования.productInfo.productId = МетаданныеПродукта.productId И ЗначениеОпределено(СостояниеЛицензирования.lockedSession) И СостояниеЛицензирования.lockedSession.poolCId = ИдентификаторПулаЛицензий И СостояниеЛицензирования.lockedSession.sessionId = ИдентификаторСеанса Тогда
					ИндексУдаляемойЗаписи = итератор;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЗначениеОпределено(ИндексУдаляемойЗаписи) Тогда
				СеансовыеДанные.СостоянияЛицензированияПродуктов.Удалить(ИндексУдаляемойЗаписи);
				Если Не ЗначениеОпределено(ВходящиеСеансовыеДанные) Тогда
					УстановитьСеансовыеДанные(СеансовыеДанные);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если НетОшибок(РезультатВызова) Тогда
		РезультатВызова.data = РезультатВызова.data.responseData;
	КонецЕсли;
	Возврат РезультатВызова;
КонецФункции
Функция ПроверитьДоступностьСервераЛицензий(СтрокаПодключения) Экспорт
	Результат = Неопределено;
	Если СтрокаПодключения = "" Тогда
		Возврат Результат;
	КонецЕсли;
	РезультатПроверкиДоступности = СведенияСервераЛицензий(СтрокаПодключения);
	Если НетОшибок(РезультатПроверкиДоступности) И РезультатПроверкиДоступности.data.Свойство("type") И РезультатПроверкиДоступности.data.type = "TLicenseServerUIInfo" Тогда
		Результат = Новый Структура("Версия,Пинг", РезультатПроверкиДоступности.data.version, РезультатПроверкиДоступности.executionTimeHttp);
	КонецЕсли;
	Возврат Результат;
КонецФункции
