
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ШиринаЛенты = Константы.омг_ШиринаЛентыПечатиНаправления.Получить();
	Шаблон = Константы.омг_МакетНаправленияЛИС.Получить().Получить();
	ПечатьЧерезПринтерЧеков = Константы.омг_ПечатьНаправленияЧерезПринтерЧеков.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	
	Константы.омг_ШиринаЛентыПечатиНаправления.Установить(ШиринаЛенты);
	Константы.омг_МакетНаправленияЛИС.Установить(Новый ХранилищеЗначения(Шаблон, Новый СжатиеДанных(9)));
	Константы.омг_ПечатьНаправленияЧерезПринтерЧеков.Установить(ПечатьЧерезПринтерЧеков);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОКНаСервере();
	Закрыть();
КонецПроцедуры
