#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сотрудник		= РаботаСФормамиСервер.ПолучитьНастройкуФормы("ПараметрыРасчетаЗППроверкаАлгоритма", "Сотрудник");
	НачалоПериода	= РаботаСФормамиСервер.ПолучитьНастройкуФормы("ПараметрыРасчетаЗППроверкаАлгоритма", "НачалоПериода");
	КонецПериода	= РаботаСФормамиСервер.ПолучитьНастройкуФормы("ПараметрыРасчетаЗППроверкаАлгоритма", "КонецПериода");
	Документ		= РаботаСФормамиСервер.ПолучитьНастройкуФормы("ПараметрыРасчетаЗППроверкаАлгоритма", "Документ");
	
	// Ограничение типа для значений параметров алгоритма
	ДопустимыеТипы = Новый Массив;
	ДопустимыеТипы.Добавить(Тип("Булево"));
	ДопустимыеТипы.Добавить(Тип("Число"));
	ДопустимыеТипы.Добавить(Тип("Дата"));
	ДопустимыеТипы.Добавить(Тип("Строка"));
	
	Для Каждого РазделМетаданных Из ОбщегоНазначенияБИТКлиентСервер.НовыйМассив("Справочники", "Документы", "ПланыВидовХарактеристик", "ПланыВидовРасчета") Цикл
		Для Каждого Метаданное Из Метаданные[РазделМетаданных] Цикл
			Если Метаданное.ИспользоватьСтандартныеКоманды
				И Не СтрНачинаетсяС(Метаданное.Имя, "Удалить")
				И Не СтрНачинаетсяС(Метаданное.Имя, "удалить")
				И Не СтрНачинаетсяС(Метаданное.Синоним, "(Не используется)")
				И Не СтрНачинаетсяС(Метаданное.Синоним, "(не используется)")
			Тогда
				ДопустимыеТипы.Добавить(ТипЗнч(ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Метаданное.ПолноеИмя()).ПустаяСсылка()));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Элементы.КонстантыЗначение.ОграничениеТипа = Новый ОписаниеТипов(ДопустимыеТипы);
	
	// Доступность редактирования текста алгоритма
	Если Не ЭтотОбъект.ТолькоПросмотр Тогда
		ЕстьПравоИзмененияАлгоритма = ПравоДоступа("Редактирование", Метаданные.Справочники.ПараметрыРасчетаЗП.Реквизиты.АлгоритмРасчета);
		Элементы.ДекорацияНетПравИзменятьАлгоритм.Видимость = Не ЕстьПравоИзмененияАлгоритма;
		Элементы.ПодробнаяПодсказкаАлгоритма.Видимость = ЕстьПравоИзмененияАлгоритма;
	КонецЕсли;

	////////////////////////////////////////////////////
	// ОМГ + 
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИспользуетсяПриоритизацияУслуг", Тип("ПолеФормы"),ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.омг_ИспользуетсяПриоритизацияУслуг";   
	Элементы.Переместить(НовыйЭлемент,ЭтаФорма,Элементы.ГруппаАлгоритмРасчета); 
	НовыйЭлемент.УстановитьДействие("ПриИзменении","ПриИзмененииИспользуетсяПриоритизацияУслуг");
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ЭтоПроцент", Тип("ПолеФормы"),ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ЭтоПроцент";   
	Элементы.Переместить(НовыйЭлемент,ЭтаФорма,Элементы.ГруппаАлгоритмРасчета);  
	// ОМГ -
	////////////////////////////////////////////////////

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриИзмененииТипПараметра();
	
	////////////////////////////////////////////////////
	// омг +
	
	ПроверкаИспользуетсяПриоритизацияУслуг()
	
	// омг -
	////////////////////////////////////////////////////
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для Каждого СтрокаПараметр Из Объект.Параметры Цикл
		Если Не ОбщегоНазначенияКлиентСервер.ИмяПараметраКорректно(СтрокаПараметр.Имя) Тогда
			ШаблонОшибки = НСтр("ru='Имя параметра ""%1"" не корректно'");
			Поле = СтрШаблон("Объект.Параметры[%1].Имя", Формат(СтрокаПараметр.НомерСтроки - 1, "ЧГ="));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ШаблонОшибки, СтрокаПараметр.Имя),, Поле,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		РаботаСФормамиСервер.СохранитьНастройкиФормы(СтруктураПараметровВыполнения(), "ПараметрыРасчетаЗППроверкаАлгоритма"); 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьАлгоритм(Команда)
	
	Если РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтаФорма) Тогда
		
		ПарамерыВычисления = СтруктураПараметровВыполнения();
		ПроизошлаОшибка = Ложь;
		
		Результат = ВыполнитьВычисление(Объект.Ссылка, ПарамерыВычисления, ПроизошлаОшибка);
		
		Если ПроизошлаОшибка Тогда
			ПоказатьПредупреждение(,НСтр("ru='Произошла ошибка при выполнении алгоритма'"), 30, НСтр("ru='Выполнено с ошибками'"));
		Иначе
			ПоказатьПредупреждение(,Результат, 30, НСтр("ru='Выполнено успешно'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипПараметраПриИзменении(Элемент)
	ПриИзмененииТипПараметра();
КонецПроцедуры

&НаКлиенте
Процедура КонстантыНаименованиеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	// Проверка корректности текста для информирования пользователя - что надо исправить в имени константы
    Текст = СокрЛП(Текст);

	Если ОбщегоНазначенияКлиентСервер.НайтиНедопустимыеСимволыВИмениФайла(Текст).Количество() > 0
		Или СтрНайти(Текст,"!") > 0 
	Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Недопустимые символы ""/\[]:;|=,?*<>! ",,"КонстантыНаименование");	
	КонецЕсли;
	
	Если СтрНайти(Текст," ") > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Недопустимые использовать в наименовании пробел",,"КонстантыНаименование");
	КонецЕсли;

	Если ПустаяСтрока(Текст) Тогда
	    ОбщегоНазначенияКлиент.СообщитьПользователю("Наименование не может быть пустым",,"КонстантыНаименование");
	ИначеЕсли СтрНайти("0123456789",Лев(Текст,1)) > 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Наименование не должно начинаться с цифры",,"КонстантыНаименование");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриИзмененииТипПараметра()
	
	Элементы.ГруппаАлгоритмРасчета.Видимость = Объект.ТипПараметра = ПредопределенноеЗначение("Перечисление.ТипыПараметровРасчетаЗарплаты.ПроизвольныйАлгоритм");
	
КонецПроцедуры

&НаКлиенте
Функция СтруктураПараметровВыполнения()
	
	ПарамерыВычисления = Новый Структура;
	ПарамерыВычисления.Вставить("Сотрудник", Сотрудник);
	ПарамерыВычисления.Вставить("НачалоПериода", НачалоПериода);
	ПарамерыВычисления.Вставить("КонецПериода", КонецДня(КонецПериода));
	ПарамерыВычисления.Вставить("Документ", Документ);
	
	// Добавляем пользовательские константы, значение может быть Неопределено или Пустой ссылкой
	КонстантыАлгоритма = Новый Структура();
	Для Каждого СтрокаТаблицы Из Объект.Параметры Цикл
		Если ОбщегоНазначенияКлиентСервер.ИмяПараметраКорректно(СтрокаТаблицы.Имя)	Тогда
			КонстантыАлгоритма.Вставить(СтрокаТаблицы.Имя, СтрокаТаблицы.Значение);
		КонецЕсли;
	КонецЦикла;
	ПарамерыВычисления.Вставить("Параметры", КонстантыАлгоритма);
	
	Возврат ПарамерыВычисления;
	
КонецФункции

&НаСервереБезКонтекста
Функция ВыполнитьВычисление(ПараметрРасчета, ПарамерыВычисления, ПроизошлаОшибка)
	
	Возврат Справочники.ПараметрыРасчетаЗП.ВыполнитьРасчетАлгоритмаПараметраРасчета(ПараметрРасчета, ПарамерыВычисления, ПроизошлаОшибка);

КонецФункции

#КонецОбласти            

/////////////////////////////////////////////////////
// ОМГ

 &НаКлиенте
Процедура ПриИзмененииИспользуетсяПриоритизацияУслуг(Элемент)
	
	ПроверкаИспользуетсяПриоритизацияУслуг()

КонецПроцедуры

 &НаКлиенте
Процедура ПроверкаИспользуетсяПриоритизацияУслуг()
	
	Если Объект.омг_ИспользуетсяПриоритизацияУслуг = Истина Тогда
		Элементы.ГруппаПроверкаАлгоритма.Видимость = Ложь; 
		Элементы.АлгоритмРасчета.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;  
		Элементы.АлгоритмРасчета.Заголовок = "Установленные отборы";
	иначе 	
		Элементы.ГруппаПроверкаАлгоритма.Видимость = Истина; 
		Элементы.АлгоритмРасчета.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;  
		Элементы.АлгоритмРасчета.Заголовок = "";	
	КонецЕсли;

КонецПроцедуры	

// ОМГ  
/////////////////////////////////////////////////////
