
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВремяНачала = ТекущаяДата();
	
	Если ВидОперации = "Продажа" Тогда
		Если ЭтоКаспи Тогда
			КодТранзакции  = омг_ИнтеграцияОплатыНаТерминалы.ЗапросНаТерминалПродажа(Сумма, АдресТерминала, Порт, ЭтоКаспи);
		Иначе
			КодТранзакции  = омг_ИнтеграцияОплатыНаТерминалы.ВыполнитьОперациюПокупкиHalyk(Сумма, АдресТерминала, Порт);
		КонецЕсли;
		ПодключитьОбработчикОжидания("ПроверитьСтатус", 1, Ложь);
	ИначеЕсли ВидОперации = "Возврат" Тогда
		Если ЭтоКаспи Тогда
			Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
			ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОбработкаВариантаОтвета", ЭтотОбъект);
			ОткрытьФорму("ОбщаяФорма.омг_ФормаВопросаВариантаОплаты",,,,,, ОбработчикОповещения, Режим);
		Иначе
			АйдиТранзакции = омг_ИнтеграцияОплатыНаТерминалы.ВыполнитьОперациюВозвратаHalyk(Сумма, АдресТерминала, Порт, КодТранзакции);
			ПодключитьОбработчикОжидания("ПроверитьСтатус", 1, Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОбработкаВариантаОтвета(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	АйдиТранзакции = омг_ИнтеграцияОплатыНаТерминалы.ЗапросНаТерминалВозврат(Сумма, АдресТерминала, Порт, ЭтоКаспи, КодТранзакции, РезультатОткрытияФормы);
	ПодключитьОбработчикОжидания("ПроверитьСтатус", 1, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСтатус() Экспорт
	
	Если ВидОперации = "Продажа" Тогда
		Код = КодТранзакции;
	ИначеЕсли ВидОперации = "Возврат" Тогда
		Код = АйдиТранзакции; 
	КонецЕсли;	
	
	Если Не АдресТерминала = "local" Тогда
		
		Если Не ЭтоКаспи Тогда
			Если ЗначениеЗаполнено(Код) Тогда 
				СтруктураОтвета = Новый Структура("status, chequeInfo, transId", "success", Новый Структура("method", "card"), Код);
			ИначеЕсли Не Код = Неопределено Тогда
				СтруктураОтвета = Новый Структура("status", "false");
			Иначе
				Элементы.Декорация1.Видимость = Ложь;
				Элементы.Декорация3.Видимость = Истина;
				Элементы.Декорация3.Заголовок = "Нет связи с терминалом, нажмите вручную";
				Возврат;
				
			КонецЕсли;
		Иначе
			
			Соединение = Новый HTTPСоединение(АдресТерминала, Порт, , , , 10);
			
			Если ЭтоКаспи Тогда
				СтрокаЗапроса = "/status?processId="+Код+"";
			Иначе
				СтрокаЗапроса = "/status?task=" + Код + "";
			КонецЕсли;
			Запрос = Новый HTTPЗапрос(СтрокаЗапроса);
			Запрос.Заголовки.Вставить("Content-type", "application/json");
			
			Попытка
				Ответ = Соединение.Получить(Запрос);
			Исключение 
				Элементы.Декорация1.Видимость = Ложь;
				Элементы.Декорация3.Видимость = Истина;
				Элементы.Декорация3.Заголовок = "Нет связи с терминалом, нажмите вручную";
				Возврат;
			КонецПопытки;
			
			Если Ответ.КодСостояния <> 200 Тогда
				Элементы.Декорация1.Видимость = Ложь;
				Элементы.Декорация3.Видимость = Истина;
				Элементы.Декорация3.Заголовок = "Ошибка терминала, нажмите вручную";
				Элементы.Декорация4.Видимость = Истина;
				Элементы.Декорация4.Заголовок = Ответ.ПолучитьТелоКакСтроку();
				Возврат;
			КонецЕсли;
			
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
			
			СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
		КонецЕсли;
		
	Иначе
		
		Если ЭтоКаспи Тогда
			
			Если ТекущаяДата() >= ВремяНачала + 10 Тогда 
				СтруктураОтвета = Новый Структура("status, chequeInfo, transactionId", "success", Новый Структура("method", "card"), "12345678");
			Иначе
				СтруктураОтвета = Новый Структура("status", "wait");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
		
	Если СтруктураОтвета.status = "wait" Тогда
		////  Ожидание
	ИначеЕсли СтруктураОтвета.status = "fail" ИЛИ СтруктураОтвета.status = "false" Тогда
		ОтключитьОбработчикОжидания("ПроверитьСтатус");
		ЭтаФорма.Закрыть("Нет");
		ВызватьИсключение "Отмена операции на терминале";
	ИначеЕсли СтруктураОтвета.status = "success" ИЛИ СтруктураОтвета.status = "true" Тогда
			ОтключитьОбработчикОжидания("ПроверитьСтатус");
			Если ЭтоКаспи Тогда
				Метод = СтруктураОтвета.chequeInfo.method;
			КонецЕсли;
			Если ВидОперации = "Продажа" Тогда
				ЭтаФорма.Закрыть(?(ЭтоКаспи, ?(Метод = "card", СтруктураОтвета.transactionId, СтруктураОтвета.chequeInfo.orderNumber), СтруктураОтвета.transId));
			ИначеЕсли ВидОперации = "Возврат" Тогда
				ЭтаФорма.Закрыть("Да"); 
			КонецЕсли;			
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресТерминала = Параметры.ДанныеТерминалаИнтеграция.АдресТерминала;
	Сумма               = Параметры.Сумма;
	ВидОперации         = Параметры.ВидОперации;
	КодТранзакции       = Параметры.НомерТранзакцииТерминала;
	Порт = Параметры.ДанныеТерминалаИнтеграция.ПортТерминала;
	Если Параметры.ДанныеТерминалаИнтеграция.ИспользуемыйТерминал = Перечисления.омг_ВидыТерминалов.Kaspi Тогда
		ЭтоКаспи = Истина;
	Иначе
		ЭтоКаспи = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Вручную(Команда)
	
	ЭтаФорма.Закрыть("ДА");
	
КонецПроцедуры
