#Область СтандартныеПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Результат = Параметры.НачальноеЗначение; 
	ВычислитьПоляПоРезультату(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры
	
#КонецОбласти

#Область СтандартныеСобытия 

&НаКлиенте
Процедура НарушениеПроизношенияЗвукиПриИзменении(Элемент)
	НарушениПроизношения = ЗначениеЗаполнено(Элемент.ТекстРедактирования);
КонецПроцедуры

&НаКлиенте
Процедура СмещениеВпередПриИзменении(Элемент)
	ПривычноеСмещениеНижнейЧелюсти = (Вперед ИЛИ ВСторону);
КонецПроцедуры

&НаКлиенте
Процедура ВСторонуПриИзменении(Элемент)
	ПривычноеСмещениеНижнейЧелюсти = (Вперед ИЛИ ВСторону);
КонецПроцедуры 

#КонецОбласти


#Область ЗаполнениеРезультата

&НаКлиенте
Процедура Принять(Команда)
	Закрыть(ВычислитьРезультатПоПолям());
КонецПроцедуры

// Заполняем все отмеченные значения заголовками выбранных элементов
// Все разделяем символом ";"
// Для "Дополнительно" будет "Дополнительно: <Значение строки Дополнительно>"
// Для НарушениПроизношения проверяется значение галочки (она изменяется только посредство ввода текста)
// И будет "НарушениПроизношения звуов речи: <Значение Строки НарушениеПроизношенияЗвуки>"
&НаКлиенте
Функция ВычислитьРезультатПоПолям()
	                         
	Результат = "";
	
	// Жалобы могут быть разные, но не противоречат друг другу, но их перечисление будет <ж1>, <Ж2>: <жжжж>
	Если Эстетические Тогда
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Результат, "эстетические",", ");
	КонецЕсли;
	
	Если Морфологические Тогда
    	ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Результат, "морфологические",", ");
	КонецЕсли;
	
	Если ФункциональныеСоСловРодителей Тогда
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Результат, "функциональные (со слов родителей)",", ");	
	КонецЕсли;
	
	// Если были перечисления - добавим в конец ": "
	ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Результат, "",": ");
	
	// Пройдёмся по жалобам
	Для каждого ЭлементФормыБокс Из ЭтаФорма.ПодчиненныеЭлементы.ПеречислениеВсехБулевых.ПодчиненныеЭлементы Цикл
		
		ИмяРеквизита = СтрЗаменить(ЭлементФормыБокс.Имя, "1", "");
		ЗначениеЗаголовкаРеквизита = ЭлементФормыБокс.Заголовок;
		
		Если ЭтаФорма[ИмяРеквизита] = Истина Тогда
			ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Результат, ЗначениеЗаголовкаРеквизита,"; ");		
		КонецЕсли;
			
	КонецЦикла; 
	
	// Отдельно проверяем Аллергию
	Если НарушениПроизношения Тогда	
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Результат,СтрШаблон("Нарушения произношения звуков речи: %1",
														НарушениеПроизношенияЗвуки),"; ");	
	КонецЕсли;
	
	// Отдельно проверяем Прочие
	Если ЗначениеЗаполнено(Дополнительно) Тогда	                                                 
		ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(Результат,СтрШаблон("Дополнительно: %1", Дополнительно),"; ");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Результат = "Нет";
	Иначе
		Результат = СтрЗаменить(Результат,": ;",": ");
		Результат = СтрЗаменить(Результат,":;",": ");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ВычислитьПоляПоРезультату(РезультатСтрокой)
	
	// Получаем предыдущее значение параметра, которое было для этой обработки
	Если Не ЗначениеЗаполнено(РезультатСтрокой) Тогда
		Возврат;
	КонецЕсли;
	
	// В начале строки есть виды жалоб, от 0 до 3, отделенные запятой, оканчивающееся на ": "
	МассивСтрок = СтрРазделить(РезультатСтрокой,":");
	Если МассивСтрок.Количество() > 1 Тогда
		
		// Первый элемент - это перечень жалоб
		Если СтрНайти(МассивСтрок[0], "эстетические") <> 0 Тогда
			Эстетические = Истина;	
		КонецЕсли; 
		
		Если СтрНайти(МассивСтрок[0], "морфологические") <> 0 Тогда
			Морфологические = Истина;	
		КонецЕсли;
		
		Если СтрНайти(МассивСтрок[0], "функциональные") <> 0 Тогда
			ФункциональныеСоСловРодителей = Истина;		
		КонецЕсли;
		
		Если Эстетические ИЛИ Морфологические ИЛИ ФункциональныеСоСловРодителей Тогда
		    РезультатСтрокой = СтрЗаменить(РезультатСтрокой,МассивСтрок[0],""); 
		КонецЕсли;
	КонецЕсли;
	
	// Получим массив строк по разделителю - символу ";"
	МассивСтрок = СтрРазделить(РезультатСтрокой,";");
	
	// Параметры-боксы записываются чисто по своему названию (кроме исключений)
	Для каждого ЭлементСтрока Из МассивСтрок Цикл
		         
		// Дополнительно ВСЕГДА имеют начало "Дополнительно:"
		Если СтрНачинаетсяС(СокрЛП(ЭлементСтрока),"Дополнительно: ") Тогда
			Дополнительно = Сред(СокрЛП(ЭлементСтрока),16);
			Продолжить;
		ИначеЕсли СтрНачинаетсяС(СокрЛП(ЭлементСтрока),"Нарушения произношения звуков речи: ") Тогда
			НарушениеПроизношенияЗвуки = Сред(СокрЛП(ЭлементСтрока),37);
			НарушениПроизношения = Истина;
			Продолжить;
		КонецЕсли;
		
		// Остальные проверяем - их значение должно совпадает с именем поля формы 
		// Уберём пробелы, и особые знаки, что не могут быть использованы
		ЭлементСтрока = СтрЗаменить(ЭлементСтрока," ","");
		ЭлементСтрока = СтрЗаменить(ЭлементСтрока,"-","");
		ЭлементСтрока = СтрЗаменить(ЭлементСтрока,",","");
		ЭлементСтрока = СтрЗаменить(ЭлементСтрока,":","");
		ЭлементСтрока = СтрЗаменить(ЭлементСтрока,")","");
		ЭлементСтрока = СтрЗаменить(ЭлементСтрока,"(","");
		
		Попытка
			ЭтаФорма[ЭлементСтрока] = Истина;
		Исключение
			//НайденныйЭлементФормы = Элементы.Найти(ЭлементСтрока);
		КонецПопытки;

	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
