&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если СправочникПустой() Тогда
		Ответ = Вопрос("Заполнить справочник?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗаполнитьСправочникНаСервере();
			Элементы.Список.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСправочникНаСервере()
	
	Макет = Справочники.ФакторыРиска.ПолучитьМакет("ДанныеДляЗаполненияСправочника");
	Группа = Неопределено;
	Подгруппа = Неопределено;
	
	Для строка = 2 По Макет.ВысотаТаблицы Цикл
		
		Объект = Справочники.ФакторыРиска.СоздатьЭлемент();
		Объект.Наименование = Макет.Область("R" + строка + "C2").Текст;
		Объект.Баллы = Макет.Область("R" + строка + "C3").Текст;
		
		Если Макет.Область("R" + строка + "C4").Текст = "+" Тогда
			Объект.ВозможенВыборНесколькихДочернихЭлементов = Истина;
		Иначе
			Объект.ВозможенВыборНесколькихДочернихЭлементов = Ложь;
		КонецЕсли;
		
		Если Макет.Область("R" + строка + "C1").Текст = "1" Тогда
			Объект.Родитель = Группа;
		ИначеЕсли Макет.Область("R" + строка + "C1").Текст = "2" Тогда
			Объект.Родитель = Подгруппа;
		КонецЕсли;
		
		Объект.Записать();
		
		Если Макет.Область("R" + строка + "C1").Текст = "0" Тогда
			Группа = Объект.Ссылка;	
		ИначеЕсли Макет.Область("R" + строка + "C1").Текст = "1" Тогда
			Подгруппа = Объект.Ссылка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СправочникПустой()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ФакторыРиска.Ссылка
		|ИЗ
		|	Справочник.ФакторыРиска КАК ФакторыРиска";
	
	РезультатЗапроса = Запрос.Выполнить();
		
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

