
Процедура Обработчик_ПослеОтветаНаВопросОбОтправкеВЛИС(Форма, Объект) Экспорт
	
	омг_ЗаявкаЛИСОбщиеКлиентСерверныеПроцедуры.Обработчик_ПослеОтветаНаВопросОбОтправкеВЛИС(Форма, Объект);
	
КонецПроцедуры

Процедура ПоказатьВыборБиоматериалов(ЭтаФорма, МассивУслуг, МассивЗаявок =  Неопределено, МассивНоменклатуры = Неопределено) Экспорт
	
	
	СсылкиНаДокументы = Новый Массив;
	Если МассивЗаявок = Неопределено Тогда
		СсылкиНаДокументы.Добавить(ЭтаФорма.Объект.Ссылка);
	ИначеЕсли МассивЗаявок.Количество() = 0 Тогда
		Возврат;
	Иначе
		СсылкиНаДокументы.Добавить(МассивЗаявок[0].Ссылка);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВыбораБиоматериаловОбработкаПодборкаПоУШК", 
		омг_ЗаявкаЛИСОбщиеКлиентскиеПроцедуры, Новый Структура("МассивЗаявок, МассивНоменклатуры, ФормаЗаявки, СсылкиНаДокументы", МассивЗаявок, МассивНоменклатуры, ЭтаФорма, СсылкиНаДокументы));
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МассивУслуг", МассивУслуг);
	
	
	СтруктураШапки = Новый Структура("Документ, Объект");
	ЗаполнитьЗначенияСвойств(СтруктураШапки, ЭтаФорма);
	СтруктураПараметров.Вставить("Документ", ?(СтруктураШапки.Документ = Неопределено, СтруктураШапки.Объект.Ссылка, СтруктураШапки.Документ));
	
	ОткрытьФорму("Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Форма.ФормаВыборБиоматериалов", 
		СтруктураПараметров, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

Процедура Обработчик_ПослеОтветаНаВопросОбОтменеЗаявки(Ответ, ДопПараметры) Экспорт
	
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СостояниеПоЗаявке = омг_ЗаявкаЛИСОбщиеСервеныеПроцедуры.ПолучитьСостояниеПоЗаявке(ДопПараметры.Заявка);
	
	Если СостояниеПоЗаявке.Доступна И Не СостояниеПоЗаявке.Завершено И Не СостояниеПоЗаявке.ПолученыБланки Тогда
		Если омг_ЗаявкаЛИСОбщиеСервеныеПроцедуры.ВыполненаОтменаЗаявки(ДопПараметры.Заявка) Тогда
			ПоказатьПредупреждение(, "Заявка отменена");
			ДопПараметры.Форма.Прочитать();
		КонецЕсли;
	Иначе 
		
		Если СостояниеПоЗаявке.Завершено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Заявка уже выполнена и не может быть отменена!";
			Сообщение.Сообщить();
		ИначеЕсли Не СостояниеПоЗаявке.Доступна Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Заявка не была отправлена в ЛИС!";
			Сообщение.Сообщить();
			омг_ЗаявкаЛИСОбщиеСервеныеПроцедуры.УстановитьСтатусОтменыНеотправленнойЗаявки(ДопПараметры.Заявка);
			ДопПараметры.Форма.Прочитать();
		ИначеЕсли Не СостояниеПоЗаявке.Завершено И СостояниеПоЗаявке.ПолученыБланки Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Данная заявка не может быть отменена. Есть бланки с результатами.";
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОтменуЗаявки(Заявка, Форма = Неопределено) Экспорт
	
	ТекстВопроса = "Выполнить отмену заявки?";
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеОтветаНаВопросОбОтменеЗаявки",
		омг_ЗаявкаЛИСОбщиеКлиентскиеПроцедуры, Новый Структура("Заявка, Форма", Заявка, Форма));
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "", КодВозвратаДиалога.Нет);
	
КонецПроцедуры

Процедура ПоказатьВводУШК(БиоматериалыСУШК, МассивБиоматериалов, ДопПараметры)

	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВыбораБиоматериалов", 
		ДопПараметры.ФормаЗаявки, ДопПараметры);
		
	ПараметрыОткрытия = Новый Структура("БиоматериалыСУШК, МассивБиоматериалов, Документы", БиоматериалыСУШК, МассивБиоматериалов, ДопПараметры.СсылкиНаДокументы);
		
	ОткрытьФорму("Обработка.омг_ДополнительныеФормы.Форма.УникальноеШтрихкодирование", 
		ПараметрыОткрытия, ДопПараметры.ФормаЗаявки, ДопПараметры.ФормаЗаявки.УникальныйИдентификатор,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура Обработчик_ПослеВыбораБиоматериаловОбработкаПодборкаПоУШК(МассивБиоматериалов, ДопПараметры) Экспорт
	
	Если МассивБиоматериалов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//БиоматериалыСУШК = омг_ЗаявкаЛИСОбщиеСервеныеПроцедуры.БиоматериалыУчаствующиеВУШК(МассивБиоматериалов, ДопПараметры.СсылкиНаДокументы);
	//
	//Если Не БиоматериалыСУШК.Количество() = 0 Тогда
	//	
	//	ПоказатьВводУШК(БиоматериалыСУШК, МассивБиоматериалов, ДопПараметры);
	//	
	//Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВыбораБиоматериалов", 
			ДопПараметры.ФормаЗаявки, ДопПараметры);
		
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, МассивБиоматериалов);
	//КонецЕсли;
	
КонецПроцедуры
