#Область ПрограммныйИнтерфейс

Функция ПодписываетсяЭП() Экспорт
	
	Возврат Истина;
	
КонецФункции

Функция РолиДляПодписания() Экспорт
	
	Роли = Новый Массив;
	Роли.Добавить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(19, "РолиПриПодписиМедДокументов"));
	Возврат Роли;
	
КонецФункции

Функция РольДоступнаТекущемуПользователю(МедицинскийОтчет, Роль) Экспорт
	
	Если Роль = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(19, "РолиПриПодписиМедДокументов") Тогда
		Возврат МедицинскийОтчет.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти