#Область ПрограммныйИнтерфейс

// Возвращает список доступных макетов стандартных алгоритмов
// 
// Возвращаемое значение:
//  Массив - Массив строк наименований макетов
//
Функция СписокМакетовСтандартныхАлгоритмов() Экспорт

	Массив = Новый Массив;
		
	МетаданныеМакетов = Справочники.ВычисляемыеЗначенияПараметров.ПустаяСсылка().Метаданные().Макеты;
	Для Каждого Макет Из МетаданныеМакетов Цикл
		ИмяМакета = Макет.Имя;
		Если Лев(ИмяМакета, 38) = "СтандартныеАлгоримыВычисляемыхЗначений" Тогда
			Массив.Добавить(ИмяМакета);		
		КонецЕсли;
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

// Возвращает стандартные алгоритмы вычисляемых значений
//
// Параметры:
//  СтандартныйПрефиксВИмени - Булево	 - Добавлять стандартный префикс в имена алгоритмов
// 
// Возвращаемое значение:
//  Соостветствие - Ключ - Имя алгоритма, Значение - Структура("Алгоритм, Описание, Получатель, СвязанныеПоля, Комментарий, Группа")
//
Функция ПолучитьСтандартныеАлгоритмыВычисляемыхЗначений(СтандартныйПрефиксВИмени = Ложь, ТолькоАлгоритм = Ложь) Экспорт
	
	Соответствие = Новый Соответствие;
    Группа = "";
	
	МассивМакетовАлгоритмов = СписокМакетовСтандартныхАлгоритмов();
	Для Каждого ИмяМакета Из МассивМакетовАлгоритмов Цикл
		
		ТабДок = Справочники.ВычисляемыеЗначенияПараметров.ПолучитьМакет(ИмяМакета);
		Для Сч = 1 По ТабДок.ВысотаТаблицы Цикл
			
			ИмяАлгоритма = ТабДок.Область(Сч, 1, Сч, 1).Текст;
			Если ПустаяСтрока(ИмяАлгоритма) Тогда 
				Группа = ТабДок.Область(Сч, 2).Текст;
				Продолжить;
			Иначе
				Структура = Новый Структура("Алгоритм, Описание, Получатель, СвязанныеПоля, Комментарий, Группа");
				Структура.Алгоритм	  	= ТабДок.Область(Сч, 2).Текст;
				Если Не ТолькоАлгоритм Тогда
					Структура.Описание 		= ТабДок.Область(Сч, 3).Текст;
					Структура.Получатель	= ТабДок.Область(Сч, 4).Текст;
					Структура.СвязанныеПоля = ТабДок.Область(Сч, 5).Текст;
					Структура.Комментарий	= ТабДок.Область(Сч, 6).Текст;
					Структура.Группа 		= Группа;
				КонецЕсли;
				
				Если СтандартныйПрефиксВИмени Тогда
					ИмяАлгоритма  = РаботаСШаблонамиПечатиКлиентСервер.ПрефиксСтандартныхАлгоритмов() + ИмяАлгоритма;
				КонецЕсли;
				
				Соответствие.Вставить(ИмяАлгоритма, Структура);
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЦикла;

	Возврат Соответствие;
	
КонецФункции

// Возвращает ключ стандартного алгоритма о его тексту
//
// Параметры:
//  Алгоритм				 - Строка											 - Текст алгоритма
//  СтандартныйПрефиксВИмени - Булево	 										 - Добавлять ли стандартный префикс в начало ключа 
//	Получатель				 - ПеречислениеСсылка.ПолучателиВычисляемогоЗначения - Отбор по получателю
// 
// Возвращаемое значение:
//  Строка - Ключ стандартного алгоритма
//
Функция ПолучитьКлючСтандартногоАлгоритмаПоТекстуАлгоритма(Алгоритм, СтандартныйПрефиксВИмени = Ложь, Получатель = Неопределено) Экспорт
	
	СокрАлгоритм = СтрЗаменить(СтрЗаменить(СокрЛП(Алгоритм), Символы.ПС, ""), Символы.ВК, "");
	
	Если ЗначениеЗаполнено(Получатель) Тогда
		ИмяПолучателя = ОбщегоНазначения.ИмяЗначенияПеречисления(Получатель);	
	КонецЕсли;
	
	МассивМакетовАлгоритмов = СписокМакетовСтандартныхАлгоритмов();
	Для Каждого ИмяМакета Из МассивМакетовАлгоритмов Цикл
		
		ТабДок = Справочники.ВычисляемыеЗначенияПараметров.ПолучитьМакет(ИмяМакета);
		Для Сч = 1 По ТабДок.ВысотаТаблицы Цикл
			
			ИмяАлгоритма = ТабДок.Область(Сч, 1, Сч, 1).Текст;
			Если Не ПустаяСтрока(ИмяАлгоритма) 
				И СокрАлгоритм = СтрЗаменить(СтрЗаменить(СокрЛП(ТабДок.Область(Сч, 2).Текст), Символы.ПС, ""), Символы.ВК, "")
			Тогда
				ПолеПолучатель = ТабДок.Область(Сч, 4).Текст; 
				Если Не ЗначениеЗаполнено(Получатель) Или СтрНайти(ПолеПолучатель, ИмяПолучателя) <> 0 Тогда 
					Если СтандартныйПрефиксВИмени Тогда
						ИмяАлгоритма = РаботаСШаблонамиПечатиКлиентСервер.ПрефиксСтандартныхАлгоритмов() + ИмяАлгоритма;		
					КонецЕсли;
					Возврат ИмяАлгоритма;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЦикла;	
	
	Возврат Неопределено;
	
КонецФункции

// Определяет, какой алгоритм вычисления значения параметра необходимо использовать, и возвращает его.
//
// Параметры:
//  Ссылка	 - СправочникСсылка.ВычисляемыеЗначенияПараметров.
// 
// Возвращаемое значение:
//  Строка - Алгоритм.
//
Функция ПолучитьАлгоритмВычисленияЗначения(Ссылка) Экспорт

	Если ЭтоКлючСтандартногоАлгоритма(Ссылка.АлгоритмВычисления) Тогда
		СтандартныеАлгоритмы = ПолучитьСтандартныеАлгоритмыВычисляемыхЗначений(Истина, Истина);
		Возврат СтандартныеАлгоритмы.Получить(Ссылка.АлгоритмВычисления).Алгоритм;
	Иначе
		Возврат Ссылка.АлгоритмВычисления;	
	КонецЕсли;
	
КонецФункции 

// Определяет является ли переданная строка ключем стандартого алгоритма
//
// Параметры:
//  Алгоритм - Строка
// 
// Возвращаемое значение:
//  Булево - Истина - Ключ стандартного алгоритма, Ложь - Нет
//
Функция ЭтоКлючСтандартногоАлгоритма(Алгоритм) Экспорт
	
	СтандартныйПрефикс = РаботаСШаблонамиПечатиКлиентСервер.ПрефиксСтандартныхАлгоритмов();
	ДлинаПрефикса = СтрДлина(СтандартныйПрефикс);
	
	Если СтрНайти(Алгоритм, " ") = 0
		И Лев(Алгоритм, ДлинаПрефикса) = СтандартныйПрефикс
	Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти