#Область РазделОписанияПеременных

&НаКлиенте
Перем соотвКешИзображенийШаблонов;

&НаКлиенте
Перем ДанныеТекущегоИнтерфейсаЗаполненияПараметров;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПравоДоступа("Редактирование", Метаданные.Справочники.ВерсииШаблоновHTML) Тогда
		Элементы.Дата.ТолькоПросмотр = Ложь;
		Элементы.НеИспользоватьШапкуШаблона.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаРоли Из Объект.РолиПодписей Цикл
		Если СтрокаРоли.РежимНастройкиДоступности = Перечисления.РежимыНастройкиДоступностиРоли.ЗначениеПараметра Тогда
			СтрокаРоли.ПредставлениеНастройкаДоступности = СтрШаблон("%1: %2", СтрокаРоли.РежимНастройкиДоступности, СтрокаРоли.ПризнакДоступностиРоли);
		Иначе
			СтрокаРоли.ПредставлениеНастройкаДоступности = СтрокаРоли.РежимНастройкиДоступности;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СписокШаблонов = Новый Массив;
	СписокШаблонов.Добавить(Объект.Ссылка);
	РаботаСШаблонамиHTMLКлиентСервер.ИнициализироватьНастройкиИзображенийПриема(соотвКешИзображенийШаблонов, СписокШаблонов, ЭтаФорма.УникальныйИдентификатор);
	
	КодHTML.УстановитьТекст(Объект.ТекстHTML);
	
	ТекстHTMLПоУмолчанию = РаботаСШаблонамиHTMLКлиентСервер.ПолучитьТекстШаблонаHTMLПоУмолчанию();
	ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM(?(ПустаяСтрока(Объект.ТекстHTML), ТекстHTMLПоУмолчанию, Объект.ТекстHTML));
	ЗаполнитьСтраницыШаблонаПоДокументуHTML(ДокументHTML);
	УстановитьВидимостьКолонокСЭМД();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КонтекстноеМенюНастройкиПараметровИнтерфейса(Команда)
	
	Если ДанныеТекущегоИнтерфейсаЗаполненияПараметров = Неопределено
		Или Не ЗначениеЗаполнено(ДанныеТекущегоИнтерфейсаЗаполненияПараметров.Идентификатор)
	Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Идентификатор",				ДанныеТекущегоИнтерфейсаЗаполненияПараметров.Идентификатор);
	ПараметрыОткрытия.Вставить("ЗаголовокКнопки",			ДанныеТекущегоИнтерфейсаЗаполненияПараметров.ЗаголовокКнопки);
	ПараметрыОткрытия.Вставить("ТекущиеПараметры",			ДанныеТекущегоИнтерфейсаЗаполненияПараметров.ПараметрыПолей);
	ПараметрыОткрытия.Вставить("ТекущиеТаблицыПараметров",	ДанныеТекущегоИнтерфейсаЗаполненияПараметров.ТаблицыПараметров);
	
	ОткрытьФорму("Обработка.ИнтерфейсыЗаполненияПараметровШаблоновПриема.Форма.НастройкиЭлементаHTML", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПросмотрHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеТекущегоИнтерфейсаЗаполненияПараметров = Неопределено;
	
	Если ДанныеСобытия.Element.hasAttribute("bit-contextmenu-selectElement") Тогда
		ДанныеСобытия.Element.removeAttribute("bit-contextmenu-selectElement");
		ЗаполнитьПеременныеИнтерфейсовЗаполненияПараметров(ДанныеСобытия);
	КонецЕсли;
	
	УстановитьДоступностьКнопокКонтекстногоМенюПоляHTML();
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствияПараметрамПараметрНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьСтраницыШаблонаПоДокументуHTML(ДокументHTML, ОбновлятьИзображения = Истина)
	
	НеАктивизироватьСтрокуПараметра = Истина;
	
	Если ОбновлятьИзображения Тогда
		РаботаСШаблонамиHTMLКлиентСервер.ЗагрузитьИзображенияПриема(ДокументHTML, соотвКешИзображенийШаблонов, ЭтаФорма.УникальныйИдентификатор);
	КонецЕсли;
	
	УстановитьСкриптКонтекстногоМеню(ДокументHTML);
	ПросмотрHTML = РаботаСDOMКлиентСервер.ПолучитьТекстHTMLДокументаDOM(ДокументHTML);
	КодHTML.УстановитьТекст(РаботаСDOMКлиентСервер.ПолучитьКодТелаHTMLИзДокументаDOM(ДокументHTML));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКолонокСЭМД()
	
	ВидимостьЭлементовСЭМД = ЗначениеЗаполнено(Объект.ВидДокумента) И ФорматДокументаCDA(Объект.ВидДокумента);
	Элементы.СоответствияПараметрамlocalid.Видимость			= ВидимостьЭлементовСЭМД;
	Элементы.СоответствияПараметрамКлассификацияПоля.Видимость	= ВидимостьЭлементовСЭМД;
	Элементы.СоответствияПараметрамГруппирующееПоле.Видимость	= ВидимостьЭлементовСЭМД;
	Элементы.СоответствияПараметрамОбъединяющееПоле.Видимость	= ВидимостьЭлементовСЭМД;
	Элементы.ГруппаТаблицыСЭМД.Видимость						= ВидимостьЭлементовСЭМД;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ФорматДокументаCDA(ВидДокумента)
	Возврат ИнтеграцияЕГИСЗСервер.ПолучитьЗначениеАтрибутаЭлементаКлассификатора(ВидДокумента, "FORMAT") = "2";
КонецФункции

&НаКлиенте
Процедура УстановитьСкриптКонтекстногоМеню(ДокументHTML)
	
	Если ДокументHTML.Тело = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДокументHTML.Тело.УстановитьАтрибут("oncontextmenu","contextMenuFunc(event)");
	ТекстСкрипта =
		"<script type='text/javascript'>
		|	function contextMenuFunc(event){
		|		if (event.target !== document.body){
		|			event.target.setAttribute('bit-contextmenu-selectElement', 'true')};
		|		event.target.click();
		|	}
		|</script>";
	РаботаСDOMКлиентСервер.ДобавитьПроизвольныйHTMLВЭлемент(ДокументHTML.Тело.РодительскийУзел, ТекстСкрипта, , ДокументHTML.Тело);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКнопокКонтекстногоМенюПоляHTML()
	
	Элементы.ПросмотрHTMLКонтекстноеМенюКонтекстноеМенюНастройкиПараметровИнтерфейса.Видимость = Ложь;
	
	Если ДанныеТекущегоИнтерфейсаЗаполненияПараметров <> Неопределено
		И ЗначениеЗаполнено(ДанныеТекущегоИнтерфейсаЗаполненияПараметров.Идентификатор)
	Тогда
		Элементы.ПросмотрHTMLКонтекстноеМенюКонтекстноеМенюНастройкиПараметровИнтерфейса.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПеременныеИнтерфейсовЗаполненияПараметров(ДанныеСобытия)
	
	ЭлементИнтерфейсаЗаполненияПараметров = ДанныеСобытия.Element.closest("button[data-bit-interface-id]");
	Если ЭлементИнтерфейсаЗаполненияПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеТекущегоИнтерфейсаЗаполненияПараметров = Новый Структура("Идентификатор, ЗаголовокКнопки, ПараметрыПолей, ТаблицыПараметров", "", "", Новый Соответствие, Новый Соответствие);
	ДанныеТекущегоИнтерфейсаЗаполненияПараметров.Идентификатор = ЭлементИнтерфейсаЗаполненияПараметров.getAttribute("data-bit-interface-id");
	
	ЭлементЗаголовка = ЭлементИнтерфейсаЗаполненияПараметров.firstElementChild;
	Если ЭлементЗаголовка <> Неопределено
		И НРег(ЭлементЗаголовка.tagName) = "span"
	Тогда
		ДанныеТекущегоИнтерфейсаЗаполненияПараметров.ЗаголовокКнопки = ЭлементИнтерфейсаЗаполненияПараметров.firstElementChild.textContent;
	КонецЕсли;
	
	СтруктурыТаблицПараметров = РаботаСИнтерфейсамиЗаполненияПараметровКлиентСервер.ПолучитьСтруктурыТаблицПараметровЭлементаИнтерфейса(ЭлементИнтерфейсаЗаполненияПараметров);
	
	Если СтруктурыТаблицПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтруктураТаблицыПараметров Из СтруктурыТаблицПараметров.ТаблицыПараметровИнтерфейса Цикл
		Если СтруктураТаблицыПараметров.Идентификатор <> Неопределено Тогда
			ДанныеТекущегоИнтерфейсаЗаполненияПараметров.ТаблицыПараметров.Вставить(СтруктураТаблицыПараметров.ИмяТаблицы, СтруктураТаблицыПараметров.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтруктураПараметраПоля Из СтруктурыТаблицПараметров.ПараметрыПолей Цикл
		Если СтруктураПараметраПоля.Идентификатор <> Неопределено Тогда
			ДанныеТекущегоИнтерфейсаЗаполненияПараметров.ПараметрыПолей.Вставить(СтруктураПараметраПоля.ИмяПоля, СтруктураПараметраПоля.Идентификатор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти