
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЭтотОбъект.TranslateX = 0;
	ЭтотОбъект.TranslateY = 0;
	ЭтотОбъект.ScaleX = 0;
	ЭтотОбъект.ScaleY = 0;
	ЭтотОбъект.Rotation = 0;
	ЭтотОбъект.Фигура = "<Path xmlns=""http://schemas.microsoft.com/winfx/2006/xaml/presentation"" Data = ""M 0 0""/>";
	ЭтотОбъект.Цвет = Новый ХранилищеЗначения(Новый Цвет(255, 255, 255));
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ЭтоГруппа Тогда
		ЦветСегмента = ЭтотОбъект.Цвет.Получить();
		Если ЦветСегмента <> Неопределено Тогда
			ЭтотОбъект.ЦветHex = ОбщегоНазначенияКлиентСерверПереопределяемый.ЦветВHex(ЦветСегмента);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
