#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДопустимоРедактирование = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ДопустимоРедактированиеЭлементовЕГИСЗ();
	
	Элементы.ДанныеСообщения.ТолькоПросмотр	 = Не ДопустимоРедактирование;
	Элементы.ФормаЗаписатьИЗакрыть.Видимость = ДопустимоРедактирование;
	Элементы.ФормаЗаписать.Видимость		 = ДопустимоРедактирование;
	Элементы.ФормаЗакрыть.Видимость			 = Не ДопустимоРедактирование;
	Элементы.ФормаЗакрыть.КнопкаПоУмолчанию	 = Не ДопустимоРедактирование;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПутьКФайлуОткрытие(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ПутьКФайлу) Тогда
		СтандартнаяОбработка = Ложь;
		
		ДанныеФайла = ПолучитьДанныеФайла(Запись.ПутьКФайлу);
		Если ДанныеФайла <> Неопределено Тогда
			ИВФ	= ПолучитьИмяВременногоФайла(ДанныеФайла.РасширениеФайла);
			ДанныеФайла.ДД.Записать(ИВФ);
			ЗапуститьПриложение(ИВФ);
		Иначе
			Сообщить(НСтр("ru='Не удалось получить файл.'"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла(ПутьКФайлу)
	
	Попытка
		Возврат Новый Структура("РасширениеФайла, ДД", ПутьКФайлу.Расширение, ПутьКФайлу.Хранилище.Получить());
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ПерейтиВСообщение(Команда)
	
	СсылкаНаСообщение = ПолучитьСсылкуНаСообщениеРЭМД(Запись.УИДСообщения);
	
	Если Не ЗначениеЗаполнено(СсылкаНаСообщение) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось найти сообщение РЭМД.'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", СсылкаНаСообщение);
	ОткрытьФорму("Справочник.СообщенияРЭМД.Форма.ФормаЭлемента", ПараметрыФормы);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуНаСообщениеРЭМД(УИДСообщения)
	
	ДанныеСообщения = Справочники.СообщенияРЭМД.ПолучитьСообщениеРЭМДПоУИДСообщения(УИДСообщения);
	Если ДанныеСообщения <> Неопределено Тогда 
		Возврат ДанныеСообщения.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти