#Область ПрограммныйИнтерфейс

Функция СформироватьОтчет(ИзменяемыйТабличныйДокумент = Неопределено, Клиент, МедицинскаяКарта, Дата, ДатаОкончания, ПервыйЛист = Истина) Экспорт
	
	Если ИзменяемыйТабличныйДокумент = Неопределено Тогда
		ТабличныйДокумент = Новый ТабличныйДокумент;
	Иначе
		ТабличныйДокумент = ИзменяемыйТабличныйДокумент;
	КонецЕсли;
		
	ТабличныйДокумент.Очистить();	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = ЭтотОбъект.ПолучитьМакет("ТемпературныйЛист");
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса();
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Запрос.УстановитьПараметр("МедицинскаяКарта", МедицинскаяКарта);
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончание", КонецДня(ДатаОкончания));
	РезультатЗапроса = Запрос.Выполнить();
	ДокПоступления = Стационар.ОбращениеПоМедкарте(МедицинскаяКарта);
	
	Если ПервыйЛист Тогда
		Шапка = Макет.ПолучитьОбласть("ОбластьШапка");
		ЗаполнитьПараметрыШапки(Шапка, ДокПоступления, Клиент, МедицинскаяКарта);
	Иначе
		Шапка = Макет.ПолучитьОбласть("ОбластьПродолжение");
	КонецЕсли;
	ТабличныйДокумент.Вывести(Шапка);
	
	График = Новый ТабличныйДокумент;
	ЗаполнитьПараметрыГрафика(Макет, РезультатЗапроса, ДокПоступления, Дата, ТабличныйДокумент);
	
	Если ИзменяемыйТабличныйДокумент = Неопределено Тогда
		Возврат ТабличныйДокумент;
	КонецЕсли;
			
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстЗапроса()
		
	Возврат "ВЫБРАТЬ
	        |	ВыполнениеДействийСтационара.Клиент КАК Клиент,
	        |	ВыполнениеДействийСтационара.Документ.МедицинскаяКарта КАК МедицинскаяКарта,
	        |	ВыполнениеДействийСтационара.ДействиеСтационара КАК ДействиеСтационара,
	        |	ВыполнениеДействийСтационара.Значение КАК Значение,
	        |	ВыполнениеДействийСтационара.ДатаВремяВыполнения КАК ДатаВремяВыполнения,
	        |	ВыполнениеДействийСтационара.ДействиеСтационара.ИмяПредопределенныхДанных КАК ДействиеСтационараИмяПредопределенныхДанных
	        |ИЗ
	        |	РегистрСведений.ВыполнениеДействийСтационара КАК ВыполнениеДействийСтационара
	        |ГДЕ
	        |	ВыполнениеДействийСтационара.Клиент = &Клиент
	        |	И (ВыполнениеДействийСтационара.Документ.МедицинскаяКарта = &МедицинскаяКарта
	        |			ИЛИ ВыполнениеДействийСтационара.Документ = НЕОПРЕДЕЛЕНО)
	        |	И ВыполнениеДействийСтационара.ДатаВремяВыполнения <= &ДатаОкончание
	        |	И ВыполнениеДействийСтационара.ДатаВремяВыполнения >= &Дата
	        |	И ВыполнениеДействийСтационара.ДействиеСтационара.Предопределенный
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ДатаВремяВыполнения
			|ИТОГИ ПО
	        |	ДатаВремяВыполнения";
			
КонецФункции

Процедура ЗаполнитьПараметрыШапки(Шапка, ДокПоступления, Клиент, МедицинскаяКарта)
	
	Шапка.Параметры.ФИОБольного = СокрЛП(Клиент.Фамилия) + " " + СокрЛП(Клиент.Имя) + " " + СокрЛП(Клиент.Отчество);
	Шапка.Параметры.Возраст = ОбщегоНазначенияКлиентСервер.ПолучитьВозрастСтрокой(Клиент.ДатаРождения);
	Шапка.Параметры.РостПациента = ПолучитьРостПациента(МедицинскаяКарта);
	
	// Изменено Макеев (
	//Если ЗначениеЗаполнено(ДокПоступления) Тогда
	//	Шапка.Параметры.КодПоОКПО	= ДокПоступления.Филиал.ОКПО;
	//	Шапка.Параметры.НаименованиеУчреждения = ДокПоступления.Филиал.НазваниеОрганизации;
	//КонецЕсли;
	// )
	
КонецПроцедуры

Функция ПолучитьРостПациента(МедицинскаяКарта)
	
	КодВитальногоПар = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(57, "КлассификаторыМинЗдрава", Перечисления.ВидыКлассификаторовМинЗдрава.ВитальныеПараметры);
	ЗначенияРоста = МедицинскаяДеятельность.ЗначенияПоНазначениямПолейМедкарты(МедицинскаяКарта, КодВитальногоПар);
	
	Если ЗначенияРоста.Количество() <> 0 Тогда
		Возврат ЗначенияРоста[ЗначенияРоста.Количество() - 1].Значение;
	Иначе
		Возврат "";
	КонецЕсли;
		
КонецФункции

Процедура ЗаполнитьПараметрыГрафика(Макет, РезультатЗапроса, ДокПоступления, Дата, ТабличныйДокумент)
		
	ВыборкаЗапросаДни = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Сч=1;
	ТекДата = НачалоДня(Дата);
	ДеньГоспитализации = (ТекДата-НачалоДня(ДокПоступления.ДатаВремяГоспитализации))/86400+1;
	ОбластьГрафик = Макет.ПолучитьОбласть("ОбластьГрафик");
	ПерваяЧастьТаблицыВыведена = Ложь;
	
	// Добавлено Макеев (
	СложныеПоля = Новый Соответствие;
	// )
	Пока ВыборкаЗапросаДни.Следующий() Цикл
		ОбластьГрафик.Параметры["Дата"+Сч] = Формат(ВыборкаЗапросаДни.ДатаВремяВыполнения, "ДФ=dd.MM.yy" );
		ВремяССекундами = Формат(ВыборкаЗапросаДни.ДатаВремяВыполнения, "ДЛФ=T");
		ВремяБезСекунд = Лев(ВремяССекундами, СтрДлина(ВремяССекундами) - 3);
		ОбластьГрафик.Параметры["Время"+Сч] = ВремяБезСекунд;
		ОбластьГрафик.Параметры["День"+Сч] = (НачалоДня(ВыборкаЗапросаДни.ДатаВремяВыполнения) - НачалоДня(ДокПоступления.ДатаВремяГоспитализации))/86400+1;
		
		ВыборкаДетальныеЗаписи = ВыборкаЗапросаДни.Выбрать();
		ДанныеВСтолбецВнесены = Ложь;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл                                  	
			Если ВыборкаДетальныеЗаписи.ДействиеСтационара = Справочники.ДействияМедсестрыСтационара.Температура Тогда
				Значение =  ВыборкаДетальныеЗаписи.Значение; 
				Если Значение >= 41 Тогда
					ОбластьГрафик.Параметры[Строка("т41_" + Сч)] = Значение;
				ИначеЕсли Значение < 35 Тогда
					ОбластьГрафик.Параметры[Строка("т34_" + Сч)] = Значение;
				Иначе
					ОбластьГрафик.Параметры[Строка("т" + Цел(Значение) + "_" + Сч)] = Значение;
				КонецЕсли;
				ДанныеВСтолбецВнесены = Истина;
			// Добавлено Макеев (
			ИначеЕсли ВыборкаДетальныеЗаписи.ДействиеСтационара = Справочники.ДействияМедсестрыСтационара.АртериальноеДавление 
				Или ВыборкаДетальныеЗаписи.ДействиеСтационара = Справочники.ДействияМедсестрыСтационара.АртериальноеДавлениеНижнее Тогда
				СложныеПоля.Вставить(ВыборкаДетальныеЗаписи.ДействиеСтационара, ВыборкаДетальныеЗаписи.Значение); 
			// )
			Иначе
				Попытка
					ИмяПарам = ВыборкаДетальныеЗаписи.ДействиеСтационараИмяПредопределенныхДанных;
					ОбластьГрафик.Параметры[Строка(ИмяПарам + Сч)] = ВыборкаДетальныеЗаписи.Значение;	
					ДанныеВСтолбецВнесены = Истина;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		// Добавлено Макеев (
		АД1 = СложныеПоля.Получить(Справочники.ДействияМедсестрыСтационара.АртериальноеДавление);
		АД2 = СложныеПоля.Получить(Справочники.ДействияМедсестрыСтационара.АртериальноеДавлениеНижнее);
		Если ЗначениеЗаполнено(АД1) Тогда
			ОбластьГрафик.Параметры[Строка("АртериальноеДавление" + Сч)] =  Строка(АД1) + "/" + Строка(АД2);
		КонецЕсли;
		// )
		
		Если ДанныеВСтолбецВнесены Тогда
			Сч = Сч + 1;
			Если Сч > 30 Тогда
				Если ПерваяЧастьТаблицыВыведена Тогда
					ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ОбластьПродолжение"));
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьГрафик);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ОбластьГрафик = Макет.ПолучитьОбласть("ОбластьГрафик");
				ПерваяЧастьТаблицыВыведена = Истина;
				Сч = 1;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПерваяЧастьТаблицыВыведена Тогда
		ТабличныйДокумент.Вывести(ОбластьГрафик);
	ИначеЕсли (ПерваяЧастьТаблицыВыведена И Сч > 1) Тогда 
		ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ОбластьПродолжение"));
		ТабличныйДокумент.Вывести(ОбластьГрафик);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
