
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Филиал = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Документ, "Филиал");
	
	СписокБиоматериалов = Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ПолучитьСписокКонтейнеров(Параметры.МассивУслуг, Филиал);
	
	АдресБиоматериалов = ПоместитьВоВременноеХранилище(СписокБиоматериалов, УникальныйИдентификатор);
	
	СоответствиеДанных = Новый ТаблицаЗначений;
	СоответствиеДанных.Колонки.Добавить("Номенклатура");
	СоответствиеДанных.Колонки.Добавить("Набор");
	СоответствиеДанных.Колонки.Добавить("Строка");
	СтруктураПоиска = Новый Структура("Номенклатура, Набор");
	Для Каждого ДанныеБиоматериала Из СписокБиоматериалов Цикл
		Для Каждого ДанныеНоменклатуры Из ДанныеБиоматериала.Анализы Цикл
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ДанныеНоменклатуры);
			НайденныеСтроки = СоответствиеДанных.НайтиСтроки(СтруктураПоиска);
			Если НайденныеСтроки.Количество() = 0 Тогда
				
				Уровень1 = Биоматериалы.ПолучитьЭлементы().Добавить();
				Уровень1.Номенклатура = ДанныеНоменклатуры.Номенклатура;
				Уровень1.Набор = ДанныеНоменклатуры.Набор;
				Уровень1.КоличествоИсследований = ДанныеНоменклатуры.КоличествоИсследований;
				Уровень1.ГруппаЗабора = ДанныеНоменклатуры.ГруппаЗабора;
				СтрокаСоответствия = СоответствиеДанных.Добавить();
				СтрокаСоответствия.Номенклатура = ДанныеНоменклатуры.Номенклатура;
				СтрокаСоответствия.Набор = ДанныеНоменклатуры.Набор;
				СтрокаСоответствия.Строка = Уровень1;
				
			Иначе
				Уровень1 = НайденныеСтроки[0].Строка;
			КонецЕсли;
			Уровень2 = Уровень1.ПолучитьЭлементы().Добавить();
			Уровень2.Биоматериал = ДанныеБиоматериала.Биоматериал;
			Уровень2.Контейнер = ДанныеБиоматериала.Контейнер;
			Уровень2.КоличествоИсследований = ДанныеБиоматериала.КоличествоИсследований;
			Уровень2.Пометка = ДанныеНоменклатуры.ПоУмолчанию;
			Если Уровень2.Пометка Тогда
				Уровень1.Пометка = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры                 

&НаКлиенте
Процедура УстановитьПометку(Уровень, Знач Пометка)
	
	Для Каждого СтрокаДерева Из Уровень.ПолучитьЭлементы() Цикл
		СтрокаДерева.Пометка = Пометка;
		Если Пометка Тогда
			Пометка = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Родитель = Уровень.ПолучитьРодителя();
	
	Если Не Уровень = Биоматериалы И Не Родитель = Неопределено Тогда
		Для Каждого СтрокаДерева Из Родитель.ПолучитьЭлементы() Цикл
			Если СтрокаДерева.Пометка И Не Пометка Тогда
				Пометка = Истина;
			КонецЕсли;
		КонецЦикла;
		Родитель.Пометка = Пометка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура БиоматериалыПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Биоматериалы.ТекущиеДанные;
	
	УстановитьПометку(ТекущиеДанные, ТекущиеДанные.Пометка);
	
	Родитель = ТекущиеДанные.ПолучитьРодителя();
	
	Если Не Родитель = Неопределено Тогда
		Для Каждого Уровень2 Из Родитель.ПолучитьЭлементы() Цикл 
			ВыбраннаяПозиция = Неопределено;
			
			Если Уровень2.Пометка 
				И Не Уровень2 = ТекущиеДанные Тогда
				Уровень2.Пометка = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Функция НайтиИУдалитьСтрокуАнализов(СтруктураБиоматериала, Номенклатура)
	
	Для Каждого СтрокаДанных ИЗ СтруктураБиоматериала.Анализы Цикл
		Если СтрокаДанных.Номенклатура = Номенклатура Тогда
			СтруктураБиоматериала.Анализы.Удалить(СтруктураБиоматериала.Анализы.Найти(СтрокаДанных));
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ОК(Команда)
	
	ИсходныеДанные = ПолучитьИзВременногоХранилища(АдресБиоматериалов);
	
	УдаляемыеПозиции = Новый Массив;
	
	СоответствиеБиоматериалов = Новый Соответствие;
	
	Для Каждого СтрокаДерева1 Из Биоматериалы.ПолучитьЭлементы() Цикл
		
		Если Не СтрокаДерева1.Пометка Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Есть позиции где не был выбран биоматериал!";
			Сообщение.Поле = "Биоматериалы";
			Сообщение.УстановитьДанные(ЭтаФорма);
			Сообщение.Сообщить();
			
			Возврат;          
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СтрокаДерева1 Из Биоматериалы.ПолучитьЭлементы() Цикл

		Для Каждого СтрокаДерева2 Из СтрокаДерева1.ПолучитьЭлементы() Цикл
			Если СтрокаДерева2.Пометка Тогда
				Продолжить;
			КонецЕсли;
			МассивНоменклатуры = СоответствиеБиоматериалов.Получить(СтрокаДерева2.Биоматериал);
			Если МассивНоменклатуры = Неопределено Тогда
				МассивНоменклатуры = Новый Массив;
				СоответствиеБиоматериалов.Вставить(СтрокаДерева2.Биоматериал, МассивНоменклатуры);
			КонецЕсли;
			Если МассивНоменклатуры.Найти(СтрокаДерева1.Номенклатура) = Неопределено Тогда
				МассивНоменклатуры.Добавить(СтрокаДерева1.Номенклатура);
			КонецЕсли;

		КонецЦикла;
	КонецЦикла;                             
	
	УдаляемыеПозиции = Новый Массив;
	
	Для Каждого ЭлементБиоматериал Из СоответствиеБиоматериалов Цикл
		Для Каждого СтруктураБиоматериала Из ИсходныеДанные Цикл
			Если СтруктураБиоматериала.Биоматериал = ЭлементБиоматериал.Ключ Тогда
				Для Каждого Номенклатура Из ЭлементБиоматериал.Значение Цикл
					НайтиИУдалитьСтрокуАнализов(СтруктураБиоматериала, Номенклатура);
				КонецЦикла; 
				Если СтруктураБиоматериала.Анализы.Количество() = 0 Тогда
					ИсходныеДанные.Удалить(ИсходныеДанные.Найти(СтруктураБиоматериала));
				КонецЕсли;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если ИсходныеДанные.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбраны биоматериалы!";
		Сообщение.Поле = "Биоматериалы";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Закрыть(ИсходныеДанные);
	
КонецПроцедуры
