#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Параметры.ПутьКФайлуЭМД)
		Или Не ЗначениеЗаполнено(Параметры.ВидЭМД)
		Или Не ЗначениеЗаполнено(Параметры.Филиал)
	Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Форма просмотра не может быть открыта без параметров.'"));
		Возврат;
	КонецЕсли;
	
	ПолныйПутьКФайлу = ПолучитьПолныйПутьКФайлу(Параметры.ПутьКФайлуЭМД, Параметры.Филиал);
	
	Если Не ЗначениеЗаполнено(ПолныйПутьКФайлу) Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не удалось найти файл на сервере.'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если СтрЗаканчиваетсяНа(ПолныйПутьКФайлу, ".pdf") Тогда
		Элементы.Просмотр.Видимость = Ложь;
		ПросмотрPDF.Прочитать(ПолныйПутьКФайлу);
	Иначе
		Элементы.ПросмотрPDF.Видимость = Ложь;
		Элементы.КнопкиPDF.Видимость = Ложь;
		
		ИспользуетсяСтандартнаяСхемаВизуализации = Ложь;
		Если ЗначениеЗаполнено(Параметры.ВидЭМД.СхемаВизуализации) Тогда
			ТекстСхемыВизуализации = Параметры.ВидЭМД.СхемаВизуализации;
		Иначе
			МакетДД = Обработки.ПоискДокументовРЭМД.ПолучитьМакет("XSLСхема");
			ТекстСхемыВизуализации = ПолучитьСтрокуИзДвоичныхДанных(МакетДД);
			ИспользуетсяСтандартнаяСхемаВизуализации = Истина;
		КонецЕсли;
		
		ТекстHTML = ПолучитьHTMLТекстПредставленияЭМД(ПолныйПутьКФайлу, ТекстСхемыВизуализации);
		
		Если ЗначениеЗаполнено(ТекстHTML) Тогда
			Просмотр = ТекстHTML;
		Иначе
			Конвертер = Новый ПреобразованиеXSL;
			Попытка
				Конвертер.ЗагрузитьТаблицуСтилейXSLИзСтроки(ТекстСхемыВизуализации);
			Исключение
				Если Не ИспользуетсяСтандартнаяСхемаВизуализации Тогда
					МакетДД = Обработки.ПоискДокументовРЭМД.ПолучитьМакет("XSLСхема");
					ТекстСхемыВизуализации = ПолучитьСтрокуИзДвоичныхДанных(МакетДД);
					Конвертер.ЗагрузитьТаблицуСтилейXSLИзСтроки(ТекстСхемыВизуализации);
				КонецЕсли;
			КонецПопытки;
			
			Просмотр = Конвертер.ПреобразоватьИзФайла(ПолныйПутьКФайлу);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьПолныйПутьКФайлу(ПутьКФайлуЭМД, Филиал)
	
	ПолныйПутьКФайлу = ИнтеграцияЕГИСЗ_РЭМД.ПолучитьПолныйПутьПоОтносительномуПутиВХранилищеЭМД(ПутьКФайлуЭМД, Филиал);
	
	ВыбФайл = Новый Файл(ПолныйПутьКФайлу);
	Если ВыбФайл.Существует() Тогда
		Возврат ПолныйПутьКФайлу;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьHTMLТекстПредставленияЭМД(ПолныйПутьКФайлу, ТекстСхемыВизуализации)
	
	HTMLПредставление = "";
	
	КаталогВременныхФайлов = СтандартныеПодсистемыСервер.СоздатьКаталогВременныхФайлов(Строка(Новый УникальныйИдентификатор));
	Попытка
		HTMLПредставление = ПреобразоватьXMLВHTML(ПолныйПутьКФайлу, ТекстСхемыВизуализации, КаталогВременныхФайлов);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Для корректного отображения визуализации необходимо установить Java на сервер'"));
	КонецПопытки;
	
	ФайловаяСистема.УдалитьВременныйКаталог(КаталогВременныхФайлов);
	
	Возврат HTMLПредставление;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПреобразоватьXMLВHTML(ПолныйПутьКФайлу, ТекстСхемыВизуализации, КаталогВременныхФайлов)
	
	ФайлУтилиты				= СтрШаблон("%1%2.%3", КаталогВременныхФайлов, "ut",		"jar");
	ФайлЭМД					= СтрШаблон("%1%2.%3", КаталогВременныхФайлов, "emd",		"xml");
	ФайлСхемыВизуализации	= СтрШаблон("%1%2.%3", КаталогВременныхФайлов, "DischSum",	"xsl");
	ФайлРезультата			= СтрШаблон("%1%2.%3", КаталогВременныхФайлов, "res",		"html");
	
	КопироватьФайл(ПолныйПутьКФайлу, ФайлЭМД);
	
	Компонента = ПолучитьОбщийМакет("ПроцессорВизуализацияXMLПоСхемеВизуализации");
	Компонента.Записать(ФайлУтилиты);
	
	Файл = Новый ЗаписьТекста(ФайлСхемыВизуализации);
	Файл.Записать(ТекстСхемыВизуализации);
	Файл.Закрыть();
	
	СтрокаКоманды = СтрШаблон("java -jar ""%1"" ""%2"" ""%3"" ""%4""", ФайлУтилиты, ФайлСхемыВизуализации, ФайлЭМД, ФайлРезультата);
	
	ПараметрыЗапускаПрограммы = ОбщегоНазначенияКлиентСервер.ПараметрыЗапускаПрограммы();
	ПараметрыЗапускаПрограммы.ДождатьсяЗавершения = Истина;
	ПараметрыЗапускаПрограммы.ПолучитьПотокВывода = Истина;
	
	Результат = ОбщегоНазначенияКлиентСервер.ЗапуститьПрограмму(СтрокаКоманды, ПараметрыЗапускаПрограммы);
	
	ФайлРезультат = Новый ЧтениеТекста(ФайлРезультата, КодировкаТекста.UTF8);
	РезультатHTML = ФайлРезультат.Прочитать();
	ФайлРезультат.Закрыть();
	
	Возврат РезультатHTML;
	
КонецФункции

#КонецОбласти