
Процедура ВставитьСсылку(Форма, ПолеHTML) Экспорт
    
    Оповещение = Новый ОписаниеОповещения("Обработчик_ВставитьСсылкуЗавершение", iga_УниверсальныеОбработчикиНаКлиенте, Новый Структура("ПолеHTML", ПолеHTML));
    ОткрытьФорму("Справочник.iga_Алгоритмы.Форма.ФормаВыбораЛюбойСсылки",, Форма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    
КонецПроцедуры

Процедура Обработчик_ВставитьСсылкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = Неопределено Тогда 
        Возврат; // Пользователь нажал "Отмена"
    КонецЕсли;
    
    // Получаем готовую строку с сервера
    ТекстДляВставки = iga_ОбщегоНазначенияСервер.ПолучитьТекстВставкиДляСсылки(Результат);
    
    Если ПустаяСтрока(ТекстДляВставки) Тогда 
        Возврат; 
    КонецЕсли;
    
    // Вставляем полученный код в наш HTML-редактор
    ОкноБраузера = ДополнительныеПараметры.ПолеHTML.Документ.defaultView;
    Если ОкноБраузера <> Неопределено Тогда
        ОкноБраузера.insert1CCodeAtCursor(ТекстДляВставки);
    КонецЕсли;
    
КонецПроцедуры

Процедура Обработчик_ВставитьТекстЗапросаЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = Неопределено Тогда 
        Возврат;
    КонецЕсли;
    
    ОкноБраузера = ДополнительныеПараметры.ПолеHTML.Документ.defaultView;
	Если ОкноБраузера <> Неопределено Тогда
		ТекстВставки = iga_УниверсальныеОбработчикиВызовСервера.СформироватьКодВставкиЗапросаНаСервере(Результат);
		
        ОкноБраузера.insert1CCodeAtCursor(ТекстВставки);
    КонецЕсли;
    
КонецПроцедуры

Процедура ВставитьТекстЗапроса(Форма, ПолеHTML) Экспорт
	
    Оповещение = Новый ОписаниеОповещения("Обработчик_ВставитьТекстЗапросаЗавершение", iga_УниверсальныеОбработчикиНаКлиенте, Новый Структура("ПолеHTML", ПолеHTML));
    ОткрытьФорму("Справочник.iga_ТекстыЗапросов.ФормаВыбора", Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Истина), 
		Форма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	КонецПроцедуры
	
Процедура Обработчик_ПослеРедактированияАлгоритма(СтруктураАлгоритма, ДопПараметры) Экспорт
	
	Если СтруктураАлгоритма = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДопПараметры.Объект[ДопПараметры.ИмяПоля] = СтруктураАлгоритма.Алгоритм;
	Если Не ДопПараметры.ПолеПроверочногоКода = "" Тогда
		ДопПараметры.Объект[ДопПараметры.ПолеПроверочногоКода] = СтруктураАлгоритма.ПроверочныйКод;
	КонецЕсли;
	
	ДопПараметры.Форма.Модифицированность = Истина;
	
КонецПроцедуры

Процедура ОткрытьРедакторАлгоритма(ЭтаФорма, Объект, ИмяПоля, Подсказка = "", 
	ПолеПроверочногоКода = "") Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеРедактированияАлгоритма", iga_УниверсальныеОбработчикиНаКлиенте, 
		Новый Структура("Форма, Объект, ИмяПоля, ПолеПроверочногоКода", 
			ЭтаФорма, Объект, ИмяПоля, ПолеПроверочногоКода));
			
	Если Не ПолеПроверочногоКода = "" Тогда
		ПроверочныйКод = Объект[ПолеПроверочногоКода];
	Иначе
		ПроверочныйКод = "";
	КонецЕсли;
			
	ОткрытьФорму("Обработка.iga_ОбработчикЭтапов.Форма.РедакторАлгоритмов", 
		Новый Структура("Алгоритм, Подсказка, ПроверочныйКод",
			Объект[ИмяПоля], Подсказка, ПроверочныйКод), ЭтаФорма,,,,
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ПродолжитьОповещениеОЗаписи(ПараметрыОповещения, ДопПараметры) Экспорт
	
	ПараметрыОповещения.Удалить("Форма");
	ПараметрыОповещения.Удалить("МодульОповещения");
	ПараметрыОповещения.Вставить("Состояние", ПараметрыОповещения.Состояние);
	
	iga_НапоминанияВызовСервера.ОповеститьОЗаписиНаСервере(ПараметрыОповещения);
	
КонецПроцедуры

Процедура Обработчик_ВставитьПрокеркуНаСМЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат = Неопределено Тогда 
        Возврат;
    КонецЕсли;
    
    ОкноБраузера = ДополнительныеПараметры.ПолеHTML.Документ.defaultView;
    Если ОкноБраузера <> Неопределено Тогда
        ОкноБраузера.insert1CCodeAtCursor("ШаблонПоСпециальнойМетке(""" + Строка(Результат) + """)");
    КонецЕсли;
    
КонецПроцедуры

Процедура ВставитьПроверкуНаСпецМетку(Форма, ПОлеHTML) Экспорт
	
	Оповещение = Новый ОписаниеОповещения("Обработчик_ВставитьПрокеркуНаСМЗавершение", iga_УниверсальныеОбработчикиНаКлиенте, Новый Структура("ПолеHTML", ПолеHTML));
	ОткрытьФорму("Справочник.iga_СпециальныеМетки.ФормаВыбора", 
		Новый Структура("РежимВыбора, ЗакрыватьПриВыборе", Истина, Истина), Форма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
