#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Добавлено Макеев (
	//Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("УправляющийФилиалом") Тогда
	//	ОтборПоСотруднику = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ОтборПоСотруднику.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник");
	//	ОтборПоСотруднику.ПравоеЗначение = омг_ЗаявкаЛИСОбщиеСервеныеПроцедуры.ПолучитьТекущегоСотрудника();
	//	ОтборПоСотруднику.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//КонецЕсли;
	// )  
	
	////////////////////////////////////////////////
	// ОМГ
	Если Не РольДоступна("ПолныеПрава") Тогда   
		
		Организация = Неопределено;
		
		Если РольДоступна("омг_ОтборПоОрганизацииВОтчетеПоВыработке") Тогда
			
			Организация = омг_ДополнительныеАлгоритмы.ПолучитьОрганизациюСотрудника(); 
			
		КонецЕсли;                                         
		
		Если ЗначениеЗаполнено(Организация) Тогда   
			
			Для каждого строкаОтбора из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
				
				Если ТипЗНЧ(строкаОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда					
					Если  строкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Филиал.Организация") и строкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно 
						и строкаОтбора.Использование
						или строкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Регистратор.Организация") и строкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
						и строкаОтбора.Использование
						или строкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Регистратор.Филиал.Организация")  и 
						строкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
						и строкаОтбора.Использование Тогда
						строкаОтбора.ПравоеЗначение = Организация;
						НастройкаНайдена = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;  
			
			ОтборПоОрганизации = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоОрганизации.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Филиал.Организация");
			ОтборПоОрганизации.ПравоеЗначение = Организация;
			ОтборПоОрганизации.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
			
			
			Для каждого строкаОтбора из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
				
				Если ТипЗНЧ(строкаОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда					
					Если  ТипЗНЧ(строкаОтбора.ПравоеЗначение) = Тип("СправочникСсылка.Организации") и строкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно   Тогда
						строкаОтбора.ПравоеЗначение = Организация;
						
					КонецЕсли;
				КонецЕсли;
			КонецЦикла; 
		иначе
			Сотрудник = омг_ЗаявкаЛИСОбщиеСервеныеПроцедуры.ПолучитьТекущегоСотрудника();
			ОтборПоСотруднику = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоСотруднику.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник");
			ОтборПоСотруднику.ПравоеЗначение = Сотрудник;
			ОтборПоСотруднику.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
			
			Для каждого строкаОтбора из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
				
				Если ТипЗНЧ(строкаОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда					
					Если  ТипЗНЧ(строкаОтбора.ПравоеЗначение) = Тип("СправочникСсылка.Сотрудники") и строкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно   Тогда
						строкаОтбора.ПравоеЗначение = Сотрудник;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла; 
			
		КонецЕсли;
	КонецЕсли;
    // ОМГ 
	////////////////////////////////////////////////
	
	УниверсальныеМеханизмыСервер.ОтчетПриКомпоновкеРезультата(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
