
&НаКлиенте
Процедура ОповещенияПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.Оповещения.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		КодСтроки = "";
	Иначе 
		КодСтроки = ТекущаяСтрока.КодСтроки;
	КонецЕсли;
	
	Элементы.Шаблоны.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КодСтроки", КодСтроки));
КонецПроцедуры

&НаКлиенте
Процедура ОповещенияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		КодСтроки = Новый УникальныйИдентификатор;
		Элементы.Оповещения.ТекущиеДанные.КодСтроки = КодСтроки;
		Элементы.Шаблоны.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("КодСтроки", КодСтроки));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.Шаблоны.ТекущиеДанные.КодСтроки = Элементы.Оповещения.ТекущиеДанные.КодСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Элементы.Оповещения.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОповещенияПередУдалением(Элемент, Отказ)
	ТекущаяСтрока = Элементы.Оповещения.ТекущиеДанные;
	СтрокиШаблонов = Объект.Шаблоны.НайтиСтроки(Новый Структура("КодСтроки", ТекущаяСтрока.КодСтроки));
	Для Каждого СтрокаШаблона Из СтрокиШаблонов Цикл
		Объект.Шаблоны.Удалить(СтрокаШаблона);
	КонецЦикла;
КонецПроцедуры
