#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	пчКодировка = Перечисления.КодировкаПолейЭМД;
	РазделыЗначений = Элементы.ТекущийРаздел.СписокВыбора;// Новый СписокЗначений;
	
	ЗначенияМетаданные = Метаданные.Перечисления.КодировкаПолейЭМД.ЗначенияПеречисления;
	Для Каждого ЗначениеМетаданные Из ЗначенияМетаданные Цикл
		Если РазделыЗначений.НайтиПоЗначению(ЗначениеМетаданные.Комментарий) = Неопределено Тогда
			НаименованиеРаздела = ЗначениеМетаданные.Комментарий;
			РазделыЗначений.Добавить(НаименованиеРаздела, ?(ПустаяСтрока(ЗначениеМетаданные.Комментарий), "Общее", ЗначениеМетаданные.Комментарий));
		КонецЕсли;
		
		Строка = РазделыЗначенийПеречисления.Добавить();
		Строка.Значение = пчКодировка[ЗначениеМетаданные.Имя];
		Строка.Раздел = ЗначениеМетаданные.Комментарий;
	КонецЦикла;
	РазделыЗначений.СортироватьПоЗначению();
	
	// Количество колонок преключателя разделов
	Если	РазделыЗначений.Количество() % 4 = 1 
		Или РазделыЗначений.Количество() % 4 = 3
	Тогда
		Элементы.ТекущийРаздел.КоличествоКолонок = 3;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущаяСтрока") И ЗначениеЗаполнено(Параметры.ТекущаяСтрока) Тогда
		мсРазделТекущегоЗначения = РазделыЗначенийПеречисления.НайтиСтроки(Новый Структура("Значение", Параметры.ТекущаяСтрока));
		Если мсРазделТекущегоЗначения.Количество() > 0 Тогда
			ТекущийРаздел = мсРазделТекущегоЗначения[0].Раздел;
		Иначе
			ТекущийРаздел = РазделыЗначений[0].Значение;
		КонецЕсли;
	Иначе
		ТекущийРаздел = РазделыЗначений[0].Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьТекущийРаздел();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТекущийРазделПриИзменении(Элемент)
	
	УстановитьТекущийРаздел();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьТекущийРаздел()
	
	ЗначенияРаздела = РазделыЗначенийПеречисления.НайтиСтроки(Новый Структура("Раздел", ТекущийРаздел));
	ЗначениеОтбора = Новый Массив;
	Для Каждого ЗначениеЭтогоРаздела Из ЗначенияРаздела Цикл
		ЗначениеОтбора.Добавить(ЗначениеЭтогоРаздела.Значение);
	КонецЦикла;
	
	РаботаСФормамиКлиент.УстановитьОтборСписка("Ссылка", ЗначениеОтбора, Список, ВидСравненияКомпоновкиДанных.ВСписке);
	
КонецПроцедуры

#КонецОбласти