
Процедура ЗаписатьОповещениеПоВремени(НаборЗаписей, ЗанятыеДаты, ЧатСсылка, Заявка, Знач ДатаНачала, ТекущаяДата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Заявка.Ссылка КАК Ссылка,
	               |	iga_ВремяПодтвержденияЗаявок.Время КАК Время,
	               |	iga_ВремяПодтвержденияЗаявок.ПереносПодтверждения КАК ПереносПодтверждения
	               |ИЗ
	               |	Документ.Заявка КАК Заявка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.iga_ВремяПодтвержденияЗаявок КАК iga_ВремяПодтвержденияЗаявок
	               |		ПО Заявка.Филиал = iga_ВремяПодтвержденияЗаявок.Филиал
	               |ГДЕ
	               |	Заявка.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Заявка);
	ВыборкаВремени = Запрос.Выполнить().Выбрать();
	ВремяОповещения = Дата(1,1,1,17,0,0);
	ПереносПодтверждения = Ложь;
	Если ВыборкаВремени.Следующий() Тогда
		ВремяОповещения = ВыборкаВремени.Время;
		ПереносПодтверждения = ВыборкаВремени.ПереносПодтверждения;
	КонецЕсли;      
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_РаботыСФиксированнымВременемЗаписи.Работа КАК Работа,
	               |	iga_РаботыСФиксированнымВременемЗаписи.Время КАК Время
	               |ИЗ
	               |	Документ.Заявка.Работы КАК ЗаявкаРаботы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.iga_РаботыСФиксированнымВременемЗаписи КАК iga_РаботыСФиксированнымВременемЗаписи
	               |		ПО (ЗаявкаРаботы.Номенклатура = iga_РаботыСФиксированнымВременемЗаписи.Работа
	               |					И НЕ iga_РаботыСФиксированнымВременемЗаписи.Работа = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |				ИЛИ (ЗаявкаРаботы.Сотрудник = iga_РаботыСФиксированнымВременемЗаписи.Врач
	               |					ИЛИ ЗаявкаРаботы.Ссылка.Сотрудник = iga_РаботыСФиксированнымВременемЗаписи.Врач)
	               |					И НЕ iga_РаботыСФиксированнымВременемЗаписи.Врач = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка))
	               |ГДЕ
	               |	ЗаявкаРаботы.Ссылка = &Ссылка";
	ВыборкаФиксВремени = Запрос.Выполнить().Выбрать();
	Если ВыборкаФиксВремени.Следующий() Тогда
		ДатаНачала = НачалоДня(ДатаНачала) + (ВыборкаФиксВремени.Время - Дата(1,1,1));
	КонецЕсли;
	
		ДатаДокумента = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заявка, "Дата");
		
		КоличествоЧасов = iga_ОбщегоНазначенияКлиентСервер.РазностьДат(ТекущаяДата, ДатаНачала, "ЧАС");
		
		Язык = iga_МетодыРаботыСБотом.ПолучитьЗначениеПараметраОбщения(ЧатСсылка, "Язык");
				
		Более24 = Ложь;
		Более12 = Ложь;
		Более3 = Ложь;
		МинусЧасов = 0;
		
		Если КоличествоЧасов > 3 Тогда
			Более3 = Истина
		КонецЕсли;
		Если КоличествоЧасов > 12 Тогда
			МинусЧасов = -12;
			Более12 = Истина;
		КонецЕсли;

		//Если КоличествоЧасов > 24 Тогда
		//	МинусЧасов = -24;
		//	Более24 = Истина;
		//КонецЕсли;
		
		
		Если (Более24 Или Более12) 
			И ?(День(ДатаДокумента) + 1 = День(ДатаНачала), Час(ДатаДокумента) < 17, Истина) Тогда

			ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(ДатаНачала, "ЧАС", МинусЧасов);
			
			Если Час(ДатаОповещения) >= 0 И Час(ДатаОповещения) < 7 Тогда
				ДатаОповещения = НачалоДня(НачалоДня(ДатаОповещения)-1) + (ВремяОповещения - Дата(1,1,1));
			ИначеЕсли ДатаОповещения - НачалоДня(ДатаОповещения) > (ВремяОповещения - Дата(1,1,1)) И Час(ДатаОповещения) <= 23 Тогда
				ДатаОповещения = НачалоДня(ДатаОповещения) + (ВремяОповещения - Дата(1,1,1));
			КонецЕсли;       
			
			
			Если ПереносПодтверждения 
				И ДеньНедели(ДатаОповещения) = 7 Тогда
				ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(ДатаОповещения, "ДЕНЬ", -2);
			КонецЕсли;
			
			
			Если ЗанятыеДаты.Найти(ДатаОповещения) = Неопределено И ДатаОповещения > ТекущаяДата() Тогда
				Запись = НаборЗаписей.Добавить();
				Запись.Заявка = Заявка;
				Запись.ДатаОповещения = ДатаОповещения;
				Запись.ТребуетсяПодтверждение = Истина;
				Запись.ДатаЗаписи = ДатаНачала;
				Запись.Чат = ЧатСсылка; 
				ЗанятыеДаты.Добавить(ДатаОповещения);
				Запись.ШаблонОповещения = Справочники.iga_ШаблоныСообщений.Предопределенный(
					Перечисления.iga_ВидыПредопределенныхШаблонов.ПодтверждениеЗаписи, Язык);
			КонецЕсли;
			
		КонецЕсли;
		
		Если Более3 Тогда

			ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(ДатаНачала, "ЧАС", -3);

			Если Час(ДатаОповещения) >= 0 И Час(ДатаОповещения) < 6 Тогда
				ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(НачалоДня(ДатаОповещения), "ЧАС", 6);
			ИначеЕсли Час(ДатаОповещения) > 20 И Час(ДатаОповещения) <=23 Тогда
				ДатаОповещения = iga_ОбщегоНазначенияКлиентСервер.ДобавитьКДате(НачалоДня(ДатаОповещения), "ЧАС", 20);
			КонецЕсли;
			
			Если ЗанятыеДаты.Найти(ДатаОповещения) = Неопределено Тогда
				Запись = НаборЗаписей.Добавить();
				Запись.Заявка = Заявка;
				Запись.ДатаОповещения = ДатаОповещения;
				Запись.ДатаЗаписи = ДатаНачала;
				Запись.Чат = ЧатСсылка;
				ЗанятыеДаты.Добавить(ДатаОповещения);
				Запись.ШаблонОповещения = Справочники.iga_ШаблоныСообщений.Предопределенный(
					Перечисления.iga_ВидыПредопределенныхШаблонов.ОповещениеОЗаписи, Язык);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецПроцедуры
	