
Функция iga_ВключеноОповещениеОЗаписи()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Включено = Константы.iga_ВключеноОповещениеОЗаписи.Получить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Включено;
	
КонецФункции

&Перед("ПередЗаписью")
Процедура iga_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не iga_ВключеноОповещениеОЗаписи() Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ОповещенияПоВремени.Заявка КАК Заявка
	               |ИЗ
	               |	РегистрСведений.iga_ОповещенияПоВремени КАК iga_ОповещенияПоВремени
	               |ГДЕ
	               |	iga_ОповещенияПоВремени.Заявка = &Заявка
	               |	И iga_ОповещенияПоВремени.Выполнено";
	Запрос.УстановитьПараметр("Заявка", Ссылка);
	ЕстьОтправленноеОповещение = Не Запрос.Выполнить().Пустой();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ЕстьОтправленноеОповещение И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нельзя отменить заявку, если по ней уже была отправка оповещения!";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры
