#Область ПрограммныйИнтерфейс

Процедура ОбработатьНажатиеКнопкиОткрытияИнтерфейсаЗаполненияПараметров(ЭлементHTML, ИдентификаторИнтерфейса, Форма = Неопределено, ИдентификаторСтрокиШаблона = Неопределено) Экспорт
	
	ИмяФормыИнтерфейса = РаботаСИнтерфейсамиЗаполненияПараметров.ИмяФормыИнтерфейса(ИдентификаторИнтерфейса);
	
	Если Не ЗначениеЗаполнено(ИмяФормыИнтерфейса) Тогда
		Возврат;
	КонецЕсли;
	
	СтруктурыТаблицПараметров = РаботаСИнтерфейсамиЗаполненияПараметровКлиентСервер.ПолучитьСтруктурыТаблицПараметровЭлементаИнтерфейса(ЭлементHTML);
	
	Если СтруктурыТаблицПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицыПараметровИнтерфейса = СтруктурыТаблицПараметров.ТаблицыПараметровИнтерфейса;
	ПараметрыПолей = СтруктурыТаблицПараметров.ПараметрыПолей;
	
	Если Форма <> Неопределено Тогда
		
		Для Каждого СтруктураТаблицы Из ТаблицыПараметровИнтерфейса Цикл
			Если СтруктураТаблицы.Идентификатор = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ОтборПараметровТаблицыШаблона = Новый Структура;
			ОтборПараметровТаблицыШаблона.Вставить("ИдентификаторТаблицы", Строка(СтруктураТаблицы.Идентификатор));
			ОтборПараметровТаблицыШаблона.Вставить("ИдентификаторСтрокиШаблона", ИдентификаторСтрокиШаблона);
			СтрокиПараметровТаблицыШаблона = Форма.ПараметрыТаблицШаблонов.НайтиСтроки(ОтборПараметровТаблицыШаблона);
			Для Каждого СтрокаТаблицы Из СтрокиПараметровТаблицыШаблона Цикл
				СтруктураПараметра = Новый Структура("НомерСтрокиТаблицы, Параметр, Значение, ИдентификаторТаблицы, ИдентификаторСтроки, ИдентификаторРодительскойСтроки");
				ЗаполнитьЗначенияСвойств(СтруктураПараметра, СтрокаТаблицы);
				СтруктураТаблицы.МассивДанныхТаблицы.Добавить(СтруктураПараметра);
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого СтруктураПараметраПоля Из ПараметрыПолей Цикл
			Если СтруктураПараметраПоля.Идентификатор = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ОтборПараметра = Новый Структура;
			ОтборПараметра.Вставить("ИдентификаторСтрокиШаблона", ИдентификаторСтрокиШаблона);
			ОтборПараметра.Вставить("СтрокаУидПараметра", Строка(СтруктураПараметраПоля.Идентификатор));
			СтрокиПараметра = Форма.ТаблицаПараметров.НайтиСтроки(ОтборПараметра);
			Если СтрокиПараметра.Количество() > 0 Тогда
				СтруктураПараметраПоля.Значение = СтрокиПараметра[0].Значение;
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыЗакрытия = Новый Структура;
		ПараметрыЗакрытия.Вставить("Форма",							Форма);
		ПараметрыЗакрытия.Вставить("ИдентификаторИнтерфейса",		ИдентификаторИнтерфейса);
		ПараметрыЗакрытия.Вставить("ИдентификаторСтрокиШаблона",	ИдентификаторСтрокиШаблона);
		ПараметрыЗакрытия.Вставить("ПараметрыПолей",				ПараметрыПолей);
		ПараметрыЗакрытия.Вставить("ТаблицыПараметров",				ТаблицыПараметровИнтерфейса);
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗавершениеЗаполненияПараметровИзИнтерфейса", РаботаСИнтерфейсамиЗаполненияПараметровКлиент, ПараметрыЗакрытия);
		ДополнительныеПараметры = ДополнительныеПараметрыОткрытияПоИнтерфейсу(Форма, ИдентификаторИнтерфейса, ИдентификаторСтрокиШаблона);
	Иначе
		ОповещениеОЗакрытии = Неопределено;
		ДополнительныеПараметры = Неопределено;
	КонецЕсли;
	
	ЗаголовокИнтерфейса = РаботаСИнтерфейсамиЗаполненияПараметровКлиентСервер.ЗаголовокИнтерфейса(ЭлементHTML, ИдентификаторИнтерфейса);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ИдентификаторИнтерфейса",	ИдентификаторИнтерфейса);
	ПараметрыОткрытия.Вставить("ПараметрыПолей",			ПараметрыПолей);
	ПараметрыОткрытия.Вставить("ТаблицыПараметров",			ТаблицыПараметровИнтерфейса);
	ПараметрыОткрытия.Вставить("ДополнительныеПараметры",	ДополнительныеПараметры);
	ПараметрыОткрытия.Вставить("ЗаголовокИнтерфейса",		ЗаголовокИнтерфейса);
	
	ОткрытьФорму(ИмяФормыИнтерфейса, ПараметрыОткрытия, , , , , ОповещениеОЗакрытии);
	
КонецПроцедуры

Процедура ЗавершениеЗаполненияПараметровИзИнтерфейса(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИнтерфейсЗаполнения = РаботаСИнтерфейсамиЗаполненияПараметровКлиентСервер.ИнтерфейсЗаполнения(Параметры.ИдентификаторИнтерфейса);
	
	Если ИнтерфейсЗаполнения = ПредопределенноеЗначение("Перечисление.ИнтерфейсыЗаполненияПараметров.СЭМД_186_Исследования") Тогда
		ЗаполнитьДанныеПоРезультатамИнтерфейса(Результат, Параметры);
	КонецЕсли;
	
	СтрокаШаблона = Параметры.Форма.Объект.ШаблоныПриема.НайтиПоИдентификатору(Параметры.ИдентификаторСтрокиШаблона);
	СтрокаСтраницыШаблона = Параметры.Форма.СтраницыШаблоновПриема.НайтиСтроки(Новый Структура("ИдентификаторСтрокиШаблона", СтрокаШаблона.ПолучитьИдентификатор()))[0];
	
	Документ = Параметры.Форма.Элементы[СтрокаСтраницыШаблона.ИмяПоляДокумента].Документ;
	
	РаботаСИнтерфейсамиЗаполненияПараметровКлиентСервер.ОбновитьТекстHTMLПоИнтерфейсу(Документ, Параметры.ИдентификаторСтрокиШаблона, Параметры.ИдентификаторИнтерфейса, Параметры.Форма.ТаблицаПараметров, Параметры.Форма.ПараметрыТаблицШаблонов);
	Параметры.Форма.Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДанныеПоРезультатамИнтерфейса(Результат, Параметры)
	
	ПоляТаблицыИнтерфейса = РаботаСИнтерфейсамиЗаполненияПараметровКлиентСервер.ПоляТаблицыИнтерфейса(Параметры.ИдентификаторИнтерфейса);
	
	// Одиночные параметры
	ИдентификаторыПараметров = Новый Соответствие;
	Для Каждого СтруктураПараметра Из Параметры.ПараметрыПолей Цикл
		ИдентификаторыПараметров.Вставить(СтруктураПараметра.ИмяПоля, СтруктураПараметра.Идентификатор);
	КонецЦикла;
	
	Для Каждого СтрокаПоляПараметра Из ПоляТаблицыИнтерфейса.Иерархия.Поля Цикл
		
		ИдентификаторПараметра = ИдентификаторыПараметров.Получить(СтрокаПоляПараметра.Имя);
		
		ЗначениеПараметра = Неопределено;
		Для Каждого СтруктураЗначенияПараметра Из Результат.МассивЗначенийПараметров Цикл
			Если СтруктураЗначенияПараметра.Параметр.УникальныйИдентификатор() = ИдентификаторПараметра Тогда
				ЗначениеПараметра = СтруктураЗначенияПараметра.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Отбор = Новый Структура("ИдентификаторСтрокиШаблона, СтрокаУидПараметра", Параметры.ИдентификаторСтрокиШаблона, Строка(ИдентификаторПараметра));
		Для Каждого СтрокаПараметра Из Параметры.Форма.ТаблицаПараметров.НайтиСтроки(Отбор) Цикл
			СтрокаПараметра.Значение = ЗначениеПараметра;
			СтрокаПараметра.Представление = РаботаСШаблонамиHTMLКлиентСервер.ПолучитьПредставлениеПараметра(СтрокаПараметра, СтрокаПараметра.ФорматнаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
	// Таблицы параметров
	ИдентификаторыТаблиц = Новый Соответствие;
	Для Каждого СтруктураТаблицы Из Параметры.ТаблицыПараметров Цикл
		ИдентификаторыТаблиц.Вставить(СтруктураТаблицы.ИмяТаблицы, СтруктураТаблицы.Идентификатор);
	КонецЦикла;
	
	// Очистка параметров таблиц
	Для Каждого СтруктураТаблицыИнтерфейса Из ПоляТаблицыИнтерфейса.Таблицы Цикл
		ИдентификаторТаблицы = ИдентификаторыТаблиц.Получить(СтруктураТаблицыИнтерфейса.Имя);
		Если ЗначениеЗаполнено(ИдентификаторТаблицы) Тогда
			УдалитьПараметрыТаблицШаблонов(Параметры.Форма.ПараметрыТаблицШаблонов, Параметры.ИдентификаторСтрокиШаблона, ИдентификаторТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	// Заполнение параметров таблиц
	Для Каждого СтруктураТаблицыИнтерфейса Из ПоляТаблицыИнтерфейса.Таблицы Цикл
		ИдентификаторТаблицы = ИдентификаторыТаблиц.Получить(СтруктураТаблицыИнтерфейса.Имя);
		Для Каждого СтрокаПараметраТаблицы Из Результат.МассивДанныхТаблицы Цикл
			Если СтрокаПараметраТаблицы.ИдентификаторТаблицы <> Строка(ИдентификаторТаблицы) Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрокаДанныхТаблицы = Параметры.Форма.ПараметрыТаблицШаблонов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДанныхТаблицы, СтрокаПараметраТаблицы);
			
			ФорматнаяСтрока = Неопределено;
			СтрокиПараметра = Параметры.Форма.ТаблицаПараметров.НайтиСтроки(Новый Структура("ИдентификаторСтрокиШаблона, Параметр", Параметры.ИдентификаторСтрокиШаблона, СтрокаПараметраТаблицы.Параметр));
			Если СтрокиПараметра.Количество() > 0 Тогда
				ФорматнаяСтрока = СтрокиПараметра[0].ФорматнаяСтрока;
			КонецЕсли;
			
			НоваяСтрокаДанныхТаблицы.ИдентификаторСтрокиШаблона = Параметры.ИдентификаторСтрокиШаблона;
			НоваяСтрокаДанныхТаблицы.Представление = РаботаСШаблонамиHTMLКлиентСервер.ПолучитьПредставлениеПараметра(НоваяСтрокаДанныхТаблицы, ФорматнаяСтрока);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьПараметрыТаблицШаблонов(ПараметрыТаблицШаблонов, ИдентификаторСтрокиШаблона, ИдентификаторТаблицы = Неопределено, ИдентификаторРодительскойСтроки = Неопределено)
	
	Отбор = Новый Структура("ИдентификаторСтрокиШаблона", ИдентификаторСтрокиШаблона);
	Если ИдентификаторТаблицы <> Неопределено Тогда
		Отбор.Вставить("ИдентификаторТаблицы", Строка(ИдентификаторТаблицы));
	КонецЕсли;
	Если ИдентификаторРодительскойСтроки <> Неопределено Тогда
		Отбор.Вставить("ИдентификаторРодительскойСтроки", Строка(ИдентификаторРодительскойСтроки));
	КонецЕсли;
	
	ИдентификаторыОбработанныхСтрок = Новый Массив;
	
	Для Каждого УдаляемаяСтрока Из ПараметрыТаблицШаблонов.НайтиСтроки(Отбор) Цикл
		Если ИдентификаторыОбработанныхСтрок.Найти(УдаляемаяСтрока.ИдентификаторСтроки) = Неопределено Тогда
			УдалитьПараметрыТаблицШаблонов(ПараметрыТаблицШаблонов, ИдентификаторСтрокиШаблона, , УдаляемаяСтрока.ИдентификаторСтроки);
			ИдентификаторыОбработанныхСтрок.Добавить(УдаляемаяСтрока.ИдентификаторСтроки);
		КонецЕсли;
		ПараметрыТаблицШаблонов.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

Функция ДополнительныеПараметрыОткрытияПоИнтерфейсу(Форма, ИдентификаторИнтерфейса, ИдентификаторСтрокиШаблона)
	
	ДополнительныеПараметры = Новый Структура;
	ИнтерфейсЗаполнения = РаботаСИнтерфейсамиЗаполненияПараметровКлиентСервер.ИнтерфейсЗаполнения(ИдентификаторИнтерфейса);
	
	Если ИнтерфейсЗаполнения = ПредопределенноеЗначение("Перечисление.ИнтерфейсыЗаполненияПараметров.СЭМД_186_Исследования") Тогда
		ДополнительныеПараметры.Вставить("Филиал", Форма.Объект.Филиал);
		ДополнительныеПараметры.Вставить("ВидДокумента", Форма.Объект.ШаблоныПриема.НайтиПоИдентификатору(ИдентификаторСтрокиШаблона).ВидДокумента);
	КонецЕсли;
	
	Возврат ДополнительныеПараметры;
	
КонецФункции

#КонецОбласти