
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПредлагатьЗапомнитьПароль = Истина;
	Если Параметры.Свойство("ПредлагатьЗапомнитьПароль", ПредлагатьЗапомнитьПароль)
		И ПредлагатьЗапомнитьПароль = Ложь Тогда
		Элементы.ЗапомнитьПароль.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Организация") Тогда
		Организация = Параметры.Организация;
		СписокДоступныхПользователей.ЗагрузитьЗначения(
			Справочники.НастройкиИнтеграцииWebKassa.ПользователиОрганизации(Параметры.Организация));
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////////////////
	// ОМГ +   
	РезультатВозврата = ОМГ_ЗполнитьДанныеВебКасса();
	Если не РезультатВозврата = Неопределено Тогда
	//ЗаполнитьЗначенияСвойств(ЭтотОбъект,РезультатВозврата);
	ЭтотОбъект.Пользователь = РезультатВозврата.Пользователь;
	ЭтотОбъект.ПарольПользователя = РезультатВозврата.ПарольПользователя;	
	КонецЕсли;	

	// ОМГ +
	////////////////////////////////////////////////////////////////////////////////////////
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаГотово(Команда)
	
	Если ЗначениеЗаполнено(Пользователь) и ЗначениеЗаполнено(ПарольПользователя) Тогда
		ОМГ_СохранитьДанныеВебКасса(Пользователь,ПарольПользователя)
	КонецЕсли;

	КомандаГотовоВыполнить();
	
КонецПроцедуры 

&НаСервере
Процедура ОМГ_СохранитьДанныеВебКасса(Пользователь,ПарольПользователя)  
	
   	УстановитьПривилегированныйРежим(Истина);
	ПользовательТек = ПараметрыСеанса.ТекущийПользователь.ПолучитьОбъект() ;
	ПользовательТек.Омг_ВебКассаПользователь = Пользователь;
	ПользовательТек.Омг_ВебКассаПароль = ПарольПользователя;
	ПользовательТек.Записать(); 
    УстановитьПривилегированныйРежим(Ложь); 
	
КонецПроцедуры	  

&НаСервере
Функция ОМГ_ЗполнитьДанныеВебКасса()  
	
	УстановитьПривилегированныйРежим(Истина);

	РезультатВозврата = Неопределено;
	ПользовательТек = ПараметрыСеанса.ТекущийПользователь ;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Пользователи.Омг_ВебКассаПользователь КАК Пользователь,
	|	Пользователи.Омг_ВебКассаПароль КАК ПарольПользователя
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Ссылка = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", ПользовательТек);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Пользователь) и 
			ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПарольПользователя) Тогда 	
			
			РезультатВозврата = Новый Структура;	
			РезультатВозврата.Вставить("Пользователь",       ВыборкаДетальныеЗаписи.Пользователь);
			РезультатВозврата.Вставить("ПарольПользователя", ВыборкаДетальныеЗаписи.ПарольПользователя);		
			
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат РезультатВозврата;
	
КонецФункции	

&НаКлиенте
Процедура КомандаГотовоВыполнить()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) И СписокДоступныхПользователей.НайтиПоЗначению(Пользователь) = Неопределено Тогда
		ШаблонСообщения = НСтр("ru = 'Пользователь %1 не имеет доступа к организации %2.
									|Обратитесь к администратору.'");
		
		ИнтеграцияWebKassaКлиентПереопределяемый.СообщитьПользователю(
			ИнтеграцияWebKassaКлиентПереопределяемый.ПодставитьПараметрыВСтроку(ШаблонСообщения, Пользователь, Организация));
		
		Возврат;
	КонецЕсли;
	
	РезультатВыбора = Новый Структура;
	
	РезультатВыбора.Вставить("Пользователь",       Пользователь);
	РезультатВыбора.Вставить("ПарольПользователя", ПарольПользователя);
	//РезультатВыбора.Вставить("ЗапомнитьПароль",    ЗапомнитьПарольНаВремяСеанса);
	
    ////////////////////////////////////////////////////////////////////////////////////////
	// ОМГ +  
	РезультатВыбора.Вставить("ЗапомнитьПароль",    Ложь);
	// ОМГ +
	////////////////////////////////////////////////////////////////////////////////////////
		
	Закрыть(РезультатВыбора);
	
КонецПроцедуры 
#КонецОбласти
