#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ДолжностьФРМР.ТолькоПросмотр = Не ЗначениеЗаполнено(Объект.ДолжностьФРМР) И ДолжностиФРМРПоДолжностиМЗ(Объект.ДолжностьМинздрава).Количество() = 0;
	ОбновитьПолеДолжностиФРМР();
	ЭтоВрач();
	 
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Изменено Макеев (
	//Если ЗначениеЗаполнено(Объект.ДолжностьМинздрава)
	//	И Не ЗначениеЗаполнено(Объект.ДолжностьФРМР)
	//	И ДолжностиФРМРПоДолжностиМЗ(Объект.ДолжностьМинздрава).Количество() <> 1
	//Тогда
	//	Отказ = Истина;
	//	Сообщить(НСтр("ru='Необходимо заполнить должность ФРМР'"));
	//КонецЕсли;
	// )
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДолжностьМинздраваПриИзменении(Элемент)
	
	Объект.ДолжностьФРМР = Неопределено;
	ОбновитьПолеДолжностиФРМР();  
	ЭтоВрач();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПолеДолжностиФРМР()
	
	ДолжностиФРМРПоДолжностиМЗ = ДолжностиФРМРПоДолжностиМЗ(Объект.ДолжностьМинздрава);
	
	мПараметрыВыбора = Новый Массив;
	мПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", ДолжностиФРМРПоДолжностиМЗ));
	мПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", Перечисления.ВидыКлассификаторовМинЗдрава.ФРМРДолжностиМедицинскогоПерсонала));
	
	Элементы.ДолжностьФРМР.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);
	Элементы.ДолжностьФРМР.ТолькоПросмотр = ДолжностиФРМРПоДолжностиМЗ.Количество() = 0;
	Элементы.ДолжностьФРМР.ПодсказкаВвода = "";
	Элементы.ДолжностьФРМР.АвтоОтметкаНезаполненного = Ложь;
	Элементы.ДолжностьФРМР.ОтметкаНезаполненного = Ложь;
	Элементы.ДолжностьФРМР.СписокВыбора.ЗагрузитьЗначения(ДолжностиФРМРПоДолжностиМЗ);
	
	Если ДолжностиФРМРПоДолжностиМЗ.Количество() = 1 Тогда
		Элементы.ДолжностьФРМР.ПодсказкаВвода = Строка(ДолжностиФРМРПоДолжностиМЗ[0]);
	ИначеЕсли ДолжностиФРМРПоДолжностиМЗ.Количество() > 1 Тогда
		Элементы.ДолжностьФРМР.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДолжностиФРМРПоДолжностиМЗ(ДолжностьМинздрава)
	
	Возврат ИнтеграцияЕГИСЗВызовСервера.ПолучитьДолжностьФРМРПоДолжностиМЗ(ДолжностьМинздрава, Ложь);
	
КонецФункции

#КонецОбласти  

&НаСервере
Процедура ЭтоВрач()
	
	Элементы.РольПерсонала.ТолькоПросмотр = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ДолжностьМинздрава) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Принадлежит
		|ИЗ
		|	Справочник.КлассификаторыМинЗдрава КАК Классификатор
		|ГДЕ
		|	Классификатор.Ссылка = &Должность
		|	И Классификатор.Ссылка В ИЕРАРХИИ
		|		(ВЫБРАТЬ
		|			Группы.Ссылка
		|		ИЗ
		|			Справочник.КлассификаторыМинЗдрава КАК Группы
		|		ГДЕ
		|			Группы.ЭтоГруппа
		|			И Группы.Наименование = ""Врачи-специалисты""
		|			И Группы.ВидКлассификатора = &ВидКлассификатора)";
	
	Запрос.УстановитьПараметр("Должность", Объект.ДолжностьМинздрава);
	Запрос.УстановитьПараметр("ВидКлассификатора", Объект.ДолжностьМинздрава.ВидКлассификатора);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Элементы.РольПерсонала.ТолькоПросмотр = Истина;
		Объект.РольПерсонала = Перечисления.омг_РолиПерсонала.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры	