#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчет.Ответственный = Пользователи.ТекущийПользователь().Сотрудник;
	Если ЗначениеЗаполнено(Отчет.Ответственный) Тогда
		Отчет.Должность = ПредставлениеДолжностиСотрудника(Отчет.Ответственный);
	КонецЕсли;
	
	Элементы.Филиалы.Видимость = ПараметрыСеанса.УчетПоНесколькимФилиалам;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	ОчиститьСообщения();
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьОтчет();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
    Диалог = Новый ДиалогРедактированияСтандартногоПериода();                                 
    Диалог.Период = Новый СтандартныйПериод(Отчет.ПериодНачало, Отчет.ПериодОкончание);        
    Если Диалог.Редактировать() Тогда
        Отчет.ПериодНачало = Диалог.Период.ДатаНачала;
        Отчет.ПериодОкончание = Диалог.Период.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Отчет.Ответственный) Тогда
		ДолжностьСотрудника = ПредставлениеДолжностиСотрудника(Отчет.Ответственный);
		Если ЗначениеЗаполнено(ДолжностьСотрудника) Тогда
			Отчет.Должность = ДолжностьСотрудника;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьОтчет()
	
	Отчет.Филиалы = Филиалы;
	ТаблицаОтчета = РеквизитФормыВЗначение("Отчет").СформироватьОтчет();
	
КонецПроцедуры

&НаСервереБезконтекста
Функция ПредставлениеДолжностиСотрудника(Сотрудник)
	
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		ДолжностьСотрудника = Сотрудник.Должность;
		Если ЗначениеЗаполнено(ДолжностьСотрудника) Тогда
			
			Возврат Строка(ДолжностьСотрудника);
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецОбласти
