#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПутьКЗаписи = ПолучитьПутьКЗаписиРазговора(ПараметрКоманды);
	
	Если ПутьКЗаписи <> Неопределено Тогда 
		доп_БитфонКлиент.ВоспроизвестиЗаписьРазговора(ПутьКЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПутьКЗаписиРазговора(Событие)
	
	Если Событие.ВидСобытия <> Перечисления.ВидыСобытий.ВходящийЗвонок 
		И Событие.ВидСобытия <> Перечисления.ВидыСобытий.ИсходящийЗвонок 
	Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Событие.ЗаписьРазговора;
	
КонецФункции

#КонецОбласти
