#Область ПрограммныйИнтерфейс

#Область ФР_НСИ

Процедура ОткрытьФормуОбновленияСправочника(НаименованиеСправочника, ЭлементСписок, Форма, ОповещениеОЗавершении = Неопределено) Экспорт
	
	РезультатПроверки = ИнтеграцияЕГИСЗВызовСервера.ПроверитьНеобходимостьАвтоОбновления(НаименованиеСправочника);
	Если РезультатПроверки.Режим = ПредопределенноеЗначение("Перечисление.РежимыАвтоОбновленияСправочниковЕГИСЗ.Полное") Тогда
		
		// Загружаем все отличающиеся элементы из последней версии справочника без отображения пользователю формы ЗагрузкаНСИЕГИСЗ
		СтруктураПараметры = Новый Структура("НаименованиеСправочника, НеОтображатьФорму, ПоследнююВерсию", НаименованиеСправочника, Истина, Истина);
		
		ЕстьВозможностьРедактированияДанных = ОбщегоНазначенияСервер.РежимРасширенныхВозможностейРедактированияДанных(); 
		Если ЕстьВозможностьРедактированияДанных Тогда
			СтруктураПараметры.НеОтображатьФорму = Ложь;
			СтруктураПараметры.ПоследнююВерсию = Ложь;
		КонецЕсли;
		
		ОткрытьФорму("ОбщаяФорма.ЗагрузкаНСИЕГИСЗ", СтруктураПараметры, ЭлементСписок, Форма,,, ОповещениеОЗавершении);
		
		Если Не ЕстьВозможностьРедактированияДанных Тогда
			
			ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Справочник был обновлен!'"));
			Если ОповещениеОЗавершении <> Неопределено Тогда
				ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Истина);
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		СтруктураПараметры = Новый Структура("НаименованиеСправочника", НаименованиеСправочника);
		ОткрытьФорму("ОбщаяФорма.ЗагрузкаНСИЕГИСЗ", СтруктураПараметры, ЭлементСписок, Форма,,,ОповещениеОЗавершении);
	КонецЕсли;
	
КонецПроцедуры

Процедура КомандаСпискаЗагрузитьКлассификаторФРНСИ(Форма, ЭлементСписок, Список, ОповещениеОЗавершении = Неопределено, ИмяСправочника = Неопределено) Экспорт
	
	Если ИмяСправочника = Неопределено Тогда
		// Получение имени справочника конфигурации из имени формы списка.
		ЧастиИмени = СтрРазделить(Форма.ИмяФормы, ".");
		Если ЧастиИмени.Количество() >= 3 Тогда // Например, Справочник.ЛабораторныеТесты.Формы.ФормаСписка.
			Если ДопСерверныеФункцииПовтИсп.ЕстьОбъектМетаданных("Справочник." + ЧастиИмени[1]) Тогда
				ИмяСправочника = ЧастиИмени[1];
			КонецЕсли;
		КонецЕсли;
		
		Если ИмяСправочника = Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru='Имя справочника не указано'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыОперации = Новый Структура;
	ПараметрыОперации.Вставить("Форма",	 Форма);
	ПараметрыОперации.Вставить("Список", Список);
	ПараметрыОперации.Вставить("ЭлементСписок", ЭлементСписок);
	ПараметрыОперации.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	
	ОповещениеОЗавершенииОбщее = Новый ОписаниеОповещения("КомандаСпискаЗагрузитьКлассификаторФРНСИ_Завершение", ИнтеграцияЕГИСЗКлиент, ПараметрыОперации);
	
	ОткрытьФормуОбновленияСправочника(ИмяСправочника, ЭлементСписок, Форма, ОповещениеОЗавершенииОбщее);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ФР_НСИ

Процедура КомандаСпискаЗагрузитьКлассификаторФРНСИ_Завершение(Результат, ПараметрыОперации) Экспорт
	
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации.ЭлементСписок.Обновить();
	
	Элементы = ПараметрыОперации.Форма.Элементы; // Элементы формы.
	Если Элементы.Найти("СписокСкрытьПоказатьАрхивные") <> Неопределено Тогда
		РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.СписокСкрытьПоказатьАрхивные, ПараметрыОперации.Список, Элементы.СписокСкрытьПоказатьАрхивные.Пометка);
	Иначе
		Попытка
			РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Новый Структура("Пометка"), ПараметрыОперации.Список, Ложь);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если ПараметрыОперации.ОповещениеОЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ПараметрыОперации.ОповещениеОЗавершении);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти