 
&НаКлиенте
Функция ЗапросНаТерминалПродажа(Сумма, АдресТерминала, Порт, ЭтоКаспи) Экспорт
	
	Если АдресТерминала = "local" Тогда
		Возврат "12345678";
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(АдресТерминала, Порт, , , , 10);
	
	Если ЭтоКаспи Тогда
		СтрокаЗапроса = "/payment?method=qr&amount="+Формат(Число(Сумма),"ЧДЦ=0; ЧГ=0")+"";		
	Иначе
		СтрокаЗапроса = "/payment?amount="+Формат(Число(Сумма),"ЧДЦ=0; ЧГ=0")+"";		
	КонецЕсли;
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса);
	Запрос.Заголовки.Вставить("Content-type", "application/json"); 
	
	Попытка
		Ответ = Соединение.Получить(Запрос);
	Исключение
		ВызватьИсключение "Эквайринговый терминал с IP адресом "+АдресТерминала+" не найден. Возможны проблемы с сетью.";
	КонецПопытки;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Эквайринговый терминал ответил ошибкой "+Ответ.КодСостояния+" ";
	Иначе
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		
		СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
		
		Если ЭтоКаспи Тогда
			Возврат СтруктураОтвета.processId;
		Иначе
			Возврат СтруктураОтвета.task;
		КонецЕсли;
		
	КонецЕсли; 
	
КонецФункции 

&НаКлиенте
Функция ЗапросНаТерминалВозврат(Сумма, АдресТерминала, Порт, ЭтоКаспи, КодЗаказа, ВидОплаты = "") Экспорт
			
	Если АдресТерминала = "local" Тогда
		Возврат "12345678";
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(АдресТерминала, Порт, , , , 10);

	Если ЭтоКаспи Тогда
		СтрокаЗапроса = "/refund?method="+ВидОплаты+"&amount="+Формат(Число(Сумма),"ЧДЦ=0; ЧГ=0")+"&transactionId="+КодЗаказа+"";
	Иначе
		СтрокаЗапроса = "/refund?amount="+Формат(Число(Сумма),"ЧДЦ=0; ЧГ=0")+"&transId="+КодЗаказа+"";
	КонецЕсли;
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса);
	Запрос.Заголовки.Вставить("Content-type", "application/json");
	
	Попытка
		Ответ = Соединение.Получить(Запрос);
	Исключение
		ВызватьИсключение "Терминал с IP адресом "+АдресТерминала+" не найден. Возможны проблемы с сетью.";
	КонецПопытки;
	
	КодОтвета  = Ответ.КодСостояния;
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	Если КодОтвета <> 200 Тогда
		Сообщить("Терминал ответил ошибкой "+КодОтвета+" "+ТелоОтвета+" ");
		Возврат 00000000;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
	
	СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
	
	Если ЭтоКаспи Тогда
		Возврат СтруктураОтвета.processId;
	Иначе
		Возврат СтруктураОтвета.task;
	КонецЕсли;
		
КонецФункции 

Функция ВыполнитьОперациюПокупкиHalyk(Сумма, АдресТерминала, Порт) Экспорт 
	
	HTTPСоединение = Новый HTTPСоединение(АдресТерминала, Порт,,,, 60);
	HTTPЗапрос = Новый HTTPЗапрос;
	
	СтруктураТелаЗапроса = Новый Структура;
	СтруктураТелаЗапроса.Вставить("task", "purchase");
	ПолеData = Новый Структура;
	СтруктураТелаЗапроса.Вставить("data", ПолеData);
	ПолеData.Вставить("amount", Формат(Число(Сумма),"ЧДЦ=0; ЧГ=0"));
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(СтруктураТелаЗапроса));
	
	Попытка
		Ответ = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось подключиться к терминалу. 
			|Ошибка: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		
		Возврат Неопределено;
	КонецПопытки;
	
	Если Не Ответ.КодСостояния = 200 Тогда
		
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось обработать операцию. 
			|Ошибка:" + ТелоОтвета;
		Сообщение.Сообщить();
		
		Возврат Неопределено;
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(ТелоОтвета);
	
	СтруктураТелаОтвета = ПрочитатьJSON(ЧтениеJson, Ложь);
	
	Если СтруктураТелаОтвета.data.result = "0" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Операция успешно выполнена";
		Сообщение.Сообщить();
		КодТранзакции = СтруктураТелаОтвета.data.tagRRN;
		
		Возврат КодТранзакции;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Операция прервана. 
			|Причина: " + СтруктураТелаОтвета.data.msg;
		Сообщение.Сообщить();
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Функция ВыполнитьОперациюВозвратаHalyk(Сумма, АдресТерминала, Порт, КодТранзакции) Экспорт
	
	HTTPСоединение = Новый HTTPСоединение(АдресТерминала, Порт,,,, 60);
	HTTPЗапрос = Новый HTTPЗапрос;
	
	СтруктураТелаЗапроса = Новый Структура;
	СтруктураТелаЗапроса.Вставить("task", "refund");
	ПолеData = Новый Структура;
	СтруктураТелаЗапроса.Вставить("data", ПолеData);
	ПолеData.Вставить("amount", Формат(Число(Сумма),"ЧДЦ=0; ЧГ=0"));
	ПолеData.Вставить("tagRRN", КодТранзакции);
	Если СтрНайти(КодТранзакции, "OBLQR") > 0 Тогда
		ПолеData.Вставить("useOldRefundLogic", Ложь);
		ПолеData.Вставить("method", 1);
		ПолеData.Вставить("printFirstReceipt", Ложь);
	КонецЕсли;
	
	HTTPЗапрос.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(СтруктураТелаЗапроса));

	Попытка
		Ответ = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось подключиться к терминалу. 
			|Ошибка: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		
		Возврат Неопределено;
	КонецПопытки;
	
	Если Не Ответ.КодСостояния = 200 Тогда
		
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось обработать операцию. 
			|Ошибка:" + ТелоОтвета;
		Сообщение.Сообщить();
		
		Возврат Неопределено;
	КонецЕсли;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(ТелоОтвета);
	
	СтруктураТелаОтвета = ПрочитатьJSON(ЧтениеJson, Ложь);
	
	Если СтруктураТелаОтвета.data.result = "0" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Операция успешно выполнена";
		Сообщение.Сообщить();
		КодТранзакции = СтруктураТелаОтвета.data.tagRRN;
		
		Возврат КодТранзакции;
		
	Иначе
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Операция прервана. 
			|Причина: " + СтруктураТелаОтвета.data.msg;
		Сообщение.Сообщить();
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции
