
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Параметры = Новый Структура("Ключ", СоздатьКлючЗаписи(Новый Структура));
	ВыбраннаяФорма = "ФормаЗаписи";
	
КонецПроцедуры

Функция ПолучитьНастройки() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураРесурсов = ОбщегоНазначенияРасширенный.СоздатьСтруктуруЗаписиРегистра(СоздатьНаборЗаписей().Метаданные(), Ложь, Истина, Ложь, Ложь);
	Запись = СоздатьМенеджерЗаписи();
	Запись.Прочитать();
	ЗаполнитьЗначенияСвойств(СтруктураРесурсов, Запись);
		
	Возврат СтруктураРесурсов;
	
КонецФункции

Процедура УстановитьНастройки(СтруктураНастроек) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Прочитать();
	ЗаполнитьЗначенияСвойств(Запись, СтруктураНастроек);
	Запись.Записать();		
	
КонецПроцедуры