
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Дата = ТекущаяДата();
	
	Если Не Параметры.Документ.Пустая() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	УстановкаЦен.омг_Организация КАК Организация,
		               |	УстановкаЦен.Дата КАК Дата
		               |ИЗ
		               |	Документ.УстановкаЦен КАК УстановкаЦен
		               |ГДЕ
		               |	УстановкаЦен.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	УстановкаЦеномг_Филиалы.Филиал КАК Филиал
		               |ИЗ
		               |	Документ.УстановкаЦен.омг_Филиалы КАК УстановкаЦеномг_Филиалы
		               |ГДЕ
		               |	УстановкаЦеномг_Филиалы.Ссылка = &Ссылка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	УстановкаЦеномг_Прейскуранты.Прейскурант КАК Прейскурант
		               |ИЗ
		               |	Документ.УстановкаЦен.омг_Прейскуранты КАК УстановкаЦеномг_Прейскуранты
		               |ГДЕ
		               |	УстановкаЦеномг_Прейскуранты.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Параметры.Документ);
		ПакетРезультатов = Запрос.ВыполнитьПакет();
		ВыборкаОрганизация = ПакетРезультатов.Получить(0).Выбрать();
		ВыборкаОрганизация.Следующий();
		Организация = ВыборкаОрганизация.Организация;
		ПериодДокументов.ДатаНачала = НачалоМесяца(ВыборкаОрганизация.Дата);
		ПериодДокументов.ДатаОкончания = КонецМесяца(ВыборкаОрганизация.Дата);
		Дата = ВыборкаОрганизация.Дата;
		ВыборкаФилиалы = ПакетРезультатов.Получить(1).Выбрать();
		Пока ВыборкаФилиалы.Следующий() Цикл
			Филиалы.Добавить(ВыборкаФилиалы.Филиал);
		КонецЦикла;
		
		ВыборкаПрейскуранты = ПакетРезультатов.Получить(2).Выбрать();
		Пока ВыборкаПрейскуранты.Следующий() Цикл
			СтраховыеПрограммы.Добавить(ВыборкаПрейскуранты.Прейскурант);
		КонецЦикла;
		
	Иначе
		
		ЭтоПолныеПрава = РольДоступна("ПолныеПрава");
		Если ЭтоПолныеПрава Тогда
			
			ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
			
			Настройки = ХранилищеОбщихНастроек.Загрузить(ИмяФормы, "Настройки",, 
				ИмяПользователя);
			Если Не Настройки = Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ЭтаФорма, Настройки,, "Дата");
			КонецЕсли;
			
			
			
		КонецЕсли;
		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура омг_ПрейскурантНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбранных = СтраховыеПрограммы;
	Отбор = Новый Структура("Организация", Организация);
	
	ПараметрыЗапроса = Новый Массив;
	ПараметрыЗапроса.Добавить(Новый Структура("Параметр, Значение", "Дата", Дата));
	
	Отбор.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	
	СложныеОтборы = Новый Массив;
	СложныеОтборы.Добавить("&Дата МЕЖДУ ДатаНачала И ДатаОкончания");
	
	Отбор.Вставить("СложныеОтборы", СложныеОтборы);
	ОткрытьФорму("ОбщаяФорма.омг_ФормаВыбораСИерархией", 
		Новый Структура("Справочник, СписокВыбранных, Отбор", "СоглашенияСтрахования", СписокВыбранных, Отбор), Элементы.СтраховыеПрограммы,
		УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ФилиалыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбранных = Филиалы;
	Отбор = Новый Структура("Организация", Организация);
	ОткрытьФорму("ОбщаяФорма.омг_ФормаВыбораСИерархией", 
		Новый Структура("Справочник, СписокВыбранных, Отбор", "Филиалы", СписокВыбранных, Отбор), Элементы.Филиалы,
		УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляБезналаНаПанелиИзОплаты(ЭТНаФорме, ОплатаБезналомНаФорме, Знач ТабЧастьОплата, Знач Филиал, Знач Касса, Знач НСПК_СпособОплаты)
	
	СтрокаБезнал = Неопределено;
	
	Для Каждого СтрокаОплаты Из ТабЧастьОплата Цикл
		
		Если СтрокаОплаты.ВидОплаты = ПредопределенноеЗначение("Перечисление.ВидыОплаты.Безналичные") Тогда
			СтрокаБезнал = СтрокаОплаты;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаБезнал <> Неопределено Тогда
		ОплатаБезналомНаФорме = СтрокаБезнал.Сумма;
		ЭТНаФорме			  = СтрокаБезнал.ЭквайринговыйТерминал;
	Иначе
		ЭТНаФорме = РаботаСТорговымОборудованием.ПолучитьЭквайринговыйТерминал(, Филиал, Касса);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПерезаполнениеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.омг_Филиал КАК омг_Филиал,
	               |	ЦеныНоменклатурыСрезПоследних.Прейскурант КАК Прейскурант,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.омг_Набор КАК омг_Набор,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	               |ПОМЕСТИТЬ ВТ_ЦеныПоСтраховым
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			&Дата,
	               |			омг_Филиал В (&Филиалы)
	               |				И Прейскурант В (&СтраховыеПрограммы)) КАК ЦеныНоменклатурыСрезПоследних
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОказаниеУслугРаботы.Ссылка КАК Ссылка,
	               |	ОказаниеУслугРаботы.НомерСтроки КАК НомерСтроки,
	               |	ОказаниеУслугРаботы.Цена КАК Цена,
	               |	ВТ_ЦеныПоСтраховым.Цена КАК НоваяЦена
	               |ИЗ
	               |	Документ.ОказаниеУслуг КАК ОказаниеУслуг
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
	               |		ПО (ОказаниеУслугРаботы.Ссылка = ОказаниеУслуг.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦеныПоСтраховым КАК ВТ_ЦеныПоСтраховым
	               |		ПО ОказаниеУслуг.Филиал = ВТ_ЦеныПоСтраховым.омг_Филиал
	               |			И ОказаниеУслуг.омг_СтраховаяПрограмма = ВТ_ЦеныПоСтраховым.Прейскурант
	               |			И ((ОказаниеУслугРаботы.Номенклатура, ОказаниеУслугРаботы.омг_Набор) В
	               |				(ВЫБРАТЬ
	               |					ВТ_ЦеныПоСтраховым.Номенклатура КАК Номенклатура,
	               |					ВТ_ЦеныПоСтраховым.омг_Набор КАК омг_Набор
	               |				ИЗ
	               |					ВТ_ЦеныПоСтраховым КАК ВТ_ЦеныПоСтраховым))
	               |			И (ОказаниеУслугРаботы.Номенклатура = ВТ_ЦеныПоСтраховым.Номенклатура)
	               |			И (ОказаниеУслугРаботы.омг_Набор = ВТ_ЦеныПоСтраховым.омг_Набор)
	               |ГДЕ
	               |	ОказаниеУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ОказаниеУслуг.Филиал В(&Филиалы)
	               |	И ОказаниеУслуг.омг_СтраховаяПрограмма В(&СтраховыеПрограммы)
	               |	И НЕ ВТ_ЦеныПоСтраховым.Цена ЕСТЬ NULL
	               |	И ВЫБОР
	               |			КОГДА &ТолькоИзменения
	               |				ТОГДА ЕСТЬNULL(ВТ_ЦеныПоСтраховым.Цена, 0) <> ОказаниеУслугРаботы.Цена
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ОказаниеУслуг.Проведен
	               |ИТОГИ ПО
	               |	Ссылка";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДатаНачала", ПериодДокументов.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ПериодДокументов.ДатаОкончания);
	Запрос.УстановитьПараметр("Филиалы", Филиалы);
	Запрос.УстановитьПараметр("СтраховыеПрограммы", СтраховыеПрограммы);
	Запрос.УстановитьПараметр("ТолькоИзменения", Не ПерезаполнитьВсеДокументыЗаПериод);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Начало перезаполнения документов " + ТекущаяДата();
	Сообщение.Сообщить();
	
	Проведено = 0;
	
	СтруктураДокумента = Новый Структура;
	СтруктураСтроки = Новый Структура;
	Для Каждого Реквизит Из Метаданные.Документы.ОказаниеУслуг.Реквизиты Цикл
		СтруктураДокумента.Вставить(Реквизит.Имя);
	КонецЦикла;
	Для Каждого Реквизит Из Метаданные.Документы.ОказаниеУслуг.ТабличныеЧасти.Работы.Реквизиты Цикл
		СтруктураСтроки.Вставить(Реквизит.Имя);
	КонецЦикла;
	
	ДанныеФормы = Новый Структура("ЭквайринговыйТерминалНаФорме, ОплаченоБезналичным",, 0);
	
	ВыборкаДокументы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументы.Следующий() Цикл
		
		ДокументОбъект = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
		Документы.ОказаниеУслуг.омг_РаботаСНДС(ДокументОбъект);	
		ДанныеФормы.ЭквайринговыйТерминалНаФорме = Неопределено;
		ДанныеФормы.ОплаченоБезналичным = 0;
		ЗаполнитьПоляБезналаНаПанелиИзОплаты(ДанныеФормы.ЭквайринговыйТерминалНаФорме, ДанныеФормы.ОплаченоБезналичным, 
			ДокументОбъект.Оплата, ДокументОбъект.Филиал, ДокументОбъект.Касса, Неопределено);
			
		ЗаполнитьЗначенияСвойств(СтруктураДокумента, ДокументОбъект);
		
		ВыборкаСтроки = ВыборкаДокументы.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
			СтрокаТаблицы = ДокументОбъект.Работы.Найти(ВыборкаСтроки.НомерСтроки, "НомерСтроки");
			Если СтрокаТаблицы = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаТаблицы.Цена = ВыборкаСтроки.НоваяЦена;
			ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТаблицы);
			РаботаСДокументамиКлиентСервер.омг_РассчитатьСуммуСкидкиСтрокиТабЧасти(СтруктураДокумента, "Товары", СтруктураСтроки);
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, СтруктураСтроки);
			
		КонецЦикла;
		РаботаСДокументамиКлиентСервер.РасчитатьСуммуДокументаОказанияУслуг(ДокументОбъект);
		Документы.ОказаниеУслуг.омг_ПересчитатьОплатыНаСервере(ДокументОбъект, ДанныеФормы);
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Проведено = Проведено + 1;
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось провести документ " + ДокументОбъект.Ссылка;
			Сообщение.КлючДанных = ДокументОбъект.Ссылка;
			Сообщение.Сообщить();
		КонецПопытки;
		
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Всего перезаполнено " + Проведено + " из " + ВыборкаДокументы.Количество();
	Сообщение.Сообщить();
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьПерезаполнение(Команда)
	ВыполнитьПерезаполнениеНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция омг_ОтобратьФилиалыПоОрганизации(Знач Филиалы, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Филиалы", Филиалы);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Филиалы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Филиалы КАК Филиалы
	               |ГДЕ
	               |	Филиалы.Ссылка В(&Филиалы)
	               |	И Филиалы.Организация = &Организация";
	РезультатЗапроса = Запрос.Выполнить();
	Филиалы.Очистить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Филиалы;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Филиалы.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Филиалы;
	
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Филиалы = омг_ОтобратьФилиалыПоОрганизации(Филиалы, Организация);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройки()
	
	ЭтоПолныеПрава = РольДоступна("ПолныеПрава");
	Если Параметры.Документ.Пустая() И ЭтоПолныеПрава Тогда
		
		СтруктураРеквизитов = Новый Структура;
		Для Каждого Реквизит Из ПолучитьРеквизиты() Цикл
			Если Реквизит.Имя = "Объект" Тогда
				Продолжить;
			КонецЕсли;
			СтруктураРеквизитов.Вставить(Реквизит.Имя);
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, ЭтаФорма);
		
		ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
		
		ХранилищеОбщихНастроек.Сохранить(ИмяФормы, "Настройки", СтруктураРеквизитов,, ИмяПользователя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьНастройки();

КонецПроцедуры

