
&НаКлиенте
Процедура ОК(Команда)
	
	СтрВозврата = Новый Структура;
		
	МассивПозиций = Новый Массив; 
	
	Если ЭтоФилиалы Тогда
		
	Для Каждого СтрокаТаблицы Из ТабФилиалы Цикл     
		МассивПозиций.Добавить(СтрокаТаблицы);
	КонецЦикла; 
	
	Иначе	
		
	//Для Каждого СтрокаТаблицы Из ТабНоменклатура Цикл   
	//	МассивПозиций.Добавить(СтрокаТаблицы.Номенклатура);
	//КонецЦикла; 
	
    КонецЕсли;	
	СтрВозврата.Вставить("МассивПозиций",МассивПозиций);
	СтрВозврата.Вставить("ИндСтроки",ИндСтроки); 
	СтрВозврата.Вставить("ЭтоИскл",ЭтоИскл); 
	СтрВозврата.Вставить("ЭтоФилиалы",ЭтоФилиалы);
	
	Закрыть(СтрВозврата);
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ИндСтроки = Параметры.ИндСтроки;
	ЭтоИскл   = Параметры.ЭтоИскл; 
	ЭтоФилиалы = Параметры.ЭтоФилиалы;  
	Организация    = Параметры.Организация;
	//Если ЭтоФилиалы Тогда
	//	Элементы.ТабНоменклатура.Видимость = Ложь;
	//	Элементы.ТабФилиалы.Видимость = Истина;
	//иначе
		//Элементы.ТабФилиалы.Видимость = Ложь;
		//Элементы.ТабНоменклатура.Видимость = Истина;
	//КонецЕсли;	
		
	Для каждого строка из Параметры.НоменклатураОтбор Цикл	
		
		//Если ЭтоФилиалы Тогда   
			
			ТабФилиалы.ЗагрузитьЗначения(Параметры.НоменклатураОтбор)
		
		//Иначе    
		//	
		//	ТабНоменклатура.ЗагрузитьЗначения(Параметры.НоменклатураОтбор)
			
		//КонецЕсли;
		
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора",Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор",Истина); 
    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",ложь); 
	Если ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Организация",ЭтотОбъект.Организация);
	ПараметрыФормы.Вставить("ДополнительныеПараметры",ДополнительныеПараметры);
	КонецЕсли;
	ОткрытьФорму("Справочник.Филиалы.Форма.ФормаВыбораУпр",ПараметрыФормы, ЭтотОбъект);  
	
КонецПроцедуры        


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если не ВыбранноеЗначение = Неопределено Тогда
		Для каждого строка из ВыбранноеЗначение Цикл
			
			Если  ТабФилиалы.НайтиПоЗначению(строка) = Неопределено Тогда
				ТабФилиалы.Добавить(строка)
			КонецЕсли;	
			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры
