#Область ПрограммныйИнтерфейс

// Получить/создать единицу по коду/наименованию ОКЕИ.
//
// Параметры:
//  ЗначениеПоиска	 - Строка	 - код или наименование.
//  ПолеПоиска		 - Строка	 - "Код" или "Наименование".
// 
// Возвращаемое значение:
//  СправочникСсылка.КлассификаторЕдиницИзмерения - единица измерения.
//
Функция ПолучитьЕдиницуИзмерения(ЗначениеПоиска, ПолеПоиска = "Код") Экспорт
	
	Если ПолеПоиска = "Код" Тогда
		Единица = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(ЗначениеПоиска);
	ИначеЕсли ПолеПоиска = "Наименование" Тогда
		Единица = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ЗначениеПоиска);
	Иначе
		Возврат Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Единица) Тогда
		Возврат Единица;
	Иначе
		Если ПолеПоиска = "Код" Тогда
			ОписаниеОКЕИ = ОписаниеЕдиницыОКЕИ(ЗначениеПоиска);
		Иначе
			ОписаниеОКЕИ = ОписаниеЕдиницыОКЕИ(, ЗначениеПоиска, ЗначениеПоиска);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОписаниеОКЕИ.Код) Тогда
			ЕдиницаОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
			ЕдиницаОбъект.Код				 = ОписаниеОКЕИ.Код;
			ЕдиницаОбъект.Наименование		 = ОписаниеОКЕИ.Наименование;
			ЕдиницаОбъект.НаименованиеПолное = ОписаниеОКЕИ.НаименованиеПолное;
			ЕдиницаОбъект.Записать();
			
			Возврат ЕдиницаОбъект.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка(); 
	
КонецФункции

// Ищет Код и наименования единицы из макета ОКЕИ по наименованию.
//
// Параметры:
//  Код					 - Строка - код по ОКЕИ.
//  Наименование		 - Строка - полное или краткое наименование по ОКЕИ.
//  НаименованиеПолное	 - Строка - полное или краткое наименование по ОКЕИ.
// 
// Возвращаемое значение:
//  Стурктура - с колонками Код, Наименование, НаименованиеПолное.
//
Функция ОписаниеЕдиницыОКЕИ(Код = Неопределено, Наименование = Неопределено, НаименованиеПолное = Неопределено) Экспорт
	
	Описание = Новый Структура("Код, Наименование, НаименованиеПолное");
	
	ОКЕИ = Справочники.КлассификаторЕдиницИзмерения.ПолучитьМакет("КлассификаторЕдиницИзмерения");
	КолОКЕИ = ОКЕИ.ВысотаТаблицы;
	
	Для Сч = 1 По КолОКЕИ Цикл
		
		КодОКЕИ					 = ОКЕИ.Область(Сч, 2).Текст;
		НаименованиеОКЕИ		 = ОКЕИ.Область(Сч, 4).Текст;
		НаименованиеПолноеОКЕИ	 = ОКЕИ.Область(Сч, 3).Текст;
		
		Если	ЗначениеЗаполнено(Код)				  И КодОКЕИ = Код
			Или ЗначениеЗаполнено(Наименование)		  И НРег(НаименованиеОКЕИ)		 = Наименование
			Или ЗначениеЗаполнено(Наименование)		  И НРег(НаименованиеПолноеОКЕИ) = Наименование
			Или ЗначениеЗаполнено(НаименованиеПолное) И НРег(НаименованиеОКЕИ)		 = НаименованиеПолное
			Или ЗначениеЗаполнено(НаименованиеПолное) И НРег(НаименованиеПолноеОКЕИ) = НаименованиеПолное
		Тогда
			Описание.Код = КодОКЕИ;
			Описание.Наименование = НаименованиеОКЕИ;
			Описание.НаименованиеПолное = НаименованиеПолноеОКЕИ;
			
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти