#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеЗаполнения, "Код")
	Тогда
		Код = ДанныеЗаполнения.Код;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый()
		И ПустаяСтрока(Код)
	Тогда
		ОписаниеОКЕИ = Справочники.КлассификаторЕдиницИзмерения.ОписаниеЕдиницыОКЕИ(, Наименование, НаименованиеПолное);
		Если ОписаниеОКЕИ.Код <> Неопределено Тогда
			Код = ОписаниеОКЕИ.Код;
			
			Если ДополнительныеСвойства.Свойство("НормализоватьНаименованияПоОКЕИ") Тогда
				
				Наименование = ОписаниеОКЕИ.Наименование;
				НаименованиеПолное = ОписаниеОКЕИ.НаименованиеПолное;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоНовый()
		И Не ЗначениеЗаполнено(МераКоличества)
		И ЗначениеЗаполнено(Код)
	Тогда
		МераКоличества = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.МераКоличестваПредметаРасчетаПоКодуЕдиницыИзмерения(Код);
		Если Не ЗначениеЗаполнено(МераКоличества) Тогда
			МераКоличества = РаботаСТорговымОборудованием.МераКоличестваПоНаименованиюЕдиницы(НаименованиеПолное, Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
