#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СообщениеРЭМД = Параметры.СообщениеРЭМД;
	
	НомерВРеестреРЭМД = СообщениеРЭМД.ИдентификаторРЭМД;
	ЛокальныйИдентификатор = СообщениеРЭМД.ИдентификаторДокумента;
	
	Если Не УдалосьЗаполнитьДанныеЭМД() Тогда
		Сообщить(НСтр("ru='Не удалось получить данные ЭМД'"));
	КонецЕсли;
	
	НовыеСообщенияРЭМД = НовыеСообщенияРЭМД();
	Если НовыеСообщенияРЭМД.Количество() = 0 Тогда
		Элементы.ДокументОформленныйВзамен.Видимость = Ложь;
	Иначе
		Элементы.ДокументОформленныйВзамен.ПараметрыВыбора = Новый ФиксированныйМассив(ОбщегоНазначенияБИТКлиентСервер.НовыйМассив(Новый ПараметрВыбора("Отбор.Ссылка", НовыеСообщенияРЭМД)));
	КонецЕсли;
	
	СотрудникиПользователя = ОтраслевыеДополнения.СотрудникиПользователяПоФилиалу(ПараметрыСеанса.ТекущийПользователь, СообщениеРЭМД.Документ.Филиал);
	Если СотрудникиПользователя.Количество() > 0 Тогда
		ФИООтветственного = ОбщегоНазначения.ФИОФизЛица(СотрудникиПользователя[0]);
		ДолжностиМинздраваПользователя = Новый Массив;
		Для Каждого СотрудникПользователя Из СотрудникиПользователя Цикл
			Для Каждого СтрокаДолжности Из ИнтеграцияЕГИСЗВызовСервера.ДолжностиСотрудникаПоКлассификаторам(СотрудникПользователя) Цикл
				ДолжностьМЗ = СтрокаДолжности.ДолжностьМинздрава;
				Если ЗначениеЗаполнено(ДолжностьМЗ) Тогда
					Если ЗначениеЗаполнено(ДолжностьМЗ.НаименованиеПолное) Тогда
						ДолжностиМинздраваПользователя.Добавить(ДолжностьМЗ.НаименованиеПолное);
					Иначе
						ДолжностиМинздраваПользователя.Добавить(ДолжностьМЗ.Наименование);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		ДолжностиМинздраваПользователя = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДолжностиМинздраваПользователя);
		Если ДолжностиМинздраваПользователя.Количество() > 0 Тогда
			Для Каждого ДолжностьМЗ Из ДолжностиМинздраваПользователя Цикл
				Элементы.ДолжностьОтветственногоЛица.СписокВыбора.Добавить(ДолжностьМЗ, ДолжностьМЗ);
			КонецЦикла;
			ДолжностьОтветственногоЛица = ДолжностиМинздраваПользователя[0];
		КонецЕсли;
	КонецЕсли;
	
	НаименованиеМИС = ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьНазваниеИнформационнойСистемы(СообщениеРЭМД.Документ.Филиал);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИндексИнойПричины = -1;
	ЗаполнитьСписокПричин(Элементы.Причина.СписокВыбора);
	ДополнитьИнойПричиной(Элементы.Причина.СписокВыбора);
	
	ОбновитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьАкт(Команда)
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохраненияФайла.ПолноеИмяФайла = СтрШаблон(НСтр("ru='Акт признания ЭМД %1 не актуальными'"), НомерВРеестреРЭМД);
	ДиалогСохраненияФайла.Фильтр = "Документ WORD(*.docx)|*.docx";
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
	ДиалогСохраненияФайла.Заголовок = НСтр("ru='Выберите куда сохранить файл'");
	
	ПослеВыбораСохраняемогоАкта = Новый ОписаниеОповещения("ПослеВыбораСохраняемогоАкта", ЭтотОбъект);
	ДиалогСохраненияФайла.Показать(ПослеВыбораСохраняемогоАкта);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПричинаПриИзменении(Элемент)
	
	ОбновитьВидимость();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция НовыеСообщенияРЭМД()
	
	Если Не ЗначениеЗаполнено(СообщениеРЭМД.ИдентификаторШаблонаЭМД) Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СообщенияРЭМД.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СообщенияРЭМД КАК СообщенияРЭМД
		|ГДЕ
		|	НЕ СообщенияРЭМД.ПометкаУдаления
		|	И НЕ СообщенияРЭМД.ВПроцессеРегистрации
		|	И СообщенияРЭМД.Документ = &Документ
		|	И СообщенияРЭМД.ДатаСоздания > &ДатаСоздания
		|	И СообщенияРЭМД.ИдентификаторШаблонаЭМД = &ИдентификаторШаблонаЭМД
		|	И СообщенияРЭМД.ИдентификаторРЭМД <> """"";
	
	Запрос.УстановитьПараметр("ДатаСоздания", СообщениеРЭМД.ДатаСоздания);
	Запрос.УстановитьПараметр("Документ", СообщениеРЭМД.Документ);
	Запрос.УстановитьПараметр("ИдентификаторШаблонаЭМД", СообщениеРЭМД.ИдентификаторШаблонаЭМД);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Функция УдалосьЗаполнитьДанныеЭМД()
	
	ДанныеМетаданныхДляАкта = Справочники.СообщенияРЭМД.ДанныеМетаданныхДляАкта(СообщениеРЭМД);
	
	Если ТипЗнч(ДанныеМетаданныхДляАкта) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеМетаданныхДляАкта.Свойство("OIDМедицинскойОрганизации",	OIDМедицинскойОрганизации);
	ДанныеМетаданныхДляАкта.Свойство("OIDДокумента",				OIDДокумента);
	ДанныеМетаданныхДляАкта.Свойство("ДатаСоздания",				ДатаСоздания);
	ДанныеМетаданныхДляАкта.Свойство("ДатаРегистрации",				ДатаРегистрации);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьВидимость()
	
	Элементы.ОписаниеИнойПричины.Видимость = Причина = ИндексИнойПричины;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораСохраняемогоАкта(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ТабличныйДокумент = СформироватьТабДок();
		ТабличныйДокумент.Записать(Результат[0], ТипФайлаТабличногоДокумента.DOCX);
		Попытка
			ЗапуститьПриложение(Результат[0]);
		Исключение КонецПопытки;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеСохраненияФайла", ЭтотОбъект), НСтр("ru='Файл сохранён. Пометить сообщение на удаление?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьТабДок()
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет = Справочники.СообщенияРЭМД.ПолучитьМакет("АктОтзываЭМД");
	
	ОбластьАкт = Макет.ПолучитьОбласть("Акт");
	ОбластьАкт.Параметры.НазваниеМИС		= СформироватьНаименованиеМИС();
	ОбластьАкт.Параметры.ПричинаВЗаголовке	= СформироватьТекстПричины();
	ОбластьАкт.Параметры.ОрганизацияOID		= OIDМедицинскойОрганизации;
	ОбластьАкт.Параметры.ДокументOID		= OIDДокумента;
	ОбластьАкт.Параметры.ДатаСоздания		= Формат(ДатаСоздания, "ДФ=dd.MM.yyyy");
	ОбластьАкт.Параметры.ДатаРегистрации	= Формат(ДатаРегистрации, "ДФ=dd.MM.yyyy");
	ОбластьАкт.Параметры.Emdrid				= НомерВРеестреРЭМД;
	ОбластьАкт.Параметры.Localid			= ЛокальныйИдентификатор;
	ОбластьАкт.Параметры.Причина			= СформироватьТекстПричины(Ложь);
	ОбластьАкт.Параметры.Должность			= ДолжностьОтветственногоЛица;
	ОбластьАкт.Параметры.Ответственный		= ФИООтветственного;
	Если ЗначениеЗаполнено(ДокументОформленныйВзамен) Тогда
		ОбластьАкт.Параметры.НовыйEmdrid	= ДокументОформленныйВзамен.ИдентификаторРЭМД;
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьАкт);
	Возврат ТабличныйДокумент;
	
КонецФункции

&НаСервере
Функция СформироватьНаименованиеМИС()
	
	Возврат Справочники.СообщенияРЭМД.СформироватьНаименованиеМИС(СообщениеРЭМД, НаименованиеМИС);
	
КонецФункции

&НаСервере
Функция СформироватьТекстПричины(ДляЗаголовка = Истина)
	
	ПредставлениеПричины = Элементы.Причина.СписокВыбора.НайтиПоЗначению(Причина);
	
	Если Причина = ИндексИнойПричины Тогда
		Если ДляЗаголовка Тогда
			ТекстПричины = НРег(Лев(ПредставлениеПричины, 1)) + Сред(ПредставлениеПричины, 2);
			Возврат СтрШаблон("%1 (%2)", ПолучитьСклоненияСтроки(ТекстПричины,, "ПД=Творительный")[0], ОписаниеИнойПричины);
		Иначе
			Возврат ОписаниеИнойПричины;
		КонецЕсли;
	Иначе
		Если ДляЗаголовка Тогда
			ТекстПричины = НРег(Лев(ПредставлениеПричины, 1)) + Сред(ПредставлениеПричины, 2);
			Возврат ПолучитьСклоненияСтроки(ТекстПричины,, "ПД=Творительный")[0]
		Иначе
			Возврат ПредставлениеПричины;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПослеСохраненияФайла(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПометитьСообщениеНаУдаление(СообщениеРЭМД);
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПометитьСообщениеНаУдаление(СообщениеРЭМД)
	
	УстановитьПривилегированныйРежим(Истина);
	ОбъектСообщениеРЭМД = СообщениеРЭМД.ПолучитьОбъект();
	ОбъектСообщениеРЭМД.УстановитьПометкуУдаления(Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьСписокПричин(СписокПричин)
	
	ДополнитьСписокПричин(СписокПричин, НСтр("ru='Ошибка в персональных данных пациента'"));
	ДополнитьСписокПричин(СписокПричин, НСтр("ru='Ошибка в информации о медицинских работниках, подписавших ЭМД'"));
	ДополнитьСписокПричин(СписокПричин, НСтр("ru='Ошибка в сведениях о медицинской организации'"));
	ДополнитьСписокПричин(СписокПричин, НСтр("ru='Создание дубля ЭМД'"));
	ДополнитьСписокПричин(СписокПричин, НСтр("ru='Ошибочно составленный ЭМД'"));
	
КонецФункции

&НаКлиенте
Функция ДополнитьИнойПричиной(СписокПричин)
	
	ИндексИнойПричины = СписокПричин.Количество();
	ДополнитьСписокПричин(СписокПричин, НСтр("ru='Иные причины'"));
	
КонецФункции

&НаКлиенте
Процедура ДополнитьСписокПричин(СписокПричин, ПредставлениеПричины)
	
	ИндексПричины = СписокПричин.Количество();
	СписокПричин.Добавить(ИндексПричины, ПредставлениеПричины)
	
КонецПроцедуры

#КонецОбласти