
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Номенклатура Из Параметры.Анализы Цикл
		Анализы.Добавить().Номенклатура = Номенклатура;
	КонецЦикла;
	
	Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ОбновитьДополнительныеПоля(ЭтаФорма);
	
	Если ДополнительныеСведения.Количество() = 0 Тогда
		Элементы.ДополнительныеПоля.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Отказ = Ложь;
	
	МассивДанных = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ДополнительныеСведения Цикл
		Если СтрокаТаблицы.Обязательное И Не ЗначениеЗаполнено(СтрокаТаблицы.Значение) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не указано обязательное поле """ + СтрокаТаблицы.Свойство + """. Оно обязательно!";
			Сообщение.Поле = "ДополнительныеСведения[" + ДополнительныеСведения.Индекс(СтрокаТаблицы) + "].Значение";
			Сообщение.УстановитьДанные(ЭтаФорма);
			Сообщение.Сообщить();
			
			Отказ = Истина;
		КонецЕсли;
		
		СтруктураДанных = Новый Структура("Свойство, Значение, Обязательное, СписокНоменклатуры");
		ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрокаТаблицы);
		МассивДанных.Добавить(СтруктураДанных);
	КонецЦикла;  
	
	//Если Не ЗначениеЗаполнено(Примечание) Тогда
	//	Сообщение = Новый СообщениеПользователю;
	//	Сообщение.Текст = "Не заполнено примечание. Оно обязательно!";
	//	Сообщение.Поле = "Примечание";
	//	Сообщение.УстановитьДанные(ЭтаФорма);
	//	Сообщение.Сообщить();
	//	
	//	Отказ = Истина;
	//КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;  
	
	СтруктураВозврата = Новый Структура("МассивДанных, Примечание", МассивДанных, Примечание);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры
