#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Состояние") Тогда
		
		НачалоДня = Дата(1,1,1);
		ВыбранныйФилиал = Неопределено;
		
		Если Параметры.Свойство("ЗаСегодня") И Параметры.ЗаСегодня Тогда
			НачалоДня = НачалоДня(ТекущаяДатаСеанса());
		КонецЕсли;
		
		Если Параметры.Свойство("Филиал") Тогда
			ВыбранныйФилиал = Параметры.Филиал;
		КонецЕсли;
		
		ИзменитьТекстЗапроса(Параметры.Состояние, НачалоДня, ВыбранныйФилиал);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПометитьНаОтправку(Команда)
	
	ВыделеноОдно = Элементы.Список.ВыделенныеСтроки.Количество() = 1;
	ЕстьЗарегистрированныеСообщения = ЕстьЗарегистрированныеСообщенияИзПомеченныхКОтправке();
	
	Если ЕстьЗарегистрированныеСообщения Тогда
		Если ВыделеноОдно Тогда 
			Оповещение = Новый ОписаниеОповещения("УстановкаОтметкиОтправитьОдноЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, НСтр("ru='Сообщение уже зарегистрировано в РЭМД. Пометить на отправку?'"), РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Нет);
		Иначе
			Кнопки = Новый СписокЗначений;
			Кнопки.Добавить(КодВозвратаДиалога.Да, "Пометить все");
			Кнопки.Добавить(КодВозвратаДиалога.Нет, "Пометить незарегистрированные");
			Кнопки.Добавить(КодВозвратаДиалога.Отмена, "Отмена");
			Оповещение = Новый ОписаниеОповещения("УстановкаОтметкиОтправитьНесколькоЗавершение", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, НСтр("ru='Среди сообщений есть уже зарегистрированные в РЭМД'"), Кнопки,, КодВозвратаДиалога.Нет);
		КонецЕсли;
	Иначе
		ПометитьНаОтправкуНаСервере(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКОтправке(Команда)
	ОткрытьФорму("ОбщаяФорма.АРМПодписанияМедицинскойДокументации");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьТекстЗапроса(Состояние, НачалоДня, ВыбранныйФилиал)
	
	НовыйТекстЗапроса =
		"ВЫБРАТЬ
		|	СообщенияРЭМД.Ссылка КАК Ссылка,
		|	СообщенияРЭМД.ПометкаУдаления КАК ПометкаУдаления,
		|	СообщенияРЭМД.Код КАК Код,
		|	СообщенияРЭМД.Наименование КАК Наименование,
		|	СообщенияРЭМД.Документ КАК Документ,
		|	СообщенияРЭМД.Клиент КАК Клиент,
		|	СообщенияРЭМД.ДатаСоздания КАК ДатаСоздания,
		|	СообщенияРЭМД.ПутьКФайлуЭМД КАК ПутьКФайлуЭМД,
		|	СообщенияРЭМД.Отправить КАК Отправить,
		|	СообщенияРЭМД.Обновить КАК Обновить,
		|	СообщенияРЭМД.НомерДокумента КАК НомерДокумента,
		|	СообщенияРЭМД.ИдентификаторДокумента КАК ИдентификаторДокумента,
		|	СообщенияРЭМД.ТекстПоследнейОшибки КАК ТекстПоследнейОшибки,
		|	СообщенияРЭМД.ВидДокумента КАК ВидДокумента,
		|	СообщенияРЭМД.НомерВерсии КАК НомерВерсии,
		|	СообщенияРЭМД.ИдентификаторРЭМД КАК ИдентификаторРЭМД,
		|	СообщенияРЭМД.ХранитьДо КАК ХранитьДо,
		|	СообщенияРЭМД.ИдентификаторШаблонаЭМД КАК ИдентификаторШаблонаЭМД,
		|	СообщенияРЭМД.Предопределенный КАК Предопределенный,
		|	СообщенияРЭМД.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|	СообщенияРЭМД.Документ.Филиал КАК Филиал
		|ИЗ
		|	Справочник.СообщенияРЭМД КАК СообщенияРЭМД
		|ГДЕ
		|	СообщенияРЭМД.Ссылка В
		|			(ВЫБРАТЬ
		|				СообщенияРЭМД.Ссылка
		|			ИЗ
		|				СообщенияПоСостоянию КАК СообщенияРЭМД)";
	
	ТекстыЗапросов = ПолучитьТекстыЗапросовПоСостояниям();
	
	ЧастиТекстаЗапроса = Новый Массив;
	ЧастиТекстаЗапроса.Добавить(ТекстыЗапросов.Получить(Состояние));
	ЧастиТекстаЗапроса.Добавить(НовыйТекстЗапроса);
	
	Список.ТекстЗапроса = СтрСоединить(ЧастиТекстаЗапроса, ";" + Символы.ПС);
	Список.Параметры.УстановитьЗначениеПараметра("НачалоДня", НачалоДня);
	Список.Параметры.УстановитьЗначениеПараметра("ПоВыбранномуФилиалу", ВыбранныйФилиал <> Неопределено);
	Список.Параметры.УстановитьЗначениеПараметра("ВыбранныйФилиал", ВыбранныйФилиал);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстыЗапросовПоСостояниям()
	
	ИмяВТ = "СообщенияПоСостоянию";
	
	Тексты = Новый Соответствие;
	Тексты.Вставить(Перечисления.СостоянияСообщенийРЭМД.Зарегистрированные,	ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаВТСообщенияЗарегистрированные(ИмяВТ));
	Тексты.Вставить(Перечисления.СостоянияСообщенийРЭМД.КОтправке,			ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаВТСообщенияКОтправке(ИмяВТ));
	Тексты.Вставить(Перечисления.СостоянияСообщенийРЭМД.СОшибками,			ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаВТСообщенияСОшибками(ИмяВТ));
	Тексты.Вставить(Перечисления.СостоянияСообщенийРЭМД.НеПодписаныМО,		ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаВТСообщенияНеПодписаныМО(ИмяВТ));
	Тексты.Вставить(Перечисления.СостоянияСообщенийРЭМД.НеПолученОтвет,		ИнтеграцияЕГИСЗ_РЭМД.ТекстЗапросаВТСообщенияНеПолученОтвет(ИмяВТ));
	
	Возврат Тексты;
	
КонецФункции

&НаСервере
Функция ЕстьЗарегистрированныеСообщенияИзПомеченныхКОтправке()
	
	Для Каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		Если ЗначениеЗаполнено(СтрокаСписка.Ссылка) И ЗначениеЗаполнено(СтрокаСписка.Ссылка.ИдентификаторРЭМД) Тогда
			Возврат Истина
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ПометитьНаОтправкуНаСервере(ПомечатьЗарегистрированные)
	
	Для Каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		Если ЗначениеЗаполнено(СтрокаСписка.Ссылка) Тогда
			Если Не ПомечатьЗарегистрированные
				И ЗначениеЗаполнено(СтрокаСписка.Ссылка.ИдентификаторРЭМД)
				Или СтрокаСписка.Ссылка.ВПроцессеРегистрации
			Тогда
				Продолжить;
			КонецЕсли;
			
			СообщениеОбъект = СтрокаСписка.Ссылка.ПолучитьОбъект();
			СообщениеОбъект.Отправить = Истина;
			Попытка
				СообщениеОбъект.Записать();
			Исключение КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтметкиОтправитьОдноЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПометитьНаОтправкуНаСервере(Истина);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаОтметкиОтправитьНесколькоЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ПометитьНаОтправкуНаСервере(Истина);
		Элементы.Список.Обновить();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ПометитьНаОтправкуНаСервере(Ложь);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти