#Область ПрограммныйИнтерфейс

// Возвращает доступные варианты печати документа.
//  Результатом является Струткура, каждая строка которой соответствует одному из вариантов печати.
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("РКО", НСтр("ru='Расходный кассовый ордер'"));
	
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьТаблицуПечатныхФорм()

// Процедура формирует печатную форму документа
//  Название макета печати передается в качестве параметра,
//  по переданному имени макета определяется соответствующая функция печати.
//
// Параметры:
//  СсылкаНаОбъект	 - ДокументСсылка	 - ссылка на распечатываемый документ.
//  ИмяМакета		 - Строка			 - имя макета из структуры печатных форм.
// 
// Возвращаемое значение:
//	ТабличныйДокумент.
//
Функция Печать(СсылкаНаОбъект, ИмяМакета) Экспорт
	
	Перем ТабДокумент;
	
	// Получить экземпляр документа на печать.
	Если ИмяМакета = "РКО" Тогда
		
		ТабДокумент = ПечатьРКО(СсылкаНаОбъект);
		
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует табличный документ с печатной формой накладной,
// разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной.
//
Функция ПечатьРКО(СсылкаНаОбъект)

	ВалютаДокумента = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ВалютаУчета");
	Если Не ЗначениеЗаполнено(ВалютаДокумента) Тогда
		ВалютаДокумента = Справочники.Валюты.Рубль;
	КонецЕсли;
	
	ОтветственныеЛица = ПроцедурыСпециализацииПоставки.ОтветственныеЛицаФилиала(СсылкаНаОбъект.Филиал);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", СсылкаНаОбъект);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номер,
	|	Дата                          КАК ДатаДокумента,
	|	СуммаДокумента                КАК Сумма,
	|	Контрагент,
	|	Контрагент.Представление      КАК ФИОПолучателя,
	|	Выдать,
	|	Приложение,
	|	ПоДокументу,
	|	Основание
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|
	|ГДЕ
	|	РасходныйКассовыйОрдер.Ссылка = &ТекущийДокумент";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();

	ТабДокумент   = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасходныйКассовыйОрдер_КО2";
	Макет         = Документы.РасходныйКассовыйОрдер.ПолучитьМакет("КО2");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	
	// Выводим шапку
	ОбластьМакета.Параметры.Заполнить(Шапка);
	
	РеквизитыОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(СсылкаНаОбъект);
	ОбластьМакета.Параметры.ПредставлениеОрганизации = РеквизитыОрганизации.НазваниеОрганизации;
	ОбластьМакета.Параметры.ОрганизацияПоОКПО		 = РеквизитыОрганизации.ОКПО;
	
	ОбластьМакета.Параметры.СуммаПрописью     = ОбщегоНазначения.СформироватьСуммуПрописью(Шапка.Сумма, ВалютаДокумента);
	ОбластьМакета.Параметры.ДатаДокумента     = Шапка.ДатаДокумента;
	ОбластьМакета.Параметры.НомерДокумента    = ОбщегоНазначения.ПолучитьНомерНаПечать(Шапка);
	
	ОбластьМакета.Параметры.Основание             = Шапка.Основание;
	ОбластьМакета.Параметры.Приложение            = Шапка.Приложение;
	
	ОбластьМакета.Параметры.ФИОПолучателя         = Шапка.Выдать;
	ОбластьМакета.Параметры.РеквизитыДокументаУдостоверяющегоЛичность = Шапка.ПоДокументу;
	
	ОбластьМакета.Параметры.ФИОГлавногоБухгалтера = ОбщегоНазначения.ФамилияИнициалыФизЛица(ОтветственныеЛица.ГлавныйБухгалтер);
	ОбластьМакета.Параметры.ФИОКассира = ОбщегоНазначения.ФамилияИнициалыФизЛица(ОтветственныеЛица.Кассир);
	
	ТабДокумент.Вывести(ОбластьМакета);

	Возврат ТабДокумент;

КонецФункции // ПечатьРКО()

#КонецОбласти       

Функция СобратьДанныеЧеков(ДокументСсылка, НомерСекции, ВерсияФормата, СообщениеОбОшибке) Экспорт
	
	ТипРасчета = 2;		

	ПараметрыПечатиЧека = ПодготовитьПараметрыПечатиЧека(ДокументСсылка);
	
	РеквизитыПечатиЧека = ПараметрыПечатиЧека.РеквизитыПечатиЧека;
	Если РеквизитыПечатиЧека.Количество() = 0 Тогда
		Возврат Новый Структура;
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РеквизитыПечатиЧека[0]);
			
	Реквизиты.Вставить("ТипРасчета",              ТипРасчета);
	Реквизиты.Вставить("НаименованиеВСтрокеЧека", НаименованиеВСтрокеЧека(Реквизиты));
	Реквизиты.Вставить("НомерСекции",             НомерСекции);
	
	Реквизиты.Вставить("ТипОплаты",               Перечисления.ТипыОплатыККТ.Наличные);

	Реквизиты.Вставить("ДокументОснование",        ДокументСсылка);
	
	ПараметрыОперацииФискализацииЧека = омг_WebKassa.ПараметрыОперацииФискализацииЧека(Реквизиты, ПараметрыПечатиЧека, ВерсияФормата, СообщениеОбОшибке);

	Возврат ПараметрыОперацииФискализацииЧека;  
	
КонецФункции     


Функция ПодготовитьПараметрыПечатиЧека(ДокументСсылка)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РасходныйКассовыйОрдер", ДокументСсылка);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", омг_WebKassa.ПолучитьВалютуРегламентированногоУчета());
	
	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаРеквизитыПечатиЧека(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ПараметрыПечатиЧека = Новый Структура;
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПечатиЧека.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПечатиЧека;
КонецФункции



Функция ТекстЗапросаРеквизитыПечатиЧека(НомераТаблиц)
	
	НомераТаблиц.Вставить("РеквизитыПечатиЧека",      НомераТаблиц.Количество());
	НомераТаблиц.Вставить("РасшифровкаПлатежа",       НомераТаблиц.Количество());
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Ссылка КАК Ссылка,
	|	РасходныйКассовыйОрдер.Дата КАК Дата,
	|	РасходныйКассовыйОрдер.Номер КАК Номер,
	|	РасходныйКассовыйОрдер.Филиал.Организация КАК Организация,
	|	РасходныйКассовыйОрдер.ДокументОснование КАК Основание,
	|	"""" КАК ВидОперации,
	|	РасходныйКассовыйОрдер.Контрагент КАК Контрагент,
	|	РасходныйКассовыйОрдер.Контрагент КАК Возвращено,
	|	РасходныйКассовыйОрдер.СуммаДокумента КАК СуммаДокумента,
	|	"""" КАК ВалютаДокумента,
	|	РасходныйКассовыйОрдер.ДокументОснование КАК ДокументРасшифровкиПозиций,
	|	ЕСТЬNULL(РасходныйКассовыйОрдер.Контрагент.ИНН, """") КАК ПолучательИИН
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|ГДЕ
	|	РасходныйКассовыйОрдер.Ссылка = &РасходныйКассовыйОрдер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	"""" КАК Ссылка,
	|	"""" КАК ДоговорКонтрагента,
	|	"""" КАК СтавкаНДС,
	|	"""" КАК СуммаНДС,
	|	РасходныйКассовыйОрдер.СуммаДокумента КАК СуммаПлатежа,
	|	РасходныйКассовыйОрдер.СуммаДокумента КАК СуммаВзаиморасчетов
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|ГДЕ
	|	РасходныйКассовыйОрдер.Ссылка = &РасходныйКассовыйОрдер";
	
	Возврат ТекстЗапроса + омг_WebKassa.ТекстРазделителяЗапросовПакета();
КонецФункции     

Функция НаименованиеВСтрокеЧека(СтруктураШапки)
	
	Если ЗначениеЗаполнено(СтруктураШапки.Возвращено) Тогда
		
		ШаблонНаименования = НСтр("ru = 'Выдача от: %1%2Основание: %3'");
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименования, СтруктураШапки.Возвращено, " ", СтруктураШапки.Основание);
		
	Иначе
		
		ШаблонНаименования = НСтр("ru = 'Основание: %1'");
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименования, СтруктураШапки.Основание);
		
	КонецЕсли;
	
КонецФункции

Процедура Инкассирование(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.РасходныйКассовыйОрдер.ПолучитьМакет("Инкассирование");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Дата КАК Дата,
	|	ВложенныйЗапрос.Касса КАК Касса,
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.Номер КАК Номер,
	|	ВложенныйЗапрос.НомераЧековСторно КАК НомераЧековСторно,
	|	ВложенныйЗапрос.НомерПредписания КАК НомерПредписания,
	|	ВложенныйЗапрос.НомерЧекаККМ КАК НомерЧекаККМ,
	|	ВложенныйЗапрос.НомерЧекаЭТ КАК НомерЧекаЭТ,
	|	ВложенныйЗапрос.НомерСумки КАК НомерСумки,
	|	ВложенныйЗапрос.НомерПломбы КАК НомерПломбы,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Ответственный КАК Ответственный,
	|	ВложенныйЗапрос.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ВложенныйЗапрос.СуммаДокумента КАК СуммаДокумента,
	|	ВложенныйЗапрос.Филиал КАК Филиал,
	|	ВложенныйЗапрос.БИН КАК БИН,
	|	ВложенныйЗапрос.К20000 КАК К20000,
	|	ВложенныйЗапрос.К10000 КАК К10000,
	|	ВложенныйЗапрос.К5000 КАК К5000,
	|	ВложенныйЗапрос.К2000 КАК К2000,
	|	ВложенныйЗапрос.К1000 КАК К1000,
	|	ВложенныйЗапрос.К500 КАК К500,
	|	ВложенныйЗапрос.К200 КАК К200,
	|	ВложенныйЗапрос.К100 КАК К100,
	|	ВложенныйЗапрос.К50 КАК К50,
	|	ВложенныйЗапрос.К20 КАК К20,
	|	ВложенныйЗапрос.К10 КАК К10,
	|	ВложенныйЗапрос.К5 КАК К5,
	|	ВложенныйЗапрос.К2 КАК К2,
	|	ВложенныйЗапрос.К1 КАК К1,
	|	ВложенныйЗапрос.С20000 КАК С20000,
	|	ВложенныйЗапрос.С10000 КАК С10000,
	|	ВложенныйЗапрос.С5000 КАК С5000,
	|	ВложенныйЗапрос.С2000 КАК С2000,
	|	ВложенныйЗапрос.С1000 КАК С1000,
	|	ВложенныйЗапрос.С500 КАК С500,
	|	ВложенныйЗапрос.С200 КАК С200,
	|	ВложенныйЗапрос.С100 КАК С100,
	|	ВложенныйЗапрос.С50 КАК С50,
	|	ВложенныйЗапрос.С20 КАК С20,
	|	ВложенныйЗапрос.С10 КАК С10,
	|	ВложенныйЗапрос.С5 КАК С5,
	|	ВложенныйЗапрос.С2 КАК С2,
	|	ВложенныйЗапрос.С1 КАК С1,
	|	ВложенныйЗапрос.С1 + ВложенныйЗапрос.С2 + ВложенныйЗапрос.С5 + ВложенныйЗапрос.С10 + ВложенныйЗапрос.С20 + ВложенныйЗапрос.С50 + ВложенныйЗапрос.С100 + ВложенныйЗапрос.С200 + ВложенныйЗапрос.С500 + ВложенныйЗапрос.С1000 + ВложенныйЗапрос.С2000 + ВложенныйЗапрос.С5000 + ВложенныйЗапрос.С10000 + ВложенныйЗапрос.С20000 КАК СИтого,
	|	ВложенныйЗапрос.КассаНомер КАК КассаНомер
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасходныйКассовыйОрдер.Дата КАК Дата,
	|		РасходныйКассовыйОрдер.Касса КАК Касса,
	|		РасходныйКассовыйОрдер.Контрагент КАК Контрагент,
	|		РасходныйКассовыйОрдер.Номер КАК Номер,
	|		РасходныйКассовыйОрдер.НомераЧековСторно КАК НомераЧековСторно,
	|		РасходныйКассовыйОрдер.НомерПредписания КАК НомерПредписания,
	|		РасходныйКассовыйОрдер.НомерЧекаККМ КАК НомерЧекаККМ,
	|		РасходныйКассовыйОрдер.НомерЧекаЭТ КАК НомерЧекаЭТ,
	|		РасходныйКассовыйОрдер.омг_НомерСумки КАК НомерСумки,
	|		РасходныйКассовыйОрдер.омг_пломба КАК НомерПломбы,
	|		РасходныйКассовыйОрдер.Организация КАК Организация,
	|		РасходныйКассовыйОрдер.Ответственный КАК Ответственный,
	|		РасходныйКассовыйОрдер.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|		РасходныйКассовыйОрдер.СуммаДокумента КАК СуммаДокумента,
	|		РасходныйКассовыйОрдер.Филиал КАК Филиал,
	|		РасходныйКассовыйОрдер.Организация.ИНН КАК БИН,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.ДвадцатьТысяч)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество
	|				КОНЕЦ, 0)) КАК К20000,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.ДесятьТысяч)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество
	|				КОНЕЦ, 0)) КАК К10000,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.ПятьТысяч)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество
	|				КОНЕЦ, 0)) КАК К5000,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.ДвеТысячи)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество
	|				КОНЕЦ, 0)) КАК К2000,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Тысяча)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество
	|				КОНЕЦ, 0)) КАК К1000,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Пятьсот)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество
	|				КОНЕЦ, 0)) КАК К500,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Двести)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество
	|				КОНЕЦ, 0)) КАК К200,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Сто)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество
	|				КОНЕЦ, 0)) КАК К100,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Пятьдесят)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество
	|				КОНЕЦ, 0)) КАК К50,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Двадцать)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество
	|				КОНЕЦ, 0)) КАК К20,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Десять)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество
	|				КОНЕЦ, 0)) КАК К10,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Пять)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество
	|				КОНЕЦ, 0)) КАК К5,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Два)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество
	|				КОНЕЦ, 0)) КАК К2,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Один)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество
	|				КОНЕЦ, 0)) КАК К1,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.ДвадцатьТысяч)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество * 20000
	|				КОНЕЦ, 0)) КАК С20000,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.ДесятьТысяч)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество * 10000
	|				КОНЕЦ, 0)) КАК С10000,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.ПятьТысяч)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество * 5000
	|				КОНЕЦ, 0)) КАК С5000,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.ДвеТысячи)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество * 2000
	|				КОНЕЦ, 0)) КАК С2000,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Тысяча)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество * 1000
	|				КОНЕЦ, 0)) КАК С1000,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Пятьсот)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество * 500
	|				КОНЕЦ, 0)) КАК С500,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Двести)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество * 200
	|				КОНЕЦ, 0)) КАК С200,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Сто)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество * 100
	|				КОНЕЦ, 0)) КАК С100,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Пятьдесят)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество * 50
	|				КОНЕЦ, 0)) КАК С50,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Двадцать)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество * 20
	|				КОНЕЦ, 0)) КАК С20,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Десять)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество * 10
	|				КОНЕЦ, 0)) КАК С10,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Пять)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество * 5
	|				КОНЕЦ, 0)) КАК С5,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Два)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество * 2
	|				КОНЕЦ, 0)) КАК С2,
	|		СУММА(ЕСТЬNULL(ВЫБОР
	|					КОГДА РасходныйКассовыйОрдеромг_Купюры.Номинал = ЗНАЧЕНИЕ(перечисление.омг_НоминалыКупюр.Один)
	|						ТОГДА РасходныйКассовыйОрдеромг_Купюры.Количество
	|				КОНЕЦ, 0)) КАК С1,
	|		РасходныйКассовыйОрдер.омг_кассаНомер КАК КассаНомер
	|	ИЗ
	|		Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер.омг_Купюры КАК РасходныйКассовыйОрдеромг_Купюры
	|			ПО РасходныйКассовыйОрдер.Ссылка = РасходныйКассовыйОрдеромг_Купюры.Ссылка
	|	ГДЕ
	|		РасходныйКассовыйОрдер.Ссылка В(&Ссылка)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасходныйКассовыйОрдер.омг_НомерСумки,
	|		РасходныйКассовыйОрдер.Филиал,
	|		РасходныйКассовыйОрдер.Номер,
	|		РасходныйКассовыйОрдер.НомераЧековСторно,
	|		РасходныйКассовыйОрдер.НомерПредписания,
	|		РасходныйКассовыйОрдер.Касса,
	|		РасходныйКассовыйОрдер.СтатьяДвиженияДенежныхСредств,
	|		РасходныйКассовыйОрдер.Дата,
	|		РасходныйКассовыйОрдер.Ответственный,
	|		РасходныйКассовыйОрдер.Контрагент,
	|		РасходныйКассовыйОрдер.омг_пломба,
	|		РасходныйКассовыйОрдер.НомерЧекаЭТ,
	|		РасходныйКассовыйОрдер.Организация,
	|		РасходныйКассовыйОрдер.Организация.ИНН,
	|		РасходныйКассовыйОрдер.СуммаДокумента,
	|		РасходныйКассовыйОрдер.НомерЧекаККМ,
	|		РасходныйКассовыйОрдер.омг_кассаНомер) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныеЛица.ФизическоеЛицо КАК ФИОРуководителя
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛица КАК ОтветственныеЛица
	|		ПО РасходныйКассовыйОрдер.Филиал = ОтветственныеЛица.СтруктурнаяЕдиница
	|ГДЕ
	|	РасходныйКассовыйОрдер.Ссылка В(&Ссылка)
	|	И ОтветственныеЛица.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ДолжностныеЛицаОрганизации.Директор)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Организацииомг_БанковскиеСчета.Банк.Наименование КАК Банк,
	|	Организацииомг_БанковскиеСчета.НомерСчета КАК счет
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.омг_БанковскиеСчета КАК Организацииомг_БанковскиеСчета
	|		ПО РасходныйКассовыйОрдер.Организация.Ссылка = Организацииомг_БанковскиеСчета.Ссылка
	|ГДЕ
	|	РасходныйКассовыйОрдер.Ссылка В(&Ссылка)
	|	И Организацииомг_БанковскиеСчета.Ссылка = РасходныйКассовыйОрдер.Организация
	|	И Организацииомг_БанковскиеСчета.ОсновнойСчет";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.ВыполнитьПакет();
    Выборка1 = Выборка[0].Выбрать(); 
	Выборка2 = Выборка[1].Выбрать();
	Выборка3 = Выборка[2].Выбрать();
	Страница1 = Макет.ПолучитьОбласть("Страница1");
	Страница2 = Макет.ПолучитьОбласть("Страница2");

	ТабДок.Очистить();
	
	Если Выборка1.Следующий() Тогда  
		
		ТабДок.Автомасштаб = истина;
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;    
		ТабДок.ПолеСверху = 0;    
		ТабДок.ПолеСнизу = 0;
		ТабДок.РазмерКолонтитулаСверху = 0;
		ТабДок.РазмерКолонтитулаСнизу = 0;
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
		Страница1.Параметры.Заполнить(Выборка1);  
		Страница1.Параметры.СуммаДокументаПрописью = ОбщегоНазначения.СформироватьСуммуПрописью(Выборка1.СуммаДокумента, Справочники.Валюты.НайтиПоКоду("398"));
		Если Выборка2.Следующий() Тогда
			Страница1.Параметры.Заполнить(Выборка2); 	
		КонецЕсли; 
		Если Выборка3.Следующий() Тогда
			Страница1.Параметры.Заполнить(Выборка3); 	
		КонецЕсли;
		ТабДок.Вывести(Страница1);  
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		Страница2.Параметры.Заполнить(Выборка1);
		ТабДок.Вывести(Страница2);
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЕсли;
	//}}
КонецПроцедуры
 