
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура НомерПереводаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	формаВыбораТелефона = ПолучитьФорму("Обработка.доп_БитфонОбщее.Форма.ФормаВыбораНомера", , ЭтаФорма);
	доп_ТелефонияКлиентПереопределяемый.ОткрытьФормуСБлокировкойВладельца(формаВыбораТелефона);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		НомерПеревода = ВыбранноеЗначение;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьОК(Команда)
	Закрыть(НомерПеревода);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьОтмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти
