
Процедура ЗакрытьСмену() Экспорт  
	
МассивРеестров = омг_WebKassa.ЗакрытьСменуНаСервере();	
ЗакрытиеСменыЗаполнитьРеестр(МассивРеестров); 

КонецПроцедуры 	

 Процедура ЗакрытиеСменыЗаполнитьРеестр(МассивРеестров)
	 
	 Для каждого ДокументРеестр из МассивРеестров Цикл  
		Ключ = Новый Структура("Ключ", ДокументРеестр); 
		Форма = ПолучитьФорму("Документ.РеестрОказанныхУслугПоСоглашениям.Форма.ФормаДокумента", Ключ);
		Форма.омг_ЗаполнитьОказаннымиУслугамиНаСервере(Истина);
		Форма.Записать();
		Форма = Неопределено;
	КонецЦикла;

КонецПроцедуры
