#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура СтавкаНДСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20_120"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10_110"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС5_105"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7_107"));
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Запись.Период = НачалоМесяца(Запись.Период);
	
КонецПроцедуры

#КонецОбласти