#Область ПрограммныйИнтерфейс

#Область ПЭМК

Процедура ОбновитьФакторыРискаНаКлиентаВПЭМК(Форма, КлиентИзменен) Экспорт
	
	МедицинскаяДеятельностьКлиентКОРП.ОбновитьФакторыРискаНаКлиентаВПЭМК(Форма, КлиентИзменен);
	
КонецПроцедуры

Процедура УстановитьПолеОсмотраПЭМКПоФакторамРиска(Форма) Экспорт
	
	МедицинскаяДеятельностьКлиентКОРП.УстановитьПолеОсмотраПЭМКПоФакторамРиска(Форма);
	
КонецПроцедуры

Процедура ОткрытьОтчетКонтролиБеременности(Клиент) Экспорт
	
	МедицинскаяДеятельностьКлиентКОРП.ОткрытьОтчетКонтролиБеременности(Клиент);
	
КонецПроцедуры

Процедура СформироватьОбщийТекстПриемовПриЗагрузкеПЭМК(Форма, СтрокиДокументов, ТекстHTML, ТекстHTMLПриемов, СтрокаПеренос, СтрокаПереходСтроки) Экспорт
	
	МедицинскаяДеятельностьКлиентКОРП.СформироватьОбщийТекстПриемовПриЗагрузкеПЭМК(Форма, СтрокиДокументов, ТекстHTML, ТекстHTMLПриемов, СтрокаПеренос, СтрокаПереходСтроки);
	
КонецПроцедуры

Процедура ДополнитьДаннымиПриЗагрузкаРазделаПоТипуПЭМК(Форма, ОписаниеРаздела, ТекстРаздела) Экспорт
	
	МедицинскаяДеятельностьКлиентКОРП.ДополнитьДаннымиПриЗагрузкаРазделаПоТипуПЭМК(Форма, ОписаниеРаздела, ТекстРаздела);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПередНачаломРаботыСистемы(Кеши) Экспорт
	
	Кеши.Свойство("глНоменклатураСправокЦенаПоПолуКлиента",				глНоменклатураСправокЦенаПоПолуКлиента);
	Кеши.Свойство("глКешВидыКлассификаторовПараметровПриемаФРНСИ",		глКешВидыКлассификаторовПараметровПриемаФРНСИ);
	Кеши.Свойство("глКешПараметрыШаблоновСвязанныхНазначенийПараметров",глКешПараметрыШаблоновСвязанныхНазначенийПараметров);
	
КонецПроцедуры

#КонецОбласти
