
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если (ЭтаФорма.Объект.Ссылка.Пустая() И Не ЗначениеЗаполнено(ЭтаФорма.Объект.ФормулаРасчета)) Тогда
		Масс = Новый Массив;
		Масс = Заполнить_По_Умолчанию();
		ЭтаФорма.Объект.ФормулаРасчета = Масс[0];
		ЭтаФорма.Объект.Периодичность  = Масс[1];
	КонецЕсли;
	
	ОбновитьДоступностьЭлементов();
	
	////////////////////////////////////////////////////
	// ОМГ + 
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ИспользуетсяПриоритизацияУслуг", Тип("ПолеФормы"),Элементы.ГруппаОсновныеРеквизиты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.омг_ИспользуетсяПриоритизацияУслуг";

	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ЭтоПроцент", Тип("ПолеФормы"),Элементы.ГруппаОсновныеРеквизиты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Омг_ЭтоПроцент";
	
	// ОМГ -
	////////////////////////////////////////////////////

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриИзмененииВидаПараметра("Показатель1");
	ПриИзмененииВидаПараметра("Показатель2");
	ПриИзмененииВидаПараметра("Показатель3");
	ОбновитьОписаниеФормулы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидПараметра1ПриИзменении(Элемент)
	ПриИзмененииВидаПараметра("Показатель1");
КонецПроцедуры

&НаКлиенте
Процедура ВидПараметра2ПриИзменении(Элемент)
	ПриИзмененииВидаПараметра("Показатель2");
КонецПроцедуры

&НаКлиенте
Процедура ВидПараметра3ПриИзменении(Элемент)
	ПриИзмененииВидаПараметра("Показатель3");
КонецПроцедуры

&НаКлиенте
Процедура ФормулаРасчетаПриИзменении(Элемент)
	ОбновитьДоступностьЭлементов(Истина);
	ОбновитьОписаниеФормулы();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПолученияДанныхВыбора(ИмяПараметра, ВидПараметра)
	
	СтандартнаяОбработка = Ложь;
	ИндексПараметра = Прав(ИмяПараметра, 1);
	пчВидыПараметров = Перечисления.ВидыПараметровРасчетаНачислений;
	пчПоказатели	 = Перечисления.ПоказателиРасчетаНачислений;
	
	Масс = Новый Массив;
	
	Если ВидПараметра = пчВидыПараметров.ДанныеТабеля Тогда
		
		Масс.Добавить(пчПоказатели.КоличествоДнейПоТабелю);
		Масс.Добавить(пчПоказатели.КоличествоЧасовПоТабелю);	
		Масс.Добавить(пчПоказатели.ДнейПоНорме);
		Масс.Добавить(пчПоказатели.ДнейОтработаноПоНорме);
		Масс.Добавить(пчПоказатели.ДнейОтработаноСверхНормы);
		Масс.Добавить(пчПоказатели.ЧасовПоНорме);
		Масс.Добавить(пчПоказатели.ЧасовОтработаноПоНорме);
		Масс.Добавить(пчПоказатели.ЧасовОтработаноСверхНормы);
		
	ИначеЕсли ВидПараметра = пчВидыПараметров.Шкала Тогда
		
		Для Сч = 1 По 3 Цикл
			Если ИндексПараметра <> Строка(Сч) Тогда
				Масс.Добавить(пчПоказатели["Параметр" + Сч]); // Например, Перечисления.ПоказателиРасчетаНачислений.Параметр2
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ВидПараметра = пчВидыПараметров.Ответственный 
		  Или ВидПараметра = пчВидыПараметров.Филиал 
	Тогда
		Масс.Добавить(пчПоказатели.Количество);
		Масс.Добавить(пчПоказатели.СуммаБезСкидок);
		Масс.Добавить(пчПоказатели.СуммаОплат);
		Масс.Добавить(пчПоказатели.Сумма);
		Масс.Добавить(пчПоказатели.СуммаПродажУслуг);
		Масс.Добавить(пчПоказатели.СуммаПродажТоваров);
		Масс.Добавить(пчПоказатели.СуммаПродажАбонементов);
		
	ИначеЕсли ВидПараметра = пчВидыПараметров.КатегорияВыработки
		  Или ВидПараметра = пчВидыПараметров.ВсеТовары
		  Или ВидПараметра = пчВидыПараметров.ВсеУслуги
		  Или ВидПараметра = пчВидыПараметров.ОценкаПоПрейскуранту
	Тогда
		Масс.Добавить(пчПоказатели.Количество);
		Масс.Добавить(пчПоказатели.СуммаБезСкидок);
		Масс.Добавить(пчПоказатели.Сумма);
		
		Если ВидПараметра <> пчВидыПараметров.ОценкаПоПрейскуранту Тогда
			Масс.Добавить(пчПоказатели.СтоимостьПоПрайсу);
			Масс.Добавить(пчПоказатели.Себестоимость);
		КонецЕсли;
	КонецЕсли;
	
	Элементы["ПоказательРасчета" + ИндексПараметра].СписокВыбора.ЗагрузитьЗначения(Масс);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция Заполнить_По_Умолчанию()
	
	Масс = Новый Массив;
	Масс.Добавить(Перечисления.ФормулыРасчетаЗаработнойПлаты.ФиксированнаяСумма);
	Масс.Добавить(Перечисления.ПериодичностиВидовРасчета.Месяц);
	Возврат Масс;

КонецФункции // Заполнить_По_Умолчанию()()

&НаСервере
Процедура ОбновитьДоступностьЭлементов(ПриИзмененииДанных = Ложь)
	
	ОбновитьДоступностьПараметров();
	ОбновитьДоступностьЗначениеИсточникаБазы(ПриИзмененииДанных);
	
	Если ПриИзмененииДанных Тогда
		ВычислитьПорядокРасчета();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьПараметров()
	
	ЧислоПараметров = РасчетЗаработнойПлаты.ПолучитьЧислоПараметровВидаНачисления(Объект);
	Для Сч = 1 По 3 Цикл
		Элементы["Показатель"+сч].Доступность = сч <= ЧислоПараметров;
	КонецЦикла;
	
	ФормулаРасчета = Объект.ФормулаРасчета;
	Формулы		   = Перечисления.ФормулыРасчетаЗаработнойПлаты;
	ВидыПараметров = Перечисления.ВидыПараметровРасчетаНачислений;
	Показатели	   = Перечисления.ПоказателиРасчетаНачислений;
	
	Если ФормулаРасчета = Формулы.ФиксированнаяСумма Тогда
		Элементы.Показатель1.Доступность = Ложь;
	КонецЕсли;
	
	Если Модифицированность Тогда
	
		// Автоподстановка видов параметров по-умолчанию.
		Если ФормулаРасчета = Формулы.ФиксированнаяСумма Тогда
			
			Объект.ВидПараметра1 = ВидыПараметров.Число;
			Объект.ВидПараметра2 = ВидыПараметров.ПустаяСсылка();
			Объект.ВидПараметра3 = ВидыПараметров.ПустаяСсылка();
			Объект.ПоказательРасчета1 = Показатели.ПустаяСсылка();
			Объект.ПоказательРасчета2 = Показатели.ПустаяСсылка();
			Объект.ПоказательРасчета3 = Показатели.ПустаяСсылка();
			
		ИначеЕсли ФормулаРасчета = Формулы.МинимальныйОклад Тогда
			
			Объект.ВидПараметра1 = ВидыПараметров.Число;
			Объект.ВидПараметра2 = ВидыПараметров.ПустаяСсылка();
			Объект.ВидПараметра3 = ВидыПараметров.ПустаяСсылка();
			Объект.ПоказательРасчета1 = Показатели.ПустаяСсылка();
			Объект.ПоказательРасчета2 = Показатели.ПустаяСсылка();
			Объект.ПоказательРасчета3 = Показатели.ПустаяСсылка();
			
		ИначеЕсли ФормулаРасчета = Формулы.ОдинПараметр
			  Или ФормулаРасчета = Формулы.ПроцентОдинПараметр
		Тогда
			
			Объект.ВидПараметра1 = ВидыПараметров.ОценкаПоПрейскуранту;
			Объект.ВидПараметра2 = ВидыПараметров.ПустаяСсылка();
			Объект.ВидПараметра3 = ВидыПараметров.ПустаяСсылка();
			Объект.ПоказательРасчета1 = Показатели.ПустаяСсылка();
			Объект.ПоказательРасчета2 = Показатели.ПустаяСсылка();
			Объект.ПоказательРасчета3 = Показатели.ПустаяСсылка();
			
		ИначеЕсли ФормулаРасчета = Формулы.Процент
			  Или ФормулаРасчета = Формулы.Произведение
		Тогда
			
			Объект.ВидПараметра1 = ВидыПараметров.Число;
			Объект.ВидПараметра2 = ВидыПараметров.ВсеУслуги;
			Объект.ВидПараметра3 = ВидыПараметров.ПустаяСсылка();
			Объект.ПоказательРасчета1 = Показатели.ПустаяСсылка();
			Объект.ПоказательРасчета2 = Показатели.Сумма;
			Объект.ПоказательРасчета3 = Показатели.ПустаяСсылка();
			
		ИначеЕсли ФормулаРасчета = Формулы.Разность Тогда
			
			Объект.ВидПараметра1 = ВидыПараметров.ВсеУслуги;
			Объект.ВидПараметра2 = ВидыПараметров.ВсеУслуги;
			Объект.ВидПараметра3 = ВидыПараметров.ПустаяСсылка();
			Объект.ПоказательРасчета1 = Показатели.Сумма;
			Объект.ПоказательРасчета2 = Показатели.Себестоимость;
			Объект.ПоказательРасчета3 = Показатели.ПустаяСсылка();

		ИначеЕсли ФормулаРасчета = Формулы.ПроцентОтРазности Тогда
			
			Объект.ВидПараметра1 = ВидыПараметров.ВсеУслуги;
			Объект.ВидПараметра2 = ВидыПараметров.ВсеУслуги;
			Объект.ВидПараметра3 = ВидыПараметров.Число;
			Объект.ПоказательРасчета1 = Показатели.Сумма;
			Объект.ПоказательРасчета2 = Показатели.Себестоимость;
			Объект.ПоказательРасчета3 = Показатели.ПустаяСсылка();

		ИначеЕсли ФормулаРасчета = Формулы.Деление Тогда	
			
			Объект.ВидПараметра1 = ВидыПараметров.ВсеУслуги;
			Объект.ВидПараметра2 = ВидыПараметров.Число;
			Объект.ВидПараметра3 = ВидыПараметров.ПустаяСсылка();
			Объект.ПоказательРасчета1 = Показатели.Сумма;
			Объект.ПоказательРасчета2 = Показатели.ПустаяСсылка();
			Объект.ПоказательРасчета3 = Показатели.ПустаяСсылка();
			
		ИначеЕсли ФормулаРасчета = Формулы.ТройноеПроизведение Тогда	
			
			Объект.ВидПараметра1 = ВидыПараметров.Число;
			Объект.ВидПараметра2 = ВидыПараметров.КатегорияВыработки;
			Объект.ВидПараметра3 = ВидыПараметров.КатегорияВыработки;	
			Объект.ПоказательРасчета1 = Показатели.ПустаяСсылка();
			Объект.ПоказательРасчета2 = Показатели.Сумма;
			Объект.ПоказательРасчета3 = Показатели.Сумма;
			
		ИначеЕсли ФормулаРасчета = Формулы.ДелениеПроизведения Тогда	
			
			Объект.ВидПараметра1 = ВидыПараметров.ВсеУслуги;
			Объект.ВидПараметра2 = ВидыПараметров.Число;
			Объект.ВидПараметра3 = ВидыПараметров.Число;	
			Объект.ПоказательРасчета1 = Показатели.Сумма;
			Объект.ПоказательРасчета2 = Показатели.ПустаяСсылка();
			Объект.ПоказательРасчета3 = Показатели.ПустаяСсылка();

		КонецЕсли;
		
		ПриИзмененииВидаПараметра("Показатель1");
		ПриИзмененииВидаПараметра("Показатель2");
		ПриИзмененииВидаПараметра("Показатель3");
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьЗначениеИсточникаБазы(ПриИзмененииФормулы = Ложь)
	
	ИсточникНужен = Ложь;
	ЭтоМинимальныйОклад = Ложь;
	
	// По формуле
	Если Объект.ФормулаРасчета = Перечисления.ФормулыРасчетаЗаработнойПлаты.МинимальныйОклад Тогда
		ЭтоМинимальныйОклад = Истина;
		ИсточникНужен = Истина;
	КонецЕсли;
	
	// По параметрам расчета
	Если Не ИсточникНужен Тогда
		Для Сч = 1 По 3 Цикл
			ВидПараметра = Объект["ВидПараметра" + Сч];
			Если	ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ВидНачисления
				Или	ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ВсеНачисления
			Тогда
				ИсточникНужен = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Элементы.ИсточникБазы.Доступность = ИсточникНужен;
	
	// Изменение значения 
	Если ПриИзмененииФормулы Тогда
		Если ИсточникНужен
			И Не ЗначениеЗаполнено(Объект.ИсточникБазы)
		Тогда
			Если ЭтоМинимальныйОклад Тогда
				Объект.ИсточникБазы = Перечисления.ИсточникБазыВторичногоНачисленияПоСтруктуре.ВсеДанные;
			Иначе
				Объект.ИсточникБазы = Перечисления.ИсточникБазыВторичногоНачисленияПоСтруктуре.ОбластьДействияДокументаНачисления;
			КонецЕсли;
			
		ИначеЕсли Не ИсточникНужен Тогда
			Объект.ИсточникБазы = Неопределено;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьПорядокРасчета()
	
	ЭтоМинимальныйОклад = Ложь;
	ЭтоРасчетОтВидаНачисления = Ложь;
	ЭтоРасчетОтВсехНачислений = Ложь;
	
	// По формуле
	Если Объект.ФормулаРасчета = Перечисления.ФормулыРасчетаЗаработнойПлаты.МинимальныйОклад Тогда
		ЭтоМинимальныйОклад = Истина;
	КонецЕсли;
	
	// По параметрам расчета
	Для Сч = 1 По 3 Цикл
		ВидПараметра = Объект["ВидПараметра" + Сч];
		Если ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ВидНачисления Тогда
			ЭтоРасчетОтВидаНачисления = Истина;
		ИначеЕсли ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ВсеНачисления Тогда
			ЭтоРасчетОтВсехНачислений = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Объект.ПорядокРасчета <= 2 И ЭтоРасчетОтВсехНачислений Тогда
		Объект.ПорядокРасчета = 4;
	ИначеЕсли Объект.ПорядокРасчета = 1 И (ЭтоМинимальныйОклад Или ЭтоРасчетОтВидаНачисления) Тогда
		Объект.ПорядокРасчета = 2;
	ИначеЕсли Не ЭтоМинимальныйОклад И Не ЭтоРасчетОтВидаНачисления И ЭтоРасчетОтВсехНачислений Тогда
		Объект.ПорядокРасчета = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВидаПараметра(Параметр)
	
	ВидПараметра	 	= ЭтаФорма.Объект["ВидПараметра"+Прав(Параметр,1)];
	ИмяПоказателя	  	= "ПоказательРасчета"+Прав(Параметр,1);
	ЭлементПоказатель	= ЭтаФорма.Элементы[ИмяПоказателя];
	
	Если ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.Число			Или
		 ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ВидНачисления  Или
		 ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ВсеНачисления  Или
		 ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ДополнительныйПараметр
	Тогда
		ЭлементПоказатель.Доступность = Ложь;
		Объект[ИмяПоказателя] = Перечисления.ПоказателиРасчетаНачислений.ПустаяСсылка();
		
	ИначеЕсли ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.Шкала Тогда
		ЭлементПоказатель.Доступность = Истина;
		Если (Объект[ИмяПоказателя] <> Перечисления.ПоказателиРасчетаНачислений.Параметр1
				И Объект[ИмяПоказателя] <> Перечисления.ПоказателиРасчетаНачислений.Параметр2
				И Объект[ИмяПоказателя] <> Перечисления.ПоказателиРасчетаНачислений.Параметр3) 
		Тогда
			Если Параметр = "Показатель1" Тогда
				Объект[ИмяПоказателя] = Перечисления.ПоказателиРасчетаНачислений.Параметр2;
			ИначеЕсли Параметр = "Показатель2" Тогда
				Объект[ИмяПоказателя] = Перечисления.ПоказателиРасчетаНачислений.Параметр1;
			Иначе
				Объект[ИмяПоказателя] = Перечисления.ПоказателиРасчетаНачислений.Параметр1;
			КонецЕсли; 
		КонецЕсли;
		
	ИначеЕсли ВидПараметра = Перечисления.ВидыПараметровРасчетаНачислений.ДанныеТабеля Тогда
		
		ЭлементПоказатель.Доступность = Истина;
		
		Если  (Объект[ИмяПоказателя] <> Перечисления.ПоказателиРасчетаНачислений.КоличествоДнейПоТабелю
			И Объект[ИмяПоказателя] <> Перечисления.ПоказателиРасчетаНачислений.КоличествоЧасовПоТабелю
			И Объект[ИмяПоказателя] <> Перечисления.ПоказателиРасчетаНачислений.ДнейПоНорме
			И Объект[ИмяПоказателя] <> Перечисления.ПоказателиРасчетаНачислений.ДнейОтработаноПоНорме
			И Объект[ИмяПоказателя] <> Перечисления.ПоказателиРасчетаНачислений.ДнейОтработаноСверхНормы
			И Объект[ИмяПоказателя] <> Перечисления.ПоказателиРасчетаНачислений.ЧасовПоНорме
			И Объект[ИмяПоказателя] <> Перечисления.ПоказателиРасчетаНачислений.ЧасовОтработаноПоНорме
			И Объект[ИмяПоказателя] <> Перечисления.ПоказателиРасчетаНачислений.ЧасовОтработаноСверхНормы) Тогда

			Объект[ИмяПоказателя] = Неопределено;	
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект[ИмяПоказателя]) Тогда
			Объект[ИмяПоказателя] = Перечисления.ПоказателиРасчетаНачислений.КоличествоДнейПоТабелю;
		КонецЕсли; 	
	
	Иначе
		ЭлементПоказатель.Доступность = Истина;
		Если (Объект[ИмяПоказателя] = Перечисления.ПоказателиРасчетаНачислений.Параметр1
				Или Объект[ИмяПоказателя] = Перечисления.ПоказателиРасчетаНачислений.Параметр2
				Или Объект[ИмяПоказателя] = Перечисления.ПоказателиРасчетаНачислений.Параметр3) Тогда
			Объект[ИмяПоказателя] = Неопределено;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВидПараметра) 
			И Не ЗначениеЗаполнено(Объект[ИмяПоказателя]) Тогда
				Объект[ИмяПоказателя] = Перечисления.ПоказателиРасчетаНачислений.Сумма;		
		КонецЕсли;
	КонецЕсли;
	
	ОбработкаПолученияДанныхВыбора(Параметр, ВидПараметра);
	
	ОбновитьДоступностьЗначениеИсточникаБазы(Истина);
	ВычислитьПорядокРасчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОписаниеФормулы()
	
	Элементы.Описание.Заголовок = ПолучитьОписаниеФормулы(Объект.ФормулаРасчета);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОписаниеФормулы(Формула) 
	
    Попытка
		Рез = Формула.Метаданные().ЗначенияПеречисления[Перечисления.ФормулыРасчетаЗаработнойПлаты.Индекс(Формула)].Комментарий;	
	Исключение
	    Рез = "";
	КонецПопытки;
	
    Возврат Рез;
	
КонецФункции // ПолучитьОписаниеФормулы()

#КонецОбласти
