#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	Сотрудник = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Сотрудник")).Значение;
	Дата	  = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Дата")).Значение.Дата;
	
	Начисления = РасчетЗаработнойПлаты.ПолучитьСхемыЗП(ОбщегоНазначенияБИТКлиентСервер.НовыйМассив(Сотрудник), Дата);
	
	// Переименование и дополнение колонок
	ВидыРасчета = Начисления.ВыгрузитьКолонку("Начисление");
	ДопКолонки = "ВидПараметра1,ВидПараметра2,ВидПараметра3,ПоказательРасчета1,ПоказательРасчета2,ПоказательРасчета3";
	РеквизитыВидовРасчета = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(ВидыРасчета, ДопКолонки, Истина);
	ДопКолонки = ДопКолонки + ",ПолеФормулы1,ПолеФормулы2,ПолеФормулы3";
	
	Для Каждого ИмяКолонки Из СтрРазделить(ДопКолонки,",", Ложь) Цикл
		Начисления.Колонки.Добавить(ИмяКолонки);
	КонецЦикла;
	
	Для Каждого СтрокаНачисления Из Начисления Цикл
		ЗаполнитьЗначенияСвойств(СтрокаНачисления, РеквизитыВидовРасчета.Получить(СтрокаНачисления.Начисление));
		
		Для Сч = 1 По 3 Цикл
			ПоказательРасчета = Строка(СтрокаНачисления["ПоказательРасчета"+Сч]);
			
			ШаблонП = "(%1)";
			ШаблонЗП = "%1 (%2)";
			ШаблонПараметрФормулыВП = "%1: %2";
			
			
			ЗначениеПараметра = Формат(СтрокаНачисления["Параметр"+Сч], "ЧН=");
				
			Если СтрокаНачисления["ВидПараметра"+Сч] = Перечисления.ВидыПараметровРасчетаНачислений.Число Тогда
				ПараметрФормулы = "";
			Иначе
				ПараметрФормулыВид = Строка(СтрокаНачисления["ВидПараметра"+Сч]);
				
				Если ПустаяСтрока(ПоказательРасчета) Тогда
					ПараметрФормулы = ПараметрФормулыВид;
				Иначе
					ПараметрФормулы = СтрШаблон(ШаблонПараметрФормулыВП, ПараметрФормулыВид, ПоказательРасчета);
				КонецЕсли;
			КонецЕсли;
			
			// Строим строку
			Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
				Если ЗначениеЗаполнено(ПараметрФормулы) Тогда
					СтрокаНачисления["ПолеФормулы"+Сч] = СтрШаблон(ШаблонЗП, ЗначениеПараметра, ПараметрФормулы);
				Иначе
					СтрокаНачисления["ПолеФормулы"+Сч] = ЗначениеПараметра;
				КонецЕсли;
			Иначе
				Если ЗначениеЗаполнено(ПараметрФормулы) Тогда
					СтрокаНачисления["ПолеФормулы"+Сч] = СтрШаблон(ШаблонП, ПараметрФормулы);
				Иначе
					СтрокаНачисления["ПолеФормулы"+Сч] = "";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Вывод в СКД
	ВнешниеНаборыДанных = Новый Структура("Начисления", Начисления);
	
	ОсновнойМакетОформления = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойМакетОформленияСКД");
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	ПараметрМакет = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("МакетОформления");
	ПараметрМакет.Значение = ОсновнойМакетОформления;
	ПараметрМакет.Использование = Истина;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	// Инициализация процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	// Получение результата
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

#КонецОбласти