#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьНовыйИдентификаторПриложения() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПриложенияGoogle.ИдентификаторПриложения КАК ИдентификаторПриложения
	                      |ИЗ
	                      |	РегистрСведений.ПриложенияGoogle КАК ПриложенияGoogle
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ИдентификаторПриложения УБЫВ");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ИдентификаторПриложения = Выборка.ИдентификаторПриложения + 1;
	Иначе
		ИдентификаторПриложения = 100;
	КонецЕсли; 
	
	Возврат ИдентификаторПриложения;
	
КонецФункции

#КонецОбласти 
