#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта"
		И Параметры.Свойство("Ключ")
		И ДокументДо530н(Параметры.Ключ)
	Тогда
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = Метаданные.Документы.Форма066.Формы.ФормаДокументаДо530н;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьДанныеКлиента(Клиент) Экспорт
	
	Результат = Новый Структура("Фамилия, Имя, Отчество, Пол, ДатаРождения");
	ЗаполнитьЗначенияСвойств(Результат, Клиент);
	
	СтраховойПолис = Клиент.умцОсновнойСтраховойПолис;
	Результат.Вставить("СтраховойПолис", Клиент.умцОсновнойСтраховойПолис);
	
	МедицинскаяКарта = Стационар.ПолучитьМедКартуСтационара(Клиент);
	Результат.Вставить("МедицинскаяКарта", МедицинскаяКарта);
	
	Адрес = "";
	Местность = "";
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Представление,
		|	КонтактнаяИнформация.ЗначенияПолей КАК ЗначенияПолей
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮридический)";
	
	Запрос.УстановитьПараметр("Объект", Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Адрес = Выборка.Представление;
		ЗначенияПолей = Выборка.ЗначенияПолей;
		Если УправлениеКонтактнойИнформациейКлиентСервер.ЭтоКонтактнаяИнформацияВXML(ЗначенияПолей) Тогда
			РезультатыЧтения = Новый Структура;
			XDTOКонтактная = УправлениеКонтактнойИнформациейЛокализация.КонтактнаяИнформацияИзXML(ЗначенияПолей, Перечисления.ТипыКонтактнойИнформации.Адрес, РезультатыЧтения);
			Если Не РезультатыЧтения.Свойство("ТекстОшибки") Тогда
				Попытка
					Если Не ПустаяСтрока(XDTOКонтактная.Состав.Состав.Город) Тогда
						Местность = "город — 1";
					Иначе
						Местность = "село — 2";
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат.Вставить("Адрес", Адрес);
	Результат.Вставить("Местность", Местность);
	
	ПаспДанные = РегистрыСведений.ПаспортныеДанные.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("ФизЛицо", Клиент));
	ПаспДанныеСтрока = Строка(ПаспДанные.ДокументВид)
						+ ?(ЗначениеЗаполнено(ПаспДанные.ДокументСерия), ", " + ПаспДанные.ДокументСерия, "")
						+ ?(ЗначениеЗаполнено(ПаспДанные.ДокументНомер), ", " + ПаспДанные.ДокументНомер, "");
	Результат.Вставить("ДокументКлиента", ПаспДанныеСтрока);
	
	Возврат Результат;
	
КонецФункции

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("Форма066у", "Форма 066/у");
	
	Возврат СтруктураМакетов;
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура формирует печатную форму документа
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Функция Печать(СсылкаНаОбъект, ИмяМакета) Экспорт
	
	Перем ТабДокумент;
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "Форма066у" Тогда
		Если ДокументДо530н(СсылкаНаОбъект) Тогда
			ТабДокумент = ПечатьФормы066у02(СсылкаНаОбъект);
		Иначе
			ТабДокумент = ПечатьФормы066у_530н(СсылкаНаОбъект);
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция РолиДляПодписания() Экспорт
	
	Роли = Новый Массив;
	Роли.Добавить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(18, "РолиПриПодписиМедДокументов"));
	Роли.Добавить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(5, "РолиПриПодписиМедДокументов"));
	Возврат Роли;
	
КонецФункции

Функция СохранитьЭМД(СсылкаНаОбъект, ТекстОшибки, СохранитьЭМД) Экспорт
	
	ТабДок = ПечатьФормы066у_530н(СсылкаНаОбъект);
	Если ТабДок <> Неопределено Тогда
		
		ПотокФайла = Новый ПотокВПамяти();
		ТабДок.Записать(ПотокФайла, ТипФайлаТабличногоДокумента.MXL);
		
		ДД = ПотокФайла.ЗакрытьИПолучитьДвоичныеДанные();
		
		Если СохранитьЭМД Тогда
			доп_РаботаСФайлами.ДобавитьФайлЭМД(СсылкаНаОбъект, ДД, "mxl");
		КонецЕсли;
		
		Возврат Новый Структура("ДД, расширение", ДД, "mxl");
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьНеподписанныеДокументыДляОтчётаЭЦП(ПараметрыДанных, ДокументыРЭМД) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Форма066.Ссылка КАК Ссылка,
		|	Форма066.Дата КАК ДатаДокумента,
		|	ОбращениеВСтационар.ЛечащийВрач КАК ЛечащийВрач,
		|	Сотрудники.Ссылка КАК ЗаведующийОтделением
		|ПОМЕСТИТЬ Форма066
		|ИЗ
		|	(ВЫБРАТЬ
		|		ДатыПервыхОбращенийПоФорме066.Форма066 КАК Ссылка,
		|		МИНИМУМ(ОбращениеВСтационар.Ссылка) КАК ПервоеОбращение
		|	ИЗ
		|		(ВЫБРАТЬ
		|			Форма066.Ссылка КАК Форма066,
		|			Форма066.МедицинскаяКарта КАК МедицинскаяКарта,
		|			МИНИМУМ(ОбращениеВСтационар.Дата) КАК ДатаПервогоОбращения
		|		ИЗ
		|			Документ.Форма066 КАК Форма066
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОбращениеВСтационар КАК ОбращениеВСтационар
		|				ПО (ОбращениеВСтационар.МедицинскаяКарта = Форма066.МедицинскаяКарта)
		|					И (НЕ ОбращениеВСтационар.ПометкаУдаления)
		|					И (НЕ ОбращениеВСтационар.ОтказВГоспитализации)
		|					И (НЕ Форма066.ПометкаУдаления)
		|					И (&КонецПериода = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|						ИЛИ Форма066.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Форма066.Ссылка,
		|			Форма066.МедицинскаяКарта) КАК ДатыПервыхОбращенийПоФорме066
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОбращениеВСтационар КАК ОбращениеВСтационар
		|			ПО (ОбращениеВСтационар.Дата = ДатыПервыхОбращенийПоФорме066.ДатаПервогоОбращения)
		|				И (ОбращениеВСтационар.МедицинскаяКарта = ДатыПервыхОбращенийПоФорме066.МедицинскаяКарта)
		|				И (НЕ ОбращениеВСтационар.ПометкаУдаления)
		|				И (НЕ ОбращениеВСтационар.ОтказВГоспитализации)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ДатыПервыхОбращенийПоФорме066.Форма066) КАК ПервыеОбращенияПоФорме066
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Форма066 КАК Форма066
		|		ПО (Форма066.Ссылка = ПервыеОбращенияПоФорме066.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОбращениеВСтационар КАК ОбращениеВСтационар
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|				ПО Подразделения.Руководитель = Сотрудники.Ссылка
		|			ПО ОбращениеВСтационар.Подразделение = Подразделения.Ссылка
		|		ПО (ОбращениеВСтационар.Ссылка = ПервыеОбращенияПоФорме066.ПервоеОбращение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	""Форма № 066"" КАК ТипМедицинскогоДокумента,
		|	Форма066.Ссылка КАК Ссылка,
		|	Форма066.ДатаДокумента КАК ДатаДокумента,
		|	ЛОЖЬ КАК ПодписьРЭМД,
		|	ИСТИНА КАК ПодписьФайловЭМД
		|ИЗ
		|	(ВЫБРАТЬ
		|		Форма066.Ссылка КАК Ссылка,
		|		Форма066.ДатаДокумента КАК ДатаДокумента,
		|		Форма066.ЛечащийВрач КАК ЛечащийВрач,
		|		Форма066.ЗаведующийОтделением КАК ЗаведующийОтделением
		|	ИЗ
		|		(ВЫБРАТЬ
		|			Форма066.Ссылка КАК Ссылка,
		|			Форма066.ДатаДокумента КАК ДатаДокумента,
		|			Форма066.ЛечащийВрач КАК ЛечащийВрач,
		|			Форма066.ЗаведующийОтделением КАК ЗаведующийОтделением
		|		ИЗ
		|			Форма066 КАК Форма066
		|		ГДЕ
		|			Форма066.ЛечащийВрач = &СотрудникДокумента) КАК Форма066
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектронныеПодписи КАК ЭП
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РолиИПодписиЭМД КАК РолиИПодписиЭМД
		|				ПО (РолиИПодписиЭМД.УИД_ЭЦП = ЭП.УникальныйИдентификатор)
		|			ПО (ЭП.Объект = Форма066.Ссылка)
		|				И (НЕ ЭП.ПодписанФайлЭМД)
		|				И (РолиИПодписиЭМД.РольПодписи = ЗНАЧЕНИЕ(Перечисление.РолиПодписей.ЛечащийВрач))
		|	ГДЕ
		|		ЭП.Объект ЕСТЬ NULL
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		Форма066.Ссылка,
		|		Форма066.ДатаДокумента,
		|		Форма066.ЛечащийВрач,
		|		Форма066.ЗаведующийОтделением
		|	ИЗ
		|		(ВЫБРАТЬ
		|			Форма066.Ссылка КАК Ссылка,
		|			Форма066.ДатаДокумента КАК ДатаДокумента,
		|			Форма066.ЛечащийВрач КАК ЛечащийВрач,
		|			Форма066.ЗаведующийОтделением КАК ЗаведующийОтделением
		|		ИЗ
		|			Форма066 КАК Форма066
		|		ГДЕ
		|			Форма066.ЗаведующийОтделением = &СотрудникДокумента) КАК Форма066
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭлектронныеПодписи КАК ЭП
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РолиИПодписиЭМД КАК РолиИПодписиЭМД
		|				ПО (РолиИПодписиЭМД.УИД_ЭЦП = ЭП.УникальныйИдентификатор)
		|			ПО (ЭП.Объект = Форма066.Ссылка)
		|				И (НЕ ЭП.ПодписанФайлЭМД)
		|				И (РолиИПодписиЭМД.РольПодписи = ЗНАЧЕНИЕ(Перечисление.РолиПодписей.ЗаведующийОтделением))
		|	ГДЕ
		|		ЭП.Объект ЕСТЬ NULL) КАК Форма066";
	
	Запрос.УстановитьПараметр("КонецПериода", ПараметрыДанных.КонецПериода);
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыДанных.НачалоПериода);
	Запрос.УстановитьПараметр("СотрудникДокумента", ПараметрыДанных.СотрудникДокумента);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьФормы066у02(СсылкаНаОбъект)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "Форма066у02";
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Форма066.ВидСтационара КАК ВидСтационара,
		|	Форма066.МедицинскаяКарта.НомерКарты КАК НомерКарты,
		|	Форма066.Клиент.Код КАК КодКлиента,
		|	Форма066.Фамилия + "" "" + Форма066.Имя + "" "" + Форма066.Отчество КАК ФИО,
		|	Форма066.Пол КАК Пол,
		|	Форма066.ДатаРождения КАК ДатаРождения,
		|	Форма066.ДокументКлиента КАК ДокументКлиента,
		|	Форма066.Местность КАК Местность,
		|	Форма066.Адрес КАК Адрес,
		|	Форма066.СтраховойПолис.Серия + "",  "" + Форма066.СтраховойПолис.Номер КАК СтраховойПолис,
		|	Форма066.СтраховойПолис.ВидПолиса.Контрагент.НаименованиеПолное КАК ДанныеСтраховщика,
		|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК АдресСтраховщика,
		|	Форма066.ВидОплаты КАК ВидОплаты,
		|	Форма066.СоциальныйСтатус КАК СоциальныйСтатус,
		|	Форма066.КодВоеннослужащего КАК КодВоеннослужащего,
		|	Форма066.КатегорияЛьготности КАК КатегорияЛьготности,
		|	Форма066.ДокументОснование.НаправившееУчреждение КАК КемНаправлен,
		|	Форма066.ДокументОснование.НомерНаправления КАК НомерНаправления,
		|	Форма066.ДокументОснование.ДатаВыдачиНаправления КАК ДатаНаправления,
		|	Форма066.ДокументОснование.КаналГоспитализации КАК КаналГоспитализации,
		|	Форма066.ДокументОснование.НомерНаряда КАК НомерНаряда,
		|	Форма066.ДокументОснование.ДиагнозНаправления КАК ДиагнозНаправившегоУчреждения,
		|	Форма066.ДокументОснование.ДиагнозПоступления КАК ДиагнозПриемногоОтделения,
		|	Форма066.ДокументОснование.АлкогольноеОпьянение КАК АлкогольноеОпьянение,
		|	Форма066.ДокументОснование.НаркотическоеОпьянение КАК НаркотическоеОпьянение,
		|	Форма066.СрочностьГоспитализации КАК СрочностьГоспитализации,
		|	Форма066.ДокументОснование.ЧерезЧасовПослеНачалаЗаболевания КАК ВремяДоставкиВСтационар,
		|	Форма066.Травма КАК Травма,
		|	Форма066.ДокументОснование.ДатаВремяПоступления КАК ДатаПоступления,
		|	Форма066.ДокументОснование.Подразделение.Наименование КАК Отделение,
		|	Форма066.ДокументОснование.ДатаВремяГоспитализации КАК ДатаГоспитализации,
		|	Форма066.ДокументОснование.ЛечащийВрач.КодПоОМС КАК КодСотрудникаПоОМС,
		|	Форма066.ДатаВремяВыписки КАК ДатаВыписки,
		|	Форма066.ПродолжительностьГоспитализации КАК ПродолжительностьГоспитализации,
		|	Форма066.ИсходГоспитализации КАК ИсходГоспитализации,
		|	Форма066.РезультатГоспитализации КАК РезультатГоспитализации,
		|	Форма066.ДатаОткрытияЛисткаНетрудоспособности КАК ДатаОткрытияЛН,
		|	Форма066.ДатаЗакрытияЛисткаНетрудоспособности КАК ДатаЗакрытияЛН,
		|	Форма066.РодственникВозраст КАК ПоУходуЗаБольнымВозраст,
		|	Форма066.РодственникПол КАК ПоУходуЗаБольнымПол,
		|	Форма066.ОбследованRW1 КАК ОбследованRW1,
		|	Форма066.ОбследованAIDS2 КАК ОбследованAIDS2,
		|	Форма066.ДиагнозКлиническийЗаключительный.НаименованиеПолное КАК ДиагнозКлиническийЗаключительный,
		|	Форма066.ДиагнозКлиническийЗаключительный.КодДиагноза КАК КодДиагнозаКлиническогоЗаключительного,
		|	Форма066.Осложнение.НаименованиеПолное КАК Осложнение,
		|	Форма066.Осложнение.КодДиагноза КАК КодОсложнения,
		|	Форма066.СопутствующееЗаболевание.НаименованиеПолное КАК СопутствующееЗаболевание,
		|	Форма066.СопутствующееЗаболевание.КодДиагноза КАК КодСопутствующегоЗаболевания,
		|	Форма066.ДиагнозПатологоанатомический.НаименованиеПолное КАК ДиагнозПатологоанатомический,
		|	Форма066.ДиагнозПатологоанатомический.КодДиагноза КАК КодДиагнозаПатологоанатомического,
		|	Форма066.ПричинаСмерти.НаименованиеПолное КАК ПричинаСмерти,
		|	Форма066.ПричинаСмерти.КодДиагноза КАК КодПричиныСмерти,
		|	Форма066.ДефектыДогоспитальногоЭтапа КАК ДефектыДогоспитальногоЭтапа,
		|	Форма066.ДвиженияПациентаПоОтделениям.(
		|		НомерСтроки КАК Номер,
		|		Отделение КАК КодОтделения,
		|		ПрофильКоек КАК ПрофильКоек,
		|		Врач.КодПоОМС КАК КодСотрудникаПоОМС,
		|		ДатаПоступления КАК ДатаПоступления,
		|		ДатаВыписки КАК ДатаВыписки,
		|		Диагноз.КодДиагноза КАК КодДиагноза,
		|		МедицинскийСтандарт КАК КодМедицинскогоСтандарта,
		|		ПрерванныйСлучай КАК КодПрерванногоСлучая,
		|		ВидОплаты КАК ВидОплаты
		|	) КАК ДвиженияПациентаПоОтделениям,
		|	Форма066.ХирургическиеОперации.(
		|		ДатаОперации КАК ДатаОперации,
		|		Хирург.КодПоОМС КАК КодХирургаПоОМС,
		|		Отделение КАК КодОтделения,
		|		Операция.НаименованиеПолное КАК НаименованиеОперации,
		|		Операция.Артикул КАК КодОперации,
		|		Осложнение.НаименованиеПолное КАК НаименованиеОсложнения,
		|		Осложнение.КодДиагноза КАК КодОсложнения,
		|		Анестезия КАК Анестезия,
		|		ИспользованиеЭнд КАК ИспользованиеЭнд,
		|		ИспользованиеЛазер КАК ИспользованиеЛазер,
		|		ИспользованиеКриог КАК ИспользованиеКриог,
		|		ВидОплаты КАК ВидОплаты
		|	) КАК ХирургическиеОперации
		|ИЗ
		|	Документ.Форма066 КАК Форма066
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|		ПО Форма066.СтраховойПолис.ВидПолиса.Контрагент = КонтактнаяИнформация.Объект
		|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮридический))
		|ГДЕ
		|	Форма066.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	
	ТабДанныеДокумента = Запрос.Выполнить().Выгрузить();
	ДанныеДокумента = Новый Структура;
	Для Каждого Колонка Из ТабДанныеДокумента.Колонки Цикл
		ДанныеДокумента.Вставить(Колонка.Имя, ТабДанныеДокумента[0][Колонка.Имя]);
	КонецЦикла;
	
	Макет = ПолучитьМакет("Форма066у02");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	СтруктураРеквизитовОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(СсылкаНаОбъект);
	Если ЗначениеЗаполнено(СтруктураРеквизитовОрганизации.НазваниеОрганизации) Тогда
		ДанныеДокумента.Вставить("ПредставлениеОрганизации", СтруктураРеквизитовОрганизации.НазваниеОрганизации);
	КонецЕсли;
	
	ДанныеДокумента.ВидСтационара = ?(ДанныеДокумента.ВидСтационара = Перечисления.ВидыСтационара.Круглосуточный,
									"круглосуточного пребывания", "дневного при больничном учреждении");
	ДанныеДокумента.Пол = ?(ДанныеДокумента.Пол = Перечисления.ПолФизическихЛиц.Женский, "жен. - 2", "муж. - 1");
	КодСубъектаРФПациента = ?(ЗначениеЗаполнено(ДанныеДокумента.Адрес), ПолучитьКодРегиона(ДанныеДокумента.Адрес), "");
	ДанныеДокумента.Вставить("КодСубъектаРФПациента", КодСубъектаРФПациента);
	КодСубъектаРФСтраховщика = ?(ЗначениеЗаполнено(ДанныеДокумента.АдресСтраховщика), ПолучитьКодРегиона(ДанныеДокумента.АдресСтраховщика), "");
	ДанныеДокумента.Вставить("КодСубъектаРФСтраховщика", КодСубъектаРФСтраховщика);
	ДанныеДокумента.КодВоеннослужащего = СокрЛП(ДанныеДокумента.КодВоеннослужащего);
	ДанныеДокумента.СоциальныйСтатус = 	Строка(ДанныеДокумента.СоциальныйСтатус) + ?(Не ПустаяСтрока(ДанныеДокумента.КодВоеннослужащего),
										";  Код " + ДанныеДокумента.КодВоеннослужащего, "");
	ДанныеДокумента.КемНаправлен = 	?(ТипЗнч(ДанныеДокумента.КемНаправлен) = Тип("СправочникСсылка.Контрагенты"),
									ДанныеДокумента.КемНаправлен.НаименованиеПолное, ДанныеДокумента.КемНаправлен);
	КодКаналаГоспитализации = ?(ТипЗнч(ДанныеДокумента.КаналГоспитализации) = Тип("СправочникСсылка.КаналыГоспитализации"),
					ДанныеДокумента.КаналГоспитализации.УИДЕГИСЗ, "");
	ДанныеДокумента.Вставить("КодКаналаГоспитализации", КодКаналаГоспитализации);
	ДанныеДокумента.ДиагнозНаправившегоУчреждения = ?(ТипЗнч(ДанныеДокумента.ДиагнозНаправившегоУчреждения) = Тип("СправочникСсылка.Диагнозы"),
													ДанныеДокумента.ДиагнозНаправившегоУчреждения.КодДиагноза + "  " +
													ДанныеДокумента.ДиагнозНаправившегоУчреждения.НаименованиеПолное,
													ДанныеДокумента.ДиагнозНаправившегоУчреждения);
	ДанныеДокумента.ДиагнозПриемногоОтделения = ?(ТипЗнч(ДанныеДокумента.ДиагнозПриемногоОтделения) = Тип("СправочникСсылка.Диагнозы"),
												ДанныеДокумента.ДиагнозПриемногоОтделения.КодДиагноза + "  " + 
												ДанныеДокумента.ДиагнозПриемногоОтделения.НаименованиеПолное,
												ДанныеДокумента.ДиагнозПриемногоОтделения);
	ДоставленВСостоянииОпьянения = 	?(ДанныеДокумента.АлкогольноеОпьянение, "Алкогольного — 1", "") +
									?(ДанныеДокумента.АлкогольноеОпьянение И ДанныеДокумента.НаркотическоеОпьянение, ";  ", "") +
									?(ДанныеДокумента.НаркотическоеОпьянение, "Наркотического — 2", "");
	ДанныеДокумента.Вставить("ДоставленВСостоянииОпьянения", ДоставленВСостоянииОпьянения);
	ДанныеДокумента.ВремяДоставкиВСтационар = 	?(ДанныеДокумента.ВремяДоставкиВСтационар <= 6, "в первые 6 часов — 1",
												?(ДанныеДокумента.ВремяДоставкиВСтационар <= 24, "в теч. 7—24 часов — 2",
												"позднее 24-х часов — 3"));
	ДанныеДокумента.ПоУходуЗаБольнымПол = 	?(ЗначениеЗаполнено(ДанныеДокумента.ПоУходуЗаБольнымПол),
											?(ДанныеДокумента.ПоУходуЗаБольнымПол = Перечисления.ПолФизическихЛиц.Женский,
											"жен. - 2", "муж. - 1"),"");
	
	ЗаполнитьЗначенияСвойств(ОбластьШапка.Параметры, ДанныеДокумента);
	ТабДокумент.Вывести(ОбластьШапка);
	
	ОбластьПримечаниеШапка = Макет.ПолучитьОбласть("ПримечаниеШапка");
	ТабДокумент.Вывести(ОбластьПримечаниеШапка);
	
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ОбластьШапкаДвижениеПациента = Макет.ПолучитьОбласть("ШапкаДвижениеПациента");
	ТабДокумент.Вывести(ОбластьШапкаДвижениеПациента);
	
	ДвиженияПациентаПоОтделениям = ДанныеДокумента.ДвиженияПациентаПоОтделениям;
	Если ДвиженияПациентаПоОтделениям.Количество() = 0 Тогда
		ОбластьСтрокаПустаяДвижениеПациента = Макет.ПолучитьОбласть("СтрокаПустаяДвижениеПациента");
		ТабДокумент.Вывести(ОбластьСтрокаПустаяДвижениеПациента);
	Иначе
		ОбластьСтрокаДвижениеПациента = Макет.ПолучитьОбласть("СтрокаДвижениеПациента");
		Для Каждого ДвижениеПациента Из ДвиженияПациентаПоОтделениям Цикл
			ДвижениеПациента.КодОтделения = ?(ТипЗнч(ДвижениеПациента.КодОтделения) = Тип("СправочникСсылка.Подразделения"),
											ДвижениеПациента.КодОтделения.Код, ДвижениеПациента.КодОтделения);
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаДвижениеПациента.Параметры, ДвижениеПациента);
			ТабДокумент.Вывести(ОбластьСтрокаДвижениеПациента);
		КонецЦикла;
	КонецЕсли;
	
	ОбластьПримечаниеДвижениеПациента = Макет.ПолучитьОбласть("ПримечаниеДвижениеПациента");
	ТабДокумент.Вывести(ОбластьПримечаниеДвижениеПациента);
	
	ОбластьШапкаХирургическиеОперации = Макет.ПолучитьОбласть("ШапкаХирургическиеОперации");
	ТабДокумент.Вывести(ОбластьШапкаХирургическиеОперации);
	
	ХирургическиеОперации = ДанныеДокумента.ХирургическиеОперации;
	Если ХирургическиеОперации.Количество() = 0 Тогда 
		ОбластьСтрокаПустаяХирургическиеОперации = Макет.ПолучитьОбласть("СтрокаПустаяХирургическиеОперации");
		ТабДокумент.Вывести(ОбластьСтрокаПустаяХирургическиеОперации);
	Иначе
		ОбластьСтрокаХирургическиеОперации = Макет.ПолучитьОбласть("СтрокаХирургическиеОперации");
		Для Каждого Операция Из ХирургическиеОперации Цикл
			Операция.КодОтделения = ?(ТипЗнч(Операция.КодОтделения) = Тип("СправочникСсылка.Подразделения"),
											Операция.КодОтделения.Код, Операция.КодОтделения);
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаХирургическиеОперации.Параметры, Операция);
			ТабДокумент.Вывести(ОбластьСтрокаХирургическиеОперации);
		КонецЦикла;
	КонецЕсли;
	
	ОбластьПримечаниеХирургическиеОперации = Макет.ПолучитьОбласть("ПримечаниеХирургическиеОперации");
	ТабДокумент.Вывести(ОбластьПримечаниеХирургическиеОперации);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ЗаполнитьЗначенияСвойств(ОбластьПодвал.Параметры, ДанныеДокумента);
	ТабДокумент.Вывести(ОбластьПодвал);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПолучитьКодРегиона(Адрес)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АдресныеОбъекты.КодСубъектаРФ КАК КодСубъектаРФ,
		|	АдресныеОбъекты.Наименование КАК НаименованиеСубъектаРФ
		|ИЗ
		|	РегистрСведений.АдресныеОбъекты КАК АдресныеОбъекты
		|ГДЕ
		|	АдресныеОбъекты.Уровень = 1";
	
	ВыборкаСубъектыРФ = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСубъектыРФ.Следующий() Цикл
		Если СтрНайти(Адрес, ВыборкаСубъектыРФ.НаименованиеСубъектаРФ) > 0 Тогда
			Возврат ВыборкаСубъектыРФ.КодСубъектаРФ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

Функция ПечатьФормы066у_530н(СсылкаНаОбъект)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "Форма066у02";
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.АвтоМасштаб = Истина;
	ТабДокумент.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	
	Если СсылкаНаОбъект.ПодписанЭП Тогда
		МЗ = РегистрыСведений.ФайлыЭМД.СоздатьМенеджерЗаписи();
		МЗ.Документ = СсылкаНаОбъект;
		МЗ.Прочитать();
		
		Если Не МЗ.Выбран() Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Попытка
			ТабДокумент.Прочитать(МЗ.ЭМД.Получить().ОткрытьПотокДляЧтения());
		Исключение
			Возврат Неопределено;
		КонецПопытки;
		
		УстановитьШтампыЭЦП(ТабДокумент, СсылкаНаОбъект);
		ТабДокумент.Защита = Истина;
		
		Возврат ТабДокумент;
	КонецЕсли;
	
	МедКарта = СсылкаНаОбъект.МедицинскаяКарта;
	Обращение = СсылкаНаОбъект.ДокументОснование;
	
	Макет = ПолучитьМакет("Форма066у_530н");
	ОбластьСтраница1 = Макет.ПолучитьОбласть("Страница1");
	
	ЗначенияПараметров = МедицинскаяДеятельность.ПолучитьЗначенияПараметровМедкарты(МедКарта, СсылкаНаОбъект.Филиал);
	ЗначенияВычисляемыхПараметров = МедицинскаяДеятельность.ПолучитьВычисляемыеЗначенияПараметровМедкарты(МедКарта, МедКарта.ВидКарты).Значения;
	
	Стационар.ДополнитьЗначенияПараметровПоМедкарте(МедКарта, ЗначенияПараметров, ЗначенияВычисляемыхПараметров, Истина);
	
	ЗначенияПараметров.Вставить("ФИО", СтрШаблон("%1 %2 %3", СсылкаНаОбъект.Фамилия, СсылкаНаОбъект.Имя, СсылкаНаОбъект.Отчество));
	ЗначенияПараметров.Вставить("ОсновнойВидОплаты", СсылкаНаОбъект.ВидОплаты);
	ЗначенияПараметров.Вставить("ДоставленВСостоянииОпьянения", Стационар.ФактУпотребленияАлкоголяИИныхПсихоактивныхВеществ(Обращение));
	ЗначенияПараметров.Вставить("ПоступилВпервыеПовторно", ?(Обращение.ПовторноеПоступление, "повторно", "первично"));
	
	Если ЗначенияПараметров.Свойство("ДиагнозНаправившегоУчреждения")
		И ЗначениеЗаполнено(ЗначенияПараметров.ДиагнозНаправившегоУчреждения)
		И ТипЗнч(ЗначенияПараметров.ДиагнозНаправившегоУчреждения) = Тип("СправочникСсылка.Диагнозы")
	Тогда
		ЗначенияПараметров.Вставить("КодДиагнозаНаправившегоУчреждения", ЗначенияПараметров.ДиагнозНаправившегоУчреждения.КодДиагноза);
	КонецЕсли;
	
	ЗначенияПараметров.Вставить("Номер", 	ОбщегоНазначения.ПолучитьНомерНаПечать(СсылкаНаОбъект));
	ЗначенияПараметров.Вставить("Местность",СсылкаНаОбъект.Местность);
	
	МедицинскаяДеятельность.ЗаполнитьОбластьМедкартыПараметрами(ОбластьСтраница1, ЗначенияПараметров, ЗначенияВычисляемыхПараметров);
	ТабДокумент.Вывести(ОбластьСтраница1);
	
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("ДвиженияПациентаПоОтделениямШапка"));
	
	Если СсылкаНаОбъект.ДвиженияПациентаПоОтделениям.Количество() = 0 Тогда
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ДвиженияПациентаПоОтделениямПустаяСтрока"));
	Иначе
		ОбластьСтрокаДвижениеПациента = Макет.ПолучитьОбласть("ДвиженияПациентаПоОтделениямСтрока");
		Для Каждого ДвижениеПациента Из СсылкаНаОбъект.ДвиженияПациентаПоОтделениям Цикл
			
			Если ТипЗнч(ДвижениеПациента.Отделение) = Тип("Строка") Тогда
				НаименованиеОтделения = ДвижениеПациента.Отделение;
			ИначеЕсли ЗначениеЗаполнено(ДвижениеПациента.Отделение.НаименованиеПолное) Тогда
				НаименованиеОтделения = ДвижениеПациента.Отделение.НаименованиеПолное;
			Иначе
				НаименованиеОтделения = ДвижениеПациента.Отделение.Наименование;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаДвижениеПациента.Параметры, ДвижениеПациента);
			ОбластьСтрокаДвижениеПациента.Параметры.ДатаПоступления = Формат(ДвижениеПациента.ДатаПоступления, "ДФ='dd.MM.yyyy ЧЧ:мм'");
			ОбластьСтрокаДвижениеПациента.Параметры.ДатаВыписки = Формат(ДвижениеПациента.ДатаВыписки, "ДФ='dd.MM.yyyy ЧЧ:мм'");
			ОбластьСтрокаДвижениеПациента.Параметры.Диагноз = ?(ПустаяСтрока(ДвижениеПациента.Диагноз.НаименованиеПолное), ДвижениеПациента.Диагноз.Наименование, ДвижениеПациента.Диагноз.НаименованиеПолное);
			ОбластьСтрокаДвижениеПациента.Параметры.КодДиагноза = ДвижениеПациента.Диагноз.КодДиагноза;
			ОбластьСтрокаДвижениеПациента.Параметры.ДнейПроведено = Окр((НачалоДня(ДвижениеПациента.ДатаВыписки) - НачалоДня(ДвижениеПациента.ДатаПоступления)) / 86400) + 1;
			ОбластьСтрокаДвижениеПациента.Параметры.Номер = ДвижениеПациента.НомерСтроки;
			ОбластьСтрокаДвижениеПациента.Параметры.Отделение = НаименованиеОтделения;
			ОбластьСтрокаДвижениеПациента.Параметры.ПрофильКоек = ДвижениеПациента.ПрофильКоек;
			ОбластьСтрокаДвижениеПациента.Параметры.ФИОВрача = ОбщегоНазначения.ФИОФизЛица(ДвижениеПациента.Врач);
			ТабДокумент.Вывести(ОбластьСтрокаДвижениеПациента);
		КонецЦикла;
	КонецЕсли;
	
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("ХирургическиеОперацииШапка"));
	
	Если СсылкаНаОбъект.ХирургическиеОперации.Количество() = 0 Тогда
		ТабДокумент.Вывести(Макет.ПолучитьОбласть("ХирургическиеОперацииПустаяСтрока"));
	Иначе
		ОбластьСтрокаХирургическойОперации = Макет.ПолучитьОбласть("ХирургическиеОперацииСтрока");
		Для Каждого ХирургическаяОперация Из СсылкаНаОбъект.ХирургическиеОперации Цикл
			
			ВидАнестезии = "";
			Если ЗначениеЗаполнено(ХирургическаяОперация.Анестезия) Тогда
				Если ЗначениеЗаполнено(ХирургическаяОперация.Анестезия.НаименованиеПолное) Тогда
					ВидАнестезии = ХирургическаяОперация.Анестезия.НаименованиеПолное;
				Иначе
					ВидАнестезии = ХирургическаяОперация.Анестезия.Наименование;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ХирургическаяОперация.Анестезия2) Тогда
				Если ЗначениеЗаполнено(ХирургическаяОперация.Анестезия.НаименованиеПолное) Тогда
					ВидАнестезии2 =  ХирургическаяОперация.Анестезия2.НаименованиеПолное;
				Иначе
					ВидАнестезии2 = ХирургическаяОперация.Анестезия2.Наименование;
				КонецЕсли;
				ВидАнестезии = ВидАнестезии + ?(ЗначениеЗаполнено(ВидАнестезии), ", ", "") + ВидАнестезии2; 
			КонецЕсли;
			
			КодОтделения = "";
			Если ЗначениеЗаполнено(ХирургическаяОперация.Отделение)
				И ТипЗнч(ХирургическаяОперация.Отделение) = Тип("СправочникСсылка.Подразделения")
			Тогда
				КодОтделения = ХирургическаяОперация.Отделение.КодОтделения; // TODO
			КонецЕсли;
			
			НаименованиеОперации = "";
			НМУОперации = Справочники.НоменклатураМедицинскихУслуг.ПустаяСсылка();
			
			Если ЗначениеЗаполнено(ХирургическаяОперация.Операция) Тогда
				
				Если ТипЗнч(ХирургическаяОперация.Операция) = Тип("СправочникСсылка.Номенклатура") Тогда
					НМУОперации = ХирургическаяОперация.Операция.НоменклатураМедицинскихУслуг;
				Иначе
					НМУОперации = ХирургическаяОперация.Операция;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(НМУОперации.ПолноеНаименование) Тогда
					НаименованиеОперации = НМУОперации.ПолноеНаименование;
				Иначе
					НаименованиеОперации = НМУОперации.Наименование;
				КонецЕсли;
				
			КонецЕсли;
			
			ОперацияОсложнение = ХирургическаяОперация.Осложнение;
			Если ЗначениеЗаполнено(ОперацияОсложнение.НаименованиеПолное) Тогда
				НаименованиеОсложнения = ОперацияОсложнение.НаименованиеПолное;
			Иначе
				НаименованиеОсложнения = ОперацияОсложнение.Наименование;
			КонецЕсли;
			
			ОбластьСтрокаХирургическойОперации.Параметры.ВидАнестезии = ВидАнестезии;
			ОбластьСтрокаХирургическойОперации.Параметры.ДатаОперации = Формат(ХирургическаяОперация.ДатаОперации, "ДФ='dd.MM.yyyy ЧЧ:мм'");
			ОбластьСтрокаХирургическойОперации.Параметры.ИспользованиеКриог = ХирургическаяОперация.ИспользованиеКриог;
			ОбластьСтрокаХирургическойОперации.Параметры.ИспользованиеЛазер = ХирургическаяОперация.ИспользованиеЛазер;
			ОбластьСтрокаХирургическойОперации.Параметры.ИспользованиеРентген = ХирургическаяОперация.ИспользованиеРентген;
			ОбластьСтрокаХирургическойОперации.Параметры.ИспользованиеЭнд = ХирургическаяОперация.ИспользованиеЭнд;
			ОбластьСтрокаХирургическойОперации.Параметры.КодОперации = НМУОперации.Код;
			ОбластьСтрокаХирургическойОперации.Параметры.НаименованиеОперации = НаименованиеОперации;
			ОбластьСтрокаХирургическойОперации.Параметры.НаименованиеОсложнения = НаименованиеОсложнения;
			ОбластьСтрокаХирургическойОперации.Параметры.КодОсложнения = ОперацияОсложнение.КодДиагноза;
			ОбластьСтрокаХирургическойОперации.Параметры.КодОтделения = КодОтделения;
			ОбластьСтрокаХирургическойОперации.Параметры.ФИОХирурга = ОбщегоНазначения.ФИОФизЛица(ХирургическаяОперация.Хирург);
			
			ТабДокумент.Вывести(ОбластьСтрокаХирургическойОперации);
		КонецЦикла;
	КонецЕсли;
	
	ОбластьСтраница2 = Макет.ПолучитьОбласть("Страница2");
	ОбластьСтраница2.Область("ЭЦПЛечащегоВрача").Расшифровка = "ЭЦПЛечащегоВрача";
	ОбластьСтраница2.Область("ЭЦПЗаведующего").Расшифровка = "ЭЦПЗаведующего";
	
	ПатологоанатомическиеДиагнозы = Новый Массив;
	ПатологоанатомическиеДиагнозы.Добавить(Новый Структура("Диагноз, Параметр", СсылкаНаОбъект.ДиагнозПатологоанатомический, "ДиагнозПатологоанатомический"));
	ПатологоанатомическиеДиагнозы.Добавить(Новый Структура("Диагноз, Параметр", СсылкаНаОбъект.Осложнение,					 "ОсложнениеПаталогоанатомическое"));
	ПатологоанатомическиеДиагнозы.Добавить(Новый Структура("Диагноз, Параметр", СсылкаНаОбъект.ВнешняяПричина,				 "ВнешняяПричинаПаталогоанатомическая"));
	ПатологоанатомическиеДиагнозы.Добавить(Новый Структура("Диагноз, Параметр", СсылкаНаОбъект.СопутствующееЗаболевание,	 "СопутствующееЗаболеваниеПаталогоанатомическое"));
	
	Для Каждого СтруктураДиагноза Из ПатологоанатомическиеДиагнозы Цикл
		Если Не ЗначениеЗаполнено(СтруктураДиагноза.Диагноз) Тогда
			Продолжить;
		КонецЕсли;
		НаименованиеДиагноза = ?(ПустаяСтрока(СтруктураДиагноза.Диагноз.НаименованиеПолное), СтруктураДиагноза.Диагноз.Наименование, СтруктураДиагноза.Диагноз.НаименованиеПолное);
		ЗначенияПараметров.Вставить(СтруктураДиагноза.Параметр, НаименованиеДиагноза);
		ЗначенияПараметров.Вставить(СтрШаблон("Код%1", СтруктураДиагноза.Параметр), СтруктураДиагноза.Диагноз.КодДиагноза);
	КонецЦикла;
	
	ЗначенияПараметров.Вставить("ДополнительныеСведенияОЗаболеванииПаталогоанатомическом", СсылкаНаОбъект.ДополнительныеСведенияОЗаболеванииПаталогоанатомическом);
	
	ЗначенияПараметров.Вставить("ОбследованиеВИЧ",		Формат(СсылкаНаОбъект.ОбследованAIDS2,		"БЛ=Нет; БИ=Да"));
	ЗначенияПараметров.Вставить("ОбследованиеГепатиты",	Формат(СсылкаНаОбъект.ОбследованГепатиты,	"БЛ=Нет; БИ=Да"));
	ЗначенияПараметров.Вставить("ОбследованиеСифилис",	Формат(СсылкаНаОбъект.ОбследованСифилис,	"БЛ=Нет; БИ=Да"));
	
	МедицинскаяДеятельность.ЗаполнитьОбластьМедкартыПараметрами(ОбластьСтраница2, ЗначенияПараметров, ЗначенияВычисляемыхПараметров);
	ТабДокумент.Вывести(ОбластьСтраница2);
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ДокументДо530н(Ссылка)
	
	Возврат Ссылка.Дата <= Дата530н();
	
КонецФункции

Функция Дата530н() Экспорт
	
	Возврат Дата(2023, 3, 1);
	
КонецФункции

Процедура УстановитьШтампыЭЦП(ТабДок, СсылкаНаОбъект)
	
	ОбластьЭЦП = ПолучитьМакет("Форма066у_530н").ПолучитьОбласть("ЭЦП");
	
	ПараметрыРасшифровокПоРолям = Новый Соответствие;
	ПараметрыРасшифровокПоРолям.Вставить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(18, "РолиПриПодписиМедДокументов"), "ЭЦПЛечащегоВрача");
	ПараметрыРасшифровокПоРолям.Вставить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(5, "РолиПриПодписиМедДокументов"), "ЭЦПЗаведующего");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РолиИПодписиЭМД.РольПодписи КАК РольПодписи,
		|	ЭлектронныеПодписи.Сертификат КАК Сертификат,
		|	ЭлектронныеПодписи.ДатаПодписи КАК ДатаПодписи
		|ИЗ
		|	РегистрСведений.ЭлектронныеПодписи КАК ЭлектронныеПодписи
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РолиИПодписиЭМД КАК РолиИПодписиЭМД
		|		ПО (РолиИПодписиЭМД.Документ = &Документ)
		|			И (РолиИПодписиЭМД.УИД_ЭЦП = ЭлектронныеПодписи.УникальныйИдентификатор)";
	
	Запрос.УстановитьПараметр("Документ", СсылкаНаОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеПараметровРасшифровок = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		
		ПараметрРасшифровки = ПараметрыРасшифровокПоРолям.Получить(Выборка.РольПодписи);
		Если ПараметрРасшифровки <> Неопределено Тогда
			ДанныеПараметровРасшифровок.Вставить(ПараметрРасшифровки, ЭЦП_УМЦ_Сервер.ПолучитьДанныеСертификата(Выборка.Сертификат, СсылкаНаОбъект, Выборка.ДатаПодписи));
		КонецЕсли;
	КонецЦикла;
	
	Области = Новый Массив;
	Для Строка = 1 По ТабДок.ВысотаТаблицы Цикл
		Для Колонка = 1 По ТабДок.ШиринаТаблицы Цикл
			ТекОбласть = ТабДок.Область(Строка, Колонка);
			
			Если Области.Найти(ТекОбласть.Имя) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Области.Добавить(ТекОбласть.Имя);
			
			Если ЗначениеЗаполнено(ТекОбласть.Расшифровка) Тогда
				
				ДанныеПодписи = ДанныеПараметровРасшифровок.Получить(ТекОбласть.Расшифровка);
				Если ДанныеПодписи <> Неопределено Тогда
					ЗаполнитьЗначенияСвойств(ОбластьЭЦП.Параметры, ДанныеПодписи);
					ТабДокЭЦП = Новый ТабличныйДокумент;
					ТабДокЭЦП.Вывести(ОбластьЭЦП);
					ТабДок.ВставитьОбласть(ТабДокЭЦП.Области[0], ТекОбласть);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти