Процедура УстановитьОбщиеНастройки(АдресСервераЛицензий, ИспользоватьПроксиСервер, ПолучатьЛицензиюПриЗапуске, ПулыЛицензий, НастройкамиУправляетОблачныйХостер) Экспорт
	Настройки = сл2_Сервер.TClientSettings(Истина);
	Настройки.АдресСервераЛицензий = АдресСервераЛицензий;
	Настройки.ИспользоватьПроксиСервер = ИспользоватьПроксиСервер;
	Настройки.ПолучатьЛицензиюПриЗапуске = ПолучатьЛицензиюПриЗапуске;
	Настройки.ОпределенныйПулЛицензий = ЗначениеЗаполнено(ПулыЛицензий);
	Настройки.ПулыЛицензий = ПулыЛицензий;
	Настройки.НастройкамиУправляетОблачныйХостер = НастройкамиУправляетОблачныйХостер;
	сл2_Сервер.УстановитьОбщиеНастройки(Настройки);
КонецПроцедуры
