
#Область ФормированиеДанныхДляПриложения

Функция ПолучитьСтрокуОчисткиПриложения() Экспорт
	
	Возврат "<Tooths><Tooth><ToothInfo>-</ToothInfo></Tooth>";
	
КонецФункции

#КонецОбласти

#Область ФормированиеДанныхДляПриложенияJS

Функция ПолучитьСтрокуОчисткиПриложенияJSON() Экспорт 
	
	СтруктураJSON = Новый Структура("elements", Новый Массив);
	СтруктураJSON.elements.Добавить(Новый Структура("operation", "-"));
	Возврат ОбщегоНазначенияКлиентСерверПереопределяемый.СформироватьСтрокуJSON(СтруктураJSON);
	
КонецФункции

#КонецОбласти

#Область РаботаВФорме

#Область Инициализация

Функция ПолучитьСтруктуруДанныхЗК(ИмяЭлемента = "") Экспорт 
	
	СтруктураЗК = Новый Структура;
	
	// Основная карта
	СтруктураЗК.Вставить("ИмяЭлемента", ИмяЭлемента);
	СтруктураЗК.Вставить("Адрес", "");
	СтруктураЗК.Вставить("СтруктураЗагружена", Ложь);	
	СтруктураЗК.Вставить("ПриложениеЗагружено", Ложь);
	СтруктураЗК.Вставить("ВыделенныеЗубыСегменты", Новый Массив);
	СтруктураЗК.Вставить("СписокВыбораЗубов", Новый СписокЗначений);
	СтруктураЗК.Вставить("ДатаПоследнейАкутализации", Неопределено);
	
	// Параметры зубов
	СтруктураПЗ = Новый Структура;
	СтруктураПЗ.Вставить("Используется", Ложь);
	СтруктураПЗ.Вставить("Загружены", Ложь);
	СтруктураПЗ.Вставить("РеквизитыЗагружены", Ложь);
	СтруктураПЗ.Вставить("НеВызыватьОбработчикСворачиванияРазворачивания", Ложь);
	СтруктураЗК.Вставить("ПараметрыЗубов", СтруктураПЗ);
	
	// История зубов
	СтруктураИЗ = Новый Структура;
	СтруктураИЗ.Вставить("Используется", Ложь);
	СтруктураИЗ.Вставить("Загружена", Ложь);
	СтруктураИЗ.Вставить("ИмяЭлемента", "");
	СтруктураИЗ.Вставить("Адрес", "");
	СтруктураИЗ.Вставить("СтруктураЗагружена", Ложь);
	СтруктураИЗ.Вставить("ПриложениеЗагружено", Ложь);
	СтруктураИЗ.Вставить("ВыбраннаяДата");
	СтруктураИЗ.Вставить("ДоступныеДаты", Новый Соответствие);
	СтруктураЗК.Вставить("ИсторияЗубов", СтруктураИЗ);
	
	Возврат СтруктураЗК;
	
КонецФункции

&НаКлиенте
Функция ИнициализироватьЗубнуюКарту(Форма, ИмяРеквизита = "стомЗубнаяКартаHTML") Экспорт 
	
	// TODO: не нужно?
	//Объект = Форма.Объект;
	//Элементы = Форма.Элементы;
	//ЭтоФормаПриема = (ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.Прием"));
	//
	//стомКомпонентыКлиент.ИнициализацияПриложенияЗубнойКарты(Форма[ИмяРеквизита]);
	//
	//Если ЭтоФормаПриема Тогда 
	//	Элементы.стомДиагнозы.ТолькоПросмотр = Истина;
	//КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область РаботаСоСпискамиДоступныхСостоянийВариантов

Процедура ЗаполнитьДеревоДоступныхСостояний(ДоступныеСостояния, ДанныеФормыДерево) Экспорт 

	СписокСостояний = ДанныеФормыДерево.ПолучитьЭлементы();
	СписокСостояний.Очистить();
	
	Для Каждого СтруктураСостояние Из ДоступныеСостояния Цикл
		
		СтрокаСостояние = СписокСостояний.Добавить();
		СтрокаСостояние.СостояниеСегмент = СтруктураСостояние.Состояние;
		СтрокаСостояние.Состояние = СтруктураСостояние.Состояние;
		СтрокаСостояние.УстановленоДетей = СтруктураСостояние.ВыбраноСегментов;
		
		СписокСегментов = СтрокаСостояние.ПолучитьЭлементы();
		Для Каждого ВыделенныйСегмент Из СтруктураСостояние.Сегменты Цикл
			
			СтрокаСегмент = СписокСегментов.Добавить();
			СтрокаСегмент.Состояние = СтруктураСостояние.Состояние;
			СтрокаСегмент.СостояниеСегмент = ВыделенныйСегмент.СегментВЗубе;
			СтрокаСегмент.ЗубВКарте = ВыделенныйСегмент.ЗубВКарте;
			СтрокаСегмент.СегментВЗубе = ВыделенныйСегмент.СегментВЗубе;
			СтрокаСегмент.Установлено = ?(ВыделенныйСегмент.Выбран, 1, 0);
			
		КонецЦикла;
		
		Если СтрокаСостояние.УстановленоДетей > 0 Тогда 
			СтрокаСостояние.Установлено = ?(СтрокаСостояние.УстановленоДетей = СтруктураСостояние.КоличествоСегментов, 1, 2);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДеревоДоступныхВариантов(ДоступныеВарианты, ДанныеФормыДерево) Экспорт 

	СписокВариантов = ДанныеФормыДерево.ПолучитьЭлементы();
	СписокВариантов.Очистить();
	
	Для Каждого СтруктураВариант Из ДоступныеВарианты Цикл
		
		СтрокаВариант = СписокВариантов.Добавить();
		СтрокаВариант.ВариантОбластьЗуб = СтруктураВариант.Вариант;
		СтрокаВариант.Вариант = СтруктураВариант.Вариант;
		СтрокаВариант.Основной = СтруктураВариант.Основной;
		СтрокаВариант.Конструкция = СтруктураВариант.Конструкция;
		СтрокаВариант.УстановленоДетей = 0;
		
		Если СтрокаВариант.Основной Тогда
			
			СписокЗубов = СтрокаВариант.ПолучитьЭлементы();
			Для Каждого ВыделенныйЗуб Из СтруктураВариант.Зубы Цикл
				СтрокаЗуб = СписокЗубов.Добавить();
				СтрокаЗуб.Вариант = СтруктураВариант.Вариант;
				СтрокаЗуб.ВариантОбластьЗуб = ВыделенныйЗуб.ЗубВКарте;
				СтрокаЗуб.ЗубВКарте = ВыделенныйЗуб.ЗубВКарте;
				СтрокаЗуб.Установлено = ?(ВыделенныйЗуб.Выбран, 1, 0);
				СтрокаВариант.УстановленоДетей = СтрокаВариант.УстановленоДетей + СтрокаЗуб.Установлено; 
			КонецЦикла;
			
			Если СтрокаВариант.УстановленоДетей > 0 Тогда 
				СтрокаВариант.Установлено = ?(СтрокаВариант.УстановленоДетей = СписокЗубов.Количество(), 1, 2);
			КонецЕсли
			
		Иначе				
			
			СписокОбластей = СтрокаВариант.ПолучитьЭлементы();
			Для Каждого СтруктураОбласть Из СтруктураВариант.Области Цикл
				
				СтрокаОбласть = СписокОбластей.Добавить();
				СтрокаОбласть.ВариантОбластьЗуб = СтруктураОбласть.Область;
				СтрокаОбласть.Вариант = СтруктураВариант.Вариант;
				СтрокаОбласть.Область = СтруктураОбласть.Область;
				СтрокаОбласть.Конструкция = СтруктураОбласть.Конструкция;
				СтрокаОбласть.УстановленоДетей = СтруктураОбласть.ВыбраноЗубов;
				
				СписокЗубов = СтрокаОбласть.ПолучитьЭлементы();
				Для Каждого ВыделенныйЗуб Из СтруктураОбласть.Зубы Цикл
					СтрокаЗуб = СписокЗубов.Добавить();
					СтрокаЗуб.ВариантОбластьЗуб = ВыделенныйЗуб.ЗубВКарте;
					СтрокаЗуб.Вариант = СтруктураВариант.Вариант;
					СтрокаЗуб.Область = СтруктураОбласть.Область;
					СтрокаЗуб.Конструкция = СтруктураОбласть.Конструкция;
					СтрокаЗуб.ЗубВКарте = ВыделенныйЗуб.ЗубВКарте;
					СтрокаЗуб.Установлено = ?(ВыделенныйЗуб.Выбран, 1, 0);
				КонецЦикла;
				
				Если СтрокаОбласть.УстановленоДетей > 0 Тогда 
					СтрокаОбласть.Установлено = ?(СтрокаОбласть.УстановленоДетей = СписокЗубов.Количество(), 1, 2);
				КонецЕсли;
				
				Если СтрокаОбласть.Установлено = 1 Тогда 
					СтрокаВариант.УстановленоДетей = СтрокаВариант.УстановленоДетей + 1;
				ИначеЕсли СтрокаОбласть.Установлено = 2 Тогда 
					СтрокаВариант.УстановленоДетей = СтрокаВариант.УстановленоДетей + 0.5;
				КонецЕсли;
				
			КонецЦикла;
			
			Если СтрокаВариант.УстановленоДетей > 0 Тогда 
				СтрокаВариант.Установлено = ?(СтрокаВариант.УстановленоДетей = СписокОбластей.Количество(), 1, 2);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановкаСнятиеСостоянияВДереве(Форма, ДоступныеСостояния, СтрокаДерева) Экспорт
	
	ДанныеЗК = Форма.стомДанныеЗубныхКарт;
	Если ДанныеЗК = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеЗК.СтруктураЗагружена Тогда 
		Возврат;
	КонецЕсли;
	
	Если СтрокаДерева.Установлено = 2 Тогда
		СтрокаДерева.Установлено = 0;
	КонецЕсли;
	ЭтоУстановка = (СтрокаДерева.Установлено = 1);
	
	ЗубыСегменты = Новый Массив;
	СоответствиеСтрокЗубов = Новый Соответствие;
	
	// Определяем уровень кликнутого
	Родитель = СтрокаДерева.ПолучитьРодителя();
	Если Родитель = Неопределено Тогда // Кликнули по состоянию
		Для Каждого СтрокаСегмент Из СтрокаДерева.ПолучитьЭлементы() Цикл
			СтруктураЗуб = СоответствиеСтрокЗубов.Получить(СтрокаСегмент.ЗубВКарте);
			Если СтруктураЗуб = Неопределено Тогда
				СтруктураЗуб = Новый Структура("ЗубВКарте, Сегменты", СтрокаСегмент.ЗубВКарте, Новый Массив);
				СоответствиеСтрокЗубов.Вставить("ЗубВКарте", СтруктураЗуб);
				ЗубыСегменты.Добавить(СтруктураЗуб);
			КонецЕсли;
			СтруктураЗуб.Сегменты.Добавить(СтрокаСегмент.СостояниеСегмент.УникальныйИдентификатор());
		КонецЦикла;
	Иначе // Кликнули по сегменту, может быть только один зуб и одно состояние
		СтруктураЗуб = Новый Структура("ЗубВКарте, Сегменты", СтрокаДерева.ЗубВКарте, Новый Массив);
		ЗубыСегменты.Добавить(СтруктураЗуб);
		СтруктураЗуб.Сегменты.Добавить(СтрокаДерева.СостояниеСегмент.УникальныйИдентификатор());
	КонецЕсли; 
	
	ОбщегоНазначенияКлиентСерверПереопределяемый.ПересчитатьФлажкиВДереве(СтрокаДерева);
	
	Если ЭтоУстановка Тогда  
		стомЗубнаяКартаМетоды.УстановитьСостояниеЗубам(ДанныеЗК.Адрес, ЗубыСегменты, СтрокаДерева.Состояние);
	Иначе
		стомЗубнаяКартаМетоды.СнятьСостояниеЗубам(ДанныеЗК.Адрес, ЗубыСегменты, СтрокаДерева.Состояние);
	КонецЕсли;
	
	#Если Клиент Тогда
	Если ДанныеЗК.ПриложениеЗагружено Тогда
		ДанныеДляОбновления = Новый Структура;
		ДанныеДляОбновления.Вставить("СтруктураАдресЗК", ДанныеЗК.Адрес);
		ДанныеДляОбновления.Вставить("ЗубыСегменты", ЗубыСегменты);
		
		стомКомпонентыКлиент.ОбновитьСостоянияЗубовПриложения(Форма.Элементы[ДанныеЗК.ИмяЭлемента], ДанныеДляОбновления); 
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Процедура УстановкаСнятиеВариантаВДереве(Форма, ДоступныеВарианты, СтрокаДерева) Экспорт
	
	ДанныеЗК = Форма.стомДанныеЗубныхКарт;
	Если ДанныеЗК = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеЗК.СтруктураЗагружена Тогда 
		Возврат;
	КонецЕсли;
	
	ВариантЗуба = Неопределено;
	Область = Неопределено;
	Зубы = Новый Массив;
	ЭтоКонструкция = СтрокаДерева.Конструкция;
		
	Если СтрокаДерева.Установлено = 2 Тогда
		СтрокаДерева.Установлено = 0;
	КонецЕсли;
	ЭтоУстановка = (СтрокаДерева.Установлено = 1);
	
	Если ТипЗнч(СтрокаДерева.ВариантОбластьЗуб) = Тип("СправочникСсылка.стомВариантыЗубов") Тогда 
		ВариантЗуба = СтрокаДерева.Вариант;
		Если СтрокаДерева.Основной Тогда // Основной вариант не содержит областей
			Если СтрокаДерева.Установлено = 0 Тогда // Снять основной нельзя
				ОбщегоНазначенияКлиентСерверПереопределяемый.ПересчитатьФлажкиВДеревеРекурсивноВверх(СтрокаДерева);
				Возврат;
			КонецЕсли;
			Для Каждого СтрокаЗуб Из СтрокаДерева.ПолучитьЭлементы() Цикл
				Зубы.Добавить(СтрокаЗуб.ЗубВКарте);
			КонецЦикла;
		Иначе
			Для Каждого СтрокаВариант Из СтрокаДерева.ПолучитьЭлементы() Цикл
				Для Каждого СтрокаЗуб Из СтрокаВариант.ПолучитьЭлементы() Цикл
					Если Зубы.Найти(СтрокаЗуб.ЗубВКарте) = Неопределено Тогда 
						Зубы.Добавить(СтрокаЗуб.ЗубВКарте);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнч(СтрокаДерева.ВариантОбластьЗуб) = Тип("СправочникСсылка.стомОбластиСегментов") Тогда
		ВариантЗуба = СтрокаДерева.Вариант;
		Область = СтрокаДерева.Область;
		Для Каждого СтрокаЗуб Из СтрокаДерева.ПолучитьЭлементы() Цикл
			Зубы.Добавить(СтрокаЗуб.ЗубВКарте);
		КонецЦикла;
	ИначеЕсли ТипЗнч(СтрокаДерева.ВариантОбластьЗуб) = Тип("СправочникСсылка.стомЗубыКарты") Тогда 
		Если СтрокаДерева.ПолучитьРодителя().Основной Тогда 
			Если СтрокаДерева.Установлено = 0 Тогда // Снять основной нельзя
				ОбщегоНазначенияКлиентСерверПереопределяемый.ПересчитатьФлажкиВДеревеРекурсивноВверх(СтрокаДерева);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		ВариантЗуба = СтрокаДерева.Вариант;
		Если ЗначениеЗаполнено(СтрокаДерева.Область) Тогда 
			Область = СтрокаДерева.Область;
		КонецЕсли;
		Зубы.Добавить(СтрокаДерева.ЗубВКарте);
	КонецЕсли;	
	
	Если ЭтоКонструкция Тогда
		Если ЭтоУстановка Тогда 
			ДанныеКонструкций = стомЗубнаяКартаМетоды.УстановитьКонструкцию(ДанныеЗК.Адрес, Зубы, ВариантЗуба, Область);
		Иначе
			ДанныеКонструкций = стомЗубнаяКартаМетоды.СнятьКонструкцию(ДанныеЗК.Адрес, Зубы, ВариантЗуба, Область);
		КонецЕсли;
		Если ДанныеКонструкций.Свойство("ОписаниеОшибки") Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ДанныеКонструкций.ОписаниеОшибки);
		Иначе	
			ДанныеЗК.ВыделенныеЗубыСегменты = ДанныеКонструкций.ВыделенныеЗубыСегменты;
			стомЗубнаяКартаМетодыКлиентСервер.ОбновитьСписокКонструкций(Форма.стомУстановленныеКонструкции, ДанныеКонструкций.Конструкции);
		КонецЕсли;
	Иначе
		Если ЭтоУстановка Тогда 
			ДанныеЗК.ВыделенныеЗубыСегменты = стомЗубнаяКартаМетоды.УстановитьВариант(ДанныеЗК.Адрес, Зубы, ВариантЗуба, Область);
		Иначе
			ДанныеЗК.ВыделенныеЗубыСегменты = стомЗубнаяКартаМетоды.СнятьВариант(ДанныеЗК.Адрес, Зубы, ВариантЗуба, Область);
		КонецЕсли;
	КонецЕсли;
	
	ДанныеЗК.СписокВыбораЗубов = стомЗубнаяКартаМетоды.ПолучитьСписокВыбораЗубов(ДанныеЗК.Адрес);
	
	#Если Клиент Тогда
	Если ДанныеЗК.ПриложениеЗагружено Тогда
		стомКомпонентыКлиент.ОбновитьВариантыЗубовПриложения(Форма.Элементы[ДанныеЗК.ИмяЭлемента], ДанныеЗК.Адрес);
	КонецЕсли;
	#КонецЕсли
	
КонецПроцедуры

Процедура ОбновитьСписокКонструкций(СписокКонструкций, ИзмененныеКонструкции) Экспорт
	
	Для Каждого СтруктураКонструкция Из ИзмененныеКонструкции Цикл
		
		// Ищем существующую строку
		СтрокиКонструкции = СписокКонструкций.НайтиСтроки(Новый Структура("Идентификатор", Строка(СтруктураКонструкция.Идентификатор)));
		Если СтрокиКонструкции.Количество() = 0 Тогда
			
			// Если конструкцию удалили, не успев создать ссылку, ничего делать не нужно
			Если СтруктураКонструкция.Удалена И СтруктураКонструкция.НеСоздана Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаКонструкции = СписокКонструкций.Добавить();
			СтрокаКонструкции.КонструкцияОбласть	= СтруктураКонструкция.Область;
			СтрокаКонструкции.Обозначение			= СтруктураКонструкция.Обозначение;
			СтрокаКонструкции.Идентификатор			= Строка(СтруктураКонструкция.Идентификатор);
			СтрокаКонструкции.Конструкция			= СтруктураКонструкция.Конструкция;
			СтрокаКонструкции.СоставЗубовСтрокой	= СтруктураКонструкция.СоставЗубовСтрокой;
			СтрокаКонструкции.Комментарий			= СтруктураКонструкция.Комментарий;
			СтрокаКонструкции.НеСоздана				= СтруктураКонструкция.НеСоздана;
			СтрокаКонструкции.Удалена				= СтруктураКонструкция.Удалена;
			
		Иначе
			СтрокаКонструкции = СтрокиКонструкции[0];
		КонецЕсли;
		
		// Обновляем реквизиты
		СтрокаКонструкции.НеСоздана	= СтруктураКонструкция.НеСоздана;
		СтрокаКонструкции.Удалена	= СтруктураКонструкция.Удалена;
		
	КонецЦикла;
		
КонецПроцедуры

Функция СохранитьТекщуюСтрокуТаблицыФормы(Элемент, Колонки) Экспорт
	
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура(Колонки);
	ЗаполнитьЗначенияСвойств(СтруктураОтбора, ТекДанные);
	Возврат СтруктураОтбора;
	
КонецФункции

Процедура ВосстановитьТекущуюСтрокуТаблицыФормы(Элемент, ТаблицаФормы, Отбор) Экспорт 
	
	Если Отбор = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекСтрока = Неопределено;
	Если ТипЗнч(ТаблицаФормы) = Тип("ДанныеФормыДерево") Тогда
		НайденнаяСтрока = ОбщегоНазначенияКлиентСерверПереопределяемый.НайтиСтрокиВДеревеФормы(ТаблицаФормы, Отбор, Истина);
		Если НайденнаяСтрока <> Неопределено Тогда 
			ТекСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
	Иначе
		НайденныеСтроки = ТаблицаФормы.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда 
			ТекСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
	Если ТекСтрока <> Неопределено Тогда 
		Элемент.ТекущаяСтрока = ТекСтрока;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
