#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//////////////////////////////////////////////////////////
	//омг  
	СоздаватьДвижения = Истина;
	Если омг_ВидОплаты = Перечисления.омг_ВидыОплаты.Предоплата Тогда
		СтатусыОплаты = омг_Предоплата.ВернутьСтатусОплаты(ЭтотОбъект.Ссылка);
		Если ЗначениеЗаполнено(СтатусыОплаты) Тогда
			Если не СтатусыОплаты.Статус = Перечисления.омг_СтатусыПредоплаты.ОплатаПринята Тогда
				СоздаватьДвижения = Ложь;	
			КонецЕсли;  
		иначе
			 СоздаватьДвижения = Ложь;
		КонецЕсли
	КонецЕсли;
	
	Если СоздаватьДвижения Тогда		
		РегистрыНакопления.ДвиженияДенежныхСредств.СформироватьДвиженияПоШапкеДокумента(Новый Структура("Дата, Касса, СуммаДокумента,СтатьяДвиженияДенежныхСредств",Дата,ЭквайринговыйТерминал,СуммаДокумента, СтатьяДвиженияДенежныхСредств),Движения.ДвиженияДенежныхСредств, Истина, Отказ);
		
		Движение = Движения.ВзаиморасчетыСКлиентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Сумма	= СуммаДокумента;
		
		// Комплексные расчеты в взиморасчетах с клиентами.
		Если Метаданные.Документы.Найти("КомплексныйРасчетКлиента") <> Неопределено
			И ЗначениеЗаполнено(ЭтотОбъект.Сделка)
			И ТипЗнч(ЭтотОбъект.Сделка) = Тип("ДокументСсылка.КомплексныйРасчетКлиента")
			И ОбщегоНазначения.ОбщийМодуль("КомплексныеРасчетыКлиентов").РасчетСОбособленнымУчетомВзаиморасчетов(ЭтотОбъект.Сделка)
			Тогда
			Движение.Сделка = ЭтотОбъект.Сделка;
		КонецЕсли;
		
		// Регистр "Оплаты".
		РаботаСДокументамиСервер.ДобавитьДвижениеПоРегиструОплаты(Движения.Оплаты, Дата, Клиент, Перечисления.ВидыОплаты.Безналичные, СуммаДокумента);
		
		// Документ коррекции дополнительно сторнирует движения если это требуется
		Если Коррекция Тогда	
			РаботаСДокументамиСервер.СторнироватьДвиженияПоРегистрамУПР(ЭтотОбъект, Отказ);	
		КонецЕсли;   
	КонецЕсли;
    
    НаборЗаписей = ЭтотОбъект.Движения.омг_ОстаткиПредоплаты;
 
    НаборЗаписей.Прочитать();
    НаборЗаписей.Очистить();
	
	СуммаПредоплаты = омг_Предоплата.ВернутьСуммуПредоплатыПоДокументу(ЭтотОбъект.Ссылка);
	Если СуммаПредоплаты > 0 Тогда
    НоваяЗапись = НаборЗаписей.Добавить();
    НоваяЗапись.Клиент = Клиент;
    НоваяЗапись.Сумма = СуммаПредоплаты;
    НоваяЗапись.Регистратор = Ссылка; 
    НоваяЗапись.ДокументПоступления = Ссылка;
    НоваяЗапись.Период = Дата;
    НаборЗаписей.Записать(Истина);
	КонецЕсли;	
	//омг
	////////////////////////////////////////////////////////

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	РаботаСДокументамиСервер.ДокументОплатыПроверитьСуммыКредитаККМПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи);	
	РаботаСДокументамиСервер.ПроверитьДанныеКоррекции(ЭтотОбъект, Отказ, РежимЗаписи);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	РаботаСДокументамиСервер.ОчиститьРеквизитыККМДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Метаданные.Документы.Найти("КомплексныйРасчетКлиента") <> Неопределено
		И ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КомплексныйРасчетКлиента")
		Тогда
		Клиент = ДанныеЗаполнения.Клиент;
		СуммаДокумента = КомплексныеРасчетыКлиентов.ВерятнаяСуммаДляОплатыРасчета(ДанныеЗаполнения);
		Сделка = ДанныеЗаполнения;
		
		НастройкаПечатиЧеков = МенеджерОборудованияВызовСервераПереопределяемый.ПолучитьНастройкуПечатиЧековФилиала(Филиал, Истина);	
		РаботаСДокументамиСервер.ДокументОплатыЗаполнитьРасчетыПоДолгуПоКомплексномуРасчетуСервер(Сделка, НастройкаПечатиЧеков, КредитныеДанные, СуммаДокумента);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ДокументОснование") 
		И ЗначениеЗаполнено(ДанныеЗаполнения.ДокументОснование) 
		И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ОказаниеУслуг") 
		Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		РаботаСДокументамиСервер.ОбработкаЗаполнения(ЭтотОбъект, ДокументОснование);
		
		///////////////////////////////////////////////////
		// ОМГ   
		СтрПоиска = Новый Структура;
		СтрПоиска.Вставить("ВидОплаты",Перечисления.ВидыОплаты.Безналичные);
		СтрокиБезнала = ДокументОснование.Оплата.НайтиСтроки(СтрПоиска);
		Если СтрокиБезнала.Количество() > 0 Тогда			
			ЭтотОбъект.ЭквайринговыйТерминал = СтрокиБезнала[0].ЭквайринговыйТерминал; 
		КонецЕсли;
		// ОМГ  
		///////////////////////////////////////////////////
		
		НастройкаПечатиЧеков = МенеджерОборудованияВызовСервераПереопределяемый.ПолучитьНастройкуПечатиЧековФилиала(Филиал, Истина);	
		РаботаСДокументамиСервер.ДокументОплатыЗаполнитьРасчетыПоДолгуПоОказаниюУслуг(ДокументОснование, НастройкаПечатиЧеков, КредитныеДанные, СуммаДокумента, СпособРасчетаЧекаККМ);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("Коррекция")
		И ДанныеЗаполнения.Коррекция 
		Тогда		
		РаботаСДокументамиСервер.ЗаполнитьДанныеДокументаКоррекцииПоОснованию(ЭтотОбъект, ДанныеЗаполнения);  
		////////////////////////////////////////////////// 
		// ОМГ   
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заявка") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заявка.Филиал КАК Филиал,
		|	Заявка.Клиент КАК Клиент,
		|	ЕСТЬNULL(омг_СуммыПредоплатыСрезПоследних.СуммаПредоплаты, 0) КАК СуммаДокумента,
		|	Заявка.Ссылка КАК ДокументОснование,
		|	ЗНАЧЕНИЕ(Перечисление.омг_ВидыОплаты.Предоплата) КАК омг_ВидОплаты,
		|	ЗНАЧЕНИЕ(Перечисление.омг_СтатусыПредоплаты.ОжиданиеОплаты) КАК омг_СтатусПредоплаты
		|ИЗ
		|	Документ.Заявка КАК Заявка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.омг_СуммыПредоплаты.СрезПоследних(&ДатаПредоплаты, ) КАК омг_СуммыПредоплатыСрезПоследних
		|		ПО Заявка.Филиал.Организация = омг_СуммыПредоплатыСрезПоследних.Организация
		|ГДЕ
		|	Заявка.Ссылка = &Основание";
		
		Запрос.УстановитьПараметр("ДатаПредоплаты", ТекущаяДата());
		Запрос.УстановитьПараметр("Основание", ДанныеЗаполнения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,ВыборкаДетальныеЗаписи);
			ЭтотОбъект.Дата = ТекущаяДата();
			Попытка 
				ЭтотОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;
		
	
		// ОМГ    
		/////////////////////////////////////////////////
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		РаботаСДокументамиСервер.ЗаполнитьУчастникаИИННДенежнойОперации(Клиент, ПринятоОт, ПринятоОтИНН, ПринятоОтАдрес);
	КонецЕсли;	
	
	НомерЧекаККМ = "";
	НомерЧекаЭТ = "";
	
КонецПроцедуры

#КонецОбласти
