
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Филиал = Параметры.Филиал;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеФилиалов = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ДополнительныеНастройкиИнтеграцииЛИС", "ДанныеФилиалов");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Не ДанныеФилиалов = Неопределено Тогда
		СведенияПоФилиалу = ДанныеФилиалов.Получить().Получить(Филиал);
		Если Не СведенияПоФилиалу = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ЭтаФорма, СведенияПоФилиалу,, "Пароль");
			Пароль = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеФилиалов = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ДополнительныеНастройкиИнтеграцииЛИС", "ДанныеФилиалов");
	
	Если Не ДанныеФилиалов = Неопределено Тогда
		СоответствиеФилиалов = ДанныеФилиалов.Получить();
	Иначе
		СоответствиеФилиалов = Новый Соответствие;
	КонецЕсли;
	
	СтруктураСведений = Новый Структура;
	РеквизитыФормы = ПолучитьРеквизиты();
	Для Каждого Реквизит Из РеквизитыФормы Цикл
		Если Реквизит.Имя = "Филиал"
			Или Реквизит.Имя = "ПарольИзменен" Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураСведений.Вставить(Реквизит.Имя, ЭтаФорма[Реквизит.Имя]);
	КонецЦикла;
	
	ИзначальнеСведения = СоответствиеФилиалов.Получить(Филиал);
	
	Если Не ИзначальнеСведения = Неопределено И Не ПарольИзменен Тогда
		СтруктураСведений.Пароль = ИзначальнеСведения.Пароль;
	КонецЕсли;
	
	СоответствиеФилиалов.Вставить(Филиал, СтруктураСведений);
	
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("омг_ДополнительныеНастройкиИнтеграцииЛИС", Новый ХранилищеЗначения(СоответствиеФилиалов), "ДанныеФилиалов");
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОКНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры
