
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Если Не РольДоступна("ПолныеПрава") Тогда 
		    		Филиал = ПолучитьФилиалПользователя();

			ОтборПоФилиалу = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборПоФилиалу.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Филиал");
			ОтборПоФилиалу.ПравоеЗначение = Филиал;
			ОтборПоФилиалу.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли; 

КонецПроцедуры


&НаСервере
Функция ПолучитьФилиалПользователя()
	НастройкаОрганизация = ПланыВидовХарактеристик.НастройкиПользователей.омг_ОсновнаяОрганизация;
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиПользователей.Значение КАК Организация
	               |ИЗ
	               |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	               |ГДЕ
	               |	НастройкиПользователей.Пользователь = &Пользователь
	               |	И НастройкиПользователей.Настройка = &НастройкаОрганизация";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("НастройкаОрганизация", НастройкаОрганизация);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
	    ОсновнаяОрганизация = Выборка.Организация
	КонецЕсли;
    Возврат ОсновнаяОрганизация;
		
КонецФункции
