
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предопределенный Тогда
		
		Элементы.ГруппаНаименованиеКод.ТолькоПросмотр = Истина;
		МассивДоступныеАналитики = Справочники.ПоказателиПланирования.ПолучитьДоступныеАналитикиПоказателяПланирования(Объект.Ссылка);
		МассивИспользуемыеАналитики = Справочники.ПоказателиПланирования.ПолучитьНаименованияАналитик();
		
		Для Каждого Аналитика Из МассивИспользуемыеАналитики Цикл
			ЭлементФормыУчет = Элементы.Найти("Учет_" + Аналитика);
			Если ЭлементФормыУчет <> Неопределено Тогда 
				ЭлементФормыУчет.Доступность = МассивДоступныеАналитики.Найти(Аналитика) <> Неопределено;
				ЭлементФормыОбязательный = Элементы.Найти("Обязательный_" + Аналитика);
				Если ЭлементФормыОбязательный <> Неопределено Тогда 
					ЭлементФормыОбязательный.Доступность = Объект["Учет_" + Аналитика];
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Элементы.СпособГруппировки.ТолькоПросмотр = Объект.СпособГруппировки = Справочники.ПоказателиПланирования.ПолучитьСпособГруппировки(Объект.Ссылка); 
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура Учет_СпециализацияПриИзменении(Элемент)
	
	УчетПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Обязательный_СпециализацияПриИзменении(Элемент)

	ОбязательныйПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура Учет_СотрудникПриИзменении(Элемент)
	
	УчетПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Обязательный_СотрудникПриИзменении(Элемент)

	ОбязательныйПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Учет_НоменклатураПриИзменении(Элемент)

	УчетПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Обязательный_НоменклатураПриИзменении(Элемент)

	ОбязательныйПриИзменении(Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УчетПриИзменении(Знач Элемент)
	
	Аналитика = СтрЗаменить(Элемент.Имя, "Учет_", "");

	Если Не Объект["Учет_" + Аналитика] И Объект["Обязательный_" + Аналитика] Тогда 
		Объект["Обязательный_" + Аналитика] = Ложь;	
	КонецЕсли;
	
	Если Объект.Предопределенный
		И Объект["Учет_" + Аналитика] 
	Тогда 
		Элементы["Обязательный_" + Аналитика].Доступность = Истина;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбязательныйПриИзменении(Знач Элемент)
	
	Аналитика = СтрЗаменить(Элемент.Имя, "Обязательный_", "");
	
	Если Не Объект["Учет_" + Аналитика] И Объект["Обязательный_" + Аналитика] Тогда 
		Объект["Учет_" + Аналитика] = Истина;	
	КонецЕсли;
	
КонецПроцедуры	

#КонецОбласти