
#Область СлужебныеПроцедурыИФункции

// Возвращает массив наименований используемых аналитик показателей планирования.
// 
// Возвращаемое значение:
//   Массив из Строка - наименования аналитик.
//
Функция ПолучитьНаименованияАналитик() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить("Специализация");
	Массив.Добавить("Сотрудник");
	Массив.Добавить("Номенклатура");
	
	Возврат Массив;
	
КонецФункции	

// Возвращает массив доступных аналитик для предопределенного показателя планирования.
//
// Параметры:
//  СправочникСсылка - СправочникСсылка.ПоказателиПланирования - предопределенный показатель планирования.
// 
// Возвращаемое значение:
//   Массив из Строка - наименования аналитик. 
//
Функция ПолучитьДоступныеАналитикиПоказателяПланирования(СправочникСсылка) Экспорт 
	
	Массив = Новый Массив;
		
	Если СправочникСсылка = Справочники.ПоказателиПланирования.СуммаПродаж
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоУслуг
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоНовыхПациентовПоСотруднику
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоПосещений	
		Или СправочникСсылка = Справочники.ПоказателиПланирования.СреднийЧекПоСотруднику	
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоОтработанныхЧасовПоТабелю	
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоНовыхПациентовПоНаправлению	Тогда
		
		Массив.Добавить("Сотрудник");			
	КонецЕсли;
	
	Если СправочникСсылка = Справочники.ПоказателиПланирования.СуммаПродаж
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоУслуг
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоНовыхПациентовПоНаправлению	
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоПациентовПоНаправлению	
		Или СправочникСсылка = Справочники.ПоказателиПланирования.СреднийЧекПоНаправлению Тогда
		
		Массив.Добавить("Специализация");			
	КонецЕсли;
	
	Если СправочникСсылка = Справочники.ПоказателиПланирования.СуммаПродаж
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоУслуг Тогда 
		
		Массив.Добавить("Номенклатура");			
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

// Возвращает вид расчета для предопределенного показателя планирования.
//
// Параметры:
//  СправочникСсылка - СправочникСсылка.ПоказателиПланирования - предопределенный показатель планирования.
// 
// Возвращаемое значение:
//   ПеречислениеСсылка.ВидыРасчетаПоказателяПланирования 
//
Функция ПолучитьСпособГруппировки(СправочникСсылка) Экспорт 
	
	Если СправочникСсылка = Справочники.ПоказателиПланирования.СуммаПродаж
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоУслуг
		Или СправочникСсылка = Справочники.ПоказателиПланирования.СуммаОплат
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоПациентовОбщее
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоНовыхПациентовПоСотруднику
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоПосещений	
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоОтработанныхЧасовПоТабелю	
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоНовыхПациентовПоНаправлению	
		Или СправочникСсылка = Справочники.ПоказателиПланирования.КоличествоПациентовПоНаправлению Тогда
	
		Возврат Перечисления.СпособыГруппировкиПоказателяПланирования.Сумма;
		
	ИначеЕсли СправочникСсылка = Справочники.ПоказателиПланирования.СреднийЧекОбщий
		Или СправочникСсылка = Справочники.ПоказателиПланирования.СреднийЧекПоСотруднику
		Или СправочникСсылка = Справочники.ПоказателиПланирования.СреднийЧекПоНаправлению
		Или СправочникСсылка = Справочники.ПоказателиПланирования.СредняяСуммаПродажНаСотрудника Тогда
	
		Возврат Перечисления.СпособыГруппировкиПоказателяПланирования.Среднее;
		
	КонецЕсли;
	
	Возврат Перечисления.СпособыГруппировкиПоказателяПланирования.Сумма;
	
КонецФункции

#КонецОбласти
