
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = Объект.Ссылка.Пустая();
	Если ЭтоНовый Тогда 
		Объект.ТипЗначения = Новый ОписаниеТипов("Строка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.ЗначениеПоУмолчанию = Объект.ТипЗначения.ПривестиЗначение(Объект.ЗначениеПоУмолчанию);
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура РегулировкаПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьДоступность()
	
	НастроитьВидимостьДоступностьПоТипам();
	
	РазрешенЗапретРучногоРедактирования = (Объект.Регулирование > 0);
	Объект.ЗапретРучногоРедактирования = Объект.ЗапретРучногоРедактирования И РазрешенЗапретРучногоРедактирования;
	Элементы.ЗапретРучногоРедактирования.Доступность = РазрешенЗапретРучногоРедактирования;
		
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьДоступностьПоТипам()
	
	Типы = Объект.ТипЗначения.Типы();
	Если Типы.Количество() <> 1 Тогда 
		Элементы.ГруппаНастройкиПоТипу.Видимость = Ложь;
		Объект.Регулирование = 0;
		Объект.ЗапретРучногоРедактирования = Ложь;
		Возврат;
	КонецЕсли;
	
	Тип = Типы[0];
	
	Для Каждого ГруппаНастроек Из Элементы.ГруппаНастройкиПоТипу.ПодчиненныеЭлементы Цикл
		ГруппаНастроек.Видимость = Ложь;
	КонецЦикла;
	
	Если Тип = Тип("Число") Тогда
		
		Элементы.ГруппаНастройкиЧисло.Видимость = Истина;
		
		Элементы.ЗначениеПоУмолчанию.МинимальноеЗначение = Объект.МинимальноеЗначение;
		Элементы.ЗначениеПоУмолчанию.МаксимальноеЗначение = Объект.МаксимальноеЗначение;
		
		Если Объект.МинимальноеЗначение <> 0 Или Объект.МаксимальноеЗначение <> 0 Тогда 
			Объект.ЗначениеПоУмолчанию = Макс(Объект.ЗначениеПоУмолчанию, Объект.МинимальноеЗначение);
			Объект.ЗначениеПоУмолчанию = Мин(Объект.ЗначениеПоУмолчанию, Объект.МаксимальноеЗначение);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФорматыПоТипу()
	
	Типы = Объект.ТипЗначения.Типы();
	Если Типы.Количество() <> 1 Тогда 
		Элементы.ГруппаНастройкиПоТипу.Видимость = Ложь;
		Объект.Регулирование = 0;
		Объект.ЗапретРучногоРедактирования = Ложь;
		Возврат;
	КонецЕсли;
	
	Тип = Типы[0];
	
	Если Тип = Тип("Число") Тогда
		
		Объект.ФорматПредставления = "ЧН=0";
		Объект.ФорматРедактирования = "ЧН=0";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФорматНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Элемент = Элементы.ФорматРедактирования Тогда
		ИмяРеквизита = "ФорматРедактирования";
	ИначеЕсли Элемент = Элементы.ФорматПредставления Тогда 
		ИмяРеквизита = "ФорматПредставления";
	Иначе
		Возврат;
	КонецЕсли;
	
	КонструкторФС = Новый КонструкторФорматнойСтроки;	
	КонструкторФС.Текст = Объект[ИмяРеквизита];
	
	Если КонструкторФС.ОткрытьМодально() Тогда 
		Объект[ИмяРеквизита] = КонструкторФС.Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	
	Объект.ЗначениеПоУмолчанию = Объект.ТипЗначения.ПривестиЗначение(Неопределено);
	НастроитьВидимостьДоступность();
	ЗаполнитьФорматыПоТипу();
		
КонецПроцедуры

&НаКлиенте
Процедура МинимальноеМаксимальноеЗначениеПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

