
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Период = НачалоМесяца(ТекущаяДата()); 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.ПолучениеФактическихДанных.ПроверитьЗаполнениеАналитик(ЭтотОбъект, "ФактическиеДанные", Отказ);
	
	Если НЕ Отказ Тогда

		Движения.ОборотыПоПланированию.Записывать = Истина;
		НаборДвижений = Движения.ОборотыПоПланированию;
		
		Для Каждого СтрокаФактическиеДанные Из ФактическиеДанные Цикл
		
			Движение = НаборДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, СтрокаФактическиеДанные);
			Движение.Период = Период;
			
		КонецЦикла; 
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
