&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовый = Объект.Ссылка.Пустая();
	
	Если ЭтоНовый Тогда
		Если Не ЗначениеЗаполнено(Объект.ВидОбласти) Тогда
			Объект.ВидОбласти = Перечисления.стомВидыОбластей.ОбластьЗуба;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбластиПриИзменении(Элемент)
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьДоступность()
	
	ЭтоЭлементКонструкции = 
		(Объект.ВидОбласти = ПредопределенноеЗначение("Перечисление.стомВидыОбластей.ЭлементКонструкции"));
	ЭтоКонструкция = 
		(Объект.ВидОбласти = ПредопределенноеЗначение("Перечисление.стомВидыОбластей.Конструкция"));
			
	Элементы.Декоративная.Видимость = Не ЭтоЭлементКонструкции;
	Элементы.Обозначение.Видимость = ЭтоКонструкция;
	Элементы.ГруппаКонструкции.Видимость = ЭтоКонструкция;
	Элементы.ГруппаСостояния.Видимость = Не ЭтоЭлементКонструкции;
	Элементы.ГруппаПараметры.Видимость = Не ЭтоЭлементКонструкции;
	Элементы.КонструкцияРодитель.Видимость = ЭтоЭлементКонструкции;
	Элементы.ВидОбласти.ТолькоПросмотр = ЭтоЭлементКонструкции;
	
КонецПроцедуры

&НаКлиенте
Процедура КонструкцииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не РаботаСДиалогамиКлиент.ЗаписатьНовыйОбъектВФорме(ЭтаФорма) Тогда 
		Возврат;
	КонецЕсли;
	
	ОтборФормы = Новый Структура;
	ОтборФормы.Вставить("ВидОбласти", ПредопределенноеЗначение("Перечисление.стомВидыОбластей.ЭлементКонструкции"));
	ОтборФормы.Вставить("КонструкцияРодитель", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", ОтборФормы);
	
	ОткрытьФорму("Справочник.стомОбластиСегментов.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

