#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Если Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма107_1_у")
			И Не ЗначениеЗаполнено(Объект.Срок)
		Тогда
			Объект.Срок = 2;
		КонецЕсли;
		
		Объект.Срочность = "нет";
		
		Если Не ЗначениеЗаполнено(Объект.Взрослый)
			И ЗначениеЗаполнено(Объект.Клиент)
		Тогда
			Объект.Взрослый = ОпределитьВзрослыйДетский(Объект.Клиент, Объект.Дата);
		КонецЕсли;   
		
		//////////////////////////////////////////////////////////////////
		// ОМГ       
		Объект.ФормаРецепта = Перечисления.ФормыРецептов.омг_Форма107_1_у1;
		// ОМГ
        //////////////////////////////////////////////////////////////////
		
	КонецЕсли;
	
	Если Параметры.ЗначенияЗаполнения.Свойство("ФормаРецепта") Тогда
		Объект.ФормаРецепта = Параметры.ЗначенияЗаполнения.ФормаРецепта;
	КонецЕсли;
	
	// Автоподстановка формы рецепта из последней использовавшейся для указанной номенклатуры.
	Если Не ЗначениеЗаполнено(Объект.ФормаРецепта)
		И ЗначениеЗаполнено(Объект.Номенклатура1)
		И Не ЗначениеЗаполнено(Объект.Номенклатура2)
	Тогда
		Объект.ФормаРецепта = ПолучитьПоследнююФормуРецепта(Объект.Номенклатура1);
	КонецЕсли;
	
	УстановитьВидимостьРЭМД(Истина);
	
	Если Не ИспользуетсяРЭМД Тогда
		Элементы.ТипЛьготы.Видимость = Ложь;
	КонецЕсли;
	
	ЭтоФорма148_1_у_04_л = Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма148_1_у_04_л");
	Элементы.ГруппаДиагнозИЛьготы.Видимость = ЭтоФорма148_1_у_04_л;
	
	Если Объект.Ссылка.Пустая()
		И ЭтоФорма148_1_у_04_л
	Тогда
		Элементы.ГруппаДиагнозИЛьготы.Видимость = Истина;
		Объект.Диагноз = МедицинскаяДеятельность.ОсновнойДиагнозПриема(Объект.Прием);
		Объект.ЛьготнаяКатегория = ЛьготнаяКатегорияПоКлиенту(Объект.Клиент);
	КонецЕсли;
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Номенклатура")
		И ТипЗнч(Параметры.ЗначенияЗаполнения.Номенклатура) = Тип("Массив")
		И Параметры.ЗначенияЗаполнения.Номенклатура.Количество() > 0
	Тогда
		Индекс = 1;
		Для Каждого РеквизитыНоменклатуры Из Параметры.ЗначенияЗаполнения.Номенклатура Цикл
			Объект["Номенклатура" + Строка(Индекс)]		= РеквизитыНоменклатуры.Номенклатура;
			Объект["ЕдиницаИзмерения" + Строка(Индекс)]	= РеквизитыНоменклатуры.ЕдиницаИзмерения;
			Объект["Количество" + Строка(Индекс)]		= РеквизитыНоменклатуры.Количество;
			Объект["СколькоДней" + Строка(Индекс)]		= РеквизитыНоменклатуры.КоличествоДней;
			Объект["РазВДень" + Строка(Индекс)]			= РеквизитыНоменклатуры.ПриемовВДень;
			Объект["Дозировка" + Строка(Индекс)]		= РеквизитыНоменклатуры.Дозировка;
			Если Элементы["ЕдИзмПоКлассификатору" + Строка(Индекс)].Видимость Тогда
				Объект["ЕдИзмПоКлассификатору" + Строка(Индекс)] = ПолучитьЕдиницуИзмеренияПоКлассификатору(РеквизитыНоменклатуры.ЕдиницаИзмерения);
			КонецЕсли;
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЕсли;
	
	ПривестиЗначениеНоменклатурыЛекарства(1);
	ПривестиЗначениеНоменклатурыЛекарства(2);
	ПривестиЗначениеНоменклатурыЛекарства(3);  
	
	/////////////////////////////////////////////////////////////
	// ОМГ 
	Изменения = Ложь;
	омг_УстановитьОтборПоАптекам(); 
	Если Объект.омг_РецептОтправлен и не Объект.Ссылка.Пустая() Тогда
		//Статус = омг_РаботаСАптекамиСервер.омг_ОбновитьСтатусРецептаНаСервере(Объект.омг_ключ,Объект.Ссылка); 
		//Если Статус = "НеСогласован" Тогда
		//	Если не Объект.омг_Статус = Перечисления.омг_СтатусыРецептов.НеСогласован Тогда
		//		Объект.омг_Статус = Перечисления.омг_СтатусыРецептов.НеСогласован;
		//		Изменения = Истина;
		//	КонецЕсли;
		//ИначеЕсли Статус = "Согласован" Тогда
		//	Если не Объект.омг_Статус = Перечисления.омг_СтатусыРецептов.Согласован Тогда
		//		Объект.омг_Статус = Перечисления.омг_СтатусыРецептов.Согласован;
		//		Изменения = Истина;
		//	КонецЕсли;
		//	Элементы.Формаомг_ОтправитьРецепт.Доступность = Ложь;
		//ИначеЕсли Статус = "Закрыт" Тогда
		//	Если не Объект.омг_Статус = Перечисления.омг_СтатусыРецептов.Закрыт Тогда
		//		Объект.омг_Статус = Перечисления.омг_СтатусыРецептов.Закрыт;
		//		Изменения = Истина;
		//	КонецЕсли;
		//	Элементы.Формаомг_ОтправитьРецепт.Доступность = Ложь;
		//КонецЕсли; 
		
		Омг_ДанныеАптеки.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
		Если Изменения Тогда
			
		Записать();
		ЭтаФорма.Прочитать();
			
		КонецЕсли;	
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
	Если Объект.Ссылка.Пустая() Тогда
		КлиентПриИзменении(Элементы.Клиент);
	КонецЕсли;
	
	ШаблонПриИзменении(,Истина);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбновитьВидимостьЗначениеСерии();
	КонецЕсли;
	
	ОбновитьТолькоПросмотрЕдиницыизмерения();
	
	// Заполнение параметров отбора типа льготы
	УстановитьПараметрыТипаЛьгот();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);
	
	// РЭМД
	Если ИспользуютсяЭП Тогда
		Если Объект.ПодписанЭП Тогда
			ОбновитьСписокПодписей();
		Иначе
			доп_СертификатыЭЦП.ЗаполнитьСводкуПодписей(Объект.Ссылка, СводкаHTML, ЭлектронныеПодписи);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОЗаписиНового(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменилисьПодписи"
		И Параметр = Объект.Ссылка
	Тогда
		ОбновитьДанныеПослеПодписания();
		ЭтотОбъект.Прочитать();
	ИначеЕсли ИмяСобытия = "ОбновитьСписокПодписей"
		И Параметр = Объект.Ссылка
	Тогда
		ОбновитьСписокПодписей();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	
	ОповещениеОВыборе = Новый ОписаниеОповещения("Подключаемый_КнопкаФилиалПриНажатииЗавершение", ЭтотОбъект);
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма, , ОповещениеОВыборе);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатииЗавершение(Результат, ДополнительныеЗначения) Экспорт
	ОбновитьВидимостьЗначениеСерии();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.МедицинскаяКарта) Тогда
			Объект.МедицинскаяКарта = МедицинскаяДеятельность.ПолучитьОсновнуюМедКартуПациента(Объект.Клиент, Объект.Дата);
		КонецЕсли;
		
		Объект.Взрослый = ОпределитьВзрослыйДетский(Объект.Клиент, Объект.Дата);
		Объект.ЛьготнаяКатегория = ЛьготнаяКатегорияПоКлиенту(Объект.Клиент);
		УстановитьПараметрыТипаЛьгот();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент = Неопределено, ПриОткрытии = Ложь)
	
	ЭтоФорма107_1_у = Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма107_1_у"); 
	
	//////////////////////////////////////////////////////////////////////
	// ОМГ
	ЭтоФорма107_1_у = Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.омг_Форма107_1_у1");
	// ОМГ
    //////////////////////////////////////////////////////////////////////

	Элементы.ПериодичностьОтпуска.Видимость = ЭтоФорма107_1_у;
	
	// Поля указания второго и третьего препарата
	//Элементы.Срок1.Видимость = ЭтоФорма107_1_у;
	Элементы.ГруппаНоменклатуры2.Доступность = ЭтоФорма107_1_у;
	Элементы.ГруппаНоменклатуры3.Доступность = ЭтоФорма107_1_у;
	
	Элементы.НадписьФиксированныйСрок.Видимость = Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма107_у_НП");
												  
	Элементы.Срок2.Видимость =	Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма148_1_у_04_л")
							Или	Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма148_1_у_06_л")
							Или Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма148_1_у_88");
	
	Если (Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма148_1_у_04_л")
			Или Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма148_1_у_06_л"))
		И Элементы.Срок2.СписокВыбора.НайтиПоЗначению(Объект.Срок) = Неопределено
	Тогда
		Объект.Срок = 0;
	ИначеЕсли ЭтоФорма107_1_у
			И (Объект.Срок < Элементы.Срок1.МинимальноеЗначение
				Или Объект.Срок > Элементы.Срок1.МаксимальноеЗначение)
	Тогда
		Объект.Срок = 2;
	ИначеЕсли Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма148_1_у_88")
		И Элементы.Срок2.СписокВыбора.НайтиПоЗначению(Объект.Срок) = Неопределено
	Тогда
		Объект.Срок = 50;
	КонецЕсли;
	
	Если ЭтоФорма107_1_у Тогда
		Срок1ПриИзменении(Неопределено);
	Иначе
		Срок2ПриИзменении(Неопределено);
		Объект.ПериодичностьОтпуска = "";
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////
	// ОМГ
	Элементы.Срок2.Видимость = Ложь; 
	Элементы.Срок1.Видимость = Ложь;

	// ОМГ
    //////////////////////////////////////////////////////////////////////

	Элементы.ГруппаДиагнозИЛьготы.Видимость = Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма148_1_у_04_л");
	
	Если Объект.Ссылка.Пустая() Тогда
		Если Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма148_1_у_04_л") Тогда
			Объект.Диагноз = МедицинскаяДеятельность.ОсновнойДиагнозПриема(Объект.Прием);
		Иначе
			Объект.Диагноз = ПредопределенноеЗначение("Справочник.Диагнозы.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьСписокВыбораДляСроковДействия();
	ОбновитьДоступностьПереключателя();
	Если Элемент <> Неопределено Тогда
		ОбновитьВидимостьЗначениеСерии();
	КонецЕсли;
	
	УстановитьВидимостьРЭМД(,Не ПриОткрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантВводаНоменклатуры1ПриИзменении(Элемент)
	ИзменениеФорматаВводаНоменклатуры(1, ВариантВводаНоменклатуры1);
КонецПроцедуры

&НаКлиенте
Процедура ВариантВводаНоменклатуры2ПриИзменении(Элемент)
	ИзменениеФорматаВводаНоменклатуры(2, ВариантВводаНоменклатуры2);
КонецПроцедуры

&НаКлиенте
Процедура ВариантВводаНоменклатуры3ПриИзменении(Элемент)
	ИзменениеФорматаВводаНоменклатуры(3, ВариантВводаНоменклатуры3);
КонецПроцедуры

&НаКлиенте
Процедура Номенклатура1ПриИзменении(Элемент)
	ИзменениеНоменклатуры(1, ВариантВводаНоменклатуры1);
КонецПроцедуры

&НаКлиенте
Процедура Номенклатура2ПриИзменении(Элемент)
	ИзменениеНоменклатуры(2, ВариантВводаНоменклатуры2);
КонецПроцедуры

&НаКлиенте
Процедура Номенклатура3ПриИзменении(Элемент)
	ИзменениеНоменклатуры(3, ВариантВводаНоменклатуры3);
КонецПроцедуры

&НаКлиенте
Процедура Срок1ПриИзменении(Элемент)
	Если Объект.Срок > 2 Тогда
		Объект.ПоСпециальномуНазначению = Истина;
		Элементы.ПоСпециальномуНазначению.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ПоСпециальномуНазначению.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Срок2ПриИзменении(Элемент)
	Если Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма148_1_у_88")
		И Объект.Срок = 70
	Тогда
		Объект.ПоСпециальномуНазначению = Истина;
		Элементы.ПоСпециальномуНазначению.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ПоСпециальномуНазначению.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Если ИспользуетсяРЭМД
		И Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма148_1_у_04_л")
		И Объект.Срок = 80
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Доступные сроки действия рецепта на лекарственный препарат для формирования СЭМД: 15 дней, 30 дней и 90 дней.'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)
	
	ИзменитьЕдИзмПоКлассификатору(Прав(Элемент.Имя, 1));
	
КонецПроцедуры

&НаКлиенте
Процедура ЛьготнаяКатегорияПриИзменении(Элемент)
	
	УстановитьПараметрыТипаЛьгот();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьСписокВыбораДляСроковДействия()

	Элементы.Срок2.СписокВыбора.Очистить();
	Если Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма148_1_у_04_л") Тогда
		Элементы.Срок2.СписокВыбора.Добавить(50, "15 дней");
		Элементы.Срок2.СписокВыбора.Добавить(0, "30 дней");
		Элементы.Срок2.СписокВыбора.Добавить(60, "90 дней");
		Элементы.Срок2.СписокВыбора.Добавить(80, "180 дней");
	ИначеЕсли Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма148_1_у_88") Тогда
		Элементы.Срок2.СписокВыбора.Добавить(50, "15 дней");
		Элементы.Срок2.СписокВыбора.Добавить(0, "30 дней");
		Элементы.Срок2.СписокВыбора.Добавить(70, "60 дней");
	ИначеЕсли Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма148_1_у_06_л") Тогда
		Элементы.Срок2.СписокВыбора.Добавить(40, "5 дней");
		Элементы.Срок2.СписокВыбора.Добавить(50, "15 дней");
		Элементы.Срок2.СписокВыбора.Добавить(0, "30 дней");
		Элементы.Срок2.СписокВыбора.Добавить(60, "90 дней");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьПереключателя()
	Если Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма148_1_у_88") Тогда
		Элементы.АдресИлиНомер.Доступность = Истина;
	Иначе
		Элементы.АдресИлиНомер.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЗначениеСерии()
	
	Если Объект.ФормаРецепта = ПредопределенноеЗначение("Перечисление.ФормыРецептов.Форма107_1_у") Тогда
		Элементы.Серия.Видимость = Ложь;
		Объект.Серия = "";
	Иначе
		Элементы.Серия.Видимость = Истина;
		Если ЗначениеЗаполнено(Объект.ФормаРецепта) Тогда
			Объект.Серия = ПолучитьЗначениеСерииНаСервере(Объект.Филиал, Объект.ФормаРецепта);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеСерииНаСервере(Филиал, ФормаРецепта)
	
	УстановитьПривилегированныйРежим(Истина);
	МЗ = РегистрыСведений.СерииРецептов.СоздатьМенеджерЗаписи();
	МЗ.Филиал = Филиал;
	МЗ.ФормаРецепта = ФормаРецепта;
	МЗ.Прочитать();
	
	Если Не ЗначениеЗаполнено(МЗ.Серия) Тогда
		МЗ.Филиал = Справочники.Филиалы.ПустаяСсылка();
		МЗ.ФормаРецепта = ФормаРецепта;
		МЗ.Прочитать();
	КонецЕсли;
	
	Возврат МЗ.Серия;
	
КонецФункции

&НаСервере
Процедура ПривестиЗначениеНоменклатурыЛекарства(НомерСтрокиЛекарства)
	
	ИмяРеквизитаНоменклатуры = "Номенклатура" + НомерСтрокиЛекарства;
	Номенклатура = Объект[ИмяРеквизитаНоменклатуры];
	//Номенклатура, Наименование, РеквизитФормы)
	
	Если Объект[ИмяРеквизитаНоменклатуры] = Неопределено Тогда
		// Если реквизит не заполнен (даже пустой ссылкой или строкой)
		ОписаниеТипа = Новый ОписаниеТипов("Строка");
		Элементы[ИмяРеквизитаНоменклатуры].ОграничениеТипа = ОписаниеТипа;
		Если Не ЭтаФорма.ТолькоПросмотр Тогда
			Объект[ИмяРеквизитаНоменклатуры]= ОписаниеТипа.ПривестиЗначение(Объект[ИмяРеквизитаНоменклатуры]);
		КонецЕсли;
		
		Элементы[ИмяРеквизитаНоменклатуры].ВыбиратьТип = Ложь;
	Иначе
		ТипНоменклатуры = ТипЗнч(Объект[ИмяРеквизитаНоменклатуры]);
		ВариантВвода = 0;
		Если ТипНоменклатуры = Тип("СправочникСсылка.Номенклатура") Тогда
			ВариантВвода = 1;
		ИначеЕсли ТипНоменклатуры = Тип("СправочникСсылка.СправочникМеждународныхНепатентованныхНаименований") Тогда
			ВариантВвода = 2;
		КонецЕсли;
		ЭтаФорма["ВариантВводаНоменклатуры" + НомерСтрокиЛекарства] = ВариантВвода;
	КонецЕсли;
	
	// Повторение клиентской процедуры "ИзменениеФорматаВводаЕдиницыИзмерения".
	ИмяРеквизитаЕдиницыИзмерения = "ЕдиницаИзмерения" + НомерСтрокиЛекарства;
	
	// Настройка поля ввода единицы измерения
	Если ЭтаФорма["ВариантВводаНоменклатуры" + НомерСтрокиЛекарства] = 1 Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения");
	Иначе
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения");
	КонецЕсли;
	Элементы[ИмяРеквизитаЕдиницыИзмерения].ОграничениеТипа = ОписаниеТипа;
	Элементы[ИмяРеквизитаЕдиницыИзмерения].БыстрыйВыбор = ЭтаФорма["ВариантВводаНоменклатуры" + НомерСтрокиЛекарства] = 1;
	Объект[ИмяРеквизитаЕдиницыИзмерения] = ОписаниеТипа.ПривестиЗначение(Объект[ИмяРеквизитаЕдиницыИзмерения]);
	
	ОтображатьКартинкуНепереносимости = Ложь;
	Если ЭтаФорма["ВариантВводаНоменклатуры" + НомерСтрокиЛекарства] = 2 Тогда
		ОбработатьНоменклатуруСМНН(НомерСтрокиЛекарства, ОтображатьКартинкуНепереносимости);
	КонецЕсли;
	
	Элементы["Непереносимость" + НомерСтрокиЛекарства].Видимость = ОтображатьКартинкуНепереносимости;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеФорматаВводаНоменклатуры(НомерСтрокиЛекарства, ВариантВводаНоменклатуры)
	
	ИмяРеквизитаНоменклатуры = "Номенклатура" + НомерСтрокиЛекарства;
	
	Объект[ИмяРеквизитаНоменклатуры] = Неопределено;
	
	// Настройка поля ввода номенклатуры
	Если ВариантВводаНоменклатуры = 0 Тогда
		ОписаниеТипа = Новый ОписаниеТипов("Строка");
	ИначеЕсли ВариантВводаНоменклатуры = 1 Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
	Иначе
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.СправочникМеждународныхНепатентованныхНаименований");
	КонецЕсли;
	Элементы[ИмяРеквизитаНоменклатуры].ОграничениеТипа = ОписаниеТипа;
	Объект[ИмяРеквизитаНоменклатуры] = ОписаниеТипа.ПривестиЗначение(Объект[ИмяРеквизитаНоменклатуры]);
	
	ИзменениеФорматаВводаЕдиницыИзмерения(НомерСтрокиЛекарства, ВариантВводаНоменклатуры);
	Элементы["Непереносимость" + НомерСтрокиЛекарства].Видимость = Ложь;
	
	ИзменитьЕдИзмПоКлассификатору(Строка(НомерСтрокиЛекарства));
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеФорматаВводаЕдиницыИзмерения(НомерСтрокиЛекарства, ВариантВводаНоменклатуры)
	
	ИмяРеквизитаЕдиницыИзмерения = "ЕдиницаИзмерения" + НомерСтрокиЛекарства;
	
	Объект[ИмяРеквизитаЕдиницыИзмерения] = Неопределено;
	
	// Настройка поля ввода единицы измерения
	Если ВариантВводаНоменклатуры = 1 Тогда
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения");
	Иначе
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.КлассификаторЕдиницИзмерения");
	КонецЕсли;
	Элементы[ИмяРеквизитаЕдиницыИзмерения].ОграничениеТипа = ОписаниеТипа;
	Элементы[ИмяРеквизитаЕдиницыИзмерения].БыстрыйВыбор = ВариантВводаНоменклатуры = 1;
	Объект[ИмяРеквизитаЕдиницыИзмерения] = ОписаниеТипа.ПривестиЗначение(Объект[ИмяРеквизитаЕдиницыИзмерения]);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменениеНоменклатуры(НомерСтрокиЛекарства, ВариантВводаНоменклатуры)
	
	ОтображатьКартинкуНепереносимости = Ложь;
	Если ВариантВводаНоменклатуры = 2 Тогда
		ОбработатьНоменклатуруСМНН(НомерСтрокиЛекарства, ОтображатьКартинкуНепереносимости);
		ИзменитьЕдИзмПоКлассификатору(Строка(НомерСтрокиЛекарства));
	КонецЕсли;
	
	Элементы["Непереносимость" + НомерСтрокиЛекарства].Видимость = ОтображатьКартинкуНепереносимости;
	Элементы["ЕдиницаИзмерения" + НомерСтрокиЛекарства].ТолькоПросмотр = ВариантВводаНоменклатуры = 2 И ЗначениеЗаполнено(Объект["ЕдиницаИзмерения" + НомерСтрокиЛекарства]);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьНоменклатуруСМНН(НомерСтрокиЛекарства, ОтображатьКартинкуНепереносимости)
	
	Номенклатура = Объект["Номенклатура" + НомерСтрокиЛекарства];
	Объект["ЕдиницаИзмерения" + НомерСтрокиЛекарства] = Номенклатура.ЕдиницаИзмерения;
	НепереносимыеАТХ = Медикаменты.ПолучитьНепереносимыеАТХ(Объект.Клиент,СтрРазделить(Номенклатура.КодАТХ,";", Ложь));
	Если НепереносимыеАТХ.Количество() > 0 Тогда
		ОтображатьКартинкуНепереносимости = Истина;
		ТекстПодсказки = "";
		Для Каждого НепереносимоеДВ Из НепереносимыеАТХ Цикл
			ТекстПодсказки = ТекстПодсказки + Символы.ПС + НепереносимоеДВ.Ключ.Наименование + " (" + СтрСоединить(НепереносимоеДВ.Значение, ", ") + ")";
		КонецЦикла;
		Элементы["Непереносимость" + НомерСтрокиЛекарства].Подсказка = "Непереносимые действующие вещества: " + ТекстПодсказки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТолькоПросмотрЕдиницыИзмерения()
	
	СоответствиеПроверки = Новый Соответствие;
	СоответствиеПроверки.Вставить(Объект.Номенклатура1, "ЕдиницаИзмерения1");
	СоответствиеПроверки.Вставить(Объект.Номенклатура2, "ЕдиницаИзмерения2");
	СоответствиеПроверки.Вставить(Объект.Номенклатура3, "ЕдиницаИзмерения3");
	
	Для Каждого Номенклатура Из СоответствиеПроверки Цикл
		Элементы[Номенклатура.Значение].ТолькоПросмотр = (ТипЗнч(Номенклатура.Ключ) = Тип("СправочникСсылка.СправочникМеждународныхНепатентованныхНаименований"));
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоследнююФормуРецепта(Назначение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Рецепт.ФормаРецепта КАК ФормаРецепта
		|ИЗ
		|	Документ.Рецепт КАК Рецепт
		|ГДЕ
		|	(Рецепт.Номенклатура1 = &Назначение
		|			ИЛИ Рецепт.Номенклатура2 = &Назначение
		|			ИЛИ Рецепт.Номенклатура3 = &Назначение)
		|	И НЕ Рецепт.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Рецепт.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Назначение", Назначение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ФормаРецепта;
	Иначе
		Возврат Перечисления.ФормыРецептов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОпределитьВзрослыйДетский(Клиент, ДатаДок)
	
	ПолныхЛет = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеЧислоЛетСДаты(Клиент.ДатаРождения, ДатаДок);
	Если ПолныхЛет >= 18 Тогда
		Возврат 1;
	Иначе
		Возврат 2;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЕдиницуИзмеренияПоКлассификатору(ЕдиницаИзмерения)

	КлассификаторЕдиницы = Неопределено;
	Если ТипЗнч(ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		КлассификаторЕдиницы = ЕдиницаИзмерения;
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ЕдиницаИзмерения, "ЕдиницаПоКлассификатору")
		И ЗначениеЗаполнено(ЕдиницаИзмерения.ЕдиницаПоКлассификатору)
	Тогда
		КлассификаторЕдиницы = ЕдиницаИзмерения.ЕдиницаПоКлассификатору;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлассификаторЕдиницы) Тогда
		Возврат ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЕдиницаИзмененияНСИПоОКЕИ(КлассификаторЕдиницы);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ИдентификаторыДоступныхТиповЛьготПоЛьготнойКатегории(ЛьготнаяКатегория)
	
	ИдентификаторыТиповЛьгот = Новый Массив;
	
	СтрокаАтрибута = ЛьготнаяКатегория.Атрибуты.Найти("ID");
	Если СтрокаАтрибута = Неопределено Тогда
		Возврат ИдентификаторыТиповЛьгот;
	КонецЕсли;
	
	ВидыЛьготы = ИнтеграцияЕГИСЗСервер.ПолучитьЭлементКлассификатораПоЗначениюАтрибута("ID_LGOTA", СтрокаАтрибута.Значение, Перечисления.ВидыКлассификаторовМинЗдрава.ВидыПредоставляемыхЛьгот,, Ложь);
	Для Каждого ВидЛьготы Из ВидыЛьготы Цикл
		СтрокаАтрибутаКатегории = ВидЛьготы.Атрибуты.Найти("ID_LGOTA_LIST");
		Если СтрокаАтрибутаКатегории <> Неопределено Тогда
			Попытка
				ИдентификаторыТиповЛьгот.Добавить(Число(СтрокаАтрибутаКатегории.Значение));
			Исключение КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИдентификаторыТиповЛьгот;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПараметрыТипаЛьгот()
	
	Если Не ЗначениеЗаполнено(Объект.ЛьготнаяКатегория) Тогда
		Объект.ТипЛьготы = Неопределено;
		Элементы.ТипЛьготы.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	ИдентификаторыДоступныхТиповЛьгот = ИдентификаторыДоступныхТиповЛьготПоЛьготнойКатегории(Объект.ЛьготнаяКатегория);
	
	ПараметрыВыбораПоТипуЛьгот = Новый Массив;
	ПараметрыВыбораПоТипуЛьгот.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ПереченьПредоставляемыхЛьгот")));
	ПараметрыВыбораПоТипуЛьгот.Добавить(Новый ПараметрВыбора("Отбор.УИДЕГИСЗ", ИдентификаторыДоступныхТиповЛьгот));
	Элементы.ТипЛьготы.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПоТипуЛьгот);
	Элементы.ТипЛьготы.Доступность = Истина;
	
	Если ИдентификаторыДоступныхТиповЛьгот.Найти(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТипЛьготы, "УИДЕГИСЗ")) = Неопределено Тогда
		Объект.ТипЛьготы = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЛьготнаяКатегорияПоКлиенту(Клиент)
	
	Если Не ЗначениеЗаполнено(Клиент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	НЗ = РегистрыСведений.ЛьготыКлиентов.СоздатьНаборЗаписей();
	НЗ.Отбор.Клиент.Установить(Клиент);
	НЗ.Прочитать();
	
	ЛьготыКлиента = НЗ.ВыгрузитьКолонку("Льгота");
	
	Если ЛьготыКлиента.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЛьготаПоКлассификатору = Неопределено;
	ЛьготаПоУстаревшемуКлассификатору = Неопределено;
	
	Для Каждого Льгота Из ЛьготыКлиента Цикл
		Если Льгота.ВидКлассификатора = Перечисления.ВидыКлассификаторовМинЗдрава.ЛьготныеКатегорииГраждан Тогда
			ЛьготаПоКлассификатору = Льгота;
			Прервать;
		ИначеЕсли Льгота.ВидКлассификатора = Перечисления.ВидыКлассификаторовМинЗдрава.КлассификаторКатегорийЛьгот
			И ЛьготаПоУстаревшемуКлассификатору = Неопределено
		Тогда
			ЛьготаПоУстаревшемуКлассификатору = ИнтеграцияЕГИСЗВызовСервера.ПолучитьЛьготнуюКатегориюПоКатегорииЛьгот(Льгота);
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ЛьготаПоКлассификатору) Тогда
		Возврат ЛьготаПоКлассификатору;
	Иначе
		Возврат ЛьготаПоУстаревшемуКлассификатору;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьЕдИзмПоКлассификатору(Индекс)
	
	Объект["ЕдИзмПоКлассификатору" + Индекс] = ПолучитьЕдиницуИзмеренияПоКлассификатору(Объект["ЕдиницаИзмерения" + Индекс]);
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписи

#Область ЭлектронныеПодписиКоманды

&НаКлиенте
Процедура ПодписатьДокумент(Команда)
	
	Если МожноПерейтиКПодписанию() Тогда
		ЭЦП_УМЦ_Клиент.ПерейтиКПодписаниюЭМД(ЭтотОбъект, Ложь, Ложь, ИспользуетсяРЭМД);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКПодписаниюЭМД(Команда)
	
	Если МожноПерейтиКПодписанию() Тогда
		ЭЦП_УМЦ_Клиент.ПерейтиКПодписаниюЭМД(ЭтотОбъект, Истина, Ложь, ИспользуетсяРЭМД);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РЭМДПроверитьДанныеПередПодписанием(Команда)
	
	ИнтеграцияЕГИСЗ_РЭМДКлиент.ВыполнитьДействие(ЭтотОбъект, "ПроверитьДанныеПередПодписанием", Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписиСлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокПодписей()
	
	доп_СертификатыЭЦП.ЗаполнитьСписокПодписей(Объект.Ссылка, УникальныйИдентификатор, Элементы.ЭП, ЭлектронныеПодписи,, СводкаHTML);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПослеПодписания()
	
	ОбновитьСписокПодписей();
	УстановитьДоступностьВидимостьПоЭП();
	
КонецПроцедуры

&НаКлиенте
Функция МожноПерейтиКПодписанию()
	
	//Если Не (ЗначениеЗаполнено(Объект.ПредседательМедКомиссии) И ЗначениеЗаполнено(Объект.ДатаЗавершения)) Тогда
	//	ПоказатьПредупреждение(, ?(ЗначениеЗаполнено(Объект.ПредседательМедКомиссии), НСтр("ru='Не заполнена дата заключения!'"), НСтр("ru='Не заполнен председатель мед комиссии!'")));
	//	Возврат Ложь;
	//КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ЭлектронныеПодписиУправлениеДоступностьюПолей

&НаСервере
Процедура УстановитьДоступностьВидимостьПоЭП()
	
	ПодписанЭП = ЭЦП_УМЦ_Сервер.ДокументПодписан(Объект.Ссылка);
	
	Если ИспользуютсяЭП Тогда
		РаботаСФормамиКлиентСервер.УстановитьДоступностьЭлементаФормы(Элементы, "ГруппаЛево",			Не ПодписанЭП);
		РаботаСФормамиКлиентСервер.УстановитьДоступностьЭлементаФормы(Элементы, "ГруппаНоменклатуры",	Не ПодписанЭП);
		
		РаботаСФормамиКлиентСервер.УстановитьПолеЭлементаФормы(Элементы, "КнопкаФилиал", "Доступность",	Не ПодписанЭП);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРЭМД(ПриСоздании = Ложь, ПересчитатьЕдиницыПоКлассификатору = Ложь)
	
	// ЭЦП
	ИспользуютсяЭП = ЭЦП_УМЦ_Сервер.ИспользоватьЭлектронныеПодписиЭМК();
	Если ИспользуютсяЭП И Не Объект.Ссылка.Пустая() Тогда
		Если Объект.ПодписанЭП Тогда
			ОбновитьСписокПодписей();
		Иначе
			доп_СертификатыЭЦП.ЗаполнитьСводкуПодписей(Объект.Ссылка, СводкаHTML, ЭлектронныеПодписи);
		КонецЕсли;
	КонецЕсли;
	
	УстановитьДоступностьВидимостьПоЭП();
	
	// РЭМД
	ИспользуетсяРЭМД = ИнтеграцияЕГИСЗСерверПовтИсп.ИспользуетсяИнтеграцияРЭМД();
	
	ВидРЭМДПоФормеРецепта = ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ВидРЭМДРецепта(Объект.ФормаРецепта);
	
	ДокументДоРЭМД = Объект.Дата < ИнтеграцияЕГИСЗСерверПовтИсп.ПолучитьДатуНачалаОбменаИнформациейСРЭМД(Объект.Филиал);
	
	// Выводим группу ЭП только для тех форм рецептов у которых существует вид РЭМД
	ВыводитьГруппуЭП = ИспользуютсяЭП И ИспользуетсяРЭМД И Не ДокументДоРЭМД И ВидРЭМДПоФормеРецепта <> Неопределено;
	РаботаСФормамиКлиентСервер.УстановитьВидимостьЭлементаФормы(Элементы, "ЭП", ВыводитьГруппуЭП);
	
	Элементы.ЕдИзмПоКлассификатору1.Видимость = ВыводитьГруппуЭП;
	Элементы.ЕдИзмПоКлассификатору2.Видимость = ВыводитьГруппуЭП;
	Элементы.ЕдИзмПоКлассификатору3.Видимость = ВыводитьГруппуЭП;
	
	Если ПриСоздании Тогда
		ПараметрыВыбораПоТипуЛьгот = Новый Массив;
		ПараметрыВыбораПоТипуЛьгот.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ЕдиницыИзмерения")));
		
		Элементы.ЕдИзмПоКлассификатору1.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПоТипуЛьгот);
		Элементы.ЕдИзмПоКлассификатору2.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПоТипуЛьгот);
		Элементы.ЕдИзмПоКлассификатору3.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораПоТипуЛьгот);
	КонецЕсли;
	
	Если ПересчитатьЕдиницыПоКлассификатору Тогда
		Для Индекс = 1 По 3 Цикл
			Если Не ЗначениеЗаполнено(Объект["ЕдИзмПоКлассификатору" + Строка(Индекс)]) Тогда
				Объект["ЕдИзмПоКлассификатору" + Строка(Индекс)] = ПолучитьЕдиницуИзмеренияПоКлассификатору(Объект["ЕдиницаИзмерения" + Строка(Индекс)]);
			КонецЕсли;
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры

/////////////////////////////////////////////////////////////
// ОМГ
&НаКлиенте
Процедура Добавить(Команда)  
		
	Оповещение = Новый ОписаниеОповещения("омг_ОбработкаВыбора",ЭтаФорма);
	ОткрытьФорму("Документ.Рецепт.Форма.омг_ФормаВводаНоменклатуры",Неопределено,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

Процедура омг_ОбработкаВыбора(РезультатВыбора,Источник) Экспорт  

	если не РезультатВыбора = Неопределено Тогда
	ЗаполнитьЗначенияСвойств(Объект.омг_Препараты.Добавить(),РезультатВыбора);
	ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;
     
КонецПроцедуры

&НаКлиенте
Процедура омг_ПрепаратыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если не НоваяСтрока и не Копирование Тогда  
	ТекСТрока = Элементы.омг_Препараты.ТекущиеДанные;	
	СтрПередачи = Новый Структура;  
	СтрПередачи.Вставить("Номенклатура",ТекСТрока.Номенклатура); 
	СтрПередачи.Вставить("Количество",ТекСТрока.Количество);
	СтрПередачи.Вставить("ЕдиницаИзмерения",ТекСТрока.ЕдиницаИзмерения);
	СтрПередачи.Вставить("СпособПрименения",ТекСТрока.СпособПрименения);
	СтрПередачи.Вставить("РазВдень",ТекСТрока.РазВдень);
	СтрПередачи.Вставить("СколькоДней",ТекСТрока.СколькоДней);
	СтрПередачи.Вставить("Дозировка",ТекСТрока.Дозировка);
	СтрПередачи.Вставить("Дополнение",ТекСТрока.Дополнение);

	
	Оповещение = Новый ОписаниеОповещения("омг_ОбработкаВыбораРедактирование",ЭтаФорма);
	ОткрытьФорму("Документ.Рецепт.Форма.омг_ФормаВводаНоменклатуры",СтрПередачи,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	КонецЕсли;		
		
КонецПроцедуры 

 &НаКлиенте
Процедура омг_ОбработкаВыбораРедактирование(РезультатВыбора,Источник) Экспорт  
	
	Если РезультатВыбора.ЭтоПодбор Тогда
		
		Если РезультатВыбора.ТекСТрока > 0 Тогда
			ЗаполнитьЗначенияСвойств(Объект.омг_Препараты[РезультатВыбора.ТекСТрока - 1],РезультатВыбора);
		иначе
			ЗаполнитьЗначенияСвойств(Объект.омг_Препараты.Добавить(),РезультатВыбора);
		КонецЕсли;
		
	иначе
		ЗаполнитьЗначенияСвойств(Элементы.омг_Препараты.ТекущиеДанные,РезультатВыбора);
	КонецЕсли;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ПрепаратыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Оповещение = Новый ОписаниеОповещения("омг_ОбработкаВыбора",ЭтаФорма);
	ОткрытьФорму("Документ.Рецепт.Форма.омг_ФормаВводаНоменклатуры",Неопределено,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура омг_УстановитьОтборПоАптекам()
	
	Остатки.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
	Элементы.Остатки.Заголовок = "Остатки по всем аптекам (справочно!)";
	Если ЗначениеЗаполнено(Объект.омг_Аптека) Тогда
		Элементы.Остатки.Заголовок = "Остатки в аптеке " + Объект.омг_Аптека + " (Справочно!)";	
		ЭлементОтбора = Остатки.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Аптека");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Объект.омг_Аптека;	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура омг_АптекаПриИзменении(Элемент)
	омг_УстановитьОтборПоАптекам()
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтрПоиска = Новый Структура("Номенклатура",Элемент.ТекущиеДанные.Номенклатура);
    НайдСтроки = Объект.омг_Препараты.НайтиСтроки(СтрПоиска); 
	Если НайдСтроки.Количество() > 0 Тогда
		
	ТекСТрока = НайдСтроки[0];	
	СтрПередачи = Новый Структура;  
	СтрПередачи.Вставить("Номенклатура",ТекСТрока.Номенклатура); 
	СтрПередачи.Вставить("Количество",ТекСТрока.Количество+1);
	СтрПередачи.Вставить("ЕдиницаИзмерения",ТекСТрока.ЕдиницаИзмерения);
	СтрПередачи.Вставить("СпособПрименения",ТекСТрока.СпособПрименения);
	СтрПередачи.Вставить("РазВдень",ТекСТрока.РазВдень);
	СтрПередачи.Вставить("СколькоДней",ТекСТрока.СколькоДней);
	СтрПередачи.Вставить("Дозировка",ТекСТрока.Дозировка);
	СтрПередачи.Вставить("Дополнение",ТекСТрока.Дополнение); 	
	СтрПередачи.Вставить("ТекСтрока",ТекСТрока.НомерСтроки); 
	
	иначе
 	
	СтрПередачи = Новый Структура;  
	СтрПередачи.Вставить("Номенклатура",Элемент.ТекущиеДанные.Номенклатура); 
	СтрПередачи.Вставить("Количество",1);
	СтрПередачи.Вставить("ЕдиницаИзмерения",Элемент.ТекущиеДанные.омг_ЕдиницаХраненияАптеки);
	СтрПередачи.Вставить("СпособПрименения","");
	СтрПередачи.Вставить("РазВдень",0);
	СтрПередачи.Вставить("СколькоДней",0);
	СтрПередачи.Вставить("Дозировка","");
	СтрПередачи.Вставить("Дополнение","");	
			
	КонецЕсли;	  
	СтрПередачи.Вставить("ЭтоПодбор",Истина);
	Оповещение = Новый ОписаниеОповещения("омг_ОбработкаВыбораРедактирование",ЭтаФорма);
	ОткрытьФорму("Документ.Рецепт.Форма.омг_ФормаВводаНоменклатуры",СтрПередачи,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПередНачаломИзменения(Элемент, Отказ)
	
	отказ = Истина;
    Возврат;
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиПередУдалением(Элемент, Отказ)
	
	отказ = Истина;
    Возврат;

КонецПроцедуры

&НаКлиенте
Процедура омг_ОтправитьРецепт(Команда)
	омг_ОтправитьРецептНаСервере();
КонецПроцедуры

&НаСервере
Процедура омг_ОтправитьРецептНаСервере(Записывать = Истина)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) и Записывать или ЭтаФорма.Модифицированность и Записывать Тогда
	Попытка
		Записать()
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Перед отправкой необходимо записать документ!";
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	СоединениеHTTP = Новый HTTPСоединение("1c.ubtech.pro",443,"httpSalesOrder","Le6c^Yo)6by",,,Новый ЗащищенноеСоединениеOpenSSL(),);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Рецепт.омг_Аптека.ключ КАК store,
	|	Рецепт.Клиент.ИНН КАК comment
	|ИЗ
	|	Документ.Рецепт КАК Рецепт
	|ГДЕ
	|	Рецепт.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рецептомг_Препараты.Номенклатура.ключ КАК Номенклатураключ,
	|	Рецептомг_Препараты.Количество КАК Количество
	|ИЗ
	|	Документ.Рецепт.омг_Препараты КАК Рецептомг_Препараты
	|ГДЕ
	|	Рецептомг_Препараты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаОсновная = РезультатЗапроса[0].Выбрать(); 
	ВыборкаОсновная.Следующий();
	ВыборкаДетальныеЗаписи = РезультатЗапроса[1].Выбрать();
	
	ДанныеРецепта = Новый Структура;
	
	Если ЗначениеЗаполнено(Объект.омг_ключ) Тогда
		
		ДанныеРецепта.Вставить("order",Объект.омг_ключ);
		
	КонецЕсли;  
	
	ДанныеРецепта.Вставить("store",ВыборкаОсновная.store);
	ДанныеРецепта.Вставить("comment",ВыборкаОсновная.comment);
	
	goods = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Стрgoods = Новый Структура;
		Стрgoods.Вставить("id",ВыборкаДетальныеЗаписи.Номенклатураключ);
		Стрgoods.Вставить("qnt",ВыборкаДетальныеЗаписи.Количество);
		goods.Добавить(Стрgoods);
	КонецЦикла;	 
	
	ДанныеРецепта.Вставить("goods",goods);
	
	//сериализуем в json
	ЗаписьJSON = Новый ЗаписьJSON;               
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеРецепта);
	СтрокаДляТела = ЗаписьJSON.Закрыть();
	// Отправка
	
	//заголовок создадим в виде соответствия
	ЗаголовокЗапросаHTTP = Новый Соответствие();
	//передаем в заголовках размер и тип данных на отправку
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	//создадим заголовок запроса
	ЗапросHTTP = Новый HTTPЗапрос("/prod-atk-meditec/hs/so/order", ЗаголовокЗапросаHTTP);
	//загрузить строку в тело
	ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаДляТела);
	//отсылаем POST-запрос на обработку.
	Если ЗначениеЗаполнено(Объект.омг_ключ) Тогда
		ОтветHTTP = СоединениеHTTP.ВызватьHTTPМетод("PUT", ЗапросHTTP);
	Иначе
		ОтветHTTP = СоединениеHTTP.ВызватьHTTPМетод("POST", ЗапросHTTP);
	КонецЕсли;
	
	Если ОтветHTTP.КодСостояния = 200 Тогда
		
		Сообщение = ОтветHTTP.ПолучитьТелоКакСтроку("UTF-8");
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(Сообщение);
		ДанныеРецепта = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть(); 

		Если не ЗначениеЗаполнено(Объект.омг_ключ) Тогда			
			Объект.омг_ключ = ДанныеРецепта.order_id;
			Объект.омг_РецептОтправлен = Истина;
			Объект.омг_Статус = Перечисления.омг_СтатусыРецептов.НеСогласован;
			Записывать = Истина;
		иначе  
			Элементы.Формаомг_ОтправитьРецепт.Доступность = Истина;
			Если ДанныеРецепта.status = "НеСогласован" Тогда
				Если не Объект.омг_Статус = Перечисления.омг_СтатусыРецептов.НеСогласован Тогда
				Объект.омг_Статус = Перечисления.омг_СтатусыРецептов.НеСогласован;
				КонецЕсли;
			ИначеЕсли ДанныеРецепта.status = "Согласован" Тогда
				Если не Объект.омг_Статус = Перечисления.омг_СтатусыРецептов.Согласован Тогда
				Объект.омг_Статус = Перечисления.омг_СтатусыРецептов.Согласован;
				КонецЕсли;
				Элементы.Формаомг_ОтправитьРецепт.Доступность = Ложь;
			ИначеЕсли ДанныеРецепта.status = "Закрыт" Тогда
				Если не Объект.омг_Статус = Перечисления.омг_СтатусыРецептов.Закрыт Тогда
				Объект.омг_Статус = Перечисления.омг_СтатусыРецептов.Закрыт;
				КонецЕсли;
				Элементы.Формаомг_ОтправитьРецепт.Доступность = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		Попытка  
			Если Записывать Тогда
			Записать();
			КонецЕсли;
			ЭтотОбъект.Прочитать();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Рецепт успешно отправлен!";
			Сообщение.Сообщить();
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Рецепт отправлен, но не записан. Необходимо записать вручную!";
			Сообщение.Сообщить();
		КонецПопытки;
	иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось отправить рецепт! Код: " + ОтветHTTP.КодСостояния;
		Сообщение.Сообщить();	
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);	 
	
КонецПроцедуры    


&НаКлиенте
Процедура омг_ОбновитьСтатусРецпета(Команда) 
	
		Статус = омг_РаботаСАптекамиСервер.омг_ОбновитьСтатусРецептаНаСервере(Объект.омг_ключ,Объект.Ссылка); 
		Если Статус = "НеСогласован" Тогда
			Если не Объект.омг_Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыРецептов.НеСогласован") Тогда
				Объект.омг_Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыРецептов.НеСогласован");
			КонецЕсли;
		ИначеЕсли Статус = "Согласован" Тогда
			Если не Объект.омг_Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыРецептов.Согласован") Тогда
				Объект.омг_Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыРецептов.Согласован");
			КонецЕсли;
			Элементы.Формаомг_ОтправитьРецепт.Доступность = Ложь;
		ИначеЕсли Статус = "Закрыт" Тогда
			Если не Объект.омг_Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыРецептов.Закрыт") Тогда
				Объект.омг_Статус = ПредопределенноеЗначение("Перечисление.омг_СтатусыРецептов.Закрыт");
			КонецЕсли;
			Элементы.Формаомг_ОтправитьРецепт.Доступность = Ложь;
		КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЭтаФорма.Модифицированность и ЗначениеЗаполнено(Объект.омг_ключ) Тогда 
		омг_ОтправитьРецептНаСервере(Ложь)
	КонецЕсли;
		
КонецПроцедуры



// ОМГ
/////////////////////////////////////////////////////////////

#КонецОбласти

#КонецОбласти