Процедура ОтразитьПриложение(ПриложениеОбъект) Экспорт

    Набор = РегистрыСведений.омг_ЛицензированныеВидыДеятельности.СоздатьНаборЗаписей();
    Набор.Отбор.Приложение.Установить(ПриложениеОбъект.Ссылка);

    Если НЕ ПриложениеОбъект.ПометкаУдаления Тогда

        Лицензия    = ПриложениеОбъект.Владелец;
        Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Лицензия, "Организация");

        Для Каждого СтрокаТЧ Из ПриложениеОбъект.Подвиды Цикл

            Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ПодвидДеятельности) Тогда
                Продолжить;
            КонецЕсли;

            Запись = Набор.Добавить();
            Запись.МедицинскийЦентр   = ПриложениеОбъект.МедицинскийЦентр;
            Запись.ПодвидДеятельности = СтрокаТЧ.ПодвидДеятельности;
            Запись.Приложение         = ПриложениеОбъект.Ссылка;
            Запись.Лицензия           = Лицензия;
            Запись.Организация        = Организация;
            Запись.Бессрочно          = ПриложениеОбъект.Бессрочное;
            Запись.ДатаОкончания      = ПриложениеОбъект.ДатаОкончания;
            Запись.Состояние          = ПриложениеОбъект.Состояние;

        КонецЦикла;

    КонецЕсли;

    Набор.Записать(Истина);

КонецПроцедуры

Процедура ПерезаполнитьПоЛицензии(Лицензия) Экспорт

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |   Приложения.Ссылка КАК Ссылка
    |ИЗ
    |   Справочник.омг_ПриложенияКЛицензии КАК Приложения
    |ГДЕ
    |   Приложения.Владелец = &Лицензия";
    Запрос.УстановитьПараметр("Лицензия", Лицензия);

    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        ОтразитьПриложение(Выборка.Ссылка.ПолучитьОбъект());
    КонецЦикла;

КонецПроцедуры