#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	// ?
	//Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		
	Таблица = ПолучитьПриемы();
	
	ВнешниеНаборыДанных = Новый Структура("Данные",Таблица);
	
	ОсновнойМакетОформления = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойМакетОформленияСКД");
	// ?
	// КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	ПараметрМакет = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("МакетОформления");
	ПараметрМакет.Значение = ОсновнойМакетОформления;
	ПараметрМакет.Использование = Истина;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();    
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	// Инициализация процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	// Получение результата
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПриемы()
	ПараметрыОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", ПараметрыОтчета.Найти("НачалоПериода").Значение);
	Запрос.УстановитьПараметр("КонецПериода",  ПараметрыОтчета.Найти("КонецПериода").Значение);
	Запрос.УстановитьПараметр("СписокФилиалов", ПроцедурыСпециализацииПоставки.ФилиалыОрганизации(ПараметрыОтчета.Найти("Филиал").Значение));
	Запрос.УстановитьПараметр("ДолжностиЗубныхВрачейМинздрава", ДолжностиЗубныхВрачейМинздрава());


	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК ЗубнойВрач
		|ПОМЕСТИТЬ СотрудникиЗубныеВрачи 
		|ИЗ
		|	Справочник.Сотрудники Как Сотрудники
		|ГДЕ
		|	Сотрудники.Должность <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка) 
		|	И Сотрудники.Должность.ДолжностьМинздрава В (&ДолжностиЗубныхВрачейМинздрава)
		|;
		|/////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ссылка КАК Прием
		|ИЗ
		|	Документ.Прием Прием
		|ГДЕ
		|	Прием.Дата >= &НачалоПериода
		|	И Прием.Дата <= &КонецПериода
		|	И Прием.Филиал В(&СписокФилиалов)
		|	И НЕ Прием.ПометкаУдаления
		|	И Прием.Проведен
		|	И Прием.Врач НЕ В (ВЫБРАТЬ ЗубнойВрач ИЗ СотрудникиЗубныеВрачи)
		|";
		Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ДолжностиЗубныхВрачейМинздрава();
	
	ДолжностиЗубныхВрачейМЗ = Новый Массив;

	ДолжностиЗубныхВрачейМЗ.Добавить(
		ИнтеграцияЕГИСЗВызовСервера.ЭлементКлассификатораПоУИДЕГИСЗ(151,   // Гигиенист стоматологический
			Перечисления.ВидыКлассификаторовМинЗдрава.ДолжностиРаботниковМедОрганизаций));
	ДолжностиЗубныхВрачейМЗ.Добавить(
		ИнтеграцияЕГИСЗВызовСервера.ЭлементКлассификатораПоУИДЕГИСЗ(152,   // Зубной врач
			Перечисления.ВидыКлассификаторовМинЗдрава.ДолжностиРаботниковМедОрганизаций));
	ДолжностиЗубныхВрачейМЗ.Добавить(
		ИнтеграцияЕГИСЗВызовСервера.ЭлементКлассификатораПоУИДЕГИСЗ(153,   // Зубной техник
			Перечисления.ВидыКлассификаторовМинЗдрава.ДолжностиРаботниковМедОрганизаций));
			
	Возврат ДолжностиЗубныхВрачейМЗ;
	
КонецФункции

#КонецОбласти
