
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УровеньАлкоголя = Параметры.НачальноеЗначение;
	ЦелаяЧасть = Цел(УровеньАлкоголя);
	ДробнаяЧастьСотые = (УровеньАлкоголя - ЦелаяЧасть) * 100;
	ДробнаяЧасть = ?(ДробнаяЧастьСотые = Цел(ДробнаяЧастьСотые), ДробнаяЧастьСотые, (УровеньАлкоголя - ЦелаяЧасть) * 1000);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Если СтрДлина(Строка(ДробнаяЧасть)) = 3 Тогда
		Делитель = 1000;
	ИначеЕсли СтрДлина(Строка(ДробнаяЧасть)) = 2 Тогда
		Делитель = 100;
	Иначе
		Делитель = 10;
	КонецЕсли;
	Результат = ЦелаяЧасть + ДробнаяЧасть/Делитель;  
	Если Результат = УровеньАлкоголя Тогда
		Закрыть();
	Иначе
		Закрыть(Результат); 
	КонецЕсли;
	
КонецПроцедуры
