
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		ВыбранныйЦвет = ЦветаСтиля.ЦветФонаГруппировкиОтчета1;
	Иначе
		СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.ВидыСостоянийКойкоМест"));
		ВыбранныйЦвет = СправочникОбъект.Цвет.Получить();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(ВыбранныйЦвет);

КонецПроцедуры
