
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Асинх Процедура Выбрать(Команда)
	
	Ответ = Ждать ВопросАсинх("Подразделение """ + ВыбПодразделение + """. 
		|Подтверждаете данный шаблон для отправки?", РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да, "Отправка шаблона",
		КодВозвратаДиалога.Нет);
		
	Если Не Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Элементы.СписокШаблонов.ТекущиеДанные.Идентификатор);
КонецПроцедуры

&НаКлиенте
Процедура СписокШаблоновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Выбрать(Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыбПодразделение = Параметры.ВыбПодразделение;
	
	СписокШаблонов.Параметры.УстановитьЗначениеПараметра("Оператор", Параметры.Оператор);
	СписокШаблонов.Параметры.УстановитьЗначениеПараметра("ВыбПодразделение", Параметры.ВыбПодразделение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстСообщенияHTML = iga_HTMLКлиент.ПолучитьИзначальныйТексСтраницы(Истина);

КонецПроцедуры

&НаКлиенте
Процедура СписокШаблоновПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.СписокШаблонов.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	iga_HTMLКлиент.ПрименитьТекстКПолюHTML(ТекущаяСтрока.ТекстСообщения, Элементы.ТекстСообщения);
	
КонецПроцедуры
