
Процедура ПриЗаписи(Отказ, Замещение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	iga_ПоследниеСтатусыЧатов.Чат КАК Чат
	               |ИЗ
	               |	РегистрСведений.iga_ПоследниеСтатусыЧатов КАК iga_ПоследниеСтатусыЧатов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.iga_ОчередьРаспределения КАК iga_ОчередьРаспределения
	               |		ПО iga_ОчередьРаспределения.Чат = iga_ПоследниеСтатусыЧатов.Чат
	               |ГДЕ
	               |	iga_ОчередьРаспределения.Чат ЕСТЬ NULL";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.iga_ПоследниеСтатусыЧатов.СоздатьМенеджерЗаписи();
		Запись.Чат = Выборка.Чат;
		Запись.Удалить();
	КонецЦикла;
	
КонецПроцедуры

