
&НаСервере
Процедура ОбновитьСправочникиНаСервере()
	
	Ключи = Новый Массив;
	Ключи.Добавить(Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеАнализовЛИС);
	ОбновляемыеДаннные = Новый Структура("Ключи", Ключи);
	омг_ИнтеграцияСЛИС.ОбновлениеДанныхПоСведениямОтЛИС(ОбновляемыеДаннные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСправочники(Команда)
	ОбновитьСправочникиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСправочникиИЦеныНаСервере()
	
	Ключи = Новый Массив;
	Ключи.Добавить(Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеЦенЛИС);
	ОбновляемыеДаннные = Новый Структура("Ключи", Ключи);
	омг_ИнтеграцияСЛИС.ОбновлениеДанныхПоСведениямОтЛИС(ОбновляемыеДаннные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСправочникиИЦены(Команда)
	ОбновитьСправочникиИЦеныНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСправочникиБиоматериаловИКонтейнеровНаСервере()
	
	Ключи = Новый Массив;
	Ключи.Добавить(Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеБиоматериаловЛИС);
	ОбновляемыеДаннные = Новый Структура("Ключи", Ключи);
	омг_ИнтеграцияСЛИС.ОбновлениеДанныхПоСведениямОтЛИС(ОбновляемыеДаннные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСправочникиБиоматериаловИКонтейнеров(Команда)
	ОбновитьСправочникиБиоматериаловИКонтейнеровНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьАрхивированностьНаСервере()
	
	Ключи = Новый Массив;
	Ключи.Добавить(Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеАрхивированных);
	ОбновляемыеДаннные = Новый Структура("Ключи", Ключи);
	омг_ИнтеграцияСЛИС.ОбновлениеДанныхПоСведениямОтЛИС(ОбновляемыеДаннные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьАрхивированность(Команда)
	ОбновитьАрхивированностьНаСервере();
КонецПроцедуры
