#Область ПрограммныйИнтерфейс

#Область Печать

// Возвращает доступные варианты печати документа.
//  Результатом является Струткура, каждая строка которой соответствует одному из вариантов печати.
// 
// Возвращаемое значение:
//  Структура.
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("Направление",			 НСтр("ru='Направление'"));
	СтруктураМакетов.Вставить("ПланЛечения",			 НСтр("ru='Оценка стоимости плана лечения'"));
	СтруктураМакетов.Вставить("ПодготовкаКИсследованию", НСтр("ru='Подготовка к сдаче анализов'"));
	// Изменено Макеев (
	// Отключены остальные печатные формы, нужны только первые три.
	//СтруктураМакетов.Вставить("ПланЛеченияСтом","Оценка стоимости стоматологического плана лечения");
	//СтруктураМакетов.Вставить("ПараметрыЗубов","Параметры зубной формулы");
	//ДополнитьСтруктуруПечатныхФормПараметрамиЗубов(СтруктураМакетов);
	// )
	
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Процедура формирует печатную форму документа
//  Название макета печати передается в качестве параметра,
//  по переданному имени макета определяется соответствующая функция печати.
//
// Параметры:
//  СсылкаНаОбъект	 - ДокументСсылка	 - ссылка на распечатываемый документ.
//  ИмяМакета		 - Строка			 - имя макета из структуры печатных форм.
// 
// Возвращаемое значение:
//  ТабличныйДокумент.
//
Функция Печать(СсылкаНаОбъект, ИмяМакета) Экспорт
	
	Перем ТабДокумент;
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "Направление" Тогда
		ТабДокумент = ПечатьНаправление(СсылкаНаОбъект);
	ИначеЕсли ИмяМакета = "ПланЛечения" Тогда
		ТабДокумент = ПечатьПланЛечения(СсылкаНаОбъект);
	ИначеЕсли ИмяМакета = "ПодготовкаКИсследованию" Тогда
		ТабДокумент = ПечатьПодготовкаКИсследованию(СсылкаНаОбъект);
	ИначеЕсли ИмяМакета = "ПланЛеченияСтом" Тогда
		ТабДокумент = ПечатьПланЛеченияСтом(СсылкаНаОбъект, "Зуб");
	ИначеЕсли ИмяМакета = "ПараметрыЗубов" Тогда 
		ТабДокумент = ПечатьПараметрыЗубов(СсылкаНаОбъект);
	ИначеЕсли Найти(ИмяМакета, "ПараметрыЗубов") > 0 Тогда
		ГруппаПараметров = Неопределено;
		Попытка
			УидСтрокой = Прав(ИмяМакета, СтрДлина(ИмяМакета) - СтрДлина("ПараметрыЗубов") - 1);
			УидПараметра = Новый УникальныйИдентификатор(СтрЗаменить(УидСтрокой, "_", "-"));
			ГруппаПараметров = ПланыВидовХарактеристик.стомПараметрыЗубнойФормулы.ПолучитьСсылку(УИДПараметра);
		Исключение
		КонецПопытки;
		ТабДокумент = ПечатьПараметрыЗубов(СсылкаНаОбъект, ГруппаПараметров); 
	КонецЕсли;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьНаправление(СсылкаНаОбъект)
	
	Перем Выборка;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Макет = ПолучитьМакет("Направление");
	
	макет.Параметры.НазваниеОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(СсылкаНаОбъект).НазваниеОрганизации;
	макет.Параметры.АдресОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(СсылкаНаОбъект).Адрес;
	
	макет.Параметры.ФИО = СсылкаНаОбъект.Клиент;
	макет.Параметры.Пол = ?(СсылкаНаОбъект.Клиент.Пол=Перечисления.ПолФизическихЛиц.НеУказан,"",СсылкаНаОбъект.Клиент.Пол);
	макет.Параметры.Возраст = Формат((ТекущаяДата() - СсылкаНаОбъект.Клиент.ДатаРождения)/ (60 * 60 * 24 * 365),"ЧДЦ=0");
	макет.Параметры.ФамилияВрача = СсылкаНаОбъект.Врач.Фамилия + " " + СсылкаНаОбъект.Врач.Имя + " " + СсылкаНаОбъект.Врач.Отчество;
	ТабДокумент.Вывести(макет);
	
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Прием_Направление";
	
	Возврат ТабДокумент;
	
КонецФункции 

Функция ПечатьПланЛечения(СсылкаНаОбъект)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Макет = ПолучитьМакет("ПланЛечения");
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	// Данные организации
	РеквизитыОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(СсылкаНаОбъект);	
	ОбластьШапка.Параметры.НазваниеОрганизации = РеквизитыОрганизации.НазваниеОрганизации;
	ОбластьШапка.Параметры.АдресОрганизации = РеквизитыОрганизации.Адрес;
	ОбластьШапка.Параметры.ТелефонОрганизации = РеквизитыОрганизации.Телефон;
	
	// Сведения о Клиенте
	ОбластьШапка.Параметры.ПациентФИО = СсылкаНаОбъект.Клиент.Фамилия + " " + СсылкаНаОбъект.Клиент.Имя + " " + СсылкаНаОбъект.Клиент.Отчество;
	Адрес = КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(СсылкаНаОбъект.Клиент, Перечисления.ТипыКонтактнойИнформации.Адрес);
	Телефон = КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(СсылкаНаОбъект.Клиент, Перечисления.ТипыКонтактнойИнформации.Телефон);
	ОбластьШапка.Параметры.ПациентАдрес = Адрес;
	ОбластьШапка.Параметры.ПациентТелефон = Телефон;
	ТабДокумент.Вывести(ОбластьШапка);
	
	ОбластьПланШапка = Макет.ПолучитьОбласть("ОбластьПланШапка");
	ТабДокумент.Вывести(ОбластьПланШапка);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыЛечения.ПервичныйПрием,
	|	ПланыЛечения.ИдентификаторЭлемента,
	|	ПланыЛечения.ВидЭлемента,
	|	ПланыЛечения.Номенклатура,
	|	ПланыЛечения.ПорядокЭлемента,
	|	ПланыЛечения.ДокументРегистратор,
	|	ПланыЛечения.Дата,
	|	ПланыЛечения.Сотрудник,
	|	ПланыЛечения.Количество,
	|	ПланыЛечения.Комментарий
	|ПОМЕСТИТЬ ПланыЛеченияПоПриему
	|ИЗ
	|	РегистрСведений.ПланыЛечения КАК ПланыЛечения
	|ГДЕ
	|	ПланыЛечения.ПервичныйПрием = &ПервичныйПрием
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПланыЛеченияПоПриему.Номенклатура,
	|	ПланыЛеченияПоПриему.Количество,
	|	ПланыЛеченияПоПриему.Дата КАК Назначено,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) * ПланыЛеченияПоПриему.Количество КАК Сумма
	|ИЗ
	|	ПланыЛеченияПоПриему КАК ПланыЛеченияПоПриему
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, Прейскурант = &Прейскурант) КАК ЦеныНоменклатурыСрезПоследних
	|		ПО ПланыЛеченияПоПриему.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПланыЛеченияПоПриему.Дата,
	|	ПланыЛеченияПоПриему.ПорядокЭлемента";
	ПервичныйПрием = ?(ЗначениеЗаполнено(СсылкаНаОбъект.ПервичныйПрием), СсылкаНаОбъект.ПервичныйПрием, СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ПервичныйПрием", ПервичныйПрием);
	Запрос.УстановитьПараметр("Дата", СсылкаНаОбъект.Дата); //ПервичныйПрием.Дата);
	Запрос.УстановитьПараметр("Прейскурант", УправлениеНастройками.ПолучитьПрейскурантФилиала(СсылкаНаОбъект.Филиал));
	Выборка = Запрос.Выполнить().Выбрать();
	СуммаИтого = 0;
	Пока Выборка.Следующий() Цикл
		СуммаИтого = СуммаИтого + Выборка.Сумма;
		ОбластьПланСтрока = Макет.ПолучитьОбласть("ОбластьПланСтрока");
		ЗаполнитьЗначенияСвойств(ОбластьПланСтрока.Параметры, Выборка);
		ОбластьПланСтрока.Параметры.Назначено = Формат(Выборка.Назначено,"ДФ=dd.MM.yyyy");
		ТабДокумент.Вывести(ОбластьПланСтрока);
	КонецЦикла;
	ОбластьПланИтог = Макет.ПолучитьОбласть("ОбластьПланИтог");
	ОбластьПланИтог.Параметры.СуммаИтого = ОбщегоНазначенияКлиентСервер.ФорматСумм(СуммаИтого);
	ОбластьПланИтог.Параметры.Валюта = ОбщегоНазначения.ПолучитьКраткоеНаименованиеОсновнойВалюты();
	ТабДокумент.Вывести(ОбластьПланИтог);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.ВрачФИО = СсылкаНаОбъект.Врач.Фамилия + " " + СсылкаНаОбъект.Врач.Имя + " " + СсылкаНаОбъект.Врач.Отчество;
	ОбластьПодвал.Параметры.МестоДляПодписи = Лев("_________________", 16);
	ОбластьПодвал.Параметры.ТекДата = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy");
	ОбластьПодвал.Параметры.Окончание1 = ?(СсылкаНаОбъект.Клиент.Пол = Перечисления.ПолФизическихЛиц.Женский, "а", "");
	ОбластьПодвал.Параметры.Окончание2 = ?(СсылкаНаОбъект.Клиент.Пол = Перечисления.ПолФизическихЛиц.Женский, "на", "ен");
	ТабДокумент.Вывести(ОбластьПодвал);
	
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Прием_ПланЛечения";
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьПодготовкаКИсследованию(СсылкаНаОбъект)
			
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВыполнениеПланаЛечения.ИдентификаторЭлемента,
	                      |	ВЫБОР
	                      |		КОГДА ВыполнениеПланаЛечения.Количество = 0
	                      |			ТОГДА 1
	                      |		ИНАЧЕ ВыполнениеПланаЛечения.Количество
	                      |	КОНЕЦ КАК Количество
	                      |ПОМЕСТИТЬ ВыполнениеПланаЛечения
	                      |ИЗ
	                      |	РегистрСведений.ВыполнениеПланаЛечения КАК ВыполнениеПланаЛечения
	                      |ГДЕ
	                      |	ВыполнениеПланаЛечения.ПервичныйПрием = &ПервичныйПрием
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ПланыЛечения.Номенклатура
	                      |ИЗ
	                      |	РегистрСведений.ПланыЛечения КАК ПланыЛечения
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВыполнениеПланаЛечения КАК ВыполнениеПланаЛечения
	                      |		ПО ПланыЛечения.ИдентификаторЭлемента = ВыполнениеПланаЛечения.ИдентификаторЭлемента
	                      |ГДЕ
	                      |	ПланыЛечения.ПервичныйПрием = &ПервичныйПрием
	                      |	И ПланыЛечения.Количество > ЕСТЬNULL(ВыполнениеПланаЛечения.Количество, 0)");
	
	Если СсылкаНаОбъект.ЭтоПервичный Тогда
		Запрос.УстановитьПараметр("ПервичныйПрием", СсылкаНаОбъект);
	Иначе
		Запрос.УстановитьПараметр("ПервичныйПрием", СсылкаНаОбъект.ПервичныйПрием);
	КонецЕсли;
		
	мНоменклатура = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	ТабличныйДокумент = Документы.ДействияНадАнализами.ПолучитьТабДокПодготовкаКИсследованию(мНоменклатура);
	
	Возврат ТабличныйДокумент;

КонецФункции

Функция ПечатьПланЛеченияСтом(СсылкаНаОбъект, ПорядокНазначений = "Дата")
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.АвтоМасштаб = Истина;
	
	Валюта = ОбщегоНазначения.ПолучитьКраткоеНаименованиеОсновнойВалюты();
	
	Макет = ПолучитьМакет("стомПланЛечения");
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	РеквизитыОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(СсылкаНаОбъект);	
	ОбластьШапка.Параметры.НазваниеОрганизации = РеквизитыОрганизации.НазваниеОрганизации;
	ОбластьШапка.Параметры.АдресОрганизации = РеквизитыОрганизации.Адрес;
	ОбластьШапка.Параметры.ТелефонОрганизации = РеквизитыОрганизации.Телефон;
	
	ОбластьШапка.Параметры.ПациентФИО = СсылкаНаОбъект.Клиент.Фамилия + " " + СсылкаНаОбъект.Клиент.Имя + " " + СсылкаНаОбъект.Клиент.Отчество;
	Адрес = КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(СсылкаНаОбъект.Клиент, Перечисления.ТипыКонтактнойИнформации.Адрес);
	Телефон = КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(СсылкаНаОбъект.Клиент, Перечисления.ТипыКонтактнойИнформации.Телефон);
	ОбластьШапка.Параметры.ПациентАдрес = Адрес;
	ОбластьШапка.Параметры.ПациентТелефон = Телефон;
	ТабДокумент.Вывести(ОбластьШапка);
	
	ОбластьПланШапка = Макет.ПолучитьОбласть("ОбластьПланШапка");
	ТабДокумент.Вывести(ОбластьПланШапка);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыЛечения.ПервичныйПрием,
	|	ПланыЛечения.ИдентификаторЭлемента,
	|	ПланыЛечения.ВидЭлемента,
	|	ПланыЛечения.Номенклатура КАК Номенклатура,
	|	ПланыЛечения.ПорядокЭлемента,
	|	ПланыЛечения.ДокументРегистратор,
	|	ПланыЛечения.Дата КАК назначено,
	|	ПланыЛечения.Сотрудник,
	|	ПланыЛечения.Количество,
	|	ПланыЛечения.Сумма,
	|	ПланыЛечения.ЗубВКарте,
	|	ПланыЛечения.СегментВЗубе,
	|	ПланыЛечения.Конструкция КАК Конструкция,
	|	ПланыЛечения.Комментарий,
	|	ВЫБОР
	|		КОГДА ПланыЛечения.Количество = 0
	|			ТОГДА 0
	|		ИНАЧЕ ПланыЛечения.Сумма / ПланыЛечения.Количество
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	РегистрСведений.ПланыЛечения КАК ПланыЛечения
	|ГДЕ
	|	ПланыЛечения.ПервичныйПрием = &ПервичныйПрием
	|";
	
	Если ПорядокНазначений = "Дата" Тогда
		Запрос.Текст = Запрос.Текст + "
			|УПОРЯДОЧИТЬ ПО
			|	ПланыЛечения.Дата,
			|	ПланыЛечения.ЗубВКарте.Наименование,
			|	ПланыЛечения.СегментВЗубе.Наименование,
			|	Конструкция,
			|	ПорядокЭлемента,
			|	Номенклатура";
	ИначеЕсли ПорядокНазначений = "Зуб" Тогда
		Запрос.Текст = Запрос.Текст + "
			|УПОРЯДОЧИТЬ ПО
			|	ПланыЛечения.ЗубВКарте.Наименование,
			|	ПланыЛечения.СегментВЗубе.Наименование,
			|	Конструкция,
			|	ПорядокЭлемента,
			|	ПланыЛечения.Дата,
			|	Номенклатура";
	КонецЕсли;
	
	ПервичныйПрием = ?(ЗначениеЗаполнено(СсылкаНаОбъект.ПервичныйПрием), СсылкаНаОбъект.ПервичныйПрием, СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ПервичныйПрием", ПервичныйПрием);
	Выборка = Запрос.Выполнить().Выбрать();
	СуммаИтого = 0;
	
	ОбозначенияЗубов = стомСтоматология.ПолучитьОбозначенияЗубовНаДату(
		СсылкаНаОбъект.Клиент, СсылкаНаОбъект.ЗубнаяКарта, Новый Граница(СсылкаНаОбъект.МоментВремени(), ВидГраницы.Включая));
		
	НПП = 1;
	Пока Выборка.Следующий() Цикл
		СуммаИтого = СуммаИтого + Выборка.Сумма;
		
		ЭтоКонструкция = ЗначениеЗаполнено(Выборка.Конструкция);
		
		Если ЭтоКонструкция Тогда
			ОбластьПланСтрока = Макет.ПолучитьОбласть("ОбластьПланСтрокаКонструкция");
		Иначе
			ОбластьПланСтрока = Макет.ПолучитьОбласть("ОбластьПланСтрока");
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОбластьПланСтрока.Параметры, Выборка);
		ОбластьПланСтрока.Параметры.Назначено = Формат(Выборка.Назначено, "ДФ=dd.MM.yyyy");
		
		ОбластьПланСтрока.Параметры.НПП		= НПП;
		ОбластьПланСтрока.Параметры.Цена	= ОбщегоНазначения.ФорматСумм(Выборка.Цена);
		ОбластьПланСтрока.Параметры.Сумма	= ОбщегоНазначения.ФорматСумм(Выборка.Сумма);
		
		Если Не ЭтоКонструкция Тогда
			ОбозначениеЗуба = ОбозначенияЗубов.Получить(Выборка.ЗубВКарте);
			Если ЗначениеЗаполнено(ОбозначениеЗуба) Тогда
				ОбластьПланСтрока.Параметры.ЗубВКарте = ОбозначенияЗубов[Выборка.ЗубВКарте];
			КонецЕсли;
		КонецЕсли;

		ТабДокумент.Вывести(ОбластьПланСтрока);
		
		НПП = НПП + 1;
	КонецЦикла;
	
	ОбластьПланИтог = Макет.ПолучитьОбласть("ОбластьПланИтог");
	ОбластьПланИтог.Параметры.СуммаИтого = ОбщегоНазначения.ФорматСумм(СуммаИтого, Валюта);
	ТабДокумент.Вывести(ОбластьПланИтог);
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.ВрачФИО = СсылкаНаОбъект.Врач.Фамилия + " " + СсылкаНаОбъект.Врач.Имя + " " + СсылкаНаОбъект.Врач.Отчество;
	ОбластьПодвал.Параметры.ТекДата = ТекущаяДата();
	ОбластьПодвал.Параметры.Окончание1 = ?(СсылкаНаОбъект.Клиент.Пол = Перечисления.ПолФизическихЛиц.Женский, "а", "");
	ОбластьПодвал.Параметры.Окончание2 = ?(СсылкаНаОбъект.Клиент.Пол = Перечисления.ПолФизическихЛиц.Женский, "на", "ен");
	ТабДокумент.Вывести(ОбластьПодвал);
	
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Прием_ПланЛеченияСтом";
	
	Возврат ТабДокумент;
	
КонецФункции

Процедура ДополнитьСтруктуруПечатныхФормПараметрамиЗубов(СтруктураПечатныхФорм)
	
	СтруктураПечатныхФорм.Вставить("ПараметрыЗубов", "Параметры зубной формулы");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стомПараметрыЗубнойФормулы.Ссылка КАК ГруппаПараметров
	|ПОМЕСТИТЬ ГруппыПараметров
	|ИЗ
	|	ПланВидовХарактеристик.стомПараметрыЗубнойФормулы КАК стомПараметрыЗубнойФормулы
	|ГДЕ
	|	НЕ стомПараметрыЗубнойФормулы.ПометкаУдаления
	|	И стомПараметрыЗубнойФормулы.ЭтоГруппа
	|	И стомПараметрыЗубнойФормулы.Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.стомПараметрыЗубнойФормулы.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГруппыПараметров.ГруппаПараметров
	|ИЗ
	|	ГруппыПараметров КАК ГруппыПараметров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.стомПараметрыЗубнойФормулы КАК стомПараметрыЗубнойФормулы
	|		ПО ГруппыПараметров.ГруппаПараметров = стомПараметрыЗубнойФормулы.Родитель
	|			И (НЕ стомПараметрыЗубнойФормулы.ЭтоГруппа)";
	Результат = Запрос.Выполнить();	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураПечатныхФорм.Вставить("ПараметрыЗубов" + ОбщегоНазначенияКлиентСерверПереопределяемый.УИДВСтроку(Выборка.ГруппаПараметров.УникальныйИдентификатор()),"Параметры зубной формулы (" + Строка(Выборка.ГруппаПараметров) + ")");
	КонецЦикла;
	
КонецПроцедуры

Функция ПечатьПараметрыЗубов(СсылкаНаОбъект, ОтборПоГруппеПараметров = Неопределено)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.АвтоМасштаб = Истина;
		
	Макет = ПолучитьМакет("ПараметрыЗубов");
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	
	РеквизитыОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(СсылкаНаОбъект);	
	ОбластьШапка.Параметры.НазваниеОрганизации = РеквизитыОрганизации.НазваниеОрганизации;
	ОбластьШапка.Параметры.КонтактыОрганизации = Строка(РеквизитыОрганизации.Адрес) + " " + Строка(РеквизитыОрганизации.Телефон);
	
	ОбластьШапка.Параметры.Заголовок = ?(ЗначениеЗаполнено(ОтборПоГруппеПараметров), ОтборПоГруппеПараметров, "Параметры зубной формулы");
	ОбластьШапка.Параметры.ПациентФИО = CRMСервер.ПолучитьФИООбъекта(СсылкаНаОбъект.Клиент);
	
	ТабДокумент.Вывести(ОбластьШапка);
	
	ПараметрыЗК = стомСтоматология.ПолучитьПараметрыЗубнойФормулыНаДату(СсылкаНаОбъект.Клиент, СсылкаНаОбъект.ЗубнаяКарта, СсылкаНаОбъект.Дата, СсылкаНаОбъект.Ссылка);
	ОбозначенияЗубов = стомСтоматология.ПолучитьОбозначенияЗубовНаДату(СсылкаНаОбъект.Клиент, СсылкаНаОбъект.ЗубнаяКарта, СсылкаНаОбъект.Дата);
	
	ТаблицаПорядок = стомСтоматология.ПолучитьТаблицуПорядкаЗубов();
	
	// Собираем список параметров
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПорядокЗубов.НаименованиеЗуба,
	|	ПорядокЗубов.Порядок
	|ПОМЕСТИТЬ ПорядокЗубов
	|ИЗ
	|	&ПорядокЗубов КАК ПорядокЗубов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стомОбластиСегментовСписокПараметров.Ссылка КАК Область,
	|	стомОбластиСегментовСписокПараметров.Параметр.Родитель КАК ГруппаПараметров,
	|	стомОбластиСегментовСписокПараметров.Параметр
	|ПОМЕСТИТЬ ПараметрыПоОбластям
	|ИЗ
	|	Справочник.стомОбластиСегментов.СписокПараметров КАК стомОбластиСегментовСписокПараметров
	|ГДЕ
	|	(&Параметр = ЗНАЧЕНИЕ(ПланВидовХарактеристик.стомПараметрыЗубнойФормулы.ПустаяСсылка)
	|			ИЛИ стомОбластиСегментовСписокПараметров.Параметр В ИЕРАРХИИ (&Параметр))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗначенияПараметров.ЗубВКарте,
	|	ЗначенияПараметров.СегментВЗубе,
	|	ЗначенияПараметров.Параметр,
	|	ЗначенияПараметров.Значение
	|ПОМЕСТИТЬ ЗначенияПараметров
	|ИЗ
	|	&ЗначенияПараметров КАК ЗначенияПараметров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	стомЗубыКарты.Ссылка КАК ЗубВКарте,
	|	ВЫБОР
	|		КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[12]_""
	|			ТОГДА ""Верх""
	|		КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[34]_""
	|			ТОГДА ""Низ""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Расположение,
	|	ПорядокЗубов.Порядок
	|ПОМЕСТИТЬ ЗубыКарты
	|ИЗ
	|	Справочник.стомЗубыКарты КАК стомЗубыКарты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПорядокЗубов КАК ПорядокЗубов
	|		ПО стомЗубыКарты.Наименование = ПорядокЗубов.НаименованиеЗуба
	|ГДЕ
	|	стомЗубыКарты.Владелец = &ЗубнаяКарта
	|	И ВЫБОР
	|			КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[12]_""
	|				ТОГДА ""Верх""
	|			КОГДА стомЗубыКарты.Наименование ПОДОБНО ""[34]_""
	|				ТОГДА ""Низ""
	|			ИНАЧЕ """"
	|		КОНЕЦ <> """"
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗубыКарты.ЗубВКарте КАК ЗубВКарте,
	|	стомСегментыЗубов.Ссылка КАК СегментВЗубе,
	|	ПараметрыПоОбластям.Область,
	|	ПараметрыПоОбластям.ГруппаПараметров,
	|	ПараметрыПоОбластям.Параметр КАК Параметр,
	|	ЗубыКарты.Расположение
	|ПОМЕСТИТЬ ПараметрыПоЗубам
	|ИЗ
	|	ЗубыКарты КАК ЗубыКарты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.стомСегментыЗубов КАК стомСегментыЗубов
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПараметрыПоОбластям КАК ПараметрыПоОбластям
	|			ПО стомСегментыЗубов.Сегмент.Область = ПараметрыПоОбластям.Область
	|		ПО (стомСегментыЗубов.Владелец = &ЗубнаяКарта
	|				ИЛИ ЗубыКарты.ЗубВКарте.Зуб = стомСегментыЗубов.Владелец)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗубыКарты.ЗубВКарте,
	|	ЗубыКарты.Расположение КАК Расположение
	|ИЗ
	|	ЗубыКарты КАК ЗубыКарты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗубыКарты.Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПараметрыПоЗубам.ГруппаПараметров КАК ГруппаПараметров,
	|	ПараметрыПоЗубам.Параметр КАК Параметр,
	|	ПараметрыПоЗубам.ЗубВКарте КАК ЗубВКарте,
	|	ПараметрыПоЗубам.Область,
	|	ПараметрыПоЗубам.СегментВЗубе,
	|	ЗначенияПараметров.Значение,
	|	ПараметрыПоЗубам.Расположение КАК Расположение
	|ИЗ
	|	ПараметрыПоЗубам КАК ПараметрыПоЗубам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПараметров КАК ЗначенияПараметров
	|		ПО ПараметрыПоЗубам.ЗубВКарте = ЗначенияПараметров.ЗубВКарте
	|			И ПараметрыПоЗубам.СегментВЗубе = ЗначенияПараметров.СегментВЗубе
	|			И ПараметрыПоЗубам.Параметр = ЗначенияПараметров.Параметр
	|ИТОГИ ПО
	|	ГруппаПараметров,
	|	Параметр,
	|	Расположение,
	|	ЗубВКарте";
	Запрос.УстановитьПараметр("ПорядокЗубов", ТаблицаПорядок);
	Запрос.УстановитьПараметр("ЗначенияПараметров", ПараметрыЗК);
	Запрос.УстановитьПараметр("ЗубнаяКарта", СсылкаНаОбъект.ЗубнаяКарта);
	Запрос.УстановитьПараметр("Параметр", ?(ЗначениеЗаполнено(ОтборПоГруппеПараметров), ОтборПоГруппеПараметров, ПланыВидовХарактеристик.стомПараметрыЗубнойФормулы.ПустаяСсылка()));
	
	Результат = Запрос.ВыполнитьПакет();
	
	СтрокиНаДобавление = Новый Структура("Верх, Низ", Новый Массив, Новый Массив);
	СтрокиОбозначенияЗубов = Новый Структура("Верх, Низ", Макет.ПолучитьОбласть("ОбластьОбозначения"), Макет.ПолучитьОбласть("ОбластьОбозначения"));
	
	соотвКвадрантыЗуба = Новый Соответствие;
	соотвКвадрантыЗуба.Вставить("1", "Л");
	соотвКвадрантыЗуба.Вставить("2", "П");
	соотвКвадрантыЗуба.Вставить("3", "П");
	соотвКвадрантыЗуба.Вставить("4", "Л");	
	
	// Формируем обозначения зубной формулы
	ВыборкаЗубы = Результат[5].Выбрать();
	Пока ВыборкаЗубы.Следующий() Цикл
		
		Квадрант = Лев(ВыборкаЗубы.ЗубВКарте.Наименование, 1);
		ИмяПараметра = соотвКвадрантыЗуба[Квадрант] + Прав(ВыборкаЗубы.ЗубВКарте.Наименование, 1);
		СтрокиОбозначенияЗубов[ВыборкаЗубы.Расположение].Параметры[ИмяПараметра] = ОбозначенияЗубов[ВыборкаЗубы.ЗубВКарте];
		
	КонецЦикла;
	
	соотвПараметрыСОписаниями = Новый Соответствие;
	
	ВыборкаГруппыПараметров = Результат[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаГруппыПараметров.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ОтборПоГруппеПараметров) Тогда
			
			ОбластьГруппаПараметров = Макет.ПолучитьОбласть("ОбластьГруппаПараметров");
			ОбластьГруппаПараметров.Параметры.ГруппаПараметров = ВыборкаГруппыПараметров.ГруппаПараметров;
			СтрокиНаДобавление.Верх.Добавить(ОбластьГруппаПараметров);
			СтрокиНаДобавление.Низ.Добавить(ОбластьГруппаПараметров);
			
		КонецЕсли;
		
		ВыборкаПараметры = ВыборкаГруппыПараметров.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПараметры.Следующий() Цикл
			
			Если Не ПустаяСтрока(ВыборкаПараметры.Параметр.ОписаниеЗначенийПараметров) Тогда
				соотвПараметрыСОписаниями.Вставить(ВыборкаПараметры.Параметр, ВыборкаПараметры.Параметр.ОписаниеЗначенийПараметров);
			КонецЕсли;
			
			СтруктураПараметров = Новый Структура("Верх, Низ", Макет.ПолучитьОбласть("ОбластьПараметр"), Макет.ПолучитьОбласть("ОбластьПараметр"));
			СтруктураПараметров.Верх.Параметры.Параметр = ВыборкаПараметры.Параметр;
			СтруктураПараметров.Низ.Параметры.Параметр = ВыборкаПараметры.Параметр;
			
			ЗначениеПоУмолчанию = ВыборкаПараметры.Параметр.ТипЗначения.ПривестиЗначение(ВыборкаПараметры.Параметр.ЗначениеПоУмолчанию);
			
			ВыборкаРасположение = ВыборкаПараметры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаРасположение.Следующий() Цикл
				
				ВыборкаЗубы = ВыборкаРасположение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаЗубы.Следующий() Цикл
					
					Квадрант = Лев(ВыборкаЗубы.ЗубВКарте.Наименование, 1);
					ИмяПараметра = соотвКвадрантыЗуба[Квадрант] + Прав(ВыборкаЗубы.ЗубВКарте.Наименование, 1);
					ЗначениеПараметра = ЗначениеПоУмолчанию;
					
					ВыборкаСегменты = ВыборкаЗубы.Выбрать();
					СписокЗначенийПараметров = Новый СписокЗначений;
					Пока ВыборкаСегменты.Следующий() Цикл
						
						ЗначениеПараметра = ?(ЗначениеЗаполнено(ВыборкаСегменты.Значение), ВыборкаСегменты.Значение, ЗначениеПоУмолчанию);
						СписокЗначенийПараметров.Добавить(ЗначениеПараметра);
						
					КонецЦикла;
					
					Если СписокЗначенийПараметров.Количество() > 1 Тогда 
						ЗначениеПараметра = СписокЗначенийПараметров;
					КонецЕсли;
					
					СтруктураПараметров[ВыборкаРасположение.Расположение].Параметры[ИмяПараметра] = Формат(ЗначениеПараметра, ВыборкаПараметры.Параметр.ФорматПредставления);
					
				КонецЦикла;
				
			КонецЦикла;
			
			СтрокиНаДобавление.Верх.Добавить(СтруктураПараметров.Верх);
			СтрокиНаДобавление.Низ.Добавить(СтруктураПараметров.Низ);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Выводим сформированные строки таблицы
	Для Каждого СтрокаПараметра Из СтрокиНаДобавление.Верх Цикл 
		ТабДокумент.Вывести(СтрокаПараметра);
	КонецЦикла;
	ТабДокумент.Вывести(СтрокиОбозначенияЗубов.Верх);
	ТабДокумент.Вывести(СтрокиОбозначенияЗубов.Низ);
	Для Каждого СтрокаПараметра Из СтрокиНаДобавление.Низ Цикл 
		ТабДокумент.Вывести(СтрокаПараметра);
	КонецЦикла;
	
	// Выводим обозначения параметров
	Для Каждого кзПараметр Из соотвПараметрыСОписаниями Цикл
		
		ОбластьОписание = Макет.ПолучитьОбласть("ОбластьОписаниеЗначений");
		ОбластьОписание.Параметры.Параметр = кзПараметр.Ключ;
		ОбластьОписание.Параметры.ОписаниеЗначений = кзПараметр.Значение;
		ТабДокумент.Вывести(ОбластьОписание);
		
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.ВрачФИО = CRMСервер.ПолучитьФИООбъекта(СсылкаНаОбъект.Врач);
	ОбластьПодвал.Параметры.ТекДата = ТекущаяДата();
	ТабДокумент.Вывести(ОбластьПодвал);
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ТабДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Прием_ПараметрыЗубов";
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
				
		Если Параметры.Свойство("Ключ") Тогда
			Если Параметры.Ключ.СтоматологическийПрием Тогда
				СтандартнаяОбработка = Ложь;
				ВыбраннаяФорма = "стомФормаДокумента";
			КонецЕсли;
		Иначе
			Если УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(, "Стоматолог") Тогда
				ЭтоМедосмотр =	Параметры.Свойство("ЗначенияЗаполнения") И 
								(Параметры.ЗначенияЗаполнения.Свойство("ПервичныйПрием")
									И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.ПервичныйПрием)
									И ТипЗнч(Параметры.ЗначенияЗаполнения.ПервичныйПрием) = Тип("ДокументСсылка.ПрохождениеМедосмотра")
								Или Параметры.ЗначенияЗаполнения.Свойство("МедицинскаяКарта")
									И ЗначениеЗаполнено(Параметры.ЗначенияЗаполнения.МедицинскаяКарта)
									// Изменено Макеев (
									И (Параметры.ЗначенияЗаполнения.МедицинскаяКарта.ВидКарты.ТипКарты = Перечисления.ТипыМедицинскихКарт.Стационар
										Или Параметры.ЗначенияЗаполнения.МедицинскаяКарта.ВидКарты.ТипКарты = Перечисления.ТипыМедицинскихКарт.омг_СтационарРК));
									// )
				Если Не ЭтоМедосмотр Тогда 				
					СтандартнаяОбработка = Ложь;
					ВыбраннаяФорма = "стомФормаДокумента";
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ЭЦП

// Возвращает массив имен ключевых реквизитов согласно версии
//
// Параметры:
// 	Версия - Число - версия набора ключевых реквизитов. По умолчанию Неопределено значит последняя.
//
// Возвращаемое значение:
// 	Массив.
// 
Функция ПолучитьИменаКлючевыхРеквизитов(Версия = Неопределено) Экспорт
	
	// !ДанныеОбъекта - служебное имя реквизита, означающее, что процедура формирования строки значений полей полностью переопределена.		
	// !ХешФайлов - служебное имя реквизита, формирует строку хеша файлов по объекту
	
	МассивИмен = Новый Массив;
	
	Если Версия = 2 Тогда
		МассивИмен.Добавить("!ДанныеОбъекта");
	Иначе // Реквизиты актуальной версии
		МассивИмен.Добавить("!ДанныеОбъекта");
		МассивИмен.Добавить("!ДанныеФайлов");
	КонецЕсли;
	
	Возврат МассивИмен;
	
КонецФункции

#КонецОбласти

// Возвращает данные для выбора услуг продажи по выполненным услугам (Состав услуг) в виде таблицы значений с колонками:
//	"Клиент", "Номенклатура", "Количество".
//
// Параметры:
//  ПараметрыВыбора	 - Структура - Структура с ключом "Дата" и необязательным ключом "Клиент".
// 
// Возвращаемое значение:
//   ТаблицаЗначений.
//
Функция ПолучитьДанныеВыполненияДляПродажи(ПараметрыВыбора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ПараметрыВыбора.Дата));
	Запрос.УстановитьПараметр("КонецПериода",  КонецДня(ПараметрыВыбора.Дата));
	Если ПараметрыВыбора.Свойство("Клиент") И ЗначениеЗаполнено(ПараметрыВыбора.Клиент) Тогда
		Запрос.УстановитьПараметр("Клиент", ПараметрыВыбора.Клиент);
	Иначе
		Запрос.УстановитьПараметр("Клиент", Неопределено);
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапросаДанныеВыполненияДляПродажи();
	
	ДанныеВыполнения = Запрос.Выполнить().Выгрузить();
	ДанныеВыполнения.Колонки.Добавить("ДополнительнаяИнформация", Новый ОписаниеТипов("Структура"));
	
	Для Каждого СтрокаВыполнения Из ДанныеВыполнения Цикл
		Если ЗначениеЗаполнено(СтрокаВыполнения.ДокументОснование)
			И ТипЗнч(СтрокаВыполнения.ДокументОснование) = Тип("ДокументСсылка.Заявка")
		Тогда
			СтрокаВыполнения.ДополнительнаяИнформация.Вставить("Заявка", СтрокаВыполнения.ДокументОснование);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеВыполнения.Колонки.Удалить("ДокументОснование");
	
	Возврат ДанныеВыполнения;
	
КонецФункции

Функция ТекстЗапросаДанныеВыполненияДляПродажи()
	
	Возврат "ВЫБРАТЬ
	        |	Приемы.Клиент КАК Клиент,
	        |	ПриемРаботы.Номенклатура КАК Номенклатура,
	        |	СУММА(ПриемРаботы.Количество) КАК Количество,
	        |	Приемы.Сотрудник КАК Сотрудник,
	        |	Приемы.ДокументОснование КАК ДокументОснование
	        |ИЗ
	        |	Документ.Прием.Работы КАК ПриемРаботы
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			Прием.Ссылка КАК Документ,
	        |			Прием.Клиент КАК Клиент,
	        |			Прием.Врач КАК Сотрудник,
	        |			Прием.ДокументОснование КАК ДокументОснование
	        |		ИЗ
	        |			Документ.Прием КАК Прием
	        |		ГДЕ
	        |			Прием.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	        |			И (&Клиент = НЕОПРЕДЕЛЕНО
	        |					ИЛИ Прием.Клиент В (&Клиент))
	        |			И Прием.Проведен) КАК Приемы
	        |		ПО ПриемРаботы.Ссылка = Приемы.Документ
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Приемы.Клиент,
	        |	ПриемРаботы.Номенклатура,
	        |	Приемы.Сотрудник,
	        |	Приемы.ДокументОснование";
	
КонецФункции

Процедура ЗаполнитьНастройкиПараметровПисьма(СсылкаНаОбъект, Тема, Текст, ДокументыОтправки) Экспорт
	
	Тема = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Приём %1 от %2'"), СсылкаНаОбъект.Врач, СсылкаНаОбъект.Дата);
	Текст = НСтр("ru='Во вложении Ваш приём у врача'") + " " + СсылкаНаОбъект.Врач;
	ДокументыОтправки = СсылкаНаОбъект;
	
КонецПроцедуры

#КонецОбласти
