Функция Экспортировать(КартыКВыгрузке) Экспорт
	
	ПравилаОбмена = ПолучитьМакет("ПравилаОбменаЗубнаяКарта");
	ДанныеФайлаВыгрузки = ОбщегоНазначенияСервер.ВыполнитьВыгрузкуУниверсальнымОбменомXML(ПравилаОбмена.ПолучитьТекст(), , Истина);
	Возврат ДанныеФайлаВыгрузки;
	
КонецФункции

Процедура Импортировать(ДанныеКарты) Экспорт
	
	ОбщегоНазначенияСервер.ВыполнитьЗагрузкуУниверсальнымОбменомXML(ДанныеКарты);
	
КонецПроцедуры

Функция ПолучитьСписокВычисляемыхБлоков(ЗагружатьДанные = Истина) Экспорт
	
	Возврат ПолучитьСписокМакетовПоПрефиксу("вб", ЗагружатьДанные); 
	
КонецФункции

Функция ПолучитьСписокМакетовПоПрефиксу(Префикс, ЗагружатьДанные = Ложь) Экспорт 
	
	ДлинаПрефикса = СтрДлина(Префикс);
	мсМакеты = Новый Массив;
	Для Каждого метМакет Из Метаданные.Справочники.стомВидыЗубныхКарт.Макеты Цикл
		Если Лев(метМакет.Имя, ДлинаПрефикса) = Префикс Тогда
			СтруктураМакет = Новый Структура("Имя, Представление", метМакет.Имя, метМакет.Синоним);
			Если ЗагружатьДанные Тогда 
				СтруктураМакет.Вставить("Данные", Справочники.стомВидыЗубныхКарт.ПолучитьМакет(метМакет.Имя));
			КонецЕсли;
			мсМакеты.Добавить(СтруктураМакет);
		КонецЕсли;
	КонецЦикла;
	
	Возврат мсМакеты;
	
КонецФункции
