
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	УстановитьТипыОтборыЭлементовКлассификаторовМинздрава();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискКлиентов(Команда)
	
	ФормаКлиента =  ПолучитьФорму("ОбщаяФорма.ФормаПоискаКлиентаУпр", , Элементы.Клиент);
	ФормаКлиента.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОсновныеДанные(Команда)
	
	Если ЗначениеЗаполнено(Объект.Клиент) Тогда
		ДанныеКлиента = ПолучитьДанныеКлиента(Объект.Клиент);
		ЗаполнитьЗначенияСвойств(Объект, ДанныеКлиента);
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	ПеречитатьОсновныеДанные(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ДанныеГоспитализации = ВычислитьПродолжительностьГоспитализации(Объект.ДокументОснование, Объект.ВидСтационара);
		ЗаполнитьЗначенияСвойств(Объект, ДанныеГоспитализации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВремяВыпискиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ДокументОснование) И ЗначениеЗаполнено(Объект.ДатаВремяВыписки) Тогда
		ДанныеГоспитализации = ВычислитьПродолжительностьГоспитализации(Объект.ДокументОснование, Объект.ВидСтационара, Объект.ДатаВремяВыписки);
		ЗаполнитьЗначенияСвойств(Объект, ДанныеГоспитализации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДефектыДогоспитальногоЭтапаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокДефектов = Новый СписокЗначений;
	
	СписокДефектов.Добавить("несвоевременность госпитализации — 1");
	СписокДефектов.Добавить("недостаточный объем клинико-диагностического обследования — 2");
	СписокДефектов.Добавить("неправильная тактика лечения — 3");
	СписокДефектов.Добавить("несовпадение диагноза — 4");
	
	ОповещениеПослеОтметкиЭлементов = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтотОбъект);
	СписокДефектов.ПоказатьОтметкуЭлементов(ОповещениеПослеОтметкиЭлементов, "Выберите дефекты догоспитального этапа");
	
КонецПроцедуры

&НаКлиенте
Процедура СоциальныйСтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораПоКлассификатору(Элемент, СтандартнаяОбработка, "СоциальныйСтатус");
	
КонецПроцедуры

&НаКлиенте
Процедура СоциальныйСтатусПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.СоциальныйСтатус) <> Тип("Строка") Тогда
		УстановитьОграничениеТипаПоКлассификатору(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МестностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораПоКлассификатору(Элемент, СтандартнаяОбработка, "Местность");
	
КонецПроцедуры

&НаКлиенте
Процедура МестностьПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.Местность) <> Тип("Строка") Тогда
		УстановитьОграничениеТипаПоКлассификатору(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОплатыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораПоКлассификатору(Элемент, СтандартнаяОбработка, "ВидОплаты");
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОплатыПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.ВидОплаты) <> Тип("Строка") Тогда
		УстановитьОграничениеТипаПоКлассификатору(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияЛьготностиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораПоКлассификатору(Элемент, СтандартнаяОбработка, "КатегорияЛьготности");
	
КонецПроцедуры

&НаКлиенте
Процедура КатегорияЛьготностиПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.КатегорияЛьготности) <> Тип("Строка") Тогда
		УстановитьОграничениеТипаПоКлассификатору(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СрочностьГоспитализацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораПоКлассификатору(Элемент, СтандартнаяОбработка, "СрочностьГоспитализации");
	
КонецПроцедуры

&НаКлиенте
Процедура СрочностьГоспитализацииПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.СрочностьГоспитализации) <> Тип("Строка") Тогда
		УстановитьОграничениеТипаПоКлассификатору(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходГоспитализацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораПоКлассификатору(Элемент, СтандартнаяОбработка, "ИсходГоспитализации");
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходГоспитализацииПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.ИсходГоспитализации) <> Тип("Строка") Тогда
		УстановитьОграничениеТипаПоКлассификатору(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатГоспитализацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораПоКлассификатору(Элемент, СтандартнаяОбработка, "РезультатГоспитализации");
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатГоспитализацииПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.РезультатГоспитализации) <> Тип("Строка") Тогда
		УстановитьОграничениеТипаПоКлассификатору(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТравмаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработатьНачалоВыбораПоКлассификатору(Элемент, СтандартнаяОбработка, "Травма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТравмаПриИзменении(Элемент)
	
	Если ТипЗнч(Объект.Травма) <> Тип("Строка") Тогда
		УстановитьОграничениеТипаПоКлассификатору(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХирургическиеОперацииАнестезияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Элемент.ОграничениеТипа) Тогда
		НомерСтроки = Объект.ХирургическиеОперации.НайтиПоИдентификатору(Элементы.ХирургическиеОперации.ТекущаяСтрока).НомерСтроки;
		ДанныеЯчейки = Новый Структура("ИмяТаблицы, ИмяКолонки, НомерСтроки", "ХирургическиеОперации", "Анестезия", НомерСтроки);
		ОбработатьНачалоВыбораПоКлассификатору(Элемент, СтандартнаяОбработка, , ДанныеЯчейки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХирургическиеОперацииАнестезияПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Элемент.ОграничениеТипа) Тогда
		УстановитьОграничениеТипаПоКлассификатору(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХирургическиеОперацииВидОплатыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Элемент.ОграничениеТипа) Тогда
		НомерСтроки = Объект.ХирургическиеОперации.НайтиПоИдентификатору(Элементы.ХирургическиеОперации.ТекущаяСтрока).НомерСтроки;
		ДанныеЯчейки = Новый Структура("ИмяТаблицы, ИмяКолонки, НомерСтроки", "ХирургическиеОперации", "ВидОплаты", НомерСтроки);
		ОбработатьНачалоВыбораПоКлассификатору(Элемент, СтандартнаяОбработка, , ДанныеЯчейки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ХирургическиеОперацииВидОплатыПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Элемент.ОграничениеТипа) Тогда
		УстановитьОграничениеТипаПоКлассификатору(Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияПациентаПоОтделениямВидОплатыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Элемент.ОграничениеТипа) Тогда
		НомерСтроки = Объект.ДвиженияПациентаПоОтделениям.НайтиПоИдентификатору(Элементы.ДвиженияПациентаПоОтделениям.ТекущаяСтрока).НомерСтроки;
		ДанныеЯчейки = Новый Структура("ИмяТаблицы, ИмяКолонки, НомерСтроки", "ДвиженияПациентаПоОтделениям", "ВидОплаты", НомерСтроки);
		ОбработатьНачалоВыбораПоКлассификатору(Элемент, СтандартнаяОбработка, , ДанныеЯчейки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияПациентаПоОтделениямВидОплатыПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Элемент.ОграничениеТипа) Тогда
		УстановитьОграничениеТипаПоКлассификатору(Элемент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеКлиента(Клиент)
	
	Возврат Документы.Форма066.ПолучитьДанныеКлиента(Клиент);
	
КонецФункции

&НаСервереБезКонтекста
Функция ВычислитьПродолжительностьГоспитализации(Обращение, ВидСтационара, ДатаВремяВыписки = Неопределено)
	
	Возврат Документы.ОбращениеВСтационар.ВычислитьПродолжительностьГоспитализации(Обращение, ВидСтационара, ДатаВремяВыписки);
	
КонецФункции

&НаКлиенте
Процедура ПослеОтметкиЭлементов(Элементы, Параметры) Экспорт
	
	Если Элементы <> Неопределено Тогда
		ДефектыДогоспитальногоЭтапа = "";
		Для Каждого Дефект Из Элементы Цикл
			Если Дефект.Пометка Тогда
				ДефектыДогоспитальногоЭтапа = ДефектыДогоспитальногоЭтапа
											+ ?(Не ПустаяСтрока(ДефектыДогоспитальногоЭтапа), "; ", "")
											+ Дефект.Значение;
			КонецЕсли;
		КонецЦикла;
		Объект.ДефектыДогоспитальногоЭтапа = ДефектыДогоспитальногоЭтапа;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТипыОтборыЭлементовКлассификаторовМинздрава()
	
	УстановитьПараметрыЭлементаПоТипуДанных(Объект.СоциальныйСтатус,			 Элементы.СоциальныйСтатус);
	УстановитьПараметрыЭлементаПоТипуДанных(Объект.Местность,					 Элементы.Местность);
	УстановитьПараметрыЭлементаПоТипуДанных(Объект.ВидОплаты,					 Элементы.ВидОплаты);
	УстановитьПараметрыЭлементаПоТипуДанных(Объект.КатегорияЛьготности,			 Элементы.КатегорияЛьготности);
	УстановитьПараметрыЭлементаПоТипуДанных(Объект.СрочностьГоспитализации,		 Элементы.СрочностьГоспитализации);
	УстановитьПараметрыЭлементаПоТипуДанных(Объект.ИсходГоспитализации,			 Элементы.ИсходГоспитализации);
	УстановитьПараметрыЭлементаПоТипуДанных(Объект.РезультатГоспитализации,		 Элементы.РезультатГоспитализации);
	УстановитьПараметрыЭлементаПоТипуДанных(Объект.Травма,						 Элементы.Травма);
	УстановитьПараметрыЭлементаПоТипуДанных(Объект.ПорядокСлучаевГоспитализации, Элементы.ПорядокСлучаевГоспитализации);
	
	Если Объект.ХирургическиеОперации.Количество() = 0 Тогда
		УстановитьОграничениеТипаПоКлассификатору(Элементы.ХирургическиеОперацииАнестезия);
		УстановитьОграничениеТипаПоКлассификатору(Элементы.ХирургическиеОперацииВидОплаты);
	Иначе
		УстановитьПараметрыЭлементаПоТипуДанных(Объект.ХирургическиеОперации[0].Анестезия, Элементы.ХирургическиеОперацииАнестезия);
		УстановитьПараметрыЭлементаПоТипуДанных(Объект.ХирургическиеОперации[0].ВидОплаты, Элементы.ХирургическиеОперацииВидОплаты);
	КонецЕсли;
	
	Если Объект.ДвиженияПациентаПоОтделениям.Количество() = 0 Тогда
		УстановитьОграничениеТипаПоКлассификатору(Элементы.ДвиженияПациентаПоОтделениямВидОплаты);
	Иначе
		УстановитьПараметрыЭлементаПоТипуДанных(Объект.ДвиженияПациентаПоОтделениям[0].ВидОплаты, Элементы.ДвиженияПациентаПоОтделениямВидОплаты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыЭлементаПоТипуДанных(ЗначениеРеквизита, Элемент)
	
	Если ТипЗнч(ЗначениеРеквизита) <> Тип("Строка") Тогда
		УстановитьОграничениеТипаПоКлассификатору(Элемент);
	Иначе
		Элемент.РедактированиеТекста = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтборВидаКлассификатора(ВидКлассификатора)
	
	мОтборы = Новый Массив;
	мОтборы.Добавить(Новый ПараметрВыбора("Отбор.ВидКлассификатора", ВидКлассификатора));
	
	Возврат Новый ФиксированныйМассив(мОтборы);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьНачалоВыбораПоКлассификатору(Элемент, СтандартнаяОбработка, ИмяРеквизита = Неопределено, ДанныеЯчейки = Неопределено)
	
	Если ИмяРеквизита <> Неопределено
		И ТипЗнч(Объект[ИмяРеквизита]) <> Тип("Строка")
	Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	СтруктураОтбора = Новый Структура("Отбор", Новый Структура("ВидКлассификатора", ВидКлассификатораПоЭлементу(Элемент)));
	
	ДопПараметры = Новый Структура("ИмяЭлемента", Элемент.Имя);
	
	Если ИмяРеквизита <> Неопределено Тогда
		ДопПараметры.Вставить("ИмяРеквизита", ИмяРеквизита);
	ИначеЕсли ДанныеЯчейки <> Неопределено Тогда
		ДопПараметры.Вставить("ДанныеЯчейки", ДанныеЯчейки);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораЭлементаКлассификатора", ЭтотОбъект, ДопПараметры);
	ОткрытьФорму("Справочник.КлассификаторыМинЗдрава.ФормаВыбора", СтруктураОтбора, ЭтотОбъект, УникальныйИдентификатор, , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Функция ВидКлассификатораПоЭлементу(Элемент)
	
	ВидыКлассификатора = Новый Соответствие;
	ВидыКлассификатора.Вставить(Элементы.СоциальныйСтатус,						ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.СоциальныеГруппыНаселения"));
	ВидыКлассификатора.Вставить(Элементы.Местность,								ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ПризнакЖителяГородаСела"));
	ВидыКлассификатора.Вставить(Элементы.КатегорияЛьготности,					ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ЛьготныеКатегорииНаселения"));
	ВидыКлассификатора.Вставить(Элементы.СрочностьГоспитализации,				ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.СрочностьГоспитализации"));
	ВидыКлассификатора.Вставить(Элементы.ИсходГоспитализации,					ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ИсходыГоспитализации"));
	ВидыКлассификатора.Вставить(Элементы.РезультатГоспитализации,				ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.РезультатыОбращения"));
	ВидыКлассификатора.Вставить(Элементы.Травма,								ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ВидыТравмПоСпособуПолучения"));
	ВидыКлассификатора.Вставить(Элементы.ПорядокСлучаевГоспитализации,			ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ПорядокСлучаевГоспитализацииИлиОбращения"));
	ВидыКлассификатора.Вставить(Элементы.ХирургическиеОперацииАнестезия,		ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ВидыАнестезии"));
	ВидыКлассификатора.Вставить(Элементы.ВидОплаты,								ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ИсточникиОплатыМедПомощи"));
	ВидыКлассификатора.Вставить(Элементы.ХирургическиеОперацииВидОплаты,		ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ИсточникиОплатыМедПомощи"));
	ВидыКлассификатора.Вставить(Элементы.ДвиженияПациентаПоОтделениямВидОплаты,	ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ИсточникиОплатыМедПомощи"));
	
	Возврат ВидыКлассификатора.Получить(Элемент);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбораЭлементаКлассификатора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("ИмяРеквизита") Тогда
		Объект[ДополнительныеПараметры.ИмяРеквизита] = Результат;
	Иначе
		Таблица = Объект[ДополнительныеПараметры.ДанныеЯчейки.ИмяТаблицы];
		Строка = Таблица[ДополнительныеПараметры.ДанныеЯчейки.НомерСтроки - 1];
		Строка[ДополнительныеПараметры.ДанныеЯчейки.ИмяКолонки] = Результат;
	КонецЕсли;
	
	УстановитьОграничениеТипаПоКлассификатору(Элементы[ДополнительныеПараметры.ИмяЭлемента]);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничениеТипаПоКлассификатору(Элемент)
	
	мТипКлассификатора = Новый Массив();
	мТипКлассификатора.Добавить(Тип("СправочникСсылка.КлассификаторыМинЗдрава"));
	Элемент.ОграничениеТипа = Новый ОписаниеТипов(мТипКлассификатора);
	Элемент.РедактированиеТекста = Истина;
	
КонецПроцедуры

#КонецОбласти