
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если Не ЗначениеЗаполнено (Объект.Филиал) Тогда
	//		Филиал = ПолучитьФилиалПользователя();
	//		Если Филиал <> Неопределено Тогда
	//			Объект.Филиал = Филиал
	//		КонецЕсли;
	//	КонецЕсли;
	//ЗаполнитьВидДеятельности();
КонецПроцедуры 



&НаСервере
Функция ПолучитьФилиалПользователя()
	НастройкаОрганизация = ПланыВидовХарактеристик.НастройкиПользователей.омг_ОсновнаяОрганизация;
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиПользователей.Значение КАК Организация
	               |ИЗ
	               |	РегистрСведений.НастройкиПользователей КАК НастройкиПользователей
	               |ГДЕ
	               |	НастройкиПользователей.Пользователь = &Пользователь
	               |	И НастройкиПользователей.Настройка = &НастройкаОрганизация";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("НастройкаОрганизация", НастройкаОрганизация);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
	    ОсновнаяОрганизация = Выборка.Организация
	КонецЕсли;
    Возврат ОсновнаяОрганизация;
		
КонецФункции

&НаСервере
Процедура ЗаполнитьВидДеятельности()
		Объект.ЛицензируемыйВидДеятельности = Справочники.КатегорииВыработки.МедицинскаяДеятельность
КонецПроцедуры





//&НаКлиенте
//Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
//	Если Объект.ЭтоПриложение Тогда
//			Отказ = Не ЗначениеЗаполнено (Объект.Родитель);
//			ПоказатьПредупреждение(,"Укажите основную лицензию!!!");
//		КонецЕсли;
//	Если Не Объект.Бессрочная Тогда
//			Отказ = Не ЗначениеЗаполнено (Объект.ДействуетДо);
//			ПоказатьПредупреждение(,"Укажите срок действия лицензии!!!");
//	КонецЕсли;
//	
//КонецПроцедуры  


&НаСервере
Функция ПолучитьАдресФилиала(МедицинскийЦентр)
	ТипКонтактнойИнформации = Перечисления.ТипыКонтактнойИнформации.Адрес;
	ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.АдресФактический;
	Запрос = Новый Запрос;
		 Запрос.Текст = "ВЫБРАТЬ
		         |	КонтактнаяИнформация.Представление КАК Представление
		         |ИЗ
		         |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		         |ГДЕ
		         |	КонтактнаяИнформация.Тип = &ТипКонтактнойИнформации
		         |	И КонтактнаяИнформация.Вид = &ВидКонтактнойИнформации
		         |	И КонтактнаяИнформация.Объект.Ссылка = &МедицинскийЦентр";
		 Запрос.УстановитьПараметр("ТипКонтактнойИнформации", ТипКонтактнойИнформации);
		Запрос.УстановитьПараметр("ВидКонтактнойИнформации", ВидКонтактнойИнформации);
		Запрос.УстановитьПараметр("МедицинскийЦентр", МедицинскийЦентр);
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать(); 
	 Пока Выборка.Следующий() Цикл
		 Возврат Выборка.Представление;
	КонецЦикла;
КонецФункции


&НаКлиенте
Процедура СписокПриложенийПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока И Не Копирование Тогда
        Элемент.ТекущиеДанные.НомерЛицензии = Объект.НомерЛицензии;
		Элемент.ТекущиеДанные.ДатаВыДачиЛицензии = Объект.ДатаВыдачиЛицензии;
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриложенийМедицинскийЦентрПриИзменении(Элемент)
		ТекущаяСтрока = Элементы.СписокПриложений.ТекущиеДанные;
		Если Не ЗначениеЗаполнено (ТекущаяСтрока.АдресПроизводственнойБазы) Тогда
			Адрес = ПолучитьАдресФилиала(ТекущаяСтрока.МедицинскийЦентр);
			ТекущаяСтрока.АдресПроизводственнойБазы = Адрес;
		КонецЕсли;

КонецПроцедуры






