#Область СлужебныеПроцедурыИФункции

// Получение из запроса его параметры 
Функция ПолучитьПараметрыЗапроса(Запрос) Экспорт
	
	ПараметрыЗапроса = Неопределено;
	
	//ТипРесурса = Запрос.Заголовки.Получить("Content-Type");
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку("UTF-8");
	
	//JSON
	Попытка 
		ЧтениеJSON = Новый ЧтениеJSON; 
		ЧтениеJSON.УстановитьСтроку(ТелоЗапроса); 
		ПараметрыЗапроса = ПрочитатьJSON(ЧтениеJSON, Ложь); 
		ЧтениеJSON.Закрыть();
		Возврат ПараметрыЗапроса;
	Исключение КонецПопытки;
	
	//XML
	Попытка
		ПараметрыЗапроса = ОбщегоНазначения.ЗначениеИзСтрокиXML(ТелоЗапроса);
		Возврат ПараметрыЗапроса;
	Исключение КонецПопытки;
	
	//x-www-form-urlencoded
	Попытка
		Тело = Строка(РаскодироватьСтроку(СтрЗаменить(ТелоЗапроса,"+","%20"),СпособКодированияСтроки.КодировкаURL));
		СтрокиПараметров = СтрРазделить(Тело, "&", Ложь);
		ПараметрыЗапроса = Новый Структура;
		Для Каждого СтрокаПараметра Из СтрокиПараметров Цикл
			
			КлючИЗначение = СтрРазделить(СтрокаПараметра, "=");
			Ключ = КлючИЗначение[0];
			Значение = КлючИЗначение[1];
			Если СтрНайти(Ключ,"[") = 0 Тогда
				ПараметрыЗапроса.Вставить(Ключ,Значение);
			Иначе
				Ключ = Лев(Ключ,СтрНайти(Ключ,"[")-1);
				Если ПараметрыЗапроса.Свойство(Ключ) Тогда
					ПараметрыЗапроса[Ключ].Добавить(Значение);
				Иначе
					ПараметрМассив = Новый Массив;
					ПараметрМассив.Добавить(Значение);
					ПараметрыЗапроса.Вставить(Ключ,ПараметрМассив);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Возврат ПараметрыЗапроса;
	Исключение КонецПопытки;
	
КонецФункции

// Функция по преобразованию данных из XML строки в строку указанного формата или строку JSON
Функция ПреобразоватьXMLВФормат(СтрокаXML, ФорматФайла = Неопределено) Экспорт
	
	Результат = "";
	
	// Если явно не задан возвращаемый формат, то мы преобразуем в JSON
	Если ФорматФайла = Неопределено
		ИЛИ ФорматФайла = "JSON"
		Тогда
		Результат = ВебИнтеграция.XML2JSON(СтрокаXML); 
		
	ИначеЕсли ФорматФайла = "XML" Тогда
		Результат =  СтрокаXML; 
		
	ИначеЕсли ФорматФайла = "ZipXML" Тогда
		ФайлXML = ПолучитьИмяВременногоФайла("xml");
		ЗаписьФайла = Новый ЗаписьXML;
		ЗаписьФайла.ОткрытьФайл(ФайлXML);
		ЗаписатьXML(ЗаписьФайла, СтрокаXML);
		ЗаписьФайла.Закрыть();
		// Ответ Base64строка
		Результат = ВебИнтеграция.АрхивироватьФайл(ФайлXML);
		УдалитьФайлы(ФайлXML);
		
	ИначеЕсли ФорматФайла = "ZipJSON" Тогда	
		ТекстJSON = ВебИнтеграция.XML2JSON(СтрокаXML);
		ФайлJSON = ПолучитьИмяВременногоФайла("json");
		ЗаписьФайла = Новый ЗаписьJSON;
		ЗаписьФайла.ОткрытьФайл(ФайлJSON);
		ЗаписатьJSON(ЗаписьФайла,ТекстJSON);
		ЗаписьФайла.Закрыть(); 
		// Ответ Base64строка
		Результат = ВебИнтеграция.АрхивироватьФайл(ФайлJSON);
		УдалитьФайлы(ФайлJSON);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ПроверкаПараметровЗапроса
// Функция, которая проверяет оиждаемые для конкретного вида запроса его параметры - правильного они формата или нет
// Если обязательность параметров различается от запрашиваемого типа (Method), то МетодВажен = Истина
Процедура ПроверитьИЗаполнитьОжидаемыеПараметрыЗапроса(Запрос, ОтносительныйURL, ПараметрыЗапроса, Ответ, МетодВажен = Ложь) Экспорт
	
	ПараметрыЗапроса = HTTPСервисыВызовСервера.ПолучитьПараметрыЗапроса(Запрос);
	ОписаниеОшибки = ПроверитьПараметрЗапроса(ПараметрыЗапроса, ОтносительныйURL, МетодВажен);
	
	// Заполним Ответ
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Ответ = Новый HTTPСервисОтвет(400);
		Ответ.УстановитьТелоИзСтроки(ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

// Проверяем ключ подлинности и все ожидаемые параметры
// Если не было ожидаемого параметра, но он не обязательный - поле будет добавлено в структуру со значением Неопределено
Функция ПроверитьПараметрЗапроса(ПараметрыЗапроса, ОтносительныйURL, МетодВажен = Ложь)
	
	// Сразу же проверим ключ
	ОписаниеОшибки = "";
	ПроверитьДобавитьНастройкиОбменаВПараметры(ПараметрыЗапроса,ОписаниеОшибки);	
	Если Не ПустаяСтрока(ОписаниеОшибки) Тогда
		Возврат ОписаниеОшибки;
	КонецЕсли;
	
	// Запрашиваемый тип может быть обязательным, если он определяем обязательные параметры
	ПроверяемыйМетод = "";
	Если МетодВажен Тогда		
		Если Не ПараметрыЗапроса.Свойство("Method",ПроверяемыйМетод)
			Или ТипЗнч(ПроверяемыйМетод) = Тип("Число")
			Или ПустаяСтрока(ПроверяемыйМетод)
			Тогда
			Возврат НСтр("ru = 'Ошибка: Неправильно задан параметр требуемого типа (Method).'");	
		КонецЕсли;
	КонецЕсли;		
	
	// Проверим, что в переданном виде у нас есть обязательные поля 	
	ПараметрыНаПроверку = ПолучитьСписокОжидаемыхПараметров(ОтносительныйURL, ПроверяемыйМетод);
	ПолученныйПараметрЗапроса = Неопределено;
	
	Для каждого ОжидаемыйПараметр Из ПараметрыНаПроверку Цикл
		
		// Проверим наличие ожидаемого параметра
		Если ПараметрыЗапроса.Свойство(ОжидаемыйПараметр.Представление,ПолученныйПараметрЗапроса) Тогда 
			
			НовЗначение = ПроверкаКорректностиПараметра(ПолученныйПараметрЗапроса, ОжидаемыйПараметр.Значение);
			Если НовЗначение = Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ОписаниеОшибки, СтрШаблон(НСтр("ru='Ошибка: неправильное значение параметра ''%1'''"),ОжидаемыйПараметр.Представление), Символы.ПС);	
			Иначе
				ПараметрыЗапроса.Вставить(ОжидаемыйПараметр.Представление,НовЗначение);			
			КонецЕсли;
		Иначе
			// Такого свойства нет, проверяем его обязательное присутствие	
			Если ОжидаемыйПараметр.Пометка Тогда
				ОбщегоНазначенияКлиентСервер.КонкатенацияСтрок(ОписаниеОшибки, СтрШаблон(НСтр("ru='Ошибка: незаполнен параметр ''%1'''"),ОжидаемыйПараметр.Представление), Символы.ПС);	
			Иначе
				ПараметрыЗапроса.Вставить(ОжидаемыйПараметр.Представление,Неопределено);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОписаниеОшибки;
	
КонецФункции

// Возвращает список значений, где 
// Пометка означает обязательный ли для заполнения,
// Значение - тип данных, Представление - название параметра
// Если значение может иметь несколько типов, то они должны быть перечислены через ; без пробелов
Функция ПолучитьСписокОжидаемыхПараметров(ОтносительныйURL, ПереданныйМетод)
	
	ОжидаемыеПараметры = Новый СписокЗначений;		
	
	Если ОтносительныйURL = "/schedule" Тогда
		ОжидаемыеПараметры.Добавить("Дата","StartDate", Истина);
		ОжидаемыеПараметры.Добавить("Дата","FinishDate", Истина);
		ОжидаемыеПараметры.Добавить("СправочникФилиалы","Clinic");
		ОжидаемыеПараметры.Добавить("СправочникСотрудники","Employees");
		ОжидаемыеПараметры.Добавить("Строка","Format");
		ОжидаемыеПараметры.Добавить("Строка","Method");
		
	ИначеЕсли ОтносительныйURL = "/appointmentStatus" Тогда
		ОжидаемыеПараметры.Добавить("ДокументЗаявка","GUID", Истина);
		
	ИначеЕсли ОтносительныйURL = "/appointmentCancel" Тогда
		ОжидаемыеПараметры.Добавить("ДокументЗаявка","GUID", Истина);
		ОжидаемыеПараметры.Добавить("Строка","Reason", Истина);
		ОжидаемыеПараметры.Добавить("Строка","AdditionalInformation", Истина);
		
	ИначеЕсли ОтносительныйURL = "/appointmentCreate" Тогда
		ОжидаемыеПараметры.Добавить("СправочникСотрудники","EmployeeID", (СтрНачинаетсяС(ПереданныйМетод,"BookAnAppointment")) );
		ОжидаемыеПараметры.Добавить("Дата","Date", Истина);
		ОжидаемыеПараметры.Добавить("Время","TimeBegin", Истина);
		ОжидаемыеПараметры.Добавить("СправочникФилиалы","Clinic", Истина);
		ОжидаемыеПараметры.Добавить("СправочникКлиенты","Client", (СтрНайти(ПереданныйМетод,"Client") > 0) );
		ОжидаемыеПараметры.Добавить("СправочникНоменклатура","Service", (ПереданныйМетод = "BookAnAppointmentWithClient"));
		ОжидаемыеПараметры.Добавить("ДокументЗаявка","GUID");
		ОжидаемыеПараметры.Добавить("Строка","PatientSurname");
		ОжидаемыеПараметры.Добавить("Строка","PatientName");
		ОжидаемыеПараметры.Добавить("Строка","PatientFatherName");
		ОжидаемыеПараметры.Добавить("Строка","Comment");
		ОжидаемыеПараметры.Добавить("Строка","Phone");
		ОжидаемыеПараметры.Добавить("Строка","Email");
		ОжидаемыеПараметры.Добавить("Строка","Address");
		ОжидаемыеПараметры.Добавить("Строка","Specialization");
		// Неявные параметры
		ОжидаемыеПараметры.Добавить("Дата","Birthday");
		ОжидаемыеПараметры.Добавить("Время","Duration");
		ОжидаемыеПараметры.Добавить("Строка","DurationType");
		ОжидаемыеПараметры.Добавить("СправочникОборудование","EquipmentCabinet");

	ИначеЕсли ОтносительныйURL = "/data" Тогда
		ОжидаемыеПараметры.Добавить("Строка","Method", Истина);
		ОжидаемыеПараметры.Добавить("СправочникФилиалы","Clinic");
		ОжидаемыеПараметры.Добавить("СправочникСотрудники","EmployeeID");
		ОжидаемыеПараметры.Добавить("Строка","SearchName");
		
	ИначеЕсли ОтносительныйURL = "/reservation" Тогда
		ОжидаемыеПараметры.Добавить("Дата","Date", Истина);
		ОжидаемыеПараметры.Добавить("Время","TimeBegin", Истина);
		ОжидаемыеПараметры.Добавить("СправочникФилиалы","Clinic", Истина);
		ОжидаемыеПараметры.Добавить("СправочникСотрудники;СправочникОборудование","EmployeeID", Истина);
		ОжидаемыеПараметры.Добавить("Время","Duration");
		ОжидаемыеПараметры.Добавить("СправочникОборудование","EquipmentCabinet");
	Иначе
	КонецЕсли;
	
	Возврат ОжидаемыеПараметры;
КонецФункции

// Проверим, что параметр корректный - ссылка существует, Дата устанавливается
// Нам не важен какой конкретно вид запроса обрабатывается, ведь этот параметр был передан
Функция ПроверкаКорректностиПараметра(ПроверяемоеЗнач, ОжидаемыйТип)
	
	МассивПроверяемыхТипов = СтрРазделить(ОжидаемыйТип,";");
	ОднаПроверка = МассивПроверяемыхТипов.Количество() = 1;
	
	Для каждого ПроверяемыйТип Из МассивПроверяемыхТипов Цикл
		
		ПроверяемыйТип = СокрЛП(ПроверяемыйТип);
		
		Если ПроверяемыйТип = "Строка" Тогда
			
			Возврат ПроверяемоеЗнач;	
			
		ИначеЕсли ПроверяемыйТип = "Дата" Тогда
			
			// Проверяем и получаем из значения дату. Значение может быть вида "гггг-мм-ддTчч:мм:сс"
			ПроверяемоеЗнач = СтрЗаменить(ПроверяемоеЗнач, "T", " ");
			ПреобразованнаяДата = СтроковыеФункцииКлиентСервер.СтрокаВДату(ПроверяемоеЗнач);
			Возврат ?(ЗначениеЗаполнено(ПреобразованнаяДата), ПреобразованнаяДата, Неопределено);		
			
		ИначеЕсли ПроверяемыйТип = "Время" Тогда	
			
			// Проверяем и получаем из значения время
			ПроверяемоеЗнач = СтрЗаменить(ПроверяемоеЗнач, "T", " ");
			ПреобразованноеВремя = СтроковыеФункцииКлиентСервер.СтрокаВДату(ПроверяемоеЗнач, ЧастиДаты.Время);
			Если ЗначениеЗаполнено(ПреобразованноеВремя) Тогда
				Возврат ПреобразованноеВремя;
			КонецЕсли;
			
		ИначеЕсли СтрНачинаетсяС(ПроверяемыйТип, "Справочник") Тогда
			
			// Проверяем перечисленные через ; УИД по справочникам
			РезультатМассивСсылок = Новый Массив;
			МассивИскомыхУИД = СтрРазделить(ПроверяемоеЗнач, ";");                   
			
			Для каждого ИскомыйУД Из МассивИскомыхУИД Цикл
                Попытка
					ПроверяемаяСсылка = Справочники[Сред(ПроверяемыйТип,11)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(ИскомыйУД)) );	
				Исключение
					Если ОднаПроверка Тогда
						Возврат Неопределено;
					КонецЕсли;
				КонецПопытки; 
				
				Если ПроверяемаяСсылка.ПолучитьОбъект() = Неопределено Тогда
					Если ОднаПроверка Тогда
						Возврат Неопределено;
					Иначе	
						Продолжить;	
					КонецЕсли;
				КонецЕсли;
				
				РезультатМассивСсылок.Добавить(ПроверяемаяСсылка);
			КонецЦикла;
			
			Если ОднаПроверка Или РезультатМассивСсылок.Количество() > 0 Тогда
				Возврат РезультатМассивСсылок;
			КонецЕсли;			 
			
		ИначеЕсли СтрНачинаетсяС(ПроверяемыйТип, "Документ") Тогда	
			
			// Проверяем перечисленные через ; УИД по документам
			РезультатМассивСсылок = Новый Массив;
			МассивИскомыхУИД = СтрРазделить(ПроверяемоеЗнач, ";");                   
			
			Для каждого ИскомыйУД Из МассивИскомыхУИД Цикл
				Попытка
				ПроверяемаяСсылка = Документы[Сред(ПроверяемыйТип,9)].ПолучитьСсылку(Новый УникальныйИдентификатор(СокрЛП(ПроверяемоеЗнач)) );	
				Исключение
				    Если ОднаПроверка Тогда
						Возврат Неопределено;
					КонецЕсли;
				КонецПопытки; 
				
				Если ПроверяемаяСсылка.ПолучитьОбъект() = Неопределено Тогда
					Если ОднаПроверка Тогда
						Возврат Неопределено;
					Иначе
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				РезультатМассивСсылок.Добавить(ПроверяемаяСсылка);
			КонецЦикла;
			
			Если ОднаПроверка Или РезультатМассивСсылок.Количество() > 0 Тогда
				Возврат РезультатМассивСсылок;
			КонецЕсли;					
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции
#КонецОбласти

#Область Заявки

// Расчитать предполагаемое время окончания для заявки
// По приоритету: Стандарт у сотрудника -> Стандарт у специализации -> периодичность у календаря или ошибка
Функция ВычислитьВремяОкончания(ВремяНачалаЗаписи, Сотрудник, ОписаниеОшибки, МассивУслуг = Неопределено) Экспорт
	
	ВремяОкончанияЗаписи = 0;
	БазоваяПериодичность = УправлениеНастройками.ПолучитьУчетнуюПолитику().ПериодичностьПланирования;	
	
	Попытка	
		// Получим предполагаемое время окончания, по приоритету: Стандарт услуги -> Стандарт у сотрудника ->
		//														Стандарт у специализации -> Периодичность у календаря 
		Если ЗначениеЗаполнено(МассивУслуг)
			И ТипЗнч(МассивУслуг) = Тип("Массив")
			И МассивУслуг.Количество() > 0
			Тогда
			
			ПериодичностьУП = 0;
			УслугиСДлительностью = ВебИнтеграция.НормативнаяДлительностьУслуг(МассивУслуг, Сотрудник);
			Для каждого СсылкаУслуги Из МассивУслуг Цикл
				ДлительностьУслуги = УслугиСДлительностью.Получить(СсылкаУслуги);
				Если ДлительностьУслуги <> Неопределено Тогда
					ПериодичностьУП = ПериодичностьУП + ДлительностьУслуги;
				КонецЕсли;
			КонецЦикла;
			
			Если ПериодичностьУП > 0 Тогда
				Возврат ВремяОкончанияЗаписи = ВремяНачалаЗаписи + ПериодичностьУП;
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Оборудование") Тогда
			
			// У оборудования нет возможности указать стандартную длительность, поэтому используем базовую периодичность
			Если ЗначениеЗаполнено(БазоваяПериодичность) Тогда
				ПериодичностьУП =  БазоваяПериодичность - Дата("00010101");			
			Иначе
				ОписаниеОшибки = СтрШаблон(НСтр("ru = '%1 Ошибка при расчете времени окончания: в базе не настроена периодичность бронирования и у сотрудника не задана длительность приема. %2'"),ОписаниеОшибки,Символы.ПС);				
			КонецЕсли;

		ИначеЕсли ЗначениеЗаполнено(Сотрудник) И ЗначениеЗаполнено(Сотрудник.ДлительностьПриема) Тогда
			
			ПериодичностьУП = Сотрудник.ДлительностьПриема - Дата("00010101");
			
		ИначеЕсли Справочники.Сотрудники.ПустаяСсылка().Метаданные().Реквизиты.Найти("Специализация") <> Неопределено
			И ЗначениеЗаполнено(Сотрудник)
			И ЗначениеЗаполнено(Сотрудник.Специализация)
			И ЗначениеЗаполнено(Сотрудник.Специализация.ДлительностьПриема)
			Тогда
			
			ПериодичностьУП = Сотрудник.Специализация.ДлительностьПриема - Дата("00010101");
			
		ИначеЕсли ЗначениеЗаполнено(БазоваяПериодичность) Тогда 
			ПериодичностьУП =  БазоваяПериодичность - Дата("00010101");
		Иначе
			ОписаниеОшибки = СтрШаблон(НСтр("ru = '%1 Ошибка при расчете времени окончания: в базе не настроена периодичность бронирования и у сотрудника не задана длительность приема. %2'"),ОписаниеОшибки,Символы.ПС);
		КонецЕсли;
		
		ВремяОкончанияЗаписи = ВремяНачалаЗаписи + ПериодичностьУП;
	Исключение
		// Запись об ошибке считывания даты
		ОписаниеОшибки = СтрШаблон(НСтр("ru = '%1 Ошибка при расчете времени окончания. %2'"),ОписаниеОшибки,Символы.ПС);
	КонецПопытки;
	
	Возврат ВремяОкончанияЗаписи;
	
КонецФункции

#КонецОбласти

#Область НастройкиОбменаССайтом

Процедура ПроверитьДобавитьНастройкиОбменаВПараметры(ДопПараметры, ОписаниеОшибки)
	
	ПроверяемыйКлюч = Неопределено;
	
	Если НЕ ДопПараметры.Свойство("Key",ПроверяемыйКлюч) Тогда
		ОписаниеОшибки = НСтр("ru = 'Ошибка авторизации: Несанкционированный доступ'");
		Возврат; 
	КонецЕсли;

    // Настройки обмена задаются ссылкой
	// Аналогично ВебИнтеграция.ПолучитьНастройкиОбменаССайтом(Филиал)
	Попытка
		НастройкиОбмена = Справочники.НастройкиОбменаССайтом.НайтиПоРеквизиту("КлючБезопасности",ПроверяемыйКлюч);
	Исключение
		ОписаниеОшибки = НСтр("ru = 'Ошибка авторизации: Невозможно подтвердить доступ'");
		Возврат;
	КонецПопытки;
	
	Если НастройкиОбмена.Пустая() Тогда
		ОписаниеОшибки = НСтр("ru = 'Ошибка авторизации: Несанкционированный доступ'");
		Возврат; 	
	Иначе
		ДопПараметры.Вставить("НастройкиОбмена", НастройкиОбмена);
	КонецЕсли;	
	
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти
