#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьВерсиюИзКонстанты();
	Если ПерейтиВКлиентЛицензированияПриОткрытии Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ИспользуемаяВерсияСистемыЛицензирования.Доступность = ПравоДоступа("Администрирование",Метаданные);
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86_64
		Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86
	Тогда
		Элементы.ИспользуемаяВерсияСистемыЛицензирования.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПерейтиВКлиентЛицензированияПриОткрытии Тогда
		Отказ = Истина;
		ОткрытьФормуСистемыЛицензирования("");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФормуСистемыЛицензирования(Команда)
	
	Если ИспользуемаяВерсияСистемыЛицензирования = "2.0" Тогда 
		сл2_клиент.СЛ20ОткрытьФормуКлиентаЛицензирования();
	Иначе 
		доп_сл_клиент.ОткрытьФормуКлиентаЛицензирования();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИспользуемаяВерсияСистемыЛицензированияПриИзменении(Элемент)
	
	ТекстВопроса = НСтр("ru='Для применения изменений необходимо перезапустить приложение. Перезапустить приложение?'");
	Оповещение = Новый ОписаниеОповещения("Перезапустить_ПослеПодтверждения", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ОКОтмена, 60, КодВозвратаДиалога.ОК); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьВерсиюИзКонстанты()
	
	УстановитьПривилегированныйРежим(Истина);
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86_64
		Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86
	Тогда
		ИспользуемаяВерсияСистемыЛицензирования = "1.6";
	Иначе
		ИспользуемаяВерсияСистемыЛицензирования = Константы.ИспользуемаяВерсияСистемыЛицензирования.Получить();	
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИспользуемаяВерсияСистемыЛицензирования) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Константы.ИспользуемаяВерсияСистемыЛицензирования.Установить("2.0");
		ПерейтиВКлиентЛицензированияПриОткрытии = Истина;
		
	ИначеЕсли ИспользуемаяВерсияСистемыЛицензирования = "2.0" Тогда
		СрокВозможностиВернутьсяВ16 = 10 * 86400;
		ДатаПереходаНа20 = Константы.ДатаПереходаНаСистемуЛицензирования20.Получить();
		
		Если Не ЗначениеЗаполнено(ДатаПереходаНа20)
			Или (ТекущаяДата() - ДатаПереходаНа20) > СрокВозможностиВернутьсяВ16
		Тогда
			УстановитьПривилегированныйРежим(Истина);
			Константы.ИспользуемаяВерсияСистемыЛицензирования.Установить("2.0");
			ПерейтиВКлиентЛицензированияПриОткрытии = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Перезапустить_ПослеПодтверждения(Ответ, ДополнительныеПараметры) Экспорт
  
	Если Ответ = КодВозвратаДиалога.ОК Тогда 
		СохранитьНовуюВерсиюСЛ(ИспользуемаяВерсияСистемыЛицензирования);
		ЗавершитьРаботуСистемы(Истина, Истина);
	Иначе
		Если ИспользуемаяВерсияСистемыЛицензирования = "2.0" Тогда 
			ИспользуемаяВерсияСистемыЛицензирования = "1.6";
		Иначе 
			ИспользуемаяВерсияСистемыЛицензирования = "2.0"	
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры 

&НаСервереБезКонтекста
Процедура СохранитьНовуюВерсиюСЛ(ИспользуемаяВерсияСистемыЛицензирования) 
	
	ВерсияДоИзменения = Константы.ИспользуемаяВерсияСистемыЛицензирования.Получить();
	
	// Сохранение версии
	Если ИспользуемаяВерсияСистемыЛицензирования <> ВерсияДоИзменения Тогда
		
		Если ВерсияДоИзменения = "1.6" Тогда 
			Константы.ДатаПереходаНаСистемуЛицензирования20.Установить(ТекущаяДата());
		Иначе
			Константы.ДатаПереходаНаСистемуЛицензирования20.Установить(Дата(1,1,1));
		КонецЕсли;
		
		Константы.ИспользуемаяВерсияСистемыЛицензирования.Установить(ИспользуемаяВерсияСистемыЛицензирования);
	КонецЕсли;
	
	// Регламентные задания
	Если ИспользуемаяВерсияСистемыЛицензирования = "2.0" Тогда 
		ЗаданиеСЛ2 = РегламентныеЗадания.НайтиПредопределенное("сл2_МенеджерСеансов");
		ЗаданиеСЛ2.Использование = Истина;
		ЗаданиеСЛ2.Записать();
		ЗаданиеБитСЛ = РегламентныеЗадания.НайтиПредопределенное("доп_сл_МенеджерСеансов");
		ЗаданиеБитСЛ.Использование = Ложь;
		ЗаданиеБитСЛ.Записать();
	Иначе 
		ЗаданиеСЛ2 = РегламентныеЗадания.НайтиПредопределенное("сл2_МенеджерСеансов");
		ЗаданиеСЛ2.Использование = Ложь;
		ЗаданиеСЛ2.Записать();
		ЗаданиеБитСЛ = РегламентныеЗадания.НайтиПредопределенное("доп_сл_МенеджерСеансов");
		ЗаданиеБитСЛ.Использование = Истина;
		ЗаданиеБитСЛ.Записать();
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти