
Процедура ОбработкаПроведения(Отказ, Режим)

	Стационар.ПроверитьВозможностьИзмененияСостоянияКойкоМеста(ЭтотОбъект,,Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("ДокументОснование") Тогда 
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.ДокументОснование,,"Дата, Номер, ПометкаУдаления, Проведен, Ссылка");
		Иначе 
			ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		КонецЕсли;
	КонецЕсли;
		
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры
