
Функция СобратьДанныеЧеков(ДокументСсылка, НомерСекции, ВерсияФормата, СообщениеОбОшибке) Экспорт
	
	Если ДокументСсылка.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОказанияУслуг.ПродажаКлиенту") Тогда
		ТипРасчета = 1;		
	Иначе
		ТипРасчета = 2;	
	КонецЕсли;

	
	ПараметрыПечатиЧека = ПодготовитьПараметрыПечатиЧека(ДокументСсылка);
	
	РеквизитыПечатиЧека = ПараметрыПечатиЧека.РеквизитыПечатиЧека;
	Если РеквизитыПечатиЧека.Количество() = 0 Тогда
		Возврат Новый Структура;
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РеквизитыПечатиЧека[0]);
			
	Реквизиты.Вставить("ТипРасчета",              ТипРасчета);
	Реквизиты.Вставить("НаименованиеВСтрокеЧека", НаименованиеВСтрокеЧека(Реквизиты));
	Реквизиты.Вставить("НомерСекции",             НомерСекции);
	Если ДокументСсылка.ПолученоНаличными > 0 Тогда      
	Реквизиты.Вставить("ТипОплаты",               Перечисления.ТипыОплатыККТ.Наличные);	
	Иначе	
	Реквизиты.Вставить("ТипОплаты",               Перечисления.ТипыОплатыККТ.Электронно);
	КонецЕсли;
	Реквизиты.Вставить("ДокументОснование",        ДокументСсылка);
	
	ПараметрыОперацииФискализацииЧека = омг_WebKassa.ПараметрыОперацииФискализацииЧека(Реквизиты, ПараметрыПечатиЧека, ВерсияФормата, СообщениеОбОшибке);
	
	//Данные по первичному чеку для возврата
	ЧекПродажи = Документы.ОказаниеУслуг.ПустаяСсылка();
	Если ТипЗнч(Реквизиты.Основание) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
		
		ЧекПродажи = Реквизиты.Основание; 
		
	КонецЕсли;

	ПараметрыОперацииФискализацииЧека.Вставить("ДанныеПервичногоЧека", ПодключаемоеОборудованиеБКВызовСервера.СтруктураФискальнойОперацииРК());
	ПараметрыОперацииФискализацииЧека.Вставить("ЧекПродажи", ЧекПродажи);
	
	Возврат ПараметрыОперацииФискализацииЧека;  
	
КонецФункции

Функция НаименованиеВСтрокеЧека(СтруктураШапки)
	
	Если ЗначениеЗаполнено(СтруктураШапки.ПринятоОт) Тогда
		
		ШаблонНаименования = НСтр("ru = 'Оплата от: %1%2Основание: %3'");
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименования, СтруктураШапки.ПринятоОт, " ", СтруктураШапки.Основание);
		
	Иначе
		
		ШаблонНаименования = НСтр("ru = 'Основание: %1'");
		Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименования, СтруктураШапки.Основание);
		
	КонецЕсли;
	
КонецФункции

Функция ТекстЗапросаРеквизитыПечатиЧека(НомераТаблиц)
	
	НомераТаблиц.Вставить("РеквизитыПечатиЧека",      НомераТаблиц.Количество());
	НомераТаблиц.Вставить("РасшифровкаПлатежа",       НомераТаблиц.Количество());
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Заявка.Ссылка КАК Ссылка,
	|	Заявка.Дата КАК Дата,
	|	Заявка.Номер КАК Номер,
	|	Заявка.Филиал.Организация КАК Организация,
	|	"""" КАК Основание,
	|	"""" КАК ВидОперации,
	|	"""" КАК Контрагент,
	|	"""" КАК ПринятоОт,
	|	Заявка.СуммаДокумента КАК СуммаДокумента,
	|	"""" КАК ВалютаДокумента,
	|	"""" КАК ДокументРасшифровкиПозиций,
	|	Заявка.Пациент.ИНН КАК ПолучательИИН
	|ИЗ
	|	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС КАК Заявка
	|ГДЕ
	|	Заявка.Ссылка = &Заявка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаАнализы.Номенклатура.НаименованиеПолное КАК Ссылка,
	|	"""" КАК ДоговорКонтрагента,
	|	"""" КАК СтавкаНДС,
	|	"""" КАК СуммаНДС,
	|	ЗаявкаАнализы.Цена - ЗаявкаАнализы.СуммаСкидки КАК СуммаПлатежа,
	|	ЗаявкаАнализы.Цена - ЗаявкаАнализы.СуммаСкидки КАК СуммаВзаиморасчетов
	|ИЗ
	|	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Анализы КАК ЗаявкаАнализы
	|ГДЕ
	|	ЗаявкаАнализы.Ссылка = &Заявка";
	
	Возврат ТекстЗапроса + омг_WebKassa.ТекстРазделителяЗапросовПакета();
КонецФункции

Функция ПодготовитьПараметрыПечатиЧека(ДокументСсылка)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заявка", ДокументСсылка);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", омг_WebKassa.ПолучитьВалютуРегламентированногоУчета());
	
	НомераТаблиц = Новый Структура;
	
	Запрос.Текст = ТекстЗапросаРеквизитыПечатиЧека(НомераТаблиц) ;
	
	Результат = Запрос.ВыполнитьПакет();
	
	ПараметрыПечатиЧека = Новый Структура;
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПечатиЧека.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	Возврат ПараметрыПечатиЧека;
КонецФункции

Функция ПолучитьДанныеПациента(Пациент) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Клиенты.Ссылка КАК Пациент,
	               |	Клиенты.Фамилия КАК Фамилия,
	               |	Клиенты.Имя КАК Имя,
	               |	Клиенты.Отчество КАК Отчество,
	               |	Клиенты.Пол КАК Пол,
	               |	Клиенты.омг_МестоПрикрепления КАК МестоПрикрепления,
	               |	Клиенты.ДатаРождения КАК ДатаРождения,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	               |				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(1000))
	               |			ИНАЧЕ """"
	               |		КОНЕЦ) КАК Адрес,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	               |				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(1000))
	               |			ИНАЧЕ """"
	               |		КОНЕЦ) КАК НомерТелефона,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	               |				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК СТРОКА(1000))
	               |			ИНАЧЕ """"
	               |		КОНЕЦ) КАК АдресЭлПочты,
	               |	ВложенныйЗапрос.НомерКарты КАК НомерКарты,
	               |	ВложенныйЗапрос.Скидка КАК Скидка
	               |ИЗ
	               |	Справочник.Клиенты КАК Клиенты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |		ПО (КонтактнаяИнформация.Объект = Клиенты.Ссылка)
	               |			И (КонтактнаяИнформация.Тип В (&ТипыКИ))
	               |			И (КонтактнаяИнформация.Вид В (&ВидыКИ))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	               |			Клиентыомг_КартыСкидок.Карта КАК НомерКарты,
	               |			Клиентыомг_КартыСкидок.Карта.ВидКарты КАК Скидка,
	               |			Клиентыомг_КартыСкидок.НомерСтроки КАК НомерСтроки
	               |		ИЗ
	               |			Справочник.Клиенты.омг_КартыСкидок КАК Клиентыомг_КартыСкидок
	               |		ГДЕ
	               |			Клиентыомг_КартыСкидок.Ссылка = &Пациент
	               |		
	               |		УПОРЯДОЧИТЬ ПО
	               |			НомерКарты УБЫВ) КАК ВложенныйЗапрос
	               |		ПО (ИСТИНА)
	               |ГДЕ
	               |	Клиенты.Ссылка = &Пациент
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Клиенты.Ссылка,
	               |	Клиенты.Фамилия,
	               |	Клиенты.Имя,
	               |	Клиенты.Отчество,
	               |	Клиенты.Пол,
	               |	Клиенты.омг_МестоПрикрепления,
	               |	Клиенты.ДатаРождения,
	               |	ВложенныйЗапрос.НомерКарты,
	               |	ВложенныйЗапрос.Скидка";
	Запрос.УстановитьПараметр("Пациент", Пациент);
	ТипыКИ = Новый Массив;
	ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Адрес);
	ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	ТипыКИ.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	ВидыКИ = Новый Массив;
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.АдресФактический);
	ВидыКИ.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
	Запрос.УстановитьПараметр("ТипыКИ", ТипыКИ);
	Запрос.УстановитьПараметр("ВидыКИ", ВидыКИ);
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДанных = Новый Структура;
	
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СтруктураДанных.Вставить(Колонка.Имя);
	КонецЦикла;
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
			СтруктураДанных[Колонка.Имя] = Выборка[Колонка.Имя]; 
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураДанных.НомерТелефона) Тогда
		СтруктураДанных.НомерТелефона = Прав(омг_ИнтеграцияСЛИСОбщегоНазначенияКлиентСервер.УбратьСимволыИзТелефона(СтруктураДанных.НомерТелефона), 11);
	КонецЕсли;

	Возврат СтруктураДанных;
	
КонецФункции

Процедура ПересчитатьИтоги(Объект, Форма = Неопределено) Экспорт
	
	Возврат;
	
	Если Форма = Неопределено Тогда
		Форма = Новый Структура("ИтогоСоСкидкой, СуммаСкидки", 0, 0);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(РазмерыСкидокСрезПоследних.Фильтр) = ТИП(Справочник.ВидыКартСкидок)
	               |			ТОГДА ""Карта""
	               |		ИНАЧЕ РазмерыСкидокСрезПоследних.Фильтр
	               |	КОНЕЦ КАК Фильтр,
	               |	РазмерыСкидокСрезПоследних.Номенклатура КАК Номенклатура,
	               |	РазмерыСкидокСрезПоследних.ПроцентСкидки КАК ПроцентСкидки,
	               |	ЛОЖЬ КАК Эксклюзивная,
	               |	ВЫБОР
	               |		КОГДА НЕ РазмерыСкидокСрезПоследних.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Порядок
	               |ИЗ
	               |	РегистрСведений.РазмерыСкидок.СрезПоследних(, Фильтр В (&Фильтр)) КАК РазмерыСкидокСрезПоследних
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	омг_ДополнительныеСкидки.Ссылка,
	               |	NULL,
	               |	омг_ДополнительныеСкидки.Размер,
	               |	омг_ДополнительныеСкидки.Эксклюзивная,
	               |	0
	               |ИЗ
	               |	Справочник.омг_ДополнительныеСкидки КАК омг_ДополнительныеСкидки
	               |ГДЕ
	               |	омг_ДополнительныеСкидки.Ссылка В(&Фильтр)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""Карта"",
	               |	NULL,
	               |	ВидыСкидокРазмерыСкидки.Размер,
	               |	ЛОЖЬ,
	               |	ВЫБОР
	               |		КОГДА ДействиеСкидок.Филиал = &Филиал
	               |			ТОГДА -2
	               |		ИНАЧЕ -1
	               |	КОНЕЦ
	               |ИЗ
	               |	РегистрСведений.ДействиеСкидок КАК ДействиеСкидок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыСкидок.РазмерыСкидки КАК ВидыСкидокРазмерыСкидки
	               |		ПО ДействиеСкидок.ВидСкидки = ВидыСкидокРазмерыСкидки.Ссылка
	               |ГДЕ
	               |	(ДействиеСкидок.Филиал = &Филиал
	               |			ИЛИ ДействиеСкидок.Филиал = ЗНАЧЕНИЕ(Справочник.Филиалы.ПустаяСсылка))
	               |	И ДействиеСкидок.Получатель В(&Фильтр)
	               |	И ВЫБОР
	               |			КОГДА НЕ ДействиеСкидок.ДатаНачалаДействия = &ПустаяДата
	               |					ИЛИ НЕ ДействиеСкидок.ДатаОкончанияДействия = &ПустаяДата
	               |				ТОГДА ВЫБОР
	               |						КОГДА &ДатаДокумента МЕЖДУ ДействиеСкидок.ДатаНачалаДействия И ВЫБОР
	               |								КОГДА ДействиеСкидок.ДатаОкончанияДействия = &ПустаяДата
	               |									ТОГДА &ДатаДокумента
	               |								ИНАЧЕ ДействиеСкидок.ДатаОкончанияДействия
	               |							КОНЕЦ
	               |							ТОГДА ИСТИНА
	               |						ИНАЧЕ ЛОЖЬ
	               |					КОНЕЦ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок,
	               |	ПроцентСкидки";
	Фильтр = Новый Массив;
	Фильтр.Добавить(Объект.Скидка);
	Фильтр.Добавить(Объект.ДопСкидка1);
	Фильтр.Добавить(Объект.ДопСкидка2);
	Фильтр.Добавить(Объект.НомерКарты);
	Запрос.УстановитьПараметр("Фильтр", Фильтр);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.УстановитьПараметр("Филиал", Объект.Филиал);
	Запрос.УстановитьПараметр("ДатаДокумента", ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДата()));
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаСкидок = РезультатЗапроса.Выбрать();
	
	Форма.ИтогоСоСкидкой = 0;
	Форма.СуммаСкидки = 0;
	
	Для Каждого СтрокаТаблицы Из Объект.Анализы Цикл
		
		ВыборкаСкидок.Сбросить();
		СтрокаТаблицы.СуммаСкидки = 0;
		Если ВыборкаСкидок.НайтиСледующий(СтрокаТаблицы.Номенклатура, "Номенклатура") Тогда
			Форма.СуммаСкидки = Форма.СуммаСкидки + (СтрокаТаблицы.Цена * ВыборкаСкидок.ПроцентСкидки / 100);
			Продолжить;
		КонецЕсли;
		ВыборкаСкидок.Сбросить();
		Если ВыборкаСкидок.НайтиСледующий(Объект.ДопСкидка2, "Фильтр") Тогда
			
			СтрокаТаблицы.СуммаСкидки = (СтрокаТаблицы.Цена * ВыборкаСкидок.ПроцентСкидки / 100);
		
			Форма.СуммаСкидки = Форма.СуммаСкидки + СтрокаТаблицы.СуммаСкидки;
			Продолжить;
		КонецЕсли;
		
		ПроцентСкидки1 = 0;
		ПроцентСкидки2 = 0;
		
		ВыборкаСкидок.Сбросить();
		Если ВыборкаСкидок.НайтиСледующий("Карта", "Фильтр") Тогда
			
			ПроцентСкидки1 = ВыборкаСкидок.ПроцентСкидки;
			
			СтрокаТаблицы.СуммаСкидки = СтрокаТаблицы.СуммаСкидки + (СтрокаТаблицы.Цена * ПроцентСкидки1 / 100);
			
		КонецЕсли;
		ВыборкаСкидок.Сбросить();
		Если ВыборкаСкидок.НайтиСледующий(Объект.ДопСкидка1, "Фильтр") Тогда
			
			ПроцентСкидки2 = ВыборкаСкидок.ПроцентСкидки;
			
			СтрокаТаблицы.СуммаСкидки = СтрокаТаблицы.СуммаСкидки + (СтрокаТаблицы.Цена * ПроцентСкидки2 / 100);		

		КонецЕсли;
		
		Форма.СуммаСкидки = Форма.СуммаСкидки + СтрокаТаблицы.СуммаСкидки;
		Форма.ИтогоСоСкидкой = Форма.ИтогоСоСкидкой + СтрокаТаблицы.Цена;
		
	КонецЦикла;
	
	Форма.ИтогоСоСкидкой = Форма.ИтогоСоСкидкой - Форма.СуммаСкидки;
	Объект.СуммаДокумента = Форма.ИтогоСоСкидкой;
	
	Объект.ОплаченоБезналичным = Объект.СуммаДокумента;
	Объект.ПолученоНаличными = 0;
	Объект.Сдача = 0;
	
КонецПроцедуры

Функция ПолучитьСписокКонтейнеров(МассивУслуг, Филиал) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_НастройкиИнтеграцииСЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |ПОМЕСТИТЬ ВТ_ГруппаЛИС
	               |ИЗ
	               |	РегистрСведений.омг_НастройкиИнтеграцииСЛИС КАК омг_НастройкиИнтеграцииСЛИС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаУслуг.Номенклатура КАК Номенклатура,
	               |	ТаблицаУслуг.Проба КАК Проба
	               |ПОМЕСТИТЬ ВТ_ТаблицаУслуг
	               |ИЗ
	               |	&ТаблицаУслуг КАК ТаблицаУслуг
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НоменклатураКомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
	               |	НоменклатураКомплектующиеНоменклатуры.Ссылка КАК Номенклатура,
	               |	ВТ_ТаблицаУслуг.Проба КАК Проба
	               |ПОМЕСТИТЬ ВТ_Комплектующие
	               |ИЗ
	               |	ВТ_ТаблицаУслуг КАК ВТ_ТаблицаУслуг
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.КомплектующиеНоменклатуры КАК НоменклатураКомплектующиеНоменклатуры
	               |		ПО ВТ_ТаблицаУслуг.Номенклатура = НоменклатураКомплектующиеНоменклатуры.Ссылка
	               |ГДЕ
	               |	НоменклатураКомплектующиеНоменклатуры.Комплектующая В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ВТ_ГруппаЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |			ИЗ
	               |				ВТ_ГруппаЛИС КАК ВТ_ГруппаЛИС)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Комплектующие.Комплектующая КАК Номенклатура,
	               |	НоменклатураКомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
	               |	ВТ_Комплектующие.Проба КАК Проба
	               |ПОМЕСТИТЬ ВТ_ВложенныеНаборы
	               |ИЗ
	               |	ВТ_Комплектующие КАК ВТ_Комплектующие
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.КомплектующиеНоменклатуры КАК НоменклатураКомплектующиеНоменклатуры
	               |		ПО ВТ_Комплектующие.Комплектующая = НоменклатураКомплектующиеНоменклатуры.Ссылка
	               |ГДЕ
	               |	НоменклатураКомплектующиеНоменклатуры.Комплектующая В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ВТ_ГруппаЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |			ИЗ
	               |				ВТ_ГруппаЛИС КАК ВТ_ГруппаЛИС)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НоменклатураКомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
	               |	НоменклатураКомплектующиеНоменклатуры.Ссылка КАК Номенклатура,
	               |	ВТ_ВложенныеНаборы.Проба КАК Проба
	               |ПОМЕСТИТЬ ВТ_КомплектующиеВложенныхНаборов
	               |ИЗ
	               |	ВТ_ВложенныеНаборы КАК ВТ_ВложенныеНаборы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.КомплектующиеНоменклатуры КАК НоменклатураКомплектующиеНоменклатуры
	               |		ПО ВТ_ВложенныеНаборы.Номенклатура = НоменклатураКомплектующиеНоменклатуры.Ссылка
	               |ГДЕ
	               |	НоменклатураКомплектующиеНоменклатуры.Комплектующая В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ВТ_ГруппаЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |			ИЗ
	               |				ВТ_ГруппаЛИС КАК ВТ_ГруппаЛИС)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.Комплектующая КАК Комплектующая,
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ВложенныйЗапрос.Проба КАК Проба
	               |ПОМЕСТИТЬ ВТ_ПереченьАнализов
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_Комплектующие.Комплектующая КАК Комплектующая,
	               |		ВТ_Комплектующие.Номенклатура КАК Номенклатура,
	               |		ВТ_Комплектующие.Проба КАК Проба
	               |	ИЗ
	               |		ВТ_Комплектующие КАК ВТ_Комплектующие
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВТ_ТаблицаУслуг.Номенклатура,
	               |		ВТ_ТаблицаУслуг.Номенклатура,
	               |		ВТ_ТаблицаУслуг.Проба
	               |	ИЗ
	               |		ВТ_ТаблицаУслуг КАК ВТ_ТаблицаУслуг
	               |	ГДЕ
	               |		НЕ ВТ_ТаблицаУслуг.Номенклатура В
	               |					(ВЫБРАТЬ
	               |						ВТ_Комплектующие.Комплектующая КАК Комплектующая
	               |					ИЗ
	               |						ВТ_Комплектующие КАК ВТ_Комплектующие)
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВТ_ВложенныеНаборы.Комплектующая,
	               |		ВТ_ВложенныеНаборы.Номенклатура,
	               |		ВТ_ВложенныеНаборы.Проба
	               |	ИЗ
	               |		ВТ_ВложенныеНаборы КАК ВТ_ВложенныеНаборы
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВТ_КомплектующиеВложенныхНаборов.Комплектующая,
	               |		ВТ_КомплектующиеВложенныхНаборов.Номенклатура,
	               |		ВТ_КомплектующиеВложенныхНаборов.Проба
	               |	ИЗ
	               |		ВТ_КомплектующиеВложенныхНаборов КАК ВТ_КомплектующиеВложенныхНаборов) КАК ВложенныйЗапрос
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Биоматериал КАК Биоматериал,
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Контейнер КАК Контейнер,
	               |	ПереченьАнализов.Проба КАК Проба,
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.ПоУмолчанию КАК ПоУмолчанию,
	               |	ПереченьАнализов.Номенклатура КАК Номенклатура,
	               |	ПереченьАнализов.Комплектующая КАК Комплектующая,
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_КоличествоИсследований КАК омг_КоличествоИсследований,
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_КодГруппыЗабора КАК омг_КодГруппыЗабора,
	               |	ПереченьАнализов.ПропускатьПриВыгрузкеВЛИС КАК ПропускатьПриВыгрузкеВЛИС,
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_КоличествоКонтейнеров КАК омг_КоличествоКонтейнеров
	               |ПОМЕСТИТЬ ВТ_ДляОпределенияПоУмолчанию
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_ПереченьАнализов.Комплектующая КАК Комплектующая,
	               |		ВТ_ПереченьАнализов.Номенклатура КАК Номенклатура,
	               |		ВТ_ПереченьАнализов.Проба КАК Проба,
	               |		ЛОЖЬ КАК ПропускатьПриВыгрузкеВЛИС
	               |	ИЗ
	               |		ВТ_ПереченьАнализов КАК ВТ_ПереченьАнализов
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |		омг_СвязьСДополнительнымиИсследованиями.ДополнительноеИсследование,
	               |		омг_СвязьСДополнительнымиИсследованиями.ДополнительноеИсследование,
	               |		ВТ_ПереченьАнализов.Проба,
	               |		омг_СвязьСДополнительнымиИсследованиями.ПропускатьПриВыгрузкеВЛИС
	               |	ИЗ
	               |		ВТ_ПереченьАнализов КАК ВТ_ПереченьАнализов
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.омг_СвязьСДополнительнымиИсследованиями КАК омг_СвязьСДополнительнымиИсследованиями
	               |			ПО (ВТ_ПереченьАнализов.Комплектующая = омг_СвязьСДополнительнымиИсследованиями.ЦелевоеИсследование
	               |					ИЛИ ВТ_ПереченьАнализов.Номенклатура = омг_СвязьСДополнительнымиИсследованиями.ЦелевоеИсследование)) КАК ПереченьАнализов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВнутренняяЛаборатория_СопоставлениеНоменклатуры КАК ВнутренняяЛаборатория_СопоставлениеНоменклатуры
	               |		ПО ПереченьАнализов.Комплектующая = ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Номенклатура
	               |			И (НЕ ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Контейнер.омг_КодЛИС = """"
	               |				ИЛИ ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Контейнер = ЗНАЧЕНИЕ(Справочник.ВнутренняяЛаборатория_ВидыКонтейнеров.ПустаяСсылка))
	               |ГДЕ
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_Филиал = &Филиал
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.ПоУмолчанию,
	               |	ПереченьАнализов.Проба,
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Контейнер,
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Биоматериал,
	               |	ПереченьАнализов.Номенклатура,
	               |	ПереченьАнализов.Комплектующая,
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_КоличествоИсследований,
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_КодГруппыЗабора,
	               |	ПереченьАнализов.ПропускатьПриВыгрузкеВЛИС,
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_КоличествоКонтейнеров
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДляОпределенияПоУмолчанию.Проба КАК Проба,
	               |	ВТ_ДляОпределенияПоУмолчанию.Номенклатура КАК Номенклатура,
	               |	ВТ_ДляОпределенияПоУмолчанию.Комплектующая КАК Комплектующая,
	               |	КОЛИЧЕСТВО(ВТ_ДляОпределенияПоУмолчанию.Комплектующая) КАК КоличествоКомплектующих
	               |ПОМЕСТИТЬ ВТ_КомплектующиеДляОпределенияПоУмолчанию
	               |ИЗ
	               |	ВТ_ДляОпределенияПоУмолчанию КАК ВТ_ДляОпределенияПоУмолчанию
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДляОпределенияПоУмолчанию.Номенклатура,
	               |	ВТ_ДляОпределенияПоУмолчанию.Комплектующая,
	               |	ВТ_ДляОпределенияПоУмолчанию.Проба
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДляОпределенияПоУмолчанию.Биоматериал КАК Биоматериал,
	               |	ВТ_ДляОпределенияПоУмолчанию.Контейнер КАК Контейнер,
	               |	ВТ_ДляОпределенияПоУмолчанию.Комплектующая КАК Номенклатура,
	               |	ВТ_ДляОпределенияПоУмолчанию.Проба КАК Проба,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВТ_КомплектующиеДляОпределенияПоУмолчанию.КоличествоКомплектующих, 0) = 1
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ВТ_ДляОпределенияПоУмолчанию.ПоУмолчанию
	               |	КОНЕЦ КАК ПоУмолчанию,
	               |	ВЫБОР
	               |		КОГДА ВТ_ДляОпределенияПоУмолчанию.Номенклатура.омг_ДатаПоследнегоОбновленияЛИС = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ВТ_ДляОпределенияПоУмолчанию.Комплектующая
	               |		ИНАЧЕ ВТ_ДляОпределенияПоУмолчанию.Номенклатура
	               |	КОНЕЦ КАК Набор,
	               |	МАКСИМУМ(ВТ_ДляОпределенияПоУмолчанию.омг_КоличествоИсследований) КАК омг_КоличествоИсследований,
	               |	МАКСИМУМ(ВТ_ДляОпределенияПоУмолчанию.омг_КодГруппыЗабора) КАК омг_КодГруппыЗабора,
	               |	ВТ_ДляОпределенияПоУмолчанию.ПропускатьПриВыгрузкеВЛИС КАК ПропускатьПриВыгрузкеВЛИС,
	               |	МАКСИМУМ(ВТ_ДляОпределенияПоУмолчанию.омг_КоличествоКонтейнеров) КАК омг_КоличествоКонтейнеров
	               |ПОМЕСТИТЬ ВТ_ВсеБиоматериалы
	               |ИЗ
	               |	ВТ_ДляОпределенияПоУмолчанию КАК ВТ_ДляОпределенияПоУмолчанию
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КомплектующиеДляОпределенияПоУмолчанию КАК ВТ_КомплектующиеДляОпределенияПоУмолчанию
	               |		ПО ВТ_ДляОпределенияПоУмолчанию.Номенклатура = ВТ_КомплектующиеДляОпределенияПоУмолчанию.Номенклатура
	               |			И ВТ_ДляОпределенияПоУмолчанию.Комплектующая = ВТ_КомплектующиеДляОпределенияПоУмолчанию.Комплектующая
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДляОпределенияПоУмолчанию.Биоматериал,
	               |	ВТ_ДляОпределенияПоУмолчанию.Контейнер,
	               |	ВТ_ДляОпределенияПоУмолчанию.Проба,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВТ_КомплектующиеДляОпределенияПоУмолчанию.КоличествоКомплектующих, 0) = 1
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ВТ_ДляОпределенияПоУмолчанию.ПоУмолчанию
	               |	КОНЕЦ,
	               |	ВТ_ДляОпределенияПоУмолчанию.Комплектующая,
	               |	ВЫБОР
	               |		КОГДА ВТ_ДляОпределенияПоУмолчанию.Номенклатура.омг_ДатаПоследнегоОбновленияЛИС = ДАТАВРЕМЯ(1, 1, 1)
	               |			ТОГДА ВТ_ДляОпределенияПоУмолчанию.Комплектующая
	               |		ИНАЧЕ ВТ_ДляОпределенияПоУмолчанию.Номенклатура
	               |	КОНЕЦ,
	               |	ВТ_ДляОпределенияПоУмолчанию.ПропускатьПриВыгрузкеВЛИС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВсеБиоматериалы.Биоматериал КАК Биоматериал,
	               |	ВТ_ВсеБиоматериалы.Номенклатура КАК Номенклатура,
	               |	ВТ_ВсеБиоматериалы.Проба КАК Проба,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВложенныйЗапрос.ВсегоБиоматериалов, 0) > 1
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ) КАК НеобходимВыборБиоматериала,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВложенныйЗапрос.ВсегоБиоматериалов, 0) = 1
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ВТ_ВсеБиоматериалы.ПоУмолчанию
	               |	КОНЕЦ КАК ПоУмолчанию,
	               |	МАКСИМУМ(ВТ_ВсеБиоматериалы.Контейнер) КАК Контейнер,
	               |	ВТ_ВсеБиоматериалы.Набор КАК Набор,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВТ_ВсеБиоматериалы.омг_КоличествоИсследований, 99) > 0
	               |				ТОГДА ЕСТЬNULL(ВТ_ВсеБиоматериалы.омг_КоличествоИсследований, 99)
	               |			ИНАЧЕ ЕСТЬNULL(ВТ_ВсеБиоматериалы.Контейнер.омг_КоличествоИсследований, 99)
	               |		КОНЕЦ) КАК КоличествоИсследований,
	               |	МАКСИМУМ(ВТ_ВсеБиоматериалы.омг_КодГруппыЗабора) КАК КодГруппыЗабора,
	               |	ВТ_ВсеБиоматериалы.ПропускатьПриВыгрузкеВЛИС КАК ПропускатьПриВыгрузкеВЛИС,
	               |	ВТ_ВсеБиоматериалы.омг_КоличествоКонтейнеров КАК КоличествоКонтейнеров
	               |ИЗ
	               |	ВТ_ВсеБиоматериалы КАК ВТ_ВсеБиоматериалы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВТ_ВсеБиоматериалы.Номенклатура КАК Номенклатура,
	               |			ВТ_ВсеБиоматериалы.Проба КАК Проба,
	               |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ВсеБиоматериалы.Биоматериал) КАК ВсегоБиоматериалов
	               |		ИЗ
	               |			ВТ_ВсеБиоматериалы КАК ВТ_ВсеБиоматериалы
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВТ_ВсеБиоматериалы.Проба,
	               |			ВТ_ВсеБиоматериалы.Номенклатура) КАК ВложенныйЗапрос
	               |		ПО ВТ_ВсеБиоматериалы.Номенклатура = ВложенныйЗапрос.Номенклатура
	               |			И ВТ_ВсеБиоматериалы.Проба = ВложенныйЗапрос.Проба
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ВсеБиоматериалы.Проба,
	               |	ВТ_ВсеБиоматериалы.Биоматериал,
	               |	ВТ_ВсеБиоматериалы.Номенклатура,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВложенныйЗапрос.ВсегоБиоматериалов, 0) = 1
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ВТ_ВсеБиоматериалы.ПоУмолчанию
	               |	КОНЕЦ,
	               |	ВТ_ВсеБиоматериалы.Набор,
	               |	ВТ_ВсеБиоматериалы.ПропускатьПриВыгрузкеВЛИС,
	               |	ВТ_ВсеБиоматериалы.омг_КоличествоКонтейнеров
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Биоматериал,
	               |	КодГруппыЗабора
	               |ИТОГИ
	               |	МАКСИМУМ(НеобходимВыборБиоматериала),
	               |	МАКСИМУМ(ПоУмолчанию),
	               |	МАКСИМУМ(Контейнер),
	               |	МАКСИМУМ(КоличествоИсследований),
	               |	МАКСИМУМ(КодГруппыЗабора),
	               |	МАКСИМУМ(КоличествоКонтейнеров)
	               |ПО
	               |	Биоматериал,
	               |	Проба
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	ТаблицаУслуг = Новый ТаблицаЗначений;
	ТаблицаУслуг.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаУслуг.Колонки.Добавить("Проба", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	
	Для Каждого СтрокаМассива Из МассивУслуг Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаУслуг.Добавить(), СтрокаМассива);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаУслуг", ТаблицаУслуг);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	РезультатЗапроса = Запрос.Выполнить();
	СписокБиоматериалов = Новый Массив;
	ВыборкаПоБиоматериалам = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоБиоматериалам.Следующий() Цикл
		
		ВыборкаПоПробам = ВыборкаПоБиоматериалам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоПробам.Следующий() Цикл
			МассивАнализов = Новый Массив;
			ВыборкаАнализов = ВыборкаПоПробам.Выбрать();
			Пока ВыборкаАнализов.Следующий() Цикл
				СтруктураАнализа = Новый Структура;
				СтруктураАнализа.Вставить("Номенклатура", ВыборкаАнализов.Номенклатура);
				СтруктураАнализа.Вставить("Набор", ВыборкаАнализов.Набор);
				СтруктураАнализа.Вставить("ПоУмолчанию", ВыборкаАнализов.ПоУмолчанию);
				СтруктураАнализа.Вставить("КоличествоИсследований", ВыборкаАнализов.КоличествоИсследований);
				СтруктураАнализа.Вставить("ГруппаЗабора", ВыборкаАнализов.КодГруппыЗабора);
				СтруктураАнализа.Вставить("ПропускатьПриВыгрузке", ВыборкаАнализов.ПропускатьПриВыгрузкеВЛИС);
				СтруктураАнализа.Вставить("КоличествоКонтейнеров", ВыборкаАнализов.КоличествоКонтейнеров);

				МассивАнализов.Добавить(СтруктураАнализа);
			КонецЦикла;
			
			СписокБиоматериалов.Добавить(Новый Структура("Биоматериал, Анализы, Проба, ПоУмолчанию, Контейнер, КоличествоИсследований, КоличествоКонтейнеров", 
				ВыборкаПоПробам.Биоматериал, МассивАнализов, 
				"", ВыборкаПоПробам.ПоУмолчанию, ВыборкаПоПробам.Контейнер, ВыборкаПоПробам.КоличествоИсследований, ВыборкаПоПробам.КоличествоКонтейнеров));
				
		КонецЦикла;
	КонецЦикла;
	
	Возврат СписокБиоматериалов;
	
КонецФункции

Процедура ДобавитьДанныеКонтейнераВТаблицы(Объект, ДанныеКонтейнера, ПропускатьПриВыгрузке = Ложь)
	
		ТекущаяГруппаЗабора = "";
		
		СтрокаТаблицы = Объект.Биоматериалы.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДанныеКонтейнера);
		СтрокаТаблицы.Проба = Объект.НомерЗаявки;
		СтрокаТаблицы.КодСтроки = СтрокаТаблицы.НомерСтроки;
		СтрокаТаблицы.Проба = ДанныеКонтейнера.Проба;
		
		СчетчикАнализов = 0;
		ПерваяСтрока = Истина;
		
		Для Каждого ДанныеНоменклатуры Из ДанныеКонтейнера.Анализы Цикл
			
			КоличествоИсследований = ?(ЗначениеЗаполнено(ДанныеНоменклатуры.КоличествоИсследований), ДанныеНоменклатуры.КоличествоИсследований, ДанныеКонтейнера.КоличествоИсследований);
			
			Если (Не КоличествоИсследований = 0
				И СчетчикАнализов = КоличествоИсследований 
				Или Не ТекущаяГруппаЗабора = ДанныеНоменклатуры.ГруппаЗабора) И Не ПерваяСтрока Тогда
				
				СчетчикАнализов = 0;
				
				СтрокаТаблицы = Объект.Биоматериалы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ДанныеКонтейнера);
				СтрокаТаблицы.Проба = Объект.НомерЗаявки;
				СтрокаТаблицы.КодСтроки = СтрокаТаблицы.НомерСтроки;
				СтрокаТаблицы.Проба = ДанныеКонтейнера.Проба;
				
				ТекущаяГруппаЗабора = ДанныеНоменклатуры.ГруппаЗабора;
				
			КонецЕсли;
			Если ПерваяСтрока Тогда
				ТекущаяГруппаЗабора = ДанныеНоменклатуры.ГруппаЗабора;
			КонецЕсли;
			СтрокаАнализов = Объект.АнализыПоКонтейнерам.Добавить();
			СтрокаАнализов.КодСтроки = СтрокаТаблицы.КодСтроки;
			СтрокаАнализов.Номенклатура = ДанныеНоменклатуры.Номенклатура;
			СтрокаАнализов.Набор = ДанныеНоменклатуры.Набор;
			СтрокаАнализов.ПропускатьПриВыгрузке = ?(ПропускатьПриВыгрузке, Истина, ДанныеНоменклатуры.ПропускатьПриВыгрузке);
			СчетчикАнализов = СчетчикАнализов + 1;
			
			ПерваяСтрока = Ложь;
		КонецЦикла;

	
КонецПроцедуры

Процедура ЗаполнитьТаблицуБиоматериаловПоАнализам(Объект, СписокКонтейнеров = Неопределено) Экспорт
	
	МассивУслуг = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из Объект.Анализы Цикл
		МассивУслуг.Добавить(Новый Структура("Номенклатура, Проба", СтрокаТаблицы.Номенклатура, СтрокаТаблицы.Проба));
	КонецЦикла;
	
	Если СписокКонтейнеров = Неопределено Тогда
		СписокКонтейнеров = ПолучитьСписокКонтейнеров(МассивУслуг, Объект.Филиал);
	КонецЕсли;
	
	ПрошлыеСтроки = Новый Массив;
	
	
	
	Для Каждого СтрокаТаблицы Из Объект.Биоматериалы Цикл
		
		СтруктураСтроки = Новый Структура("Контейнер, Биоматериал, Проба");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТаблицы);
		ПрошлыеСтроки.Добавить(СтруктураСтроки);
		
	КонецЦикла;
	
	Объект.Биоматериалы.Очистить();
	Объект.АнализыПоКонтейнерам.Очистить(); 
	
	
	
	
	Для Каждого ДанныеКонтейнера Из СписокКонтейнеров Цикл

		ДобавитьДанныеКонтейнераВТаблицы(Объект, ДанныеКонтейнера);
		Для Счетчик = 2 По ДанныеКонтейнера.КоличествоКонтейнеров Цикл
			ДобавитьДанныеКонтейнераВТаблицы(Объект, ДанныеКонтейнера, Истина);
		КонецЦикла;
		
	КонецЦикла;

	Для Каждого СтрокаТаблицы Из Объект.Биоматериалы Цикл
		Для Каждого СтруктураСтроки Из ПрошлыеСтроки Цикл
			Если СтруктураСтроки.Проба = "" Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаТаблицы.Проба = ""
				И СтрокаТаблицы.Контейнер = СтруктураСтроки.Контейнер
				И СтрокаТаблицы.Биоматериал = СтруктураСтроки.Биоматериал Тогда
				СтрокаТаблицы.Проба = СтруктураСтроки.Проба;
				СтруктураСтроки.Проба = "";
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
	
КонецПроцедуры

Функция ПроверкаБиоматериаловДозаказа(ПозицииДозаказа, ИсходныйЗаказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДанныхДозаказа.Филиал КАК Филиал,
	               |	ТаблицаДанныхДозаказа.Номенклатура КАК Номенклатура,
	               |	ТаблицаДанныхДозаказа.Биоматериал КАК Биоматериал,
	               |	ТаблицаДанныхДозаказа.Контейнер КАК Контейнер,
	               |	ТаблицаДанныхДозаказа.КодСтроки КАК КодСтроки
	               |ПОМЕСТИТЬ ВТ_ТаблицаДанныхДозаказа
	               |ИЗ
	               |	&ТаблицаДанныхДозаказа КАК ТаблицаДанныхДозаказа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам.Номенклатура КАК Номенклатура,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Контейнер КАК Контейнер,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Биоматериал КАК Биоматериал,
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_КодГруппыЗабора КАК ГруппаЗабора,
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Контейнер.омг_КоличествоИсследований КАК МаксКоличество,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.НомерСтроки КАК НомерСтроки,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Проба КАК Проба
	               |ПОМЕСТИТЬ ВТ_ДанныеИсходнойЗаявки
	               |ИЗ
	               |	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.АнализыПоКонтейнерам КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Биоматериалы КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы
	               |		ПО омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам.Ссылка = омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Ссылка
	               |			И омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам.КодСтроки = омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.КодСтроки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВнутренняяЛаборатория_СопоставлениеНоменклатуры КАК ВнутренняяЛаборатория_СопоставлениеНоменклатуры
	               |		ПО омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам.Номенклатура = ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Номенклатура
	               |			И (омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Биоматериал = ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Биоматериал)
	               |			И (омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Контейнер = ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Контейнер)
	               |			И омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам.Ссылка.Филиал = ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_Филиал
	               |ГДЕ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализыПоКонтейнерам.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	               |	ВложенныйЗапрос.Биоматериал КАК Биоматериал,
	               |	ВложенныйЗапрос.Контейнер КАК Контейнер,
	               |	ВложенныйЗапрос.ГруппаЗабора КАК ГруппаЗабора,
	               |	ВложенныйЗапрос.ВсегоВКонтейнере КАК ВсегоВКонтейнере,
	               |	ВложенныйЗапрос.МаксКоличество КАК МаксКоличество,
	               |	ВложенныйЗапрос.Проба КАК Проба
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_ДанныеИсходнойЗаявки.НомерСтроки КАК НомерСтроки,
	               |		ВТ_ДанныеИсходнойЗаявки.Биоматериал КАК Биоматериал,
	               |		ВТ_ДанныеИсходнойЗаявки.Контейнер КАК Контейнер,
	               |		ВТ_ДанныеИсходнойЗаявки.ГруппаЗабора КАК ГруппаЗабора,
	               |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДанныеИсходнойЗаявки.Номенклатура) КАК ВсегоВКонтейнере,
	               |		ВТ_ДанныеИсходнойЗаявки.МаксКоличество КАК МаксКоличество,
	               |		ВТ_ДанныеИсходнойЗаявки.Проба КАК Проба
	               |	ИЗ
	               |		ВТ_ДанныеИсходнойЗаявки КАК ВТ_ДанныеИсходнойЗаявки
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_ДанныеИсходнойЗаявки.Контейнер,
	               |		ВТ_ДанныеИсходнойЗаявки.Биоматериал,
	               |		ВТ_ДанныеИсходнойЗаявки.ГруппаЗабора,
	               |		ВТ_ДанныеИсходнойЗаявки.МаксКоличество,
	               |		ВТ_ДанныеИсходнойЗаявки.НомерСтроки,
	               |		ВТ_ДанныеИсходнойЗаявки.Проба) КАК ВложенныйЗапрос
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Проба
	               |ИТОГИ
	               |	МАКСИМУМ(Биоматериал),
	               |	МАКСИМУМ(Контейнер),
	               |	МАКСИМУМ(ГруппаЗабора),
	               |	МАКСИМУМ(ВсегоВКонтейнере),
	               |	МАКСИМУМ(МаксКоличество),
	               |	МАКСИМУМ(Проба)
	               |ПО
	               |	НомерСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаДанныхДозаказа.Номенклатура КАК Номенклатура,
	               |	ВТ_ТаблицаДанныхДозаказа.Биоматериал КАК Биоматериал,
	               |	ВТ_ТаблицаДанныхДозаказа.Контейнер КАК Контейнер,
	               |	ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_КодГруппыЗабора КАК ГруппаЗабора,
	               |	ВТ_ТаблицаДанныхДозаказа.КодСтроки КАК КодСтроки
	               |ИЗ
	               |	ВТ_ТаблицаДанныхДозаказа КАК ВТ_ТаблицаДанныхДозаказа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВнутренняяЛаборатория_СопоставлениеНоменклатуры КАК ВнутренняяЛаборатория_СопоставлениеНоменклатуры
	               |		ПО ВТ_ТаблицаДанныхДозаказа.Номенклатура = ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Номенклатура
	               |			И ВТ_ТаблицаДанныхДозаказа.Биоматериал = ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Биоматериал
	               |			И ВТ_ТаблицаДанныхДозаказа.Контейнер = ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Контейнер
	               |			И ВТ_ТаблицаДанныхДозаказа.Филиал = ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_Филиал";
	
	ТаблицаДанныхДозаказа = Новый ТаблицаЗначений;
	ТаблицаДанныхДозаказа.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДанныхДозаказа.Колонки.Добавить("Биоматериал", Новый ОписаниеТипов("СправочникСсылка.ВнутренняяЛаборатория_Биоматериалы"));
	ТаблицаДанныхДозаказа.Колонки.Добавить("Контейнер", Новый ОписаниеТипов("СправочникСсылка.ВнутренняяЛаборатория_ВидыКонтейнеров"));
	ТаблицаДанныхДозаказа.Колонки.Добавить("Филиал", Новый ОписаниеТипов("СправочникСсылка.Филиалы"));
	ТаблицаДанныхДозаказа.Колонки.Добавить("КодСтроки", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	
	Для Каждого СтрокаДозаказа Из ПозицииДозаказа Цикл
		
		ЗаполнитьЗначенияСвойств(ТаблицаДанныхДозаказа.Добавить(), СтрокаДозаказа);
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТаблицаДанныхДозаказа", ТаблицаДанныхДозаказа);
	Запрос.УстановитьПараметр("Ссылка", ИсходныйЗаказ);
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	ИсследованияИсходнойЗаявки = ПакетРезультатов.Получить(2).Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДанныеДозаказа = ПакетРезультатов.Получить(3).Выбрать();
	
	ДозаказВозможен = Истина;
	
	ШтрихкодыПоСтрокам = Новый Соответствие;
	
	Пока ДанныеДозаказа.Следующий() Цикл
		
		ДоступноДляВыбора = Ложь;
		
		Для Каждого СтрокаКонтейнера Из ИсследованияИсходнойЗаявки.Строки Цикл
			
			Если Не СтрокаКонтейнера.Биоматериал = ДанныеДозаказа.Биоматериал
				Или Не СтрокаКонтейнера.Контейнер = ДанныеДозаказа.Контейнер Тогда
				Продолжить;
			КонецЕсли;
			
			ПодходящаяГруппаЗабора = Истина;
			
			ЕстьМесто = Истина;
			Если СтрокаКонтейнера.МаксКоличество > 0 Тогда
				ЕстьМесто = Ложь;
				Если СтрокаКонтейнера.МаксКоличество - СтрокаКонтейнера.ВсегоВКонтейнере > 1 Тогда
					ЕстьМесто = Истина;
					СтрокаКонтейнера.ВсегоВКонтейнере = СтрокаКонтейнера.ВсегоВКонтейнере + 1;
				КонецЕсли;
			КонецЕсли;
			
			Если Не ДанныеДозаказа.ГруппаЗабора = СтрокаКонтейнера.ГруппаЗабора Тогда
				ПодходящаяГруппаЗабора = Ложь;
			КонецЕсли;
			
			Если ПодходящаяГруппаЗабора И ЕстьМесто Тогда
				ДоступноДляВыбора = Истина;
				
				ШтрихкодыПоСтрокам.Вставить(ДанныеДозаказа.КодСтроки, СтрокаКонтейнера.Проба);
				
				Прервать;
			КонецЕсли;
			
		КонецЦикла;                                       
		
		Если Не ДоступноДляВыбора Тогда
			ДозаказВозможен = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый Структура("ДозаказВозможен, ШтрихкодыПоСтрокам", ДозаказВозможен, ШтрихкодыПоСтрокам);
	
КонецФункции

Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Дата КАК Дата,
	|	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ДатаРождения КАК ДатаРождения,
	|	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.НомерНаправления КАК НомерНаправления,
	|	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Пациент КАК Пациент,
	|	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Филиал КАК Филиал,
	|	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Анализы.(
	|		Номенклатура КАК Номенклатура
	|	) КАК Анализы,
	|	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Филиал.Организация КАК Организация,
	|	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Филиал.Организация.ИНН КАК БИН,
	|	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.НомерЗаявки КАК НомерЗаявки,
	|	РАЗНОСТЬДАТ( омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ДатаРождения,омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Дата, ГОД) КАК Лет
	|ИЗ
	|	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС
	|ГДЕ
	|	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	//ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка"); 
	Шапка2 = Макет.ПолучитьОбласть("Шапка2");
    Подвал = Макет.ПолучитьОбласть("Подвал");
	ШтрихкодОбл = Макет.ПолучитьОбласть("ШтрихкодОбласть");

	//ОбластьАнализыШапка = Макет.ПолучитьОбласть("АнализыШапка");
	ОбластьАнализы = Макет.ПолучитьОбласть("СтрокаУслуга");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
			Штрихкод = ПолучитьКартинкуШтрихкода(Выборка.НомерЗаявки);
			Если Штрихкод <> Неопределено Тогда 
				Рис = ШтрихкодОбл.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
				Индекс = ШтрихкодОбл.Рисунки.Индекс(Рис);
				ШтрихкодОбл.Рисунки[Индекс].Картинка = Штрихкод;
				ШтрихкодОбл.Рисунки[Индекс].РазмерКартинки = РазмерКартинки.Растянуть;
				ШтрихкодОбл.Рисунки[Индекс].Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
				ШтрихкодОбл.Рисунки[Индекс].Расположить(ШтрихкодОбл.Область("Штрихкод"));
			КонецЕсли;

		Шапка.Параметры.Заполнить(Выборка);  
		Шапка.Параметры.телефон = Строка(КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(Выборка.Филиал, Перечисления.ТипыКонтактнойИнформации.Телефон,,Истина));
		Шапка.Параметры.Адрес = Строка(КонтактнаяИнформацияСервер.ПолучитьКИОбъекта(Выборка.Филиал, Перечисления.ТипыКонтактнойИнформации.Адрес,,Истина));
		Шапка2.Параметры.Заполнить(Выборка);   
		Лет = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеЧислоЛетСДаты(Дата(Выборка.ДатаРождения), Дата(Выборка.Дата));
		Шапка2.Параметры.ДатаРождения = "" + Формат(Шапка2.Параметры.ДатаРождения,"ДФ=dd.MM.yyyy") +" ( " + Лет +" л.)";
		ТабДок.Вывести(Шапка, Выборка.Уровень());
        ТабДок.Вывести(ШтрихкодОбл, Выборка.Уровень());
		ТабДок.Вывести(Шапка2, Выборка.Уровень());
		//ТабДок.Вывести(ОбластьАнализыШапка);
		ВыборкаАнализы = Выборка.Анализы.Выбрать();
		Пока ВыборкаАнализы.Следующий() Цикл
			ОбластьАнализы.Параметры.Заполнить(ВыборкаАнализы);
			ТабДок.Вывести(ОбластьАнализы, ВыборкаАнализы.Уровень());
		КонецЦикла;
        ТабДок.Вывести(Подвал, Выборка.Уровень());
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры     

Функция ПолучитьКартинкуШтрихкода(Штрихкод)
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина"            		, 165);
	ПараметрыШтрихкода.Вставить("Высота"            		, 45);
	ПараметрыШтрихкода.Вставить("ТипКода"           		, 99);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст"   		, Истина);
	ПараметрыШтрихкода.Вставить("Штрихкод"					, Строка(Штрихкод));
	ПараметрыШтрихкода.Вставить("ВертикальноеВыравнивание"	, 2);
	Возврат МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	
КонецФункции

Процедура ОбновитьДополнительныеПоля(Объект) Экспорт
	
	МассивИсследований = Новый Массив;
	Для Каждого СтрокаТаблицы Из Объект.Анализы Цикл
		МассивИсследований.Добавить(СтрокаТаблицы.Номенклатура);
	КонецЦикла;
	
	Запрос =  Новый Запрос;
	Запрос.УстановитьПараметр("МассивИсследований", МассивИсследований);
	Запрос.УстановитьПараметр("ВидНоменклатуры", Перечисления.ВидыНоменклатуры.Набор);
	Запрос.Текст ="ВЫБРАТЬ
	              |	НоменклатураКомплектующиеНоменклатуры.Комплектующая КАК Ссылка,
	              |	НоменклатураКомплектующиеНоменклатуры.Ссылка КАК Набор
	              |ПОМЕСТИТЬ ВТ_Исследования
	              |ИЗ
	              |	Справочник.Номенклатура.КомплектующиеНоменклатуры КАК НоменклатураКомплектующиеНоменклатуры
	              |ГДЕ
	              |	НоменклатураКомплектующиеНоменклатуры.Ссылка В(&МассивИсследований)
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	НоменклатураКомплектующиеНоменклатуры.Комплектующая,
	              |	НоменклатураКомплектующиеНоменклатуры.Ссылка
	              |
	              |ОБЪЕДИНИТЬ ВСЕ
	              |
	              |ВЫБРАТЬ
	              |	Номенклатура.Ссылка,
	              |	НЕОПРЕДЕЛЕНО
	              |ИЗ
	              |	Справочник.Номенклатура КАК Номенклатура
	              |ГДЕ
	              |	Номенклатура.Ссылка В(&МассивИсследований)
	              |	И НЕ Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	НоменклатураКомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
	              |	ВТ_Исследования.Ссылка КАК Набор
	              |ПОМЕСТИТЬ ВТ_ВложенныеКомплектующие
	              |ИЗ
	              |	ВТ_Исследования КАК ВТ_Исследования
	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.КомплектующиеНоменклатуры КАК НоменклатураКомплектующиеНоменклатуры
	              |		ПО ВТ_Исследования.Ссылка = НоменклатураКомплектующиеНоменклатуры.Ссылка
	              |ГДЕ
	              |	НЕ ВТ_Исследования.Набор = НЕОПРЕДЕЛЕНО
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	омг_СоответствиеДопПолейНоменклатуре.Свойство КАК Свойство,
	              |	МАКСИМУМ(омг_СоответствиеДопПолейНоменклатуре.Обязательное) КАК Обязательное,
	              |	омг_СоответствиеДопПолейНоменклатуре.Объект КАК Номенклатура,
	              |	ВТ_Исследования.Набор КАК Набор
	              |ИЗ
	              |	(ВЫБРАТЬ
	              |		ВТ_Исследования.Ссылка КАК Ссылка,
	              |		ВТ_Исследования.Набор КАК Набор
	              |	ИЗ
	              |		ВТ_Исследования КАК ВТ_Исследования
	              |	
	              |	ОБЪЕДИНИТЬ ВСЕ
	              |	
	              |	ВЫБРАТЬ
	              |		ВТ_ВложенныеКомплектующие.Комплектующая,
	              |		ВТ_ВложенныеКомплектующие.Набор
	              |	ИЗ
	              |		ВТ_ВложенныеКомплектующие КАК ВТ_ВложенныеКомплектующие) КАК ВТ_Исследования
	              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.омг_СоответствиеДопПолейНоменклатуре КАК омг_СоответствиеДопПолейНоменклатуре
	              |		ПО ВТ_Исследования.Ссылка = омг_СоответствиеДопПолейНоменклатуре.Объект
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	омг_СоответствиеДопПолейНоменклатуре.Свойство,
	              |	омг_СоответствиеДопПолейНоменклатуре.Объект,
	              |	ВТ_Исследования.Набор
	              |ИТОГИ
	              |	МАКСИМУМ(Обязательное)
	              |ПО
	              |	Свойство";
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоСвойствам = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВсеСвойства = Новый Массив;
	Для Каждого СтрокаТаблицы Из Объект.ДополнительныеСведения Цикл
		
		ВсеСвойства.Добавить(СтрокаТаблицы);
		
	КонецЦикла;
	
	СтруктураПоиска = Новый Структура("Свойство");
	
	Пока ВыборкаПоСвойствам.Следующий() Цикл
		СтруктураПоиска.Свойство = ВыборкаПоСвойствам.Свойство;
		НайденыеСтроки = Объект.ДополнительныеСведения.НайтиСтроки(СтруктураПоиска);
		Если НайденыеСтроки.Количество() = 0 Тогда
			СтрокаТаблицы = Объект.ДополнительныеСведения.Добавить();
			СтрокаТаблицы.Свойство = ВыборкаПоСвойствам.Свойство;
			СтрокаТаблицы.Обязательное = ВыборкаПоСвойствам.Обязательное;
			Если ТипЗнч(Объект) = Тип("ФормаКлиентскогоПриложения") Тогда 
				ВыборкаПоНоменклатуре = ВыборкаПоСвойствам.Выбрать();
				
				Пока ВыборкаПоНоменклатуре.Следующий() Цикл
					
					Номенклатура = ?(ЗначениеЗаполнено(ВыборкаПоНоменклатуре.Набор), ВыборкаПоНоменклатуре.Набор, ВыборкаПоНоменклатуре.Номенклатура);
					
					СтрокаТаблицы.СписокНоменклатуры.Добавить(Номенклатура);
				КонецЦикла;
				
			КонецЕсли;
		Иначе 
			ВсеСвойства.Удалить(ВсеСвойства.Найти(НайденыеСтроки[0]));
		КонецЕсли;
		
		
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ВсеСвойства Цикл
		Объект.ДополнительныеСведения.Удалить(СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьЖурнал(ТекущийОбъект, Объект) Экспорт
	
	Для Каждого СтрокаЖурнала Из ТекущийОбъект.Журнал Цикл
		
		СтрокаЖурналаНаФорме = Объект.Журнал[СтрокаЖурнала.НомерСтроки - 1];
		
		ДанныеСтроки = СтрокаЖурнала.Детали.Получить();
		Если ТипЗнч(ДанныеСтроки) = Тип("Строка") Тогда
			СтрокаЖурналаНаФорме.ТекстОтвета = СтрокаЖурнала.Детали.Получить();
		ИначеЕсли ТипЗнч(ДанныеСтроки) = Тип("ФиксированнаяСтруктура") Тогда
			ДанныеСтроки.Свойство("ТекстЗапроса", СтрокаЖурналаНаФорме.ТекстЗапроса);
			ДанныеСтроки.Свойство("ТекстОтвета", СтрокаЖурналаНаФорме.ТекстОтвета);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьЖурнал(ТекущийОбъект, Объект) Экспорт
	
	Для Каждого СтрокаЖурнала Из Объект.Журнал Цикл
		
		СтруктураДанных = Новый ФиксированнаяСтруктура(Новый Структура("ТекстЗапроса, ТекстОтвета", СтрокаЖурнала.ТекстЗапроса, СтрокаЖурнала.ТекстОтвета));
		
		ДанныеСтроки = Новый ХранилищеЗначения(СтруктураДанных, Новый СжатиеДанных(9));
		
		СтрокаЖурналаОбъекта = ТекущийОбъект.Журнал[СтрокаЖурнала.НомерСтроки - 1];
		СтрокаЖурналаОбъекта.Детали = ДанныеСтроки;
		
	КонецЦикла;
	
КонецПроцедуры
