
Процедура ПриКопировании(ОбъектКопирования)
	
	Статус = Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Открыта;
	Автор = Пользователи.ТекущийПользователь();
	ИдентификаторЛИС = "";
	Ошибки.Очистить();
	Журнал.Очистить();
	БланкиРезультатовИсследования.Очистить();
	Контейнеры.Очистить();
	
КонецПроцедуры

Процедура ЗаполнитьПоОтобраннымАнализам(ДанныеЗаполнения)
	
	Статус = Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Открыта;
	Филиал = ДанныеЗаполнения.Филиал;
	ДокументОснование = ДанныеЗаполнения.Ссылка;
	Пациент = ДанныеЗаполнения.Клиент;
	ДанныеПациента = Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ПолучитьДанныеПациента(Пациент);
	НомерЗаявки = ДанныеЗаполнения.Штрихкод;
	Врач = ДанныеЗаполнения.НаправившийВрач;
	Комментарий = ДанныеЗаполнения.Примечание;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеПациента);
	
	Если ЗначениеЗаполнено(АдресЭлПочты) Тогда
		ОтправитьПоЭлПочте = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(НомерТелефона) Тогда
		СообщитьПоНомеру = Истина;
	КонецЕсли;

	Анализы.Очистить();
	Биоматериалы.Очистить();
	Контейнеры.Очистить();
	Для Каждого ДанныеИсследования Из ДанныеЗаполнения.Анализы Цикл
		СтрокаТаблицы = Анализы.Добавить();
		СтрокаТаблицы.Номенклатура = ДанныеИсследования.Номенклатура;
		СтрокаТаблицы.Цена = ДанныеИсследования.Цена;
		СтрокаТаблицы.Проба = НомерЗаявки;
	КонецЦикла;
	
	Если ДанныеЗаполнения.Свойство("ДополнительныеСведения") Тогда
		
		Для Каждого ДанныеДопСведений Из ДанныеЗаполнения.ДополнительныеСведения Цикл
			СтрокаДопСведений = ДополнительныеСведения.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДопСведений, ДанныеДопСведений);
		КонецЦикла;
		
	КонецЕсли;
	
	Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ЗаполнитьТаблицуБиоматериаловПоАнализам(ЭтотОбъект, ДанныеЗаполнения.Биоматериалы);
	
	МассивДанныхДозаказа = Новый Массив;
	
	СтруктураПоиска = Новый Структура("КодСтроки");
	Для Каждого ДанныеБиоматериалов Из Биоматериалы Цикл
		СтруктураПоиска.КодСтроки = ДанныеБиоматериалов.КодСтроки;
		ПереченьАнализов = АнализыПоКонтейнерам.НайтиСтроки(СтруктураПоиска);
		Для Каждого ДанныеИсследования Из ПереченьАнализов Цикл
			МассивДанныхДозаказа.Добавить(Новый Структура("Номенклатура, Контейнер, Биоматериал, Филиал, КодСтроки",
			ДанныеИсследования.Номенклатура, ДанныеБиоматериалов.Контейнер, ДанныеБиоматериалов.Биоматериал, Филиал, ДанныеБиоматериалов.КодСтроки));
		КонецЦикла;
		
	КонецЦикла;

	ДанныеПослеПроверки = Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ПроверкаБиоматериаловДозаказа(МассивДанныхДозаказа, ИсходнаяЗаявка);
	
	Для Каждого ДанныеШтрихкода Из ДанныеПослеПроверки.ШтрихкодыПоСтрокам Цикл
		Биоматериалы.Найти(ДанныеШтрихкода.Ключ, "КодСтроки").Проба = ДанныеШтрихкода.Значение;
	КонецЦикла;
	
	Документы.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ПересчитатьИтоги(ЭтотОбъект);
	
	Если Не ИсходнаяЗаявка.Пустая() Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЕСТЬNULL(ВложенныйЗапрос.НомерЗаявки, омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.НомерЗаявки) КАК НомерЗаявки,
		               |	МАКСИМУМ(омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Проба) КАК Проба
		               |ИЗ
		               |	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Биоматериалы КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы
		               |		ПО (омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБиоматериалы.Ссылка = омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Ссылка)
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
		               |			омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.НомерЗаявки КАК НомерЗаявки,
		               |			омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ИсходнаяЗаявка КАК ИсходнаяЗаявка
		               |		ИЗ
		               |			Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС
		               |		ГДЕ
		               |			омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ИсходнаяЗаявка = &Ссылка
		               |		
		               |		УПОРЯДОЧИТЬ ПО
		               |			НомерЗаявки УБЫВ) КАК ВложенныйЗапрос
		               |		ПО (ИСТИНА)
		               |ГДЕ
		               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЕСТЬNULL(ВложенныйЗапрос.НомерЗаявки, омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.НомерЗаявки)";
		Запрос.УстановитьПараметр("Ссылка", ИсходнаяЗаявка);
		ВыборкаДозаказ = Запрос.Выполнить().Выбрать();
		ВыборкаДозаказ.Следующий();
		
		НомерЗаявки = ВыборкаДозаказ.НомерЗаявки;
		Постфикс = Прав(НомерЗаявки, 2);
		Если Лев(Постфикс, 1) = "-" Тогда
			НомерЗаявки = НомерЗаявки + "-" + (Число(Прав(Постфикс, 1)) + 1);
		Иначе
			НомерЗаявки = НомерЗаявки + "-1";
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ПарольЗаявки.Получить() = Неопределено Тогда
		Генератор = Новый ГенераторСлучайныхЧисел;
		ПарольЗаявки = Новый ХранилищеЗначения(Формат(Генератор.СлучайноеЧисло(100000, 999999), "ЧГ="));
	КонецЕсли;

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ЗаполнитьПоОтобраннымАнализам(ДанныеЗаполнения);
		
	КонецЕсли;
	
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_НоменклатураИсключаемаяИзВыработкиЛИС.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТ_ИсключаемыеПозиции
	               |ИЗ
	               |	РегистрСведений.омг_НоменклатураИсключаемаяИзВыработкиЛИС КАК омг_НоменклатураИсключаемаяИзВыработкиЛИС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализы.Номенклатура КАК Номенклатура,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализы.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_Исследования
	               |ИЗ
	               |	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Анализы КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализы
	               |ГДЕ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализы.Ссылка = &Ссылка
	               |	И омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализы.Ссылка.Статус В(&Статусы)
	               |	И НЕ омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализы.Ссылка.Медсестра = ЗНАЧЕНИЕ(Справочник.Сотрудники.пустаяссылка)
	               |	И НЕ ЕСТЬNULL(омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализы.Ссылка.Медсестра.Должность.ДолжностьМинздрава.Родитель.Наименование, """") = ""Врачи-специалисты""
	               |	И НЕ омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализы.Номенклатура В ИЕРАРХИИ
	               |				(ВЫБРАТЬ
	               |					ВТ_ИсключаемыеПозиции.Номенклатура КАК Номенклатура
	               |				ИЗ
	               |					ВТ_ИсключаемыеПозиции КАК ВТ_ИсключаемыеПозиции)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализы.Номенклатура,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСАнализы.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОказаниеУслугРаботы.Номенклатура КАК Номенклатура,
	               |	СУММА(ОказаниеУслугРаботы.Количество) КАК Количество,
	               |	СУММА(ОказаниеУслугРаботы.Сумма + ОказаниеУслугРаботы.СуммаСкидки) КАК СуммаСоСкидкой,
	               |	СУММА(ОказаниеУслугРаботы.Омг_СуммаНДС) КАК Омг_СуммаНДС,
	               |	СУММА(ОказаниеУслугРаботы.Сумма) КАК Сумма,
	               |	ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма КАК омг_СтраховаяПрограмма,
	               |	NULL КАК НомерСтроки
	               |ИЗ
	               |	РегистрСведений.омг_ПереченьРаботПроводимыхСЗаявкойЛИС КАК омг_ПереченьРаботПроводимыхСЗаявкойЛИС
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
	               |		ПО омг_ПереченьРаботПроводимыхСЗаявкойЛИС.Номенклатура = ОказаниеУслугРаботы.Номенклатура
	               |			И (1 В
	               |				(ВЫБРАТЬ
	               |					1
	               |				ИЗ
	               |					ВТ_Исследования КАК ВТ_Исследования))
	               |ГДЕ
	               |	ОказаниеУслугРаботы.Ссылка = &ОказаниеУслуг
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОказаниеУслугРаботы.Номенклатура,
	               |	ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ОказаниеУслугРаботы.Номенклатура,
	               |	СУММА(ОказаниеУслугРаботы.Количество),
	               |	СУММА(ОказаниеУслугРаботы.Сумма + ОказаниеУслугРаботы.СуммаСкидки),
	               |	СУММА(ОказаниеУслугРаботы.Омг_СуммаНДС),
	               |	СУММА(ОказаниеУслугРаботы.Сумма),
	               |	ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма,
	               |	СУММА(ОказаниеУслугРаботы.НомерСтроки)
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ОказаниеУслугРаботы.Номенклатура КАК Номенклатура,
	               |		ОказаниеУслугРаботы.НомерСтроки КАК НомерСтроки
	               |	ИЗ
	               |		ВТ_Исследования КАК ВТ_Исследования
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
	               |			ПО (ВТ_Исследования.Номенклатура = ОказаниеУслугРаботы.Номенклатура
	               |					ИЛИ ВТ_Исследования.Номенклатура = ОказаниеУслугРаботы.омг_Набор
	               |					ИЛИ ВТ_Исследования.Номенклатура = ОказаниеУслугРаботы.омг_НаборЛИС)
	               |	ГДЕ
	               |		ОказаниеУслугРаботы.Ссылка = &ОказаниеУслуг
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ОказаниеУслугРаботы.Номенклатура,
	               |		ОказаниеУслугРаботы.НомерСтроки) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
	               |		ПО ВложенныйЗапрос.НомерСтроки = ОказаниеУслугРаботы.НомерСтроки
	               |ГДЕ
	               |	ОказаниеУслугРаботы.Ссылка = &ОказаниеУслуг
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОказаниеУслугРаботы.Номенклатура,
	               |	ОказаниеУслугРаботы.Ссылка.омг_СтраховаяПрограмма";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ОказаниеУслуг", ДокументОснование);
	Статусы = Новый Массив;
	Статусы.Добавить(Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Закрыта);
	Статусы.Добавить(Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ОтправленаВЛИС);
	Статусы.Добавить(Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ПолученРезультатИзЛИС);
	Статусы.Добавить(Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ПолученЧастичныйРезультатИзЛИС);
	Статусы.Добавить(Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ЕстьБракованныеПробы);
	Запрос.УстановитьПараметр("Статусы", Статусы);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.ВыработкаСотрудников.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВыработкаСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Медсестра;
		Движение.Номенклатура = Выборка.Номенклатура;
		Движение.Филиал = Филиал;
		Движение.омг_СтраховаяПрограмма = Выборка.омг_СтраховаяПрограмма;
		Движение.Сумма = Выборка.Сумма;
		Движение.омг_СуммаБезНДС = Движение.Сумма - Выборка.омг_СуммаНДС;
		Движение.СуммаБезСкидок = Выборка.СуммаСоСкидкой;
		Движение.Количество = Выборка.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

