#Область ПрограммныйИнтерфейс

Функция ПоказателиЗдоровья003у() Экспорт
	
	Показатели = Новый Массив;
	
	СпрПоказатели = Справочники.ДействияМедсестрыСтационара;
	
	Показатели.Добавить(СпрПоказатели.Температура);
	Показатели.Добавить(СпрПоказатели.Дыхание); // Частота.
	Показатели.Добавить(СпрПоказатели.НасыщениеКислородом);
	Показатели.Добавить(СпрПоказатели.Вес);
	Показатели.Добавить(СпрПоказатели.ВыпитоЖидкости);
	Показатели.Добавить(СпрПоказатели.ВведеноЖидностиПарентерально);
	Показатели.Добавить(СпрПоказатели.СуточноеКоличествоМочи);
	Показатели.Добавить(СпрПоказатели.Стул);
	Показатели.Добавить(СпрПоказатели.АртериальноеДавление);
	
	Возврат Показатели;
	
КонецФункции

Функция ПоказателиЗдоровья003уССопутствующими() Экспорт
	
	Показатели = ПоказателиЗдоровья003у();
	Показатели.Добавить(Справочники.ДействияМедсестрыСтационара.АртериальноеДавлениеНижнее);
	
	Возврат Показатели;
	
КонецФункции

#КонецОбласти