#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.СписокСкрытьПоказатьАрхивные, Список, Ложь);
	
КонецПроцедуры

// Добавлено Макеев (
&НаСервере
Процедура омг_ПриСозданииНаСервере(Отказ)
	
	// Подбор из классификатора
	КмПодборИзКлассификатора = Команды.Добавить("омг_ПодборИзКлассификатора");
	КмПодборИзКлассификатора.Заголовок = "Подбор из классификатора";
	КмПодборИзКлассификатора.Действие = "омг_ПодборИзКлассификатора";
	
	ЭлПодборИзКлассификатора = Элементы.Добавить("омг_ПодборИзКлассификатора", Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
	ЭлПодборИзКлассификатора.ИмяКоманды = "омг_ПодборИзКлассификатора";
	
КонецПроцедуры

&НаСервере
Процедура омг_УстановитьДейстияФормы()
	
	УстановитьДействие("ПриСозданииНаСервере", "омг_ПриСозданииНаСервере");
	
КонецПроцедуры
// )
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьСправочникИзЕГИСЗ(Команда)
	ИнтеграцияЕГИСЗКлиент.КомандаСпискаЗагрузитьКлассификаторФРНСИ(ЭтаФорма, Элементы.Список, Список);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСправочникНоменклатуры(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() > 1 Тогда
		СоздатьНовуюНоменклатуру("ВыделенныеСтроки", ВыделенныеСтроки);
	Иначе
		КнопкиВопроса = Новый СписокЗначений();
		КнопкиВопроса.Добавить("Все", НСтр("ru='Весь справочник'"));
		КнопкиВопроса.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Отмена'"));
		
		Если ВыделенныеСтроки.Количество() = 1 Тогда
			КнопкиВопроса.Вставить(1, "ВыделенныеСтроки", НСтр("ru='Выделенная строка'"));
			ТекстВопроса = НСтр("ru='Перенести все элементы справочника?'");
		Иначе
			ТекстВопроса = НСтр("ru='Строки для переноса не выбранны. Перенести весь справочник?'");
		КонецЕсли;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СоздатьНовуюНоменклатуру", ЭтотОбъект,ВыделенныеСтроки),
			ТекстВопроса, КнопкиВопроса, 60, "Все",, КодВозвратаДиалога.Отмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюНоменклатуру(Ответ, ВыделенныеСтроки) Экспорт
	
	Если Ответ = "Все" Тогда
		ИсходныеДанные = Неопределено;
	ИначеЕсли Ответ = "ВыделенныеСтроки" Тогда 
		ИсходныеДанные = ВыделенныеСтроки; 
	Иначе
		Возврат;
	КонецЕсли;
	
	Парам = Новый Структура("ИсходныеДанные", ИсходныеДанные);
	ОткрытьФорму("Справочник.НоменклатураМедицинскихУслуг.Форма.ФормаЗаполненияНоменклатуры", Парам, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСсылкиНаУстаревшуюНоменклатуру(Команда)
	ОткрытьФорму("Справочник.НоменклатураМедицинскихУслуг.Форма.УстаревшиеСсылки");
КонецПроцедуры

&НаКлиенте
Процедура ПоместитьВАрхив(Команда)
	РаботаСДиалогамиКлиент.ПоместитьВАрхив(Элементы.Список.ВыделенныеСтроки);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьАрхивные(Команда)
	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.СписокСкрытьПоказатьАрхивные, Список);
КонецПроцедуры

// Добавлено Макеев (
&НаКлиенте
Процедура омг_ПодборИзКлассификатора(Команда)
	
	ОткрытьФорму("Справочник.НоменклатураМедицинскихУслуг.Форма.омг_КлассификаторМедУслуг");	
	
КонецПроцедуры
// )
#КонецОбласти

// Добавлено Макеев (
омг_УстановитьДейстияФормы();
// )