#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Объект.ОсновнойСпособЗаполненияГрафика.Пустая() Тогда
		НаследоватьСпособЗаполненияГрафикаОтПодразделения = Истина;
		Элементы.ОсновнойСпособЗаполненияГрафика.Доступность = Ложь;
	Иначе
		НаследоватьСпособЗаполненияГрафикаОтПодразделения = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НаследоватьСпособЗаполненияГрафикаОтПодразделения Тогда
		ТекущийОбъект.ОсновнойСпособЗаполненияГрафика = Справочники.СпособыЗаполненияГрафиковРабот.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаследоватьОтГруппыПриИзменении(Элемент)
	Элементы.ОсновнойСпособЗаполненияГрафика.Доступность = Не НаследоватьСпособЗаполненияГрафикаОтПодразделения;
КонецПроцедуры
	
#КонецОбласти    

///////////////////////////////////////////////////////////////////
// ОМГ +

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НовыйЭлемент = Элементы.Добавить("омг_Организация", Тип("ПолеФормы"),ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.омг_Организация";
	Элементы.Переместить(НовыйЭлемент,ЭтаФорма,Элементы.ГруппаПодвал); 
	
	НовыйЭлемент = Элементы.Добавить("омг_Филиал", Тип("ПолеФормы"),ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.омг_Филиал";
	Элементы.Переместить(НовыйЭлемент,ЭтаФорма,Элементы.ГруппаПодвал);

	НовыйЭлемент = Элементы.Добавить("омг_ПлощадьПомещения", Тип("ПолеФормы"),ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.омг_ПлощадьПомещения";
	Элементы.Переместить(НовыйЭлемент,ЭтаФорма,Элементы.ГруппаПодвал);  
	
	//ТаблицаФормы = Элементы.Добавить("омг_Специализации", Тип("ТаблицаФормы"),ЭтаФорма);
	//ТаблицаФормы.ПутьКДанным = "Объект.омг_Специализации";	
	//НовыйЭлемент  = Элементы.Добавить("омг_СпециализацииСпециализация",Тип("ПолеФормы"),ТаблицаФормы);
	//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
	//НовыйЭлемент.ПутьКДанным = "Объект.омг_Специализации.Специализация";

КонецПроцедуры
// ОМГ -
///////////////////////////////////////////////////////////////////

