#Область ПрограммныйИнтерфейс

Функция ИнтерфейсЗаполнения(ИдентификаторИнтерфейса) Экспорт
	
	Попытка
		Возврат ПредопределенноеЗначение(СтрШаблон("Перечисление.ИнтерфейсыЗаполненияПараметров.%1", ИдентификаторИнтерфейса));
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ПоляТаблицыИнтерфейса(ИдентификаторИнтерфейса) Экспорт
	
	ИнтерфейсЗаполнения = ИнтерфейсЗаполнения(ИдентификаторИнтерфейса);
	
	Поля	 = Новый Массив;
	Таблицы	 = Новый Массив;
	Иерархия = СтруктураИерархии();
	
	Если ИнтерфейсЗаполнения = ПредопределенноеЗначение("Перечисление.ИнтерфейсыЗаполненияПараметров.СЭМД_186_Исследования") Тогда
		ЗаполнитьПоляТаблицы_СЭМД_186_Исследования(Поля, Таблицы, Иерархия);
	КонецЕсли;
	
	Возврат Новый Структура("Поля, Таблицы, Иерархия", Поля, Таблицы, Иерархия);
	
КонецФункции

Процедура ОбновитьТекстHTMLПоИнтерфейсу(ДокументHTML, ИдентификаторСтрокиШаблона, ИдентификаторИнтерфейса, ТаблицаПараметров, ПараметрыТаблицШаблонов = Неопределено, СообщатьОбОшибках = Ложь) Экспорт
	
	ТекущиеКонтейнерыРезультата = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(ДокументHTML, ИдентификаторИнтерфейса, , "data-bit-interface-container-result");
	
	Для Каждого ТекущийКонтейнерРезультата Из ТекущиеКонтейнерыРезультата Цикл
		ТекущийКонтейнерРезультата.parentNode.removeChild(ТекущийКонтейнерРезультата);
	КонецЦикла;
	
	НайденныеЭлементы = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(ДокументHTML, ИдентификаторИнтерфейса, , "data-bit-interface-id");
	ЭлементыИнтерфейса = РаботаСDOMКлиентСервер.ПреобразоватьОбходимуюКоллекциюВМассив(НайденныеЭлементы);
	
	Если ЭлементыИнтерфейса.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементИнтерфейса = ЭлементыИнтерфейса[0];
	
	ТекстыОшибок = Новый Массив;
	ТекстHTMLПоИнтерфейсу = СформироватьТекстHTMLПоИнтерфейсу(ЭлементИнтерфейса, ИдентификаторСтрокиШаблона, ИдентификаторИнтерфейса, ТаблицаПараметров, ПараметрыТаблицШаблонов, ТекстыОшибок);
	
	Если СообщатьОбОшибках
		И ТекстыОшибок.Количество() > 0
	Тогда
		ЗаголовокИнтерфейса = ЗаголовокИнтерфейса(ЭлементИнтерфейса, ИдентификаторИнтерфейса);
		ТекстыОшибок.Вставить(0, СтрШаблон(НСтр("ru='В настройке интерфейса ""%1"" допущены ошибки:'"), ЗаголовокИнтерфейса));
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрСоединить(ТекстыОшибок, Символы.ПС + Символы.Таб));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекстHTMLПоИнтерфейсу) Тогда
		НовыйКонтейнерРезультата = ДокументHTML.createElement("div");
		НовыйКонтейнерРезультата.setAttribute("data-bit-interface-container-result", ИдентификаторИнтерфейса);
		
		РаботаСHTMLКлиентСервер.ДобавитьПроизвольныйHTMLВЭлемент(НовыйКонтейнерРезультата, ТекстHTMLПоИнтерфейсу, Истина);
		СледующийСоседнийЭлемент = РаботаСHTMLКлиентСервер.СледующийСоседнийЭлемент(ЭлементИнтерфейса);
		
		Если СледующийСоседнийЭлемент <> Неопределено Тогда
			ЭлементИнтерфейса.parentNode.insertBefore(НовыйКонтейнерРезультата, СледующийСоседнийЭлемент);
		Иначе
			ЭлементИнтерфейса.parentNode.appendChild(НовыйКонтейнерРезультата );
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктурыТаблицПараметровЭлементаИнтерфейса(ЭлементИнтерфейса, ТекстыОшибок = Неопределено) Экспорт
	
	НайденныеЭлементы = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(ЭлементИнтерфейса,,, "data-bit-interface-parameters");
	УзлыКонтейнера = РаботаСDOMКлиентСервер.ПреобразоватьОбходимуюКоллекциюВМассив(НайденныеЭлементы);
	
	Если УзлыКонтейнера.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицыПараметровИнтерфейса = Новый Массив;
	ПараметрыПолей = Новый Массив;
	
	ПоляТаблицыИнтерфейса = ПоляТаблицыИнтерфейса(ЭлементИнтерфейса.getAttribute("data-bit-interface-id"));
	
	СтруктурыПолейПоНастройкамИнтерфейса = Новый Соответствие;
	СтруктурыТаблицПоНастройкамИнтерфейса = Новый Соответствие;
	
	ЗаполнитьСтруктурыПолейТаблицПоНастройкамИерархииИнтерфейса(ПоляТаблицыИнтерфейса.Иерархия, СтруктурыПолейПоНастройкамИнтерфейса, СтруктурыТаблицПоНастройкамИнтерфейса);
	
	УзелКонтейнера = УзлыКонтейнера[0];
	ЗначениеАтрибутаТаблиц = УзелКонтейнера.getAttribute("data-bit-interface-dyntables");
	Если ЗначениеЗаполнено(ЗначениеАтрибутаТаблиц) Тогда
		Для Каждого ТаблицаИнтерфейса Из СтрРазделить(ЗначениеАтрибутаТаблиц, ";", Ложь) Цикл
			ИмяИдентификаторТаблицы = СтрРазделить(ТаблицаИнтерфейса, ":", Ложь);
			
			Если ТекстыОшибок <> Неопределено
				И ИмяИдентификаторТаблицы.Количество() <> 2
			Тогда
				СтруктураТаблицыПоИмени = СтруктурыТаблицПоНастройкамИнтерфейса.Получить(ИмяИдентификаторТаблицы[0]);
				Если СтруктураТаблицыПоИмени <> Неопределено
					И СтруктураТаблицыПоИмени.Обязательное
				Тогда
					ТекстыОшибок.Добавить(СтрШаблон(НСтр("ru='Не настроена таблица ""%1""'"), ?(ЗначениеЗаполнено(СтруктураТаблицыПоИмени.Синоним), СтруктураТаблицыПоИмени.Синоним, ИмяИдентификаторТаблицы[0])));
				КонецЕсли;
			КонецЕсли;
			
			Попытка
				ИмяТаблицы = ИмяИдентификаторТаблицы[0];
			Исключение
				Продолжить;
			КонецПопытки;
			
			Попытка
				ИдентификаторТаблицы = Новый УникальныйИдентификатор(ИмяИдентификаторТаблицы[1]);
			Исключение
				ИдентификаторТаблицы = Неопределено;
			КонецПопытки;
			
			ТаблицыПараметровИнтерфейса.Добавить(Новый Структура("ИмяТаблицы, Идентификатор, МассивДанныхТаблицы", ИмяТаблицы, ИдентификаторТаблицы, Новый Массив));
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого УзелПараметра Из РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(УзелКонтейнера,,, "data-bit-interface-parameter-name") Цикл
		ИмяПоля = УзелПараметра.getAttribute("data-bit-interface-parameter-name");
		Если ЗначениеЗаполнено(ИмяПоля) Тогда
			Если ЗначениеЗаполнено(УзелПараметра.id) Тогда
				Попытка
					ИдентификаторПараметра = Новый УникальныйИдентификатор(УзелПараметра.id);
				Исключение
					ИдентификаторПараметра = Неопределено;
				КонецПопытки;
				ПараметрыПолей.Добавить(Новый Структура("ИмяПоля, Идентификатор, Значение", ИмяПоля, ИдентификаторПараметра));
			ИначеЕсли ТекстыОшибок <> Неопределено Тогда
				СтруктураПоляПоИмени = СтруктурыПолейПоНастройкамИнтерфейса.Получить(ИмяПоля);
				Если СтруктураПоляПоИмени <> Неопределено
					И СтруктураПоляПоИмени.Обязательное
				Тогда
					ТекстыОшибок.Добавить(СтрШаблон(НСтр("ru='Не настроено поле ""%1""'"), ?(ЗначениеЗаполнено(СтруктураПоляПоИмени.Синоним), СтруктураПоляПоИмени.Синоним, ИмяПоля)));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("ТаблицыПараметровИнтерфейса, ПараметрыПолей", ТаблицыПараметровИнтерфейса, ПараметрыПолей);
	
КонецФункции

Процедура ЗаполнитьЭлементыДанныхПоИнтерфейсам(ДокументHTML, ИдентификаторСтрокиШаблона, ТаблицаПараметров, ДанныеТаблицШаблонов, ДляРедактирования = Ложь) Экспорт
	
	Если ДанныеТаблицШаблонов = Неопределено Тогда
		ПараметрыТаблицШаблонов = Неопределено;
	Иначе
		ПараметрыТаблицШаблонов = ДанныеТаблицШаблонов.ПараметрыТаблицШаблонов;
	КонецЕсли;
	
	ЭлементыИнтерфейсов = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(ДокументHTML,,, "data-bit-interface-id");
	
	Для Каждого ЭлементИнтерфейса Из ЭлементыИнтерфейсов Цикл
		ИдентификаторИнтерфейса = ЭлементИнтерфейса.ПолучитьАтрибут("data-bit-interface-id");
		ОбновитьТекстHTMLПоИнтерфейсу(ДокументHTML, ИдентификаторСтрокиШаблона, ИдентификаторИнтерфейса, ТаблицаПараметров, ПараметрыТаблицШаблонов, Истина);
	КонецЦикла;
	
	Если Не ДляРедактирования Тогда
		Для Каждого ЭлементИнтерфейса Из ЭлементыИнтерфейсов Цикл
			ЭлементИнтерфейса.parentNode.removeChild(ЭлементИнтерфейса);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаголовокИнтерфейса(ЭлементИнтерфейса, ИдентификаторИнтерфейса) Экспорт
	
	ЗаголовокИнтерфейса = "";
	
	ЭлементЗаголовка = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(ЭлементИнтерфейса,,, "data-bit-interface-title", Истина);
	Если ЭлементЗаголовка <> Неопределено Тогда
		ЗаголовокИнтерфейса = ЭлементЗаголовка.textContent;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗаголовокИнтерфейса) Тогда
		ЗаголовокИнтерфейса = ИнтерфейсЗаполнения(ИдентификаторИнтерфейса);
	КонецЕсли;
	
	Возврат ЗаголовокИнтерфейса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураИерархии()
	
	Возврат Новый Структура("Поля, Таблицы", Новый Массив, Новый Массив);
	
КонецФункции

Процедура ДополнитьМассив(МассивСтруктур, Иерархия, Имя, Синоним, Таблица = Ложь, ТипЗначения = Неопределено, ВидКлассификатора = Неопределено, Обязательное = Истина)
	
	СтруктураЭлемента = Новый Структура("Имя, Синоним, Обязательное", Имя, Синоним, Обязательное);
	МассивСтруктур.Добавить(СтруктураЭлемента);
	
	Если ЗначениеЗаполнено(ТипЗначения) Тогда
		СтруктураЭлемента.Вставить("ТипЗначения", ТипЗначения);
		Если ЗначениеЗаполнено(ВидКлассификатора) Тогда
			СтруктураЭлемента.Вставить("ВидКлассификатора", ВидКлассификатора);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураДляИерархии = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураЭлемента);
	Если Таблица Тогда
		СтруктураДляИерархии.Вставить("Подчиненные", СтруктураИерархии());
		МассивИерархии = Иерархия.Таблицы;
	Иначе
		МассивИерархии = Иерархия.Поля;
	КонецЕсли;
	
	МассивИерархии.Добавить(СтруктураДляИерархии);
	
КонецПроцедуры

Функция ЗаполнитьСтруктурыПолейТаблицПоНастройкамИерархииИнтерфейса(Иерархия, СтруктурыПолейПоНастройкамИнтерфейса, СтруктурыТаблицПоНастройкамИнтерфейса, ОбязательноеПоРодителю = Истина)
	
	// Для структур полей/таблиц обязательность зависит от обязательности родителя
	
	Для Каждого СтруктураПоля Из Иерархия.Поля Цикл
		СтруктурыПолейПоНастройкамИнтерфейса.Вставить(СтруктураПоля.Имя, Новый Структура("Синоним, Обязательное", СтруктураПоля.Синоним, СтруктураПоля.Обязательное И ОбязательноеПоРодителю));
	КонецЦикла;
	
	Для Каждого СтруктураТаблицы Из Иерархия.Таблицы Цикл
		СтруктурыТаблицПоНастройкамИнтерфейса.Вставить(СтруктураТаблицы.Имя, Новый Структура("Синоним, Обязательное", СтруктураТаблицы.Синоним, СтруктураТаблицы.Обязательное И ОбязательноеПоРодителю));
		ЗаполнитьСтруктурыПолейТаблицПоНастройкамИерархииИнтерфейса(СтруктураТаблицы.Подчиненные, СтруктурыПолейПоНастройкамИнтерфейса, СтруктурыТаблицПоНастройкамИнтерфейса, СтруктураТаблицы.Обязательное И ОбязательноеПоРодителю)
	КонецЦикла;
	
КонецФункции

Функция СформироватьТекстHTMLПоИнтерфейсу(ЭлементИнтерфейса, ИдентификаторСтрокиШаблона, ИдентификаторИнтерфейса, ТаблицаПараметров, ПараметрыТаблицШаблонов, ТекстыОшибок)
	
	ИнтерфейсЗаполнения = ИнтерфейсЗаполнения(ИдентификаторИнтерфейса);
	
	Если ИнтерфейсЗаполнения = ПредопределенноеЗначение("Перечисление.ИнтерфейсыЗаполненияПараметров.СЭМД_186_Исследования") Тогда
		Возврат ТекстHTMLПоИнтерфейсу_СЭМД_186_Исследования(ЭлементИнтерфейса, ИдентификаторСтрокиШаблона, ИдентификаторИнтерфейса, ТаблицаПараметров, ПараметрыТаблицШаблонов, ТекстыОшибок);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#Область СЭМД_186_Исследования

Процедура ЗаполнитьПоляТаблицы_СЭМД_186_Исследования(Поля, Таблицы, Иерархия)
	
	ТипБулево		 = Новый ОписаниеТипов("Булево");
	ТипСтрока		 = Новый ОписаниеТипов("Строка");
	ТипДата			 = Новый ОписаниеТипов("Дата");
	ТипСотрудник	 = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
	ТипКлассификатор = Новый ОписаниеТипов("СправочникСсылка.КлассификаторыМинздрава");
	ТипЛабТест		 = Новый ОписаниеТипов("СправочникСсылка.ЛабораторныеТесты");
	ТипОборудование	 = Новый ОписаниеТипов("СправочникСсылка.МедицинскоеОборудование");
	ТипНМУ			 = Новый ОписаниеТипов("СправочникСсылка.НоменклатураМедицинскихУслуг");
	
	ПричиныОтмены		= ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ПричиныОтменыВыполненияЛабораторногоИсследования");
	ПрофилиИсследований	= ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ПрофилиЛабораторныхИсследований");
	Должности			= ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.ДолжностиРаботниковМедОрганизаций");
	Интерпретации		= ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.СправочникКодовИнтерпретацииРезультатов");
	
	ДополнитьМассив(Поля, Иерархия, "ИсследованияВыполнены",				"Исследования выполнены",,					ТипБулево);
	ДополнитьМассив(Поля, Иерархия, "ПричинаОтменыВыполненияИсследований",	"Причина отмены выполнения исследований",,	ТипКлассификатор, ПричиныОтмены);
	
	// Исследования
	ДополнитьМассив(Таблицы, Иерархия, "Исследования", "Исследования", Истина);
	ИерархияИсследований = Иерархия.Таблицы[Иерархия.Таблицы.ВГраница()].Подчиненные;
	
	ДополнитьМассив(Поля, ИерархияИсследований, "ИсследованиеПрофиль",						"Профиль лабораторного исследования",,	 ТипКлассификатор, ПрофилиИсследований);
	ДополнитьМассив(Поля, ИерархияИсследований, "ИсследованиеПримечаниеКРезультату",		"Примечание к результату исследования",, ТипСтрока,, Ложь);
	ДополнитьМассив(Поля, ИерархияИсследований, "ИсследованиеДатаПримечания",				"Дата указания примечания",,			 ТипДата,, Ложь);
	ДополнитьМассив(Поля, ИерархияИсследований, "ИсследованиеАвторПримечания",				"Автор примечания",,					 ТипСотрудник,, Ложь);
	ДополнитьМассив(Поля, ИерархияИсследований, "ИсследованиеДолжностьАвтораПримечания",	"Должность автора примечания",,			 ТипКлассификатор, Должности, Ложь);
	
	// Исследования → Лабораторные тесты
	ДополнитьМассив(Таблицы, ИерархияИсследований, "ЛабораторныеТесты", "Лабораторные тесты", Истина);
	ИерархияЛабТестов = ИерархияИсследований.Таблицы[ИерархияИсследований.Таблицы.ВГраница()].Подчиненные;
	
	ДополнитьМассив(Поля, ИерархияЛабТестов, "ЛабораторныйТест",							"Лабораторный тест",,								ТипЛабТест);
	ДополнитьМассив(Поля, ИерархияЛабТестов, "ЛабораторныйТестВыполнен",					"Лабораторный тест выполнен",,						ТипБулево);
	ДополнитьМассив(Поля, ИерархияЛабТестов, "ЛабораторныйТестПричинаОтмены",				"Причина отмены выполнения лабораторного теста",,	ТипКлассификатор, ПричиныОтмены);
	ДополнитьМассив(Поля, ИерархияЛабТестов, "ЛабораторныйТестДатаВыполнения",				"Дата выполнения лабораторного теста",,				ТипДата);
	ДополнитьМассив(Поля, ИерархияЛабТестов, "ЛабораторныйТестЗначение",					"Значение лабораторного теста",,					ТипСтрока);
	ДополнитьМассив(Поля, ИерархияЛабТестов, "ЛабораторныйТестИнтерпретацияРезультата",		"Интерпретация результата",,						ТипКлассификатор, Интерпретации, Ложь);
	ДополнитьМассив(Поля, ИерархияЛабТестов, "ЛабораторныйТестШтрихкод",					"Штрихкод лабораторного теста",,					ТипСтрока);
	ДополнитьМассив(Поля, ИерархияЛабТестов, "ЛабораторныйТестСотрудник",					"Сотрудник, проводивший исследование",,				ТипСотрудник);
	ДополнитьМассив(Поля, ИерархияЛабТестов, "ЛабораторныйТестДолжностьСотрудника",			"Должность сотрудника, проводившего исследование",,	ТипКлассификатор, Должности);
	ДополнитьМассив(Поля, ИерархияЛабТестов, "ЛабораторныйТестКомментарий",					"Комментарий к лабораторному параметру",,			ТипСтрока,, Ложь);
	ДополнитьМассив(Поля, ИерархияЛабТестов, "ЛабораторныйТестДатаКомментария",				"Дата указания комментария",,						ТипДата,, Ложь);
	ДополнитьМассив(Поля, ИерархияЛабТестов, "ЛабораторныйТестАвторКомментария",			"Автор комментария",,								ТипСотрудник,, Ложь);
	ДополнитьМассив(Поля, ИерархияЛабТестов, "ЛабораторныйТестДолжностьАвтораКомментария",	"Должность автора комментария",,					ТипКлассификатор, Должности, Ложь);
	
	// Исследования → Лабораторные тесты → Использованное оборудование
	ДополнитьМассив(Таблицы, ИерархияЛабТестов, "ИспользованноеОборудование", "Использованное оборудование", Истина);
	ИерархияОборудований = ИерархияЛабТестов.Таблицы[ИерархияЛабТестов.Таблицы.ВГраница()].Подчиненные;
	
	ДополнитьМассив(Поля, ИерархияОборудований, "Оборудование", "Мед. оборудование",, ТипОборудование);
	
	// Исследования → Оказанные услуги
	ДополнитьМассив(Таблицы, ИерархияИсследований, "ОказанныеУслуги", "Оказанные услуги", Истина,,, Ложь);
	ИерархияОказанныхУслуг = ИерархияИсследований.Таблицы[ИерархияИсследований.Таблицы.ВГраница()].Подчиненные;
	
	ДополнитьМассив(Поля, ИерархияОказанныхУслуг, "ОказаннаяУслуга",		"Оказанная услуга",,		ТипНМУ);
	ДополнитьМассив(Поля, ИерархияОказанныхУслуг, "ОказаннаяУслугаДата",	"Дата оказанной услуги",,	ТипДата);
	
КонецПроцедуры

Функция ТекстHTMLПоИнтерфейсу_СЭМД_186_Исследования(ЭлементИнтерфейса, ИдентификаторСтрокиШаблона, ИдентификаторИнтерфейса, ТаблицаПараметров, ПараметрыТаблицШаблонов, ТекстыОшибок)
	
	Если ПараметрыТаблицШаблонов = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	СтруктурыТаблицПараметров = ПолучитьСтруктурыТаблицПараметровЭлементаИнтерфейса(ЭлементИнтерфейса, ТекстыОшибок);
	
	ТаблицыПараметровИнтерфейса	= Новый Соответствие;
	ЗначенияПараметровПолей		= Новый Соответствие;
	ПоляПараметров				= Новый Соответствие;
	
	Для Каждого СтруктураТаблицы Из СтруктурыТаблицПараметров.ТаблицыПараметровИнтерфейса Цикл
		Если СтруктураТаблицы.Идентификатор = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОтборПараметровТаблицыШаблона = Новый Структура;
		ОтборПараметровТаблицыШаблона.Вставить("ИдентификаторТаблицы",		 Строка(СтруктураТаблицы.Идентификатор));
		ОтборПараметровТаблицыШаблона.Вставить("ИдентификаторСтрокиШаблона", ИдентификаторСтрокиШаблона);
		СтрокиПараметровТаблицыШаблона = ПараметрыТаблицШаблонов.НайтиСтроки(ОтборПараметровТаблицыШаблона);
		Для Каждого СтрокаТаблицы Из СтрокиПараметровТаблицыШаблона Цикл
			СтруктураПараметра = Новый Структура("НомерСтрокиТаблицы, Параметр, Значение, Представление, ИдентификаторТаблицы, ИдентификаторСтроки, ИдентификаторРодительскойСтроки");
			ЗаполнитьЗначенияСвойств(СтруктураПараметра, СтрокаТаблицы);
			СтруктураТаблицы.МассивДанныхТаблицы.Добавить(СтруктураПараметра);
		КонецЦикла;
		
		ТаблицыПараметровИнтерфейса.Вставить(СтруктураТаблицы.ИмяТаблицы, Новый Структура("Идентификатор, МассивДанныхТаблицы", СтруктураТаблицы.Идентификатор, СтруктураТаблицы.МассивДанныхТаблицы));
	КонецЦикла;
	
	Для Каждого СтруктураПараметраПоля Из СтруктурыТаблицПараметров.ПараметрыПолей Цикл
		Если СтруктураПараметраПоля.Идентификатор = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОтборПараметра = Новый Структура;
		ОтборПараметра.Вставить("ИдентификаторСтрокиШаблона",	ИдентификаторСтрокиШаблона);
		ОтборПараметра.Вставить("СтрокаУидПараметра",			Строка(СтруктураПараметраПоля.Идентификатор));
		СтрокиПараметра = ТаблицаПараметров.НайтиСтроки(ОтборПараметра);
		
		ЗначениеПредставление = Новый Структура("Значение, Представление");
		Если СтрокиПараметра.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(ЗначениеПредставление, СтрокиПараметра[0]);
		КонецЕсли;
		
		ЗначенияПараметровПолей.Вставить(СтруктураПараметраПоля.ИмяПоля, ЗначениеПредставление);
		ПоляПараметров.Вставить(СтруктураПараметраПоля.Идентификатор, СтруктураПараметраПоля.ИмяПоля);
	КонецЦикла;
	
	ДанныеИсследованийПоРодителям	= ПолучитьДанныеСтрокПоРодительскимСтрокам(ТаблицыПараметровИнтерфейса, "Исследования",					ПоляПараметров);
	ДанныеЛабТестовПоРодителям		= ПолучитьДанныеСтрокПоРодительскимСтрокам(ТаблицыПараметровИнтерфейса, "ЛабораторныеТесты",			ПоляПараметров);
	ДанныеОборудованияПоРодителям	= ПолучитьДанныеСтрокПоРодительскимСтрокам(ТаблицыПараметровИнтерфейса, "ИспользованноеОборудование",	ПоляПараметров);
	ДанныеОказанныхУслугПоРодителям	= ПолучитьДанныеСтрокПоРодительскимСтрокам(ТаблицыПараметровИнтерфейса, "ОказанныеУслуги",				ПоляПараметров);
	
	ИсследованияВыполнены = ЗначенияПараметровПолей.Получить("ИсследованияВыполнены").Значение;
	
	Если ИсследованияВыполнены
		И ДанныеИсследованийПоРодителям.Количество() = 0
	Тогда
		Возврат "";
	КонецЕсли;
	
	СтрокиРезультата = Новый Массив;
	СтрокиРезультата.Добавить("<div>Результаты лабораторных исследований:</div>");
	
	Если ИсследованияВыполнены <> Истина Тогда
		ТекстОтмененныхИсследований =
			"<div>Исследования отменены.</div>
			|<div>Причина отмены: %1</div>";
		СтрокиРезультата.Добавить(СтрШаблон(ТекстОтмененныхИсследований, ЗначенияПараметровПолей.Получить("ПричинаОтменыВыполненияИсследований").Представление));
		Возврат СтрСоединить(СтрокиРезультата, Символы.ПС);
	КонецЕсли;
	
	ТаблицаИсследований = ДанныеИсследованийПоРодителям.Получить("");
	ТаблицаИсследований.НомераСтрок.СортироватьПоЗначению();
	СтрокиИсследований = Новый Массив;
	
	Для Каждого НомерСтрокиИсследования Из ТаблицаИсследований.НомераСтрок.ВыгрузитьЗначения() Цикл
		
		СтруктураДанныхСтрокиПоНомеру = ТаблицаИсследований.ДанныеСтрок.Получить(НомерСтрокиИсследования);
		ПараметрыСтроки = СтруктураДанныхСтрокиПоНомеру.ПараметрыСтроки;
		
		ИсследованиеПрофиль						= HTMLПредставлениеПараметраСтроки(ПараметрыСтроки.Получить("ИсследованиеПрофиль"));
		ИсследованиеПримечаниеКРезультату		= HTMLПредставлениеПараметраСтроки(ПараметрыСтроки.Получить("ИсследованиеПримечаниеКРезультату"));
		ИсследованиеДатаПримечания				= HTMLПредставлениеПараметраСтроки(ПараметрыСтроки.Получить("ИсследованиеДатаПримечания"));
		ИсследованиеАвторПримечания				= HTMLПредставлениеПараметраСтроки(ПараметрыСтроки.Получить("ИсследованиеАвторПримечания"));
		ИсследованиеДолжностьАвтораПримечания	= HTMLПредставлениеПараметраСтроки(ПараметрыСтроки.Получить("ИсследованиеДолжностьАвтораПримечания"));
		
		Если Не ЗначениеЗаполнено(ИсследованиеПрофиль) Тогда
			ИсследованиеПрофиль = "Отдельные лабораторные тесты";
		КонецЕсли;
		
		ТестыИсследования = ДанныеЛабТестовПоРодителям.Получить(СтруктураДанныхСтрокиПоНомеру.ИдентификаторСтроки);
		
		Если ТестыИсследования = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТестыИсследования.НомераСтрок.СортироватьПоЗначению();
		
		СтрокиТестов = Новый Массив;
		Для Каждого НомерСтрокиУслуги Из ТестыИсследования.НомераСтрок.ВыгрузитьЗначения() Цикл
			
			СтруктураДанныхТестаПоНомеру = ТестыИсследования.ДанныеСтрок.Получить(НомерСтрокиУслуги);
			ПараметрыТеста = СтруктураДанныхТестаПоНомеру.ПараметрыСтроки;
			
			ЛабораторныйТестВыполнен					= ЗначениеПараметраСтроки(ПараметрыТеста.Получить("ЛабораторныйТестВыполнен"));
			
			ЛабораторныйТест							= HTMLПредставлениеПараметраСтроки(ПараметрыТеста.Получить("ЛабораторныйТест"));
			ЛабораторныйТестДатаВыполнения				= HTMLПредставлениеПараметраСтроки(ПараметрыТеста.Получить("ЛабораторныйТестДатаВыполнения"));
			ЛабораторныйТестСотрудник					= HTMLПредставлениеПараметраСтроки(ПараметрыТеста.Получить("ЛабораторныйТестСотрудник"));
			ЛабораторныйТестДолжностьСотрудника			= HTMLПредставлениеПараметраСтроки(ПараметрыТеста.Получить("ЛабораторныйТестДолжностьСотрудника"));
			ЛабораторныйТестПричинаОтмены				= HTMLПредставлениеПараметраСтроки(ПараметрыТеста.Получить("ЛабораторныйТестПричинаОтмены"));
			ЛабораторныйТестЗначение					= HTMLПредставлениеПараметраСтроки(ПараметрыТеста.Получить("ЛабораторныйТестЗначение"));
			ЛабораторныйТестИнтерпретацияРезультата		= HTMLПредставлениеПараметраСтроки(ПараметрыТеста.Получить("ЛабораторныйТестИнтерпретацияРезультата"));
			ЛабораторныйТестШтрихкод					= HTMLПредставлениеПараметраСтроки(ПараметрыТеста.Получить("ЛабораторныйТестШтрихкод"));
			ЛабораторныйТестКомментарий					= HTMLПредставлениеПараметраСтроки(ПараметрыТеста.Получить("ЛабораторныйТестКомментарий"));
			ЛабораторныйТестДатаКомментария				= HTMLПредставлениеПараметраСтроки(ПараметрыТеста.Получить("ЛабораторныйТестДатаКомментария"));
			ЛабораторныйТестАвторКомментария			= HTMLПредставлениеПараметраСтроки(ПараметрыТеста.Получить("ЛабораторныйТестАвторКомментария"));
			ЛабораторныйТестДолжностьАвтораКомментария	= HTMLПредставлениеПараметраСтроки(ПараметрыТеста.Получить("ЛабораторныйТестДолжностьАвтораКомментария"));
			
			Если Не (ЗначениеЗаполнено(ЛабораторныйТест)
					И ЗначениеЗаполнено(ЛабораторныйТестДатаВыполнения)
					И ЗначениеЗаполнено(ЛабораторныйТестСотрудник)
					И ЗначениеЗаполнено(ЛабораторныйТестДолжностьСотрудника))
			Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстПричиныОтмены = "";
			ТекстРезультата = "";
			Если ЛабораторныйТестВыполнен Тогда
				
				ОборудованияТеста = ДанныеОборудованияПоРодителям.Получить(СтруктураДанныхТестаПоНомеру.ИдентификаторСтроки);
				
				Если Не (ЗначениеЗаполнено(ЛабораторныйТестЗначение)
						И ЗначениеЗаполнено(ЛабораторныйТестШтрихкод))
					Или ОборудованияТеста = Неопределено // В успешном тесте всегда есть оборудование
				Тогда
					Продолжить;
				КонецЕсли;
				
				ОборудованияТеста.НомераСтрок.СортироватьПоЗначению();
				
				СтрокиОборудования = Новый Массив;
				Для Каждого НомерСтрокиОборудования Из ОборудованияТеста.НомераСтрок.ВыгрузитьЗначения() Цикл
					СтруктураДанныхОборудованияПоНомеру = ОборудованияТеста.ДанныеСтрок.Получить(НомерСтрокиОборудования);
					ПараметрыОборудования = СтруктураДанныхОборудованияПоНомеру.ПараметрыСтроки;
					
					ОборудованиеТеста = HTMLПредставлениеПараметраСтроки(ПараметрыОборудования.Получить("Оборудование"));
					
					ШаблонСтрокиОборудования = "<div>• %1</div>";
					СтрокиОборудования.Добавить(СтрШаблон(ШаблонСтрокиОборудования, ОборудованиеТеста));
				КонецЦикла;
				
				ТекстОбородования = СтрСоединить(СтрокиОборудования, Символы.ПС);
				
				ШаблонРезультата =
					"<div>Значение: %1</div>
					|<div>Интерпретация результата: %2</div>
					|<div>Штрихкод: %3</div>
					|<div>
					|	<div>Использованное оборудование:</div>
					|	<div style='margin-left:0.5cm'>
					|	%4
					|	</div>
					|</div>";
				
				ТекстРезультата = Символы.ПС + СтрШаблон(ШаблонРезультата, ЛабораторныйТестЗначение, ЛабораторныйТестИнтерпретацияРезультата, ЛабораторныйТестШтрихкод, ТекстОбородования);
			Иначе
				Если Не ЗначениеЗаполнено(ЛабораторныйТестПричинаОтмены) Тогда
					Продолжить;
				КонецЕсли;
				
				ТекстПричиныОтмены = Символы.ПС + СтрШаблон("<div>Причина отмены: %2</div>", Символы.ПС, ЛабораторныйТестПричинаОтмены);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЛабораторныйТестКомментарий)
				И ЗначениеЗаполнено(ЛабораторныйТестДатаКомментария)
				И ЗначениеЗаполнено(ЛабораторныйТестАвторКомментария)
				И ЗначениеЗаполнено(ЛабораторныйТестДолжностьАвтораКомментария)
			Тогда
				ШаблонКомментария =
					"<div>
					|	<div>Комментарий:</div>
					|	<div style='margin-left:0.5cm'>
					|		<div>%1</div>
					|		<div>Дата указания комментария: %2</div>
					|		<div>Автор комментария: %3, %4</div>
					|	</div>
					|</div>";
				ТекстКомментария = СтрШаблон(ШаблонКомментария, ЛабораторныйТестКомментарий, ЛабораторныйТестДатаКомментария, ЛабораторныйТестАвторКомментария, ЛабораторныйТестДолжностьАвтораКомментария);
			Иначе
				ТекстКомментария = "";
			КонецЕсли;
			
			ТекстВыполненияТеста = Формат(ЛабораторныйТестВыполнен, "БЛ=Отменен; БИ=Выполнен");
			
			ШаблонТеста =
				"<div>
				|	<div>%1</div>
				|	%2
				|	<div>Дата выполнения: %3</div>
				|	<div>Сотрудник, проводивший исследование: %4, %5</div>
				|	%6
				|	%7
				|</div>";
			
			ЗаголовокТеста = СтрШаблон("%1. %2. %3", СтрокиТестов.Количество() + 1, ЛабораторныйТест, ТекстВыполненияТеста);
			
			ТекстТеста = СтрШаблон(ШаблонТеста, ЗаголовокТеста, ТекстПричиныОтмены, ЛабораторныйТестДатаВыполнения, ЛабораторныйТестСотрудник, ЛабораторныйТестДолжностьСотрудника, ТекстРезультата, ТекстКомментария);
			СтрокиТестов.Добавить(ТекстТеста);
		КонецЦикла;
		
		Если СтрокиТестов.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекстТестовИсследования = СтрСоединить(СтрокиТестов, "<br>");
		
		СтрокиУслуг = Новый Массив;
		УслугиИсследования = ДанныеОказанныхУслугПоРодителям.Получить(СтруктураДанныхСтрокиПоНомеру.ИдентификаторСтроки);
		
		Если УслугиИсследования <> Неопределено Тогда
			УслугиИсследования.НомераСтрок.СортироватьПоЗначению();
			
			Для Каждого НомерСтрокиУслуги Из УслугиИсследования.НомераСтрок.ВыгрузитьЗначения() Цикл
				
				СтруктураДанныхУслугиПоНомеру = УслугиИсследования.ДанныеСтрок.Получить(НомерСтрокиУслуги);
				ПараметрыУслуги = СтруктураДанныхУслугиПоНомеру.ПараметрыСтроки;
				
				ОказаннаяУслуга		= HTMLПредставлениеПараметраСтроки(ПараметрыУслуги.Получить("ОказаннаяУслуга"));
				ДатаОказаннойУслуги	= HTMLПредставлениеПараметраСтроки(ПараметрыУслуги.Получить("ОказаннаяУслугаДата"));
				
				Если ЗначениеЗаполнено(ОказаннаяУслуга)
					И ЗначениеЗаполнено(ДатаОказаннойУслуги)
				Тогда
					ШаблонСтрокиУслуги = "<div>• %1: %2</div>";
					СтрокиУслуг.Добавить(СтрШаблон(ШаблонСтрокиУслуги, ДатаОказаннойУслуги, ОказаннаяУслуга));
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если СтрокиУслуг.Количество() > 0 Тогда
			ШаблонУслуг =
				"<br>
				|<div>
				|	<div style='font-style:italic'>Оказанные услуги:</div>
				|	<div style='margin-left:0.5cm'>
				|		%1
				|	</div>
				|</div>";
			
			ТекстУслуг = СтрШаблон(ШаблонУслуг, СтрСоединить(СтрокиУслуг, Символы.ПС));
		Иначе
			ТекстУслуг = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ИсследованиеПримечаниеКРезультату)
			И ЗначениеЗаполнено(ИсследованиеДатаПримечания)
			И ЗначениеЗаполнено(ИсследованиеАвторПримечания)
			И ЗначениеЗаполнено(ИсследованиеДолжностьАвтораПримечания)
		Тогда
			ШаблонПримечания =
				"<div>
				|	<div>Примечание:</div>
				|	<div style='margin-left:0.5cm'>
				|		<div>%1</div>
				|		<div>Дата указания примечания: %2</div>
				|		<div>Автор примечания: %3, %4</div>
				|	</div>
				|</div>";
			ТекстПримечания = Символы.ПС + СтрШаблон(ШаблонПримечания, ИсследованиеПримечаниеКРезультату, ИсследованиеДатаПримечания, ИсследованиеАвторПримечания, ИсследованиеДолжностьАвтораПримечания);
		Иначе
			ТекстПримечания = "";
		КонецЕсли;
		
		ШаблонПрофиляИсследования =
			"<div>
			|	<div style='font-weight:bold'>%1. Профиль: %2</div>
			|	<div style='margin-left:1cm'>
			|		<div style='font-style:italic'>Лабораторные тесты:</div>
			|		<br>
			|		%3
			|		%4
			|		%5
			|	</div>
			|</div>";
		
		ТекстИсследования = СтрШаблон(ШаблонПрофиляИсследования, СтрокиИсследований.Количество() + 1, ИсследованиеПрофиль, ТекстТестовИсследования, ТекстУслуг, ТекстПримечания);
		СтрокиИсследований.Добавить(ТекстИсследования);
	КонецЦикла;
	
	СтрокиРезультата.Добавить(СтрСоединить(СтрокиИсследований, "<br>"));
	
	НормализованныйТекст = РаботаСШаблонамиHTMLКлиентСервер.НормализоватьОтступы(СтрСоединить(СтрокиРезультата, Символы.ПС));
	
	Возврат РаботаСDOMКлиентСервер.ПолучитьКодТелаHTMLИзКодаДокумента(НормализованныйТекст);
	
КонецФункции

#КонецОбласти

Функция ПолучитьДанныеСтрокПоРодительскимСтрокам(ТаблицыПараметровИнтерфейса, ИмяТаблицы, ПоляПараметров)
	
	ДанныеТаблицыПоРодителям = Новый Соответствие;
	
	СтруктураДанныхТаблицы = ТаблицыПараметровИнтерфейса.Получить(ИмяТаблицы);
	
	Если СтруктураДанныхТаблицы = Неопределено Тогда
		Возврат ДанныеТаблицыПоРодителям;
	КонецЕсли;
	
	Для Каждого СтрокаПараметраТаблицы Из СтруктураДанныхТаблицы.МассивДанныхТаблицы Цикл
		
		ДанныеТаблицыПоРодителю = ДанныеТаблицыПоРодителям.Получить(СтрокаПараметраТаблицы.ИдентификаторРодительскойСтроки);
		Если ДанныеТаблицыПоРодителю = Неопределено Тогда
			ДанныеТаблицыПоРодителю = Новый Структура("НомераСтрок, ДанныеСтрок", Новый СписокЗначений, Новый Соответствие);
			ДанныеТаблицыПоРодителям.Вставить(СтрокаПараметраТаблицы.ИдентификаторРодительскойСтроки, ДанныеТаблицыПоРодителю);
		КонецЕсли;
		
		Если ДанныеТаблицыПоРодителю.НомераСтрок.НайтиПоЗначению(СтрокаПараметраТаблицы.НомерСтрокиТаблицы) = Неопределено Тогда
			ДанныеТаблицыПоРодителю.НомераСтрок.Добавить(СтрокаПараметраТаблицы.НомерСтрокиТаблицы);
		КонецЕсли;
		
		СтруктураДанныхСтроки = ДанныеТаблицыПоРодителю.ДанныеСтрок.Получить(СтрокаПараметраТаблицы.НомерСтрокиТаблицы);
		Если СтруктураДанныхСтроки = Неопределено Тогда
			СтруктураДанныхСтроки = Новый Структура("ПараметрыСтроки, ИдентификаторСтроки", Новый Соответствие, СтрокаПараметраТаблицы.ИдентификаторСтроки);
			ДанныеТаблицыПоРодителю.ДанныеСтрок.Вставить(СтрокаПараметраТаблицы.НомерСтрокиТаблицы, СтруктураДанныхСтроки);
		КонецЕсли;
		
		ПолеПараметра = ПоляПараметров.Получить(СтрокаПараметраТаблицы.Параметр.УникальныйИдентификатор());
		Если ПолеПараметра <> Неопределено Тогда
			СтруктураДанныхСтроки.ПараметрыСтроки.Вставить(ПолеПараметра, СтрокаПараметраТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ДанныеТаблицыПоРодителям;
	
КонецФункции

Функция ЗначениеПараметраСтроки(СтрокаПараметра)
	
	Если СтрокаПараметра <> Неопределено Тогда
		Возврат СтрокаПараметра.Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция HTMLПредставлениеПараметраСтроки(СтрокаПараметра)
	
	Если СтрокаПараметра <> Неопределено Тогда
		Возврат СтрЗаменить(СтрокаПараметра.Представление, Символы.ПС, "<br>");
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти