Процедура ПроверкаЗащитыКонфигурации(Отказ = Ложь) Экспорт
	Перем Результат, РезультатПроверки;
	ИмяПриложения = ПолучитьИмяТекущегоПриложения();
	Если ЗначениеЗаполнено(ИмяПриложения) Тогда
		Если ИмяПриложения = "WSConnection" Или ИмяПриложения = "HTTPServiceConnection" Или ИмяПриложения = "WebServerExtension" Или ИмяПриложения = "BackgroundJob" Или ИмяПриложения = "SystemBackgroundJob" Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	Текст = "РезультатПроверки = СерверСЛК.ПолучитьЛицензию(доп_Защита_Конфигурации.КлючПродукта());	|Результат = СерверСЛК.НетОшибок(РезультатПроверки);";
	Если Не Результат Тогда
		ОписаниеОшибкиСЛ = РезультатПроверки.Описание + Символы.ПС + РезультатПроверки.Комментарий + Символы.ПС + "код ошибки: " + РезультатПроверки.Код;
		ЗаписьЖурналаРегистрации("Ошибка получения лицензии через ОЛИМП.Сервер лицензирования", УровеньЖурналаРегистрации.Предупреждение, , , ОписаниеОшибкиСЛ);
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Возникла ошибка получения лицензии в ходе выполнения операции!'; en='An error occurred obtaining a license!'"));
КонецПроцедуры
Функция ПолучитьИмяТекущегоПриложения()
	Результат = "";
	УстановитьПривилегированныйРежим(Истина);
	Соединения = ПолучитьСоединенияИнформационнойБазы();
	ТекущееСоединение = Неопределено;
	Для каждого Соединение Из Соединения Цикл
		Если Соединение.НомерСоединения = НомерСоединенияИнформационнойБазы() Тогда
			ТекущееСоединение = Соединение;
		КонецЕсли;
	КонецЦикла;
	Результат = ТекущееСоединение.ИмяПриложения;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Результат;
КонецФункции
Функция ЕстьЛиЖизньНаМарсе(ИмяМодуля) Экспорт
	Перем Результат, РезультатПроверки;
	Отказ = Ложь;
	ИмяПриложения = ПолучитьИмяТекущегоПриложения();
	Если ЗначениеЗаполнено(ИмяПриложения) Тогда
		Если ИмяПриложения = "WSConnection" Или ИмяПриложения = "HTTPServiceConnection" Или ИмяПриложения = "WebServerExtension" Или ИмяПриложения = "BackgroundJob" Или ИмяПриложения = "SystemBackgroundJob" Тогда
			Возврат Отказ;
		КонецЕсли;
	КонецЕсли;
	ПараметрыМодуля = ПолучитьАтрибутыПараметраЛицензииМодуля(ИмяМодуля);
	ЗначениеПараметра = "";
	Попытка
		Текст = "Результат = СерверСЛК.ПолучитьПараметрЛицензии(доп_Защита_Конфигурации.КлючПродукта(), ПараметрыМодуля.ИмяПараметра, ЗначениеПараметра);";
		Если ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			Отказ = Отказ Или ВРег(ЗначениеПараметра) <> ВРег(ПараметрыМодуля.ЗначениеНаличия);
		Иначе
			Отказ = Истина;
		КонецЕсли;
		Если Отказ Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена лицения на функционал раздела """ + ПараметрыМодуля.ИмяПараметра + """!");
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена лицения на функционал раздела """ + ПараметрыМодуля.ИмяПараметра + """!");
	КонецПопытки;
	Возврат Отказ;
КонецФункции
