Функция ПолучитьСтавкуНДСДляУСН(Организация, Период) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтавкиНДСПриУСНСрезПоследних.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	РегистрСведений.СтавкиНДСПриУСН.СрезПоследних(&Период, Организация = &Организация) КАК СтавкиНДСПриУСНСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СтавкаНДС;
	КонецЦикла;
	
	Возврат Перечисления.СтавкиНДС.БезНДС;
	
КонецФункции

Процедура СкорректироватьСтавкуТовараДляУСН(СтавкаТовара, ОсновнаяСтавка) Экспорт
	
	// УСН применяет свою ставку кроме Номенклатуры с 0%.
	Если (		ОсновнаяСтавка = Перечисления.СтавкиНДС.БезНДС
			Или ОсновнаяСтавка = Перечисления.СтавкиНДС.НДС5
			Или ОсновнаяСтавка = Перечисления.СтавкиНДС.НДС7
			Или ОсновнаяСтавка = Перечисления.СтавкиНДС.НДС5_105
			Или ОсновнаяСтавка = Перечисления.СтавкиНДС.НДС7_107
		  )
		И СтавкаТовара <> Перечисления.СтавкиНДС.НДС0
	Тогда
		СтавкаТовара = ОсновнаяСтавка;
	КонецЕсли;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОМГ  

Функция омг_ПолучитьСтавкуНДСДляУСН(Организация, Период) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВозЗначение = Перечисления.СтавкиНДС.БезНДС;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтавкиНДСПриУСНСрезПоследних.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	РегистрСведений.СтавкиНДСПриУСН.СрезПоследних(&Период) КАК СтавкиНДСПриУСНСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда   
		
		ВозЗначение = Выборка.СтавкаНДС;  
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтавкиНДСПриУСНСрезПоследних.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	РегистрСведений.СтавкиНДСПриУСН.СрезПоследних(&Период, Организация = &Организация) КАК СтавкиНДСПриУСНСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Период);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ВозЗначение = Выборка.СтавкаНДС;
	КонецЕсли;
	
	Возврат ВозЗначение;
	
КонецФункции    

    // ОМГ    
	///////////////////////////////////////////////////////////////////////////////