
&НаСервере
Процедура ОтправитьНаСервере()
	
	ВходящиеПараметры = Новый Структура("Заявка, Чат", Заявка, Чат);
	
	ДанныеСообщения = Справочники.iga_ШаблоныСообщений.ОтправитьСообщение(Чат, Чат.Идентификатор, Шаблон, ВходящиеПараметры);
	
	//Если Не ДанныеСообщения = Неопределено Тогда 
	//	iga_МетодыРаботыСБотом.УстановитьПараметрСообщения(Чат, 
	//	ДанныеСообщения.IDСообщения, "ДатаЗаписи", Заявка.ДатаНачала);
	//	
	//	iga_МетодыРаботыСБотом.УстановитьПараметрСообщения(Чат, 
	//	ДанныеСообщения.IDСообщения, "Заявка", Заявка);
	//КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры
