
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Оператор = Параметры.Оператор;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_СвязиПодразделенийСОператорами.Подразделение КАК Подразделение
	               |ПОМЕСТИТЬ ВТ_ПодразделенияОператоров
	               |ИЗ
	               |	РегистрСведений.iga_СвязиПодразделенийСОператорами КАК iga_СвязиПодразделенийСОператорами
	               |ГДЕ
	               |	iga_СвязиПодразделенийСОператорами.Оператор = &Оператор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	iga_ПодразделенияОператоров.Ссылка КАК Подразделение,
	               |	ЛОЖЬ КАК Пометка,
	               |	iga_ПодразделенияОператоров.Код КАК Код
	               |ИЗ
	               |	Справочник.iga_ПодразделенияОператоров КАК iga_ПодразделенияОператоров
	               |ГДЕ
	               |	iga_ПодразделенияОператоров.Активное
	               |	И НЕ iga_ПодразделенияОператоров.ПометкаУдаления
	               |	И НЕ iga_ПодразделенияОператоров.Ссылка В
	               |				(ВЫБРАТЬ
	               |					ВТ_ПодразделенияОператоров.Подразделение КАК Подразделение
	               |				ИЗ
	               |					ВТ_ПодразделенияОператоров КАК ВТ_ПодразделенияОператоров)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	iga_ПодразделенияОператоров.Ссылка,
	               |	ИСТИНА,
	               |	iga_ПодразделенияОператоров.Код
	               |ИЗ
	               |	ВТ_ПодразделенияОператоров КАК ВТ_ПодразделенияОператоров
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.iga_ПодразделенияОператоров КАК iga_ПодразделенияОператоров
	               |		ПО ВТ_ПодразделенияОператоров.Подразделение = iga_ПодразделенияОператоров.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Код";
	Запрос.УстановитьПараметр("Оператор", Оператор);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Подразделения.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОКНаСервере()
	ЗаписиСвязей = РегистрыСведений.iga_СвязиПодразделенийСОператорами.СоздатьНаборЗаписей();
	ЗаписиСвязей.Отбор.Оператор.Установить(Оператор);
	Для Каждого СтрокаСписка Из Подразделения Цикл
		Если СтрокаСписка.Пометка Тогда
			Запись = ЗаписиСвязей.Добавить();
			Запись.Оператор = Оператор;
			Запись.Подразделение = СтрокаСписка.Подразделение;
		КонецЕсли;
	КонецЦикла;
	ЗаписиСвязей.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОКНаСервере();
	Закрыть();
КонецПроцедуры
