#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма);
	
	#Область ЭлектронныеПодписи
	ИспользуютсяЭП = ЭЦП_УМЦ_Сервер.ИспользоватьЭлектронныеПодписиЭМК();
	Если ИспользуютсяЭП И Не Объект.Ссылка.Пустая() Тогда
		Если Объект.ПодписанЭП Тогда
			ОбновитьСписокПодписей();
		Иначе
			доп_СертификатыЭЦП.ЗаполнитьСводкуПодписей(Объект.Ссылка, СводкаHTML, ЭлектронныеПодписи);
		КонецЕсли;
		УстановитьДоступностьВидимостьПоЭП();
	КонецЕсли;
	ПараметрыФО = Новый Структура("ПараметрУчетнаяПолитикаРасширенная", Перечисления.ПараметрыУчетнойПолитики.ИспользоватьЭлектронныеПодписиЭМК);
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	#КонецОбласти
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ОписаниеТипа = Новый ОписаниеТипов("СправочникСсылка.КлассификаторыМинЗдрава");
		ЭтаФорма.Элементы.Цель.ОграничениеТипа = ОписаниеТипа;
		Объект.Цель = ОписаниеТипа.ПривестиЗначение();
		
		Если Не ЗначениеЗаполнено(Объект.Цель) 
			И Не ЗначениеЗаполнено(Параметры.ЗначениеКопирования) 
		Тогда
			Объект.Цель = Документы.ВрачебнаяКомиссия.ПолучитьЭлементИныеЦели();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);
	
	ОбновитьВидимостьДанныхЛН();
	
	Если ЗначениеЗаполнено(Объект.Заключение) Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЗаключение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменилисьПодписи"
		И Параметр = Объект.Ссылка
	Тогда
		ЭтотОбъект.Прочитать();
		ОбновитьДанныеПослеПодписания();
	ИначеЕсли ИмяСобытия = "ОбновитьСписокПодписей"
		И Параметр = Объект.Ссылка
	Тогда
		ОбновитьСписокПодписей();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьДиагнозыИзПриема(Команда)
	ОткрытьФорму("Документ.Прием.Форма.ФормаВыбора",,,,,, Новый ОписаниеОповещения("ЗаполнитьДиагнозыИзДругогоПриемаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДиагнозыИзОснования(Команда)
	ЗаполнитьДиагнозыИзОснованияНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДиагнозыПриАктивизацииСтроки(Элемент)
	ОбновитьЗаголовокОписания();	
КонецПроцедуры

&НаКлиенте
Процедура ДиагнозыДиагнозПриИзменении(Элемент)
	ОбновитьЗаголовокОписания();
КонецПроцедуры

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)

	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)

	РаботаСФормамиКлиент.ПолеВводаКлиентаАвтоПодбор(Текст, СтандартнаяОбработка, ДанныеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		ОбновитьВидимостьДанныхЛН();
		Ответ = Вопрос(НСтр("ru='Перезаполнить данные?'"), РежимДиалогаВопрос.ДаНет,0);
	    Если Ответ = КодВозвратаДиалога.Да Тогда     
			ПерезаполнитьНаОсновании();   
	    КонецЕсли;		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеОчистка(Элемент, СтандартнаяОбработка)
	ОбновитьВидимостьДанныхЛН(Истина);
КонецПроцедуры
 
&НаКлиенте
Процедура СтрокаЛНПриИзменении(Элемент)
	ЗаполнитьДанныеИзЛН(Объект.СтрокаЛН,Объект.Основание);
	ОбновитьЗаключение();
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	Объект.МедицинскаяКарта = МедицинскаяДеятельность.ПолучитьОсновнуюМедКартуПациента(Объект.Клиент,Объект.Дата);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЗаголовокОписания()
	Если Элементы.Диагнозы.ТекущиеДанные <> Неопределено Тогда
		Элементы.ЗаголовокДиагноз.Заголовок = НСтр("ru='Строка №'") + Элементы.Диагнозы.ТекущиеДанные.НомерСтроки + ": " + Элементы.Диагнозы.ТекущиеДанные.Диагноз;
		Элементы.ГруппаОписание.Доступность = Истина;
	Иначе          
		Элементы.ЗаголовокДиагноз.Заголовок = "";	
		Элементы.ГруппаОписание.Доступность = Ложь;
	КонецЕсли; 		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаключение() 
	Если ЗначениеЗаполнено(Объект.ДатаНачалаНетрудоспособности) Или ЗначениеЗаполнено(Объект.ДатаОкончанияНетрудоспособности) Тогда
		Ответ = Вопрос(НСтр("ru='Обновить заключение?'"), РежимДиалогаВопрос.ДаНет,0);
	    Если Ответ = КодВозвратаДиалога.Да Тогда     
			Объект.Заключение = "Продлить лист нетрудоспособности с " 
								+ Формат(Объект.ДатаНачалаНетрудоспособности,"ДФ=dd.MM.yyyy") + " по " 
								+ Формат(Объект.ДатаОкончанияНетрудоспособности,"ДФ=dd.MM.yyyy");   
	    КонецЕсли;		
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеИзЛН(СтрокаЛН, СсылкаЛН)
	Если СтрокаЛН = 1 Тогда
		Объект.ДатаНачалаНетрудоспособности = СсылкаЛН.Запись1ДатаНачала;
		Объект.ДатаОкончанияНетрудоспособности = СсылкаЛН.Запись1ДатаОкончания;
		Объект.ПредседательКомиссии = СсылкаЛН.Запись1ПредседательВК;		
		Объект.СоставКомиссии.Очистить();
		Если Объект.ПредседательКомиссии<>СсылкаЛН.Запись1Врач Тогда
			СтрокаСотрудника = Объект.СоставКомиссии.Добавить();
			СтрокаСотрудника.Сотрудник = СсылкаЛН.Запись1Врач;
		КонецЕсли; 
	ИначеЕсли СтрокаЛН = 2 Тогда 
		Объект.ДатаНачалаНетрудоспособности = СсылкаЛН.Запись2ДатаНачала;
		Объект.ДатаОкончанияНетрудоспособности = СсылкаЛН.Запись2ДатаОкончания;
		Объект.ПредседательКомиссии = СсылкаЛН.Запись2ПредседательВК;
		Объект.СоставКомиссии.Очистить();
		Если Объект.ПредседательКомиссии<>СсылкаЛН.Запись2Врач Тогда
			СтрокаСотрудника = Объект.СоставКомиссии.Добавить();
			СтрокаСотрудника.Сотрудник = СсылкаЛН.Запись2Врач;
		КонецЕсли; 	
	ИначеЕсли СтрокаЛН = 3 Тогда 
		Объект.ДатаНачалаНетрудоспособности = СсылкаЛН.Запись3ДатаНачала;
		Объект.ДатаОкончанияНетрудоспособности = СсылкаЛН.Запись3ДатаОкончания;
		Объект.ПредседательКомиссии = СсылкаЛН.Запись3ПредседательВК;
		Объект.СоставКомиссии.Очистить();
		Если Объект.ПредседательКомиссии<>СсылкаЛН.Запись3Врач Тогда
			СтрокаСотрудника = Объект.СоставКомиссии.Добавить();
			СтрокаСотрудника.Сотрудник = СсылкаЛН.Запись3Врач;
		КонецЕсли; 	
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьНаОсновании()
	СсылкаОснование = Объект.Основание;       
	Объект.Диагнозы.Очистить();
	Объект.СоставКомиссии.Очистить();
	Если ТипЗнч(СсылкаОснование) = Тип("ДокументСсылка.ЛистокНетрудоспособности") Тогда
		// Заполнение шапки
		Объект.Клиент = СсылкаОснование.Клиент;
		Объект.Ответственный = СсылкаОснование.Ответственный;
		Объект.Основание = СсылкаОснование.Ссылка;
		Объект.МедицинскаяКарта = СсылкаОснование.МедицинскаяКарта;

		// Данные ЛН
		ДанныеЛН = Документы.ЛистокНетрудоспособности.ПолучитьПоследниееДанныеЛН(Объект.Основание);	
		Объект.СтрокаЛН = ДанныеЛН.НомерСтроки;
		Объект.ДатаНачалаНетрудоспособности = ДанныеЛН.ДатаНачала;
		Объект.ДатаОкончанияНетрудоспособности = ДанныеЛН.ДатаОкончания;
		Объект.ПредседательКомиссии = ДанныеЛН.ПредседательВК;
		Заключение = НСтр("ru='Продлить лист нетрудоспособности с '") 
					+ Формат(Объект.ДатаНачалаНетрудоспособности,"ДФ=dd.MM.yyyy") + " по "
					+ Формат(Объект.ДатаОкончанияНетрудоспособности,"ДФ=dd.MM.yyyy");
		
		// Состав комиссии
		Объект.СоставКомиссии.Очистить();
		ВрачЛН = ДанныеЛН.Врач;
		Если ЗначениеЗаполнено(ВрачЛН) И Объект.ПредседательКомиссии<>ВрачЛН Тогда
			СтрокаСотрудника = Объект.СоставКомиссии.Добавить();
			СтрокаСотрудника.Сотрудник = ВрачЛН;	
		КонецЕсли;		
		
		// Диагноз
		Объект.Диагнозы.Очистить();	
		СтрокаДиагноза = Объект.Диагнозы.Добавить();
		СтрокаДиагноза.Диагноз = СсылкаОснование.ДиагнозПоМКБ10;
	ИначеЕсли ТипЗнч(СсылкаОснование) = Тип("ДокументСсылка.Прием") Тогда
		// Заполнение шапки
		Объект.Клиент = СсылкаОснование.Клиент;
		Объект.Основание = СсылкаОснование.Ссылка;
		Объект.МедицинскаяКарта = СсылкаОснование.МедицинскаяКарта;
		
		// Состав комиссии
		Объект.СоставКомиссии.Очистить();
		СтрокаСотрудника = Объект.СоставКомиссии.Добавить();
		СтрокаСотрудника.Сотрудник = СсылкаОснование.Врач;
		
		// Диагнозы
		Объект.Диагнозы.Очистить();
		Для каждого СтрокаДиагноза Из СсылкаОснование.Диагнозы Цикл
			НоваяСтрока = Объект.Диагнозы.Добавить();
			НоваяСтрока.Диагноз = СтрокаДиагноза.Диагноз;
			НоваяСтрока.СтепеньОбоснованности = СтрокаДиагноза.Классификация1;
			НоваяСтрока.ВидНозологическойЕдиницы = СтрокаДиагноза.Классификация3;
		КонецЦикла; 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДиагнозыИзДругогоПриемаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЗаполнитьДиагнозамиИзПриема(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиагнозамиИзПриема(Прием)
	Для каждого СтрокаДиагноза Из Прием.Диагнозы Цикл
		НоваяСтрока = Объект.Диагнозы.Добавить();
		НоваяСтрока.Диагноз = СтрокаДиагноза.Диагноз;
		НоваяСтрока.СтепеньОбоснованности = СтрокаДиагноза.Классификация1;
		НоваяСтрока.ВидНозологическойЕдиницы = СтрокаДиагноза.Классификация3;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДанныхЛН(Скрыть = Ложь)
	Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.ЛистокНетрудоспособности") И Не Скрыть Тогда 
		Элементы.СтрокаЛН.Видимость = Истина;	
		Элементы.ПериодНетрудоспособности.Видимость = Истина;
	Иначе
		Элементы.СтрокаЛН.Видимость = Ложь;
		Элементы.ПериодНетрудоспособности.Видимость = Ложь;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиагнозыИзОснованияНаСервере()
	ОбъектОснование = Объект.Основание;
	Если ТипЗнч(ОбъектОснование) = Тип("ДокументСсылка.ЛистокНетрудоспособности") Тогда
		СтрокаДиагноза = Объект.Диагнозы.Добавить();
		СтрокаДиагноза.Диагноз = ОбъектОснование.ДиагнозПоМКБ10;
	ИначеЕсли ТипЗнч(ОбъектОснование) = Тип("ДокументСсылка.Прием") Тогда	
		Для каждого СтрокаДиагноза Из ОбъектОснование.Диагнозы Цикл
			НоваяСтрока = Объект.Диагнозы.Добавить();
			НоваяСтрока.Диагноз = СтрокаДиагноза.Диагноз;
			НоваяСтрока.СтепеньОбоснованности = СтрокаДиагноза.Классификация1;
			НоваяСтрока.ВидНозологическойЕдиницы = СтрокаДиагноза.Классификация3;
		КонецЦикла; 
	КонецЕсли;	 
КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиДинамическиСоздаваемыхКоманд

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписи

#Область ЭлектронныеПодписиКоманды

&НаКлиенте
Процедура ПодписатьВсе(Команда)
	
	ЭЦП_УМЦ_Клиент.ПерейтиКПодписаниюЭМД(ЭтотОбъект, , , Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКПодписаниюЭМД(Команда)
	
	ЭЦП_УМЦ_Клиент.ПерейтиКПодписаниюЭМД(ЭтотОбъект, Истина, , Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписиСлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьСписокПодписей()
	
	доп_СертификатыЭЦП.ЗаполнитьСписокПодписей(Объект.Ссылка, УникальныйИдентификатор, Элементы.ГруппаЭП, ЭлектронныеПодписи,, СводкаHTML);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПослеПодписания()
	
	ОбновитьСписокПодписей();
	УстановитьДоступностьВидимостьПоЭП();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодписиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	СтрокиТекстаОшибки = Новый Массив;
	СтрокиТекстаОшибки.Добавить(НСтр("ru='Некоторые подписи не прошли проверку:'"));
	Для Каждого Подпись Из ЭлектронныеПодписи Цикл
		Если ЗначениеЗаполнено(Подпись.ОписаниеОшибки) Тогда
			СтрокиТекстаОшибки.Добавить(СтрШаблон(НСтр("ru='""%1"" от %2 по причине ""%3""'"), Подпись.КомуВыданСертификат, Строка(Подпись.ДатаПодписи), Подпись.ОписаниеОшибки));
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокиТекстаОшибки.Количество() > 1 Тогда
		ПоказатьПредупреждение(, СтрСоединить(СтрокиТекстаОшибки, Символы.ПС));
	ИначеЕсли Объект.ПодписанЭП Тогда
		ПоказатьПредупреждение(, НСтр("ru='Все подписи прошли проверку'"));
	КонецЕсли;
	
	ПрочитатьУстановитьДоступностьПолейЗаполнитьПодписи();
	
КонецПроцедуры

#КонецОбласти

#Область ЭлектронныеПодписиУправлениеДоступностьюПолей

&НаСервере
Процедура УстановитьДоступностьВидимостьПоЭП()
	
	Элементы.ГруппаЭП.Видимость = ИспользуютсяЭП;
	
	Если ИспользуютсяЭП Тогда
		Элементы.ГруппаДокумента.ТолькоПросмотр = Объект.ПодписанЭП;
		УстановитьДоступностьПодчиненныхКнопок(Элементы.Диагнозы.КоманднаяПанель, Объект.ПодписанЭП);
		РаботаСФормамиКлиентСервер.УстановитьПолеЭлементаФормы(Элементы, "КнопкаФилиал", "Доступность", Не Объект.ПодписанЭП);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПодчиненныхКнопок(Родитель, ИзмененияЗапрещены)
	
	Для Каждого ПодчиненныйЭлемент Из Родитель.ПодчиненныеЭлементы Цикл
		ПодчиненныйЭлемент.Доступность = Не ИзмененияЗапрещены;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьУстановитьДоступностьПолейЗаполнитьПодписи()
	
	Прочитать();
	УстановитьДоступностьВидимостьПоЭП();
	ОбновитьСписокПодписей();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
