Процедура ПриНачалеРаботыСистемы() Экспорт
	Если ИспользуемаяВерсияСистемыЛицензирования() = "1.6" Тогда
		доп_сл_сервер.УстановитьБуфер(КлючПродухтаБИТСЛК());
	Иначе
		сл2_Сервер.ЛицензироватьПродукт(МетаданныеЛицензируемогоПродукта());
	КонецЕсли;
КонецПроцедуры
Функция КлючПродухтаБИТСЛК(ИмяПродукта = Неопределено) Экспорт
	Если ИмяПродукта = Неопределено Тогда
		Возврат "{155B7633-C5E0-4031-9FF2-426A9CD74371}";
	КонецЕсли;
КонецФункции
Функция ЛицензияДоступна(ИмяМодуля = "") Экспорт
	Возврат ЗакрытыеПроцедуры.ЕстьВДеревнеКолбаска(ИмяМодуля);
КонецФункции
Функция ИспользуемаяВерсияСистемыЛицензирования() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если Константы.ИспользуемаяВерсияСистемыЛицензирования.Получить() = "1.6" Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86_64 Или СистемнаяИнформация.ТипПлатформы = ТипПлатформы.MacOS_x86 Тогда
		Возврат "1.6";
	Иначе
		Возврат "2.0";
	КонецЕсли;
КонецФункции
Функция МетаданныеЛицензируемогоПродукта(Мета = Неопределено) Экспорт
	Если Мета = Неопределено Тогда
		Мета = СтруктураМетаданных_УМЦ20();
	ИначеЕсли ТипЗнч(Мета) = Тип("Строка") Тогда
		Если Мета = "УМЦКОРП" Или Мета = "КОРП" Тогда
			Мета = СтруктураМетаданных_УМЦКОРП();
		Иначе
			Мета = СтруктураМетаданных_УМЦ20();
		КонецЕсли;
	КонецЕсли;
	Возврат сл2_Сервер.TLicensedProductInfo(Мета.ПолноеНаименование, Мета.ВерсияПродукта, Мета.ДатаСборки, Мета.ИдентификаторПродукта, Мета.КлючШифрования, Мета.ИдентификаторВидаПодпискиТС, Мета.РежимПроверкиПодписки);
КонецФункции
Функция МетаданныеДополнительныхЛицензируемыхПродуктов() Экспорт
	МетаданныеПродуктов = Новый Массив;
	Мета = СтруктураМетаданных_УМЦКОРП();
	МетаданныеПродуктов.Добавить(МетаданныеЛицензируемогоПродукта(Мета));
	Возврат МетаданныеПродуктов;
КонецФункции
Функция ОбновитьСтатусЛицензии(СостояниеЛицензирования) Экспорт
	ЛицензияПолучена = ВалидацияПротекцииОперации();
	Для каждого Продукт Из СостояниеЛицензирования.ЛицензируемыеПродукты Цикл
		Продукт.ЛицензияПолучена = ЛицензияПолучена;
	КонецЦикла;
КонецФункции
Функция СтруктураМетаданных_УМЦ20() Экспорт
	Описание = Новый Структура("ПолноеНаименование, ВерсияПродукта, ДатаСборки, ИдентификаторПродукта, КлючШифрования, ИдентификаторВидаПодпискиТС, РежимПроверкиПодписки");
	Описание.ПолноеНаименование = "ОЛИМП.Управление медицинским центром";
	Описание.ВерсияПродукта = "";
	Описание.ДатаСборки = "00010102";
	Описание.ИдентификаторПродукта = "78a3d5d6-98af-4a7c-a244-d9a9a7c06b7c";
	Описание.КлючШифрования = "dAD0yvW3ncKS7uoA";
	Описание.ИдентификаторВидаПодпискиТС = Неопределено;
	Описание.РежимПроверкиПодписки = 4;
	Возврат Описание;
КонецФункции
Функция СтруктураМетаданных_УМЦКОРП() Экспорт
	Описание = Новый Структура("ПолноеНаименование, ВерсияПродукта, ДатаСборки, ИдентификаторПродукта, КлючШифрования, ИдентификаторВидаПодпискиТС, РежимПроверкиПодписки");
	Описание.ПолноеНаименование = "ОЛИМП.Управление медицинским центром";
	Описание.ВерсияПродукта = "";
	Описание.ДатаСборки = "00010102";
	Описание.ИдентификаторПродукта = "155b7633-c5e0-4031-9ff2-426a9cd74371";
	Описание.КлючШифрования = "cd5JNzu6VKam8TQd";
	Описание.ИдентификаторВидаПодпискиТС = Неопределено;
	Описание.РежимПроверкиПодписки = 4;
	Возврат Описание;
КонецФункции
Функция ИдентификаторВидаПодпискиТС_УМЦ20() Экспорт
	Возврат "392b9bd7-7f9e-4fe6-8bb6-80339d30d4e8";
КонецФункции
Функция ИдентификаторВидаПодпискиТС_УМЦКОРП() Экспорт
	Возврат "09755767-f338-4216-b427-408a26f9cf0c";
КонецФункции
