#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьДанныеСправочника(АрхивироватьНеактуальныеЭлементы = Ложь, ПереходНаФРНСИ = Ложь) Экспорт
	
	Если ПереходНаФРНСИ Тогда
	
		НачатьТранзакцию();
		Выб = Справочники.удалитьПричиныОтказаВГоспитализации.Выбрать();
		Пока Выб.Следующий() Цикл
			Если Не ЗначениеЗаполнено(Выб.УИДЕГИСЗ)
				И Выб.Код <= 4
			Тогда
				Объект = Выб.ПолучитьОбъект();
				Объект.УИДЕГИСЗ = Объект.Код;
				Объект.ПометкаУдаления = Истина;
				Объект.Записать();
			КонецЕсли;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
	// Первоначальное заполнение
	ОбщегоНазначенияСервер.ВыполнитьЗагрузкуУниверсальнымОбменомXML(Справочники.удалитьПричиныОтказаВГоспитализации.ПолучитьМакет("ПервоначальноеЗаполнение"), Истина);
	
	Если АрхивироватьНеактуальныеЭлементы Тогда
	
		НачатьТранзакцию();
		Выб = Справочники.удалитьПричиныОтказаВГоспитализации.Выбрать();
		Пока Выб.Следующий() Цикл
			Если Выб.OIDСправочникаИсточника <> ПолучитьOIDСправочника() Тогда
				Объект = Выб.ПолучитьОбъект();
				Объект.Архив = Истина;
				Объект.ПометкаУдаления = Истина;
				Объект.Записать();
			КонецЕсли;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры

// Оставлено для совместимости. Убрана экспортность
// Возвращает идентификатор классификатора источника на сайте росминздрава.
// 
// Возвращаемое значение:
//   - Строка
//
Функция ПолучитьOIDСправочника()
	
	Возврат "1.2.643.5.1.13.13.11.1497";
	
КонецФункции

#КонецОбласти
