#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Макет = Справочники.НоменклатураМедицинскихУслуг.ПолучитьМакет("омг_КлассификаторМедицинскихУслуг");
	Макет.Параметры.Расшифровка = Истина;
	ПолеТабличногоДокумента.Вывести(Макет);
	ПолеТабличногоДокумента.ФиксацияСверху = ПолеТабличногоДокумента.Области.ОбластьРасшифровки.Верх - 1;
	ПолеТабличногоДокумента.ОтображатьЗаголовки = Ложь;
	ПолеТабличногоДокумента.ОтображатьСетку = Ложь;
	ПолеТабличногоДокумента.ТолькоПросмотр = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеТабличногоДокументаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Получение значений полей выбранной строки.
	
	ТекущаяОбласть    = ПолеТабличногоДокумента.ТекущаяОбласть;

	ОбластьКодЧисловой         = ПолеТабличногоДокумента.Области.КодУслуги;
	ОбластьНаименованиеКраткое = ПолеТабличногоДокумента.Области.НаименованиеУслуги;
	//ОбластьНаименованиеПолное  = ПолеТабличногоДокумента.Области.НаименованиеПолное;

	КодЧисловой         = ПолеТабличногоДокумента.Область(ТекущаяОбласть.Верх, ОбластьКодЧисловой.        Лево, ТекущаяОбласть.Низ, ОбластьКодЧисловой.        Право).Текст;
	НаименованиеКраткое = ПолеТабличногоДокумента.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеКраткое.Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеКраткое.Право).Текст;
	//НаименованиеПолное  = ПолеТабличногоДокумента.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеПолное. Лево, ТекущаяОбласть.Низ, ОбластьНаименованиеПолное. Право).Текст;

	// Проверка наличия выбранной единицы измерения.

	Ссылка = НайтиЭлементПоКоду(КодЧисловой);
    ПараметрыФормы = Новый Структура;
	Если НЕ Ссылка.Пустая() Тогда
		Вопрос = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'В справочнике ""Номенклатура медицинских услуг"" уже существует элемент с кодом ""%1""! Открыть существующий?'"),
			КодЧисловой);
		
		Ответ  = Вопрос(Вопрос, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Отмена, );
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ПараметрыФормы.Вставить("Ключ", Ссылка);
			ОткрытьФорму("Справочник.НоменклатураМедицинскихУслуг.ФормаОбъекта", ПараметрыФормы);
			Возврат;
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Создание новой единицы измерения.
	ЗначенияЗаполнения = Новый Структура("Код, Наименование, ПолноеНаименование",
										КодЧисловой,
										СтрПолучитьСтроку(НаименованиеКраткое, 1),
										СтрПолучитьСтроку(НаименованиеКраткое, 1));
										
	ОткрытьФорму("Справочник.НоменклатураМедицинскихУслуг.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения));
	
КонецПроцедуры

&НаСервере
Функция НайтиЭлементПоКоду(КодЧисловой)
	Ссылка = Справочники.НоменклатураМедицинскихУслуг.НайтиПоКоду(КодЧисловой);
	Возврат Ссылка;
КонецФункции

#КонецОбласти