#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормамиСервер.ФормаДокументаПриОткрытииСервер(ЭтаФорма, Ложь);
	
	ВремяОкончанияПоУмолчанию = УправлениеНастройкамиМедицинскогоУчета.ПолучитьПараметрУчетнойПолитики("ВремяВыпискиДляБронированияПоУмолчанию");
	
	ДатаС = Объект.ДатаНачала;
	ВремяС = Объект.ДатаНачала;

	ДатаПо = Объект.ДатаОкончания;
	ВремяПо = Объект.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПечатьДокументовКлиент.УстановитьЗаголовокПечатнойФормы(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.ДатаНачала = ДатаС + (ВремяС - Дата(1,1,1));
	Объект.ДатаОкончания = ДатаПо + (ВремяПо - Дата(1,1,1));
	
	Если Объект.ДатаНачала >= Объект.ДатаОкончания Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время начала бронирования не может быть больше или равно времени окончания бронирования",Объект.Ссылка,"ДатаНачала",,Отказ);
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСФормамиСервер.ВывестиЗаголовокФормыДокумента(ТекущийОбъект,,ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзменениеДокументаВЖурналеЗаписи");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ОбработчикиДинамическиСоздаваемыхКоманд

&НаКлиенте
Процедура Подключаемый_КнопкаФилиалПриНажатии(Команда)
	РаботаСДиалогамиКлиент.ДиалогКнопкаФилиалПриНажатии(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВывестиДвиженияДокумента(Команда)
	РаботаСДиалогамиКлиент.ВывестиДвиженияДокумента(Объект.Ссылка, Команда);
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПоискКлиентов(Команда)
	
	ФормаКлиента =  ПолучитьФорму("ОбщаяФорма.ФормаПоискаКлиентаУпр",,Элементы.Клиент);
	ФормаКлиента.Открыть();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	КалендарьПланирования.ОкруглитьВремяДоПериодаПланирования(Объект.ДатаНачала);
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(ВремяПо) Тогда
		ВремяПо = ВремяОкончанияПоУмолчанию;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВремяСПриИзменении(Элемент)
	КалендарьПланирования.ОкруглитьВремяДоПериодаПланирования(ВремяС);
КонецПроцедуры

&НаКлиенте
Процедура ВремяПоПриИзменении(Элемент)
	КалендарьПланирования.ОкруглитьВремяДоПериодаПланирования(ВремяПо);
КонецПроцедуры

&НаКлиенте
Процедура ВремяРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Имя элемента и имя реквизита должны совпадать.
	НовоеВремя = ЭтотОбъект[Элемент.Имя] + Направление * 3600;
	ЭтотОбъект[Элемент.Имя] = ?(Направление < 0 Или Час(НовоеВремя) > Час(ЭтотОбъект[Элемент.Имя]), НовоеВремя, ЭтотОбъект[Элемент.Имя]);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// Добавлено Макеев (
	омг_ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// )
КонецПроцедуры

#КонецОбласти