
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаОкончания");
	ЭлементОтбора.ПравоеЗначение = ТекущаяДата();
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ПоказатьВсеДоговоры(Команда)
	
	Список.Отбор.Элементы[0].Использование = Элементы.Формаомг_ПоказатьВсеДоговоры.Пометка;
	Элементы.Формаомг_ПоказатьВсеДоговоры.Пометка = Не Элементы.Формаомг_ПоказатьВсеДоговоры.Пометка;
	
КонецПроцедуры
