#Область ПрограммныйИнтерфейс

Функция ВерсияОбработки() Экспорт
	
	Возврат "1.4.13";
	
КонецФункции

Функция НайтиСловаВСкобках(ИсходнаяСтрока) Экспорт
    Результат = Новый Массив;
    Начало = 1;
    
    Пока Истина Цикл
        ПозицияНачала = СтрНайти(ИсходнаяСтрока, "{",, Начало);
        Если ПозицияНачала = 0 Тогда
            Прервать;
        КонецЕсли;
        
        ПозицияКонца = СтрНайти(ИсходнаяСтрока, "}",,ПозицияНачала + 1);
        Если ПозицияКонца = 0 Тогда
            // Нет закрывающей скобки — выходим
            Прервать;
        КонецЕсли;
        
        // Извлекаем подстроку целиком, включая фигурные скобки
        Слово = Сред(ИсходнаяСтрока, ПозицияНачала, ПозицияКонца - ПозицияНачала + 1);
        Результат.Добавить(Слово);
        
        // Продолжаем поиск после найденной скобки
        Начало = ПозицияКонца + 1;
    КонецЦикла;
    
    Возврат Результат;
КонецФункции

// Возвращает описание параметров, которые в дальнейшем необходимо
//  соотнести с планом видов характеристик в справочнике "ШаблоныHTML" (Шаблоны осмотра)
//  состоит из массива структур с составом, состоящим из имени и синонима.
// 
// Возвращаемое значение:
//  Массив.
//
Функция ПолучитьСписокПараметров() Экспорт
	
	мПараметры = Новый Массив;
	//Для Каждого Реквизит Из Метаданные().Реквизиты Цикл
	//	мПараметры.Добавить(Новый Структура("Имя, Синоним", Реквизит.Имя, Реквизит.Синоним));
	//КонецЦикла;
	ТекстДокумента = ПолучитьМакет("Шаблон").ПолучитьТекст();
	
	МассивСлов = НайтиСловаВСкобках(ТекстДокумента);
	Для Каждого Параметр Из МассивСлов Цикл
		Если Параметр = "{ДневниковыеЗаписи}" Тогда
			Продолжить;
		КонецЕсли;
		мПараметры.Добавить(Новый Структура("Имя, Синоним", Параметр, Параметр));
	КонецЦикла;
	
	Возврат мПараметры;
	
КонецФункции

Функция ПолучитьПараметрыТаблицШаблона() Экспорт
	
	мПараметры = Новый Массив;
	Для Каждого ТЧ Из Метаданные().ТабличныеЧасти Цикл
		Для Каждого Реквизит Из ТЧ.Реквизиты Цикл
			мПараметры.Добавить(Новый Структура("ИмяТаблицы, Имя, Синоним", ТЧ.Имя, Реквизит.Имя, Реквизит.Синоним));
		КонецЦикла;
	КонецЦикла;
	
	Возврат мПараметры;
	
КонецФункции

Функция ИспользоватьТиповоеЗаполнение() Экспорт
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьМакетШаблона() Экспорт
	
	Возврат ПолучитьМакет("Эпикриз");
	
КонецФункции

#КонецОбласти