
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДеньОтбора = ТекущаяДата();
	СписокЗаявокЛИС.Параметры.УстановитьЗначениеПараметра("ДокументОснование", Неопределено);
	СписокОшибокЗаявки.Параметры.УстановитьЗначениеПараметра("Ссылка", Неопределено);
	СписокИсследований.Параметры.УстановитьЗначениеПараметра("Ссылка", Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериодОтбораЗаявок()
	
	ЕстьНачалоПериода = Ложь;
	ЕстьКонецПериода = Ложь;
	Для Каждого ЭлементОтбора ИЗ СписокОказанияУслуг.Отбор.Элементы Цикл
		Если ЭлементОтбора.Представление = "НачалоПериода" Тогда
			ЭлементОтбора.ПравоеЗначение = НачалоДня(ДеньОтбора);
			ЕстьНачалоПериода = Истина;
		КонецЕсли;
		Если ЭлементОтбора.Представление = "КонецПериода" Тогда
			ЭлементОтбора.ПравоеЗначение = КонецДня(ДеньОтбора);
			ЕстьКонецПериода = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ЕстьНачалоПериода Тогда
		ЭлементОтбора = СписокОказанияУслуг.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
		ЭлементОтбора.ПравоеЗначение = НачалоДня(ДеньОтбора);
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.Представление = "НачалоПериода";
	КонецЕсли;
	
	Если Не ЕстьКонецПериода Тогда
		ЭлементОтбора = СписокОказанияУслуг.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
		ЭлементОтбора.ПравоеЗначение = КонецДня(ДеньОтбора);
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.Представление = "КонецПериода";
	КонецЕсли;
    //Трунов омг
	Результат = Пользователи.ЭтоПолноправныйПользователь();	
	Если НЕ Результат Тогда
		ЭлементОтбора = СписокОказанияУслуг.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ответственный");
		ЭлементОтбора.ПравоеЗначение = ПользователиКлиентСервер.ТекущийПользователь();
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.Представление = "Сотрудник";
	КонецЕсли;
	
	//
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьПериодОтбораЗаявок();
	
	ЭтаФорма.ПодключитьОбработчикОжидания("ВыполнитьОбновлениеДанных", 5);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.СписокОказанияУслуг.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокЗаявокЛИС.Параметры.УстановитьЗначениеПараметра("ДокументОснование", ТекущиеДанные.Ссылка);
	СписокИсследований.Параметры.УстановитьЗначениеПараметра("Ссылка", ТекущиеДанные.Ссылка);
	СписокОшибокЗаявки.Параметры.УстановитьЗначениеПараметра("Ссылка", ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеньОтбораПриИзменении(Элемент)
	
	УстановитьПериодОтбораЗаявок();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбновлениеДанных()
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	ТекущиеДанные = Элементы.СписокОказанияУслуг.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СписокИсследований.Параметры.УстановитьЗначениеПараметра("Ссылка", ТекущиеДанные.Ссылка);
	СписокОшибокЗаявки.Параметры.УстановитьЗначениеПараметра("Ссылка", ТекущиеДанные.Ссылка);
	СписокЗаявокЛИС.Параметры.УстановитьЗначениеПараметра("ДокументОснование", ТекущиеДанные.Ссылка);
	Элементы.СписокОказанияУслуг.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ВыполнитьОбновлениеДанных();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьРоль()
	Результат = РольДоступна("ПолныеПрава");
	Возврат Результат;
КонецФункции


&НаКлиенте
Процедура СписокЗаявокЛИСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(, Элементы.СписокЗаявокЛИС.ТекущиеДанные.Заявка);
КонецПроцедуры

