
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьПоказатели();
	
	Если Показатели.Количество() = 1 Тогда
		ТекущиеДанные = Показатели.Получить(0);
		Если ТекущиеДанные <> Неопределено Тогда
			ДействиеСтационара = ТекущиеДанные.Значение;
			ИмяКолонки = ТекущиеДанные.Представление;
				   
			Если ЗначениеЗаполнено(ДействиеСтационара) Тогда 
			   ОбновитьДиаграмму(ДействиеСтационара, ИмяКолонки, Параметры.Медкарта);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоказатели()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ВыполнениеДействийСтационара.ДействиеСтационара КАК ДействиеСтационара,
	                      |	ВыполнениеДействийСтационара.ДействиеСтационара.Представление КАК Представление
	                      |ИЗ
	                      |	РегистрСведений.ВыполнениеДействийСтационара КАК ВыполнениеДействийСтационара
	                      |ГДЕ
	                      |	ВыполнениеДействийСтационара.Клиент = &Клиент
	                      |	И ((ВЫРАЗИТЬ(ВыполнениеДействийСтационара.ДействиеСтационара КАК Справочник.ДействияМедсестрыСтационара).ВыполнениеВводомЗначения
	                      |	ИЛИ ВЫРАЗИТЬ(ВыполнениеДействийСтационара.ДействиеСтационара КАК Справочник.Номенклатура).ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Материал)))");
						  
	Запрос.УстановитьПараметр("Клиент",Параметры.Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Показатели.Добавить(Выборка.ДействиеСтационара,Выборка.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДиаграмму(ДействиеСтационара,ИмяКолонки,МедицинскаяКарта)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВыполнениеДействийСтационара.ДатаВремяВыполнения КАК ДатаВремя,
	                      |	ВыполнениеДействийСтационара.Значение,
	                      |	ЕСТЬNULL(ВыполнениеДействийСтационара.ДействиеСтационара.БазовоеЗначениеДиаграммы, 0) КАК БазовоеЗначение
	                      |ИЗ
	                      |	РегистрСведений.ВыполнениеДействийСтационара КАК ВыполнениеДействийСтационара
	                      |ГДЕ
	                      |	ВыполнениеДействийСтационара.ДействиеСтационара = &ДействиеСтационара
	                      |	И ВыполнениеДействийСтационара.Клиент = &Клиент
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаВремя");
	Запрос.УстановитьПараметр("ДействиеСтационара",ДействиеСтационара);
	Запрос.УстановитьПараметр("Клиент",Параметры.Клиент);
	
	ВыборкаДанных = Запрос.Выполнить().Выбрать();
	
	Диаграмма = Новый Диаграмма();
	
	Диаграмма.КоличествоСерий = 0; 
	Диаграмма.КоличествоТочек = 0; 
	Диаграмма.ТипДиаграммы = ТипДиаграммы.ГрафикСОбластями;	
	
	Диаграмма.МаксимумСерий = МаксимумСерий.Ограничено; 
	Диаграмма.МаксимумСерийКоличество = 7; 
	Диаграмма.ВидПодписей = ВидПодписейКДиаграмме.Значение; 
	Диаграмма.ОбластьЗаголовка.Текст = "Динамика показателя: " + ИмяКолонки; 
	
	Если ВыборкаДанных.Следующий() Тогда
		Диаграмма.БазовоеЗначение = ВыборкаДанных.БазовоеЗначение;
	КонецЕсли;
	ВыборкаДанных.Сбросить();
	
	Диаграмма.Обновление = Ложь; 
	
	Диаграмма.КоличествоСерий = 1; 
	Диаграмма.Серии[0].Текст = ИмяКолонки;
	
	Пока ВыборкаДанных.Следующий() Цикл 
		Точка = Диаграмма.УстановитьТочку(ВыборкаДанных.ДатаВремя);
		Точка.Текст = Формат(ВыборкаДанных.ДатаВремя, "ДФ='дд.ММ.гггг ЧЧ.мм'");
		Диаграмма.УстановитьЗначение(Точка, 0, ВыборкаДанных.Значение);
	КонецЦикла; 
	
	Диаграмма.Обновление = Истина;
	
	ВыборкаДанных.Сбросить();
	
	ПоказателиЗначения.Очистить();
	Пока ВыборкаДанных.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(ПоказателиЗначения.Добавить(),ВыборкаДанных)	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Показатели.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		ДействиеСтационара = ТекущиеДанные.Значение;
		ИмяКолонки = ТекущиеДанные.Представление;
			   
		Если ЗначениеЗаполнено(ДействиеСтационара) Тогда 
		   ОбновитьДиаграмму(ДействиеСтационара, ИмяКолонки, Параметры.Медкарта);
		КонецЕсли;
	КонецЕсли;
   
КонецПроцедуры
