
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокСостояний") Тогда 
		Назначения.Параметры.УстановитьЗначениеПараметра("СписокСостояний", Параметры.СписокСостояний);
	КонецЕсли;
	
	// Отсев групп, в которых нет услуг.
	СписокГрупп = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.ЭтоГруппа
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
	|ИТОГИ ПО
	|	Ссылка ТОЛЬКО ИЕРАРХИЯ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа"
	;
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СписокГруппМатериалов = РезультатЗапроса[1].Выгрузить().ВыгрузитьКолонку("Ссылка");

	СписокГрупп.ЗагрузитьЗначения(СписокГруппМатериалов); // Общий список групп справочника
	
	Выб = РезультатЗапроса[0].Выбрать();
	Пока Выб.Следующий() Цикл
		Если ЗначениеЗаполнено(Выб.Ссылка)
			И Выб.ЭтоГруппа
		Тогда
			Инд = СписокГруппМатериалов.Найти(Выб.Ссылка);
			Если Инд <> Неопределено Тогда
				СписокГруппМатериалов.Удалить(Инд);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЭлементОформления = Назначения.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	УслОформПоГруппе = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	УслОформПоГруппе.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	УслОформПоГруппе.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	УслОформПоГруппе.ПравоеЗначение = СписокГруппМатериалов;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТолькоПодходящие(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если СписокГрупп.НайтиПоЗначению(ВыбраннаяСтрока) = Неопределено Тогда // Это не группа.
		СтандартнаяОбработка = Ложь;
		ВыбранноеНазначение = ВыбранныеНазначения.Добавить();
		ВыбранноеНазначение.Назначение = ВыбраннаяСтрока;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеНазначенияПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)

	СтандартнаяОбработка = Ложь;
	Для Каждого ВыбраннаяСтрока Из ПараметрыПеретаскивания.Значение Цикл
		
		Если СписокГрупп.НайтиПоЗначению(ВыбраннаяСтрока) = Неопределено Тогда // Это не группа.
			ВыбранноеНазначение = ВыбранныеНазначения.Добавить();
			ВыбранноеНазначение.Назначение = ВыбраннаяСтрока;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
 	Закрыть(ВыбранныеНазначения);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоПодходящие(Команда)
	
	Элементы.НазначенияТолькоПодходящие.Пометка = Не Элементы.НазначенияТолькоПодходящие.Пометка;
	
	Если Элементы.НазначенияТолькоПодходящие.Пометка Тогда
		Элементы.Назначения.Отображение = ОтображениеТаблицы.Список;
		РаботаСФормамиКлиент.УстановитьОтборСписка("ПодходящаяНоменклатура", Истина, Назначения);
	Иначе
		Элементы.Назначения.Отображение = ОтображениеТаблицы.ИерархическийСписок;
		РаботаСФормамиКлиент.СнятьОтборСписка("ПодходящаяНоменклатура", Назначения);
	КонецЕсли;
	Элементы.Назначения.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ВыбраннаяСтрока = Элементы.Назначения.ТекущаяСтрока;
	Если ВыбраннаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВыбраннаяСтрока, "ЭтоГруппа") Тогда
		Возврат;
	КонецЕсли;
	ВыбранноеНазначение = ВыбранныеНазначения.Добавить();
	ВыбранноеНазначение.Назначение = ВыбраннаяСтрока;
КонецПроцедуры

