
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ДанныеСписка = Параметры.СписокЗначений;
	Для Каждого Колонка Из ДанныеСписка[0] Цикл
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(Колонка.Значение));
		НовыйРеквизит = Новый РеквизитФормы(Колонка.Ключ, Новый ОписаниеТипов(МассивТипов), "СписокЗначений");
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		СписокКолонок.Добавить(Колонка.Ключ);
	КонецЦикла;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ЕстьКонтейнеры = Ложь;
	
	Для Каждого Колонка Из ДанныеСписка[0] Цикл
		НовыйЭлемент = Элементы.Добавить(Колонка.Ключ, Тип("ПолеФормы"), Элементы.СписокЗначений);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
		НовыйЭлемент.ПутьКДанным = "СписокЗначений." + Колонка.Ключ;
		НовыйЭлемент.АвтоВысотаЯчейки = Истина;
		Если Колонка.Ключ = "Контейнер" Тогда
			ЕстьКонтейнеры = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементСписка Из ДанныеСписка Цикл
		ЗаполнитьЗначенияСвойств(СписокЗначений.Добавить(), ЭлементСписка);
	КонецЦикла;
	
	Если ЕстьКонтейнеры Тогда
		Для Каждого СтрокаСписка Из Параметры.СписокБиоматериалов Цикл
			ЗаполнитьЗначенияСвойств(СписокБиоматериалов.Добавить(), СтрокаСписка);
		КонецЦикла;
		Штрихкод = Параметры.Штрихкод;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	МассивОтмеченных = Новый Массив;
	Для Каждого СтрокаСписка Из СписокЗначений Цикл
		Если Не СтрокаСписка.Пометка Тогда
			Продолжить;
		КонецЕсли;
		СтруктураСтроки = Новый Структура;
		Для Каждого Колонка Из СписокКолонок Цикл
			СтруктураСтроки.Вставить(Колонка.Значение, СтрокаСписка[Колонка.Значение]);
		КонецЦикла;
		МассивОтмеченных.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Закрыть(МассивОтмеченных);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗначенийПометкаПриИзменении(Элемент)
	
	Если ЕстьКонтейнеры Тогда
		
		ТекущиеДанные = Элементы.СписокЗначений.ТекущиеДанные;
		
		Для Каждого СтрокаСписка Из СписокЗначений Цикл
			Если Не СтрокаСписка.ГруппаЗабора = ТекущиеДанные.ГруппаЗабора 
				И СтрокаСписка.Пометка
				И ТекущиеДанные.Пометка Тогда
				ТекущиеДанные.Пометка = Ложь;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Выбранная позиция входит в другую группу забора.";
				Сообщение.Сообщить();
				Возврат;
			КонецЕсли;
		КонецЦикла;
		НайденныеСтроки = СписокБиоматериалов.НайтиСтроки(Новый Структура("Штрихкод", Штрихкод));
		Если НайденныеСтроки.Количество() > 0 Тогда
			СтрокаСписка = НайденныеСтроки[0];
			Если Не СтрокаСписка.ГруппаЗабора = ТекущиеДанные.ГруппаЗабора 
				И ТекущиеДанные.Пометка Тогда
				ТекущиеДанные.Пометка = Ложь;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Выбранная позиция входит в другую группу забора.";
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
