#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьТаблицуВерсионируемыхОбъектовДерево();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ВерсионируемыеВидыОбъектовДеревоВыбранПриИзменении(Элемент)
	
	ТекущаяСтрока = ВерсионируемыеВидыОбъектовДерево.НайтиПоИдентификатору(Элементы.ВерсионируемыеВидыОбъектовДерево.ТекущаяСтрока);
	Если ТекущаяСтрока.Выбран = 2 Тогда
		ТекущаяСтрока.Выбран = 0;
	КонецЕсли;			
	Если ТекущаяСтрока.ПолучитьЭлементы().Количество()>0 Тогда 
		Для Каждого ПодчиненныйЭлемент Из ТекущаяСтрока.ПолучитьЭлементы() Цикл
			ПодчиненныйЭлемент.Выбран = Булево(ТекущаяСтрока.Выбран);
		КонецЦикла;
	Иначе
		ПересчитатьВыбранностьГруппыОбъектовВерсионирования(ВерсионируемыеВидыОбъектовДерево);
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьУдаление(Команда)
	
	МетаданныеДляОчистки = Новый Массив;
	
	Для Каждого Уровень1 Из ВерсионируемыеВидыОбъектовДерево.ПолучитьЭлементы() Цикл
		
		Для Каждого Уровень2 Из Уровень1.ПолучитьЭлементы() Цикл
			Если Булево(Уровень2.Выбран) Тогда
				МетаданныеДляОчистки.Добавить(Уровень2.Тип + "." + Уровень2.Имя);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Если МетаданныеДляОчистки.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Не выбраны метаданные для удаления");
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "История данных для выбранных объектов будет удалена без возможности восстанвления. Продолжить?";
	Оповещение = Новый ОписаниеОповещения("ПродолжениеВыполнитьУдаление", ЭтотОбъект, Новый Структура("МетаданныеДляОчистки", МетаданныеДляОчистки));
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьТаблицуВерсионируемыхОбъектовДерево()
	
	ПеречислениеИспользоватьИсториюДанных = Метаданные.Справочники.Банки.Реквизиты.КоррСчет.ИсторияДанных;
	ПеречислениеНеИспользоватьИсториюДанных = Метаданные.Справочники.Банки.Реквизиты.Телефоны.ИсторияДанных;
	
	МассивМетаданных = Новый Массив;
	МассивМетаданных.Добавить("Документы");
	МассивМетаданных.Добавить("Справочники");
	МассивМетаданных.Добавить("Задачи");		
	МассивМетаданных.Добавить("ПланыВидовХарактеристик");
	МассивМетаданных.Добавить("РегистрыСведений");
	
	ДеревоВерсий=РеквизитФормыВЗначение("ВерсионируемыеВидыОбъектовДерево");
	
	Для Каждого ОбъектМетаданных Из МассивМетаданных Цикл 
		СтрокаВерсийУровень1 = ДеревоВерсий.Строки.Добавить();
		Если ОбъектМетаданных = "ПланыВидовХарактеристик" Тогда
			СтрокаВерсийУровень1.Представление = "Планы видов характеристик";
		ИначеЕсли ОбъектМетаданных = "РегистрыСведений" Тогда
			СтрокаВерсийУровень1.Представление = "Регистры сведений";
		Иначе
			СтрокаВерсийУровень1.Представление = ОбъектМетаданных;
		КонецЕсли;
		Для Каждого ТекущийОбъектМетаданных Из Метаданные[ОбъектМетаданных] Цикл
			
			Если НеОтображатьОбъектВДеревеИсторииДанных(ТекущийОбъектМетаданных) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПравоДоступа("Просмотр", ТекущийОбъектМетаданных) Тогда	
				ИмяОбъектаМетаданных = ТекущийОбъектМетаданных.Синоним;
				Если ИмяОбъектаМетаданных = "" Тогда
					ИмяОбъектаМетаданных = ТекущийОбъектМетаданных.Имя;
				КонецЕсли; 
				
				ТекущиеНастройки = ИсторияДанных.ПолучитьНастройки(ТекущийОбъектМетаданных);
				
				Если ТекущиеНастройки = Неопределено Тогда
					Выбран = ТекущийОбъектМетаданных.ИсторияДанных = ПеречислениеИспользоватьИсториюДанных;
				Иначе
					Выбран = ТекущиеНастройки.Использование;
				КонецЕсли;
				
				Если Выбран Тогда
					СтрокаВерсийУровень2=СтрокаВерсийУровень1.Строки.Добавить();
					СтрокаВерсийУровень2.Представление=ИмяОбъектаМетаданных;
					СтрокаВерсийУровень2.Имя=ТекущийОбъектМетаданных.Имя;
					РазделенноеПолноеИмя = СтрРазделить(ТекущийОбъектМетаданных.ПолноеИмя(), ".");
					СтрокаВерсийУровень2.Тип = РазделенноеПолноеИмя[0]; 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Счетчик = ДеревоВерсий.Строки.Количество() - 1;
	
	Пока Счетчик >= 0 Цикл
		Если ДеревоВерсий.Строки[Счетчик].Строки.Количество() = 0 Тогда
			ДеревоВерсий.Строки.Удалить(ДеревоВерсий.Строки[Счетчик]);
		КонецЕсли;
		Счетчик = Счетчик - 1;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоВерсий, "ВерсионируемыеВидыОбъектовДерево");

КонецПроцедуры

&НаСервереБезКонтекста
Функция НеОтображатьОбъектВДеревеИсторииДанных(ОбъектМетаданных)
	
	ИмяПодсистемы = "СайтМобильноеПриложение";
	
	Если ОбщегоНазначения.ПодсистемаСуществует(ИмяПодсистемы)
		И Метаданные.Подсистемы[ИмяПодсистемы].Состав.Содержит(ОбъектМетаданных)
	Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьВыбранностьГруппыОбъектовВерсионирования(ДеревоФормы)
	
	Для Каждого СтрокаУровня1 Из ДеревоФормы.ПолучитьЭлементы() Цикл
		
		Выбран = 0;
		ЕстьВыбранные = Ложь;
		ЕстьНеВыбранные = Ложь;
		Для Каждого СтрокаУровня2 Из СтрокаУровня1.ПолучитьЭлементы() Цикл
			
			Если СтрокаУровня2.Выбран = 0 Тогда
				ЕстьНеВыбранные = Истина;
			Иначе
				ЕстьВыбранные = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЕстьВыбранные И ЕстьНеВыбранные Тогда
			СтрокаУровня1.Выбран = 2;
		ИначеЕсли ЕстьВыбранные Тогда;
			СтрокаУровня1.Выбран = 1;
		Иначе
			СтрокаУровня1.Выбран = 0;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДлительнуюОперацию(МетаданныеДляОчистки, ДатаОчистки, УникальныйИдентификаторФормы)
	
	НаименованиеЗадания = НСтр("ru = 'Очистка истории данных'");
	ВыполняемыйМетод = "РегистрыСведений.СрокиХраненияИсторииДанных.УдалитьИсториюДанных";
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("МетаданныеДляОчистки", МетаданныеДляОчистки);
	СтруктураПараметров.Вставить("ДатаОчистки", ДатаОчистки);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	Возврат ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, СтруктураПараметров, ПараметрыВыполнения);
	
КонецФункции 

&НаКлиенте
Процедура ПродолжениеВыполнитьУдаление(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ДлительнаяОперация = ПолучитьДлительнуюОперацию(ДопПараметры.МетаданныеДляОчистки, ДатаСреза, УникальныйИдентификатор);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		
		ПараметрыОжидания.ТекстСообщения = "Очистка истории данных...";
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершениеВыполнитьУдаление", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыполнитьУдаление(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если Результат.Статус = "Ошибка" Тогда
			ПоказатьПредупреждение(,Результат.КраткоеПредставлениеОшибки);
			Возврат;
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю("Очистка истории завершена успешно");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
