#Область ПрограммныйИнтерфейс

Функция ПараметрыТаблицыИнтерфейса(ИдентификаторИнтерфейса, ИмяТаблицы, ПараметрыПоИменам) Экспорт
	
	ПараметрыТаблицыИнтерфейса = Новый Массив;
	
	ПоляТаблицыИнтерфейса = РаботаСИнтерфейсамиЗаполненияПараметровКлиентСервер.ПоляТаблицыИнтерфейса(ИдентификаторИнтерфейса);
	
	ИменаПараметровТаблицыИнтерфейса = РекурсивныйПоискПараметровТаблицыИнтерфейса(ПоляТаблицыИнтерфейса.Иерархия, ИмяТаблицы);
	
	Если ИменаПараметровТаблицыИнтерфейса <> Неопределено Тогда
		Для Каждого СтруктураИмениПараметра Из ИменаПараметровТаблицыИнтерфейса Цикл
			ПараметрТаблицы = ПараметрыПоИменам.Получить(СтруктураИмениПараметра.Имя);
			Если ЗначениеЗаполнено(ПараметрТаблицы) Тогда
				ПараметрыТаблицыИнтерфейса.Добавить(ПараметрТаблицы);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ПараметрыТаблицыИнтерфейса;
	
КонецФункции

Функция ИмяФормыИнтерфейса(ИдентификаторИнтерфейса) Экспорт
	
	ИнтерфейсЗаполнения = РаботаСИнтерфейсамиЗаполненияПараметровКлиентСервер.ИнтерфейсЗаполнения(ИдентификаторИнтерфейса);
	
	Если ИнтерфейсЗаполнения = Перечисления.ИнтерфейсыЗаполненияПараметров.СЭМД_186_Исследования Тогда
		Возврат Метаданные.Обработки.ИнтерфейсыЗаполненияПараметровШаблоновПриема.Формы.СЭМД_186_Исследования.ПолноеИмя();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПараметрыТаблицВсехИнтерфейсовШаблона(ТекстHTML) Экспорт
	
	ПараметрыТаблицИнтерфейсов = Новый Массив;
	
	ДокументHTML = РаботаСDOMКлиентСервер.СоздатьДокументDOM(ТекстHTML);
	ЭлементыИнетрфейсов = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(ДокументHTML,,, "data-bit-interface-id");
	
	Для Каждого ЭлементИнтерфейса Из ЭлементыИнетрфейсов Цикл
		ПараметрыКонтейнераИнтерфейса = РаботаСИнтерфейсамиЗаполненияПараметров.ПараметрыКонтейнераИнтерфейса(ЭлементИнтерфейса);
		Если ПараметрыКонтейнераИнтерфейса = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыПоИменам = ПараметрыКонтейнераИнтерфейса.ПараметрыПоИменам;
		СтруктурыНастроекТаблиц = ПараметрыКонтейнераИнтерфейса.СтруктурыНастроекТаблиц;
		ИдентификаторИнтерфейса = ЭлементИнтерфейса.ПолучитьАтрибут("data-bit-interface-id");
		
		Для Каждого СтруктураНастройкиТаблицы Из СтруктурыНастроекТаблиц Цикл
			ПараметрыТаблицы = РаботаСИнтерфейсамиЗаполненияПараметров.ПараметрыТаблицыИнтерфейса(ИдентификаторИнтерфейса, СтруктураНастройкиТаблицы.ИмяТаблицы, ПараметрыПоИменам);
			Для Каждого ПараметрТаблицы Из ПараметрыТаблицы Цикл
				ПараметрыТаблицИнтерфейсов.Добавить(ПараметрТаблицы);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ПараметрыТаблицИнтерфейсов;
	
КонецФункции

Функция ПараметрыКонтейнераИнтерфейса(ЭлементИнтерфейса) Экспорт
	
	КонтейнерыИнтерфейса = РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(ЭлементИнтерфейса, , , "data-bit-interface-dyntables");
	
	Если КонтейнерыИнтерфейса.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыПоИменам = Новый Соответствие;
	
	КонтейнерИнтерфейса = КонтейнерыИнтерфейса[0];
	Для Каждого УзелПараметра Из РаботаСHTMLКлиентСервер.ПолучитьЭлементыПоЗначениюАтрибута(КонтейнерИнтерфейса,,, "data-bit-interface-parameter-name") Цикл
		ИмяПоля = УзелПараметра.ПолучитьАтрибут("data-bit-interface-parameter-name");
		Если ЗначениеЗаполнено(ИмяПоля)
			И ЗначениеЗаполнено(УзелПараметра.Идентификатор)
		Тогда
			Попытка
				ИдентификаторПараметра = Новый УникальныйИдентификатор(УзелПараметра.Идентификатор);
			Исключение
				Продолжить;
			КонецПопытки;
			ПараметрыПоИменам.Вставить(ИмяПоля, ПланыВидовХарактеристик.ПараметрыHTML.ПолучитьСсылку(ИдентификаторПараметра));
		КонецЕсли;
	КонецЦикла;
	
	СтруктурыНастроекТаблиц = Новый Массив;
	Для Каждого СтрокаОписанияТаблицы Из СтрРазделить(КонтейнерИнтерфейса.ПолучитьАтрибут("data-bit-interface-dyntables"), ";", Ложь) Цикл
		ЧастиОписанияТаблицы = СтрРазделить(СтрокаОписанияТаблицы, ":", Ложь);
		Если ЧастиОписанияТаблицы.Количество() > 1 Тогда
			СтруктурыНастроекТаблиц.Добавить(Новый Структура("ИмяТаблицы, Идентификатор", ЧастиОписанияТаблицы[0], ЧастиОписанияТаблицы[1]));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый Структура("ПараметрыПоИменам, СтруктурыНастроекТаблиц", ПараметрыПоИменам, СтруктурыНастроекТаблиц);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РекурсивныйПоискПараметровТаблицыИнтерфейса(Иерархия, ИмяТаблицы)
	
	Для Каждого Таблица Из Иерархия.Таблицы Цикл
		Если Таблица.Имя = ИмяТаблицы Тогда
			Возврат Таблица.Подчиненные.Поля;
		КонецЕсли;
		
		ПараметрыТаблицыИнтерфейса = РекурсивныйПоискПараметровТаблицыИнтерфейса(Таблица.Подчиненные, ИмяТаблицы);
		Если ПараметрыТаблицыИнтерфейса <> Неопределено Тогда
			Возврат ПараметрыТаблицыИнтерфейса;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти