 Функция СотрудникТекущегоПользователя() Экспорт
    Возврат ПараметрыСеанса.ТекущийПользователь.Сотрудник;
КонецФункции

Функция ДанныеОтчетаКонверсия() Экспорт

    Запрос = Новый Запрос;
    Запрос.УстановитьПараметр("Наименование", "Конверсия событий (для операторов)");
    Запрос.Текст =
    "ВЫБРАТЬ ПЕРВЫЕ 1 В.КлючВарианта КАК Ключ
    |ИЗ Справочник.ВариантыОтчетов КАК В
    |ГДЕ В.Наименование = &Наименование И НЕ В.ПометкаУдаления";

    Результат = Новый Структура("КлючВарианта, Пользователь",
        Неопределено, ПараметрыСеанса.ТекущийПользователь);

    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Результат.КлючВарианта = Выборка.Ключ;
    КонецЕсли;

    Возврат Результат;

КонецФункции