
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Таблица = ПолучитьТаблицуПользователей();
	
	ВнешниеНаборыДанных = Новый Структура("Данные", Таблица);
	
	ОсновнойМакетОформления = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойМакетОформленияСКД");
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	ПараметрМакет = КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("МакетОформления");
	ПараметрМакет.Значение = ОсновнойМакетОформления;
	ПараметрМакет.Использование = Истина;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	// Инициализация процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	// Получение результата
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры

Функция ПолучитьТаблицуПользователей()
	
	ПользователиБазы = ПользователиИнформационнойБазы.ПолучитьПользователей();
	ТаблицаПользователейБазы = Новый ТаблицаЗначений;
	ТаблицаПользователейБазы.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	ТаблицаПользователейБазы.Колонки.Добавить("СтатусАутентификации", Новый ОписаниеТипов("Число"));
	
	Для Каждого Эл Из ПользователиБазы Цикл
		
		НоваяСтрока = ТаблицаПользователейБазы.Добавить();
		НоваяСтрока.Код = Эл.Имя;
		АутентификацияДоступна = Ложь;
		Если Эл.АутентификацияOpenID Тогда
			АутентификацияДоступна = Истина;
		ИначеЕсли Эл.АутентификацияOpenIDConnect Тогда
			АутентификацияДоступна = Истина;
		ИначеЕсли Эл.АутентификацияОС Тогда
			АутентификацияДоступна = Истина;
		ИначеЕсли Эл.АутентификацияСтандартная Тогда
			АутентификацияДоступна = Истина;
		ИначеЕсли Эл.АутентификацияТокеномДоступа Тогда
			АутентификацияДоступна = Истина;
		КонецЕсли;
		
		// Также 2 - Пользователь в базе не найден
		Если АутентификацияДоступна Тогда
			НоваяСтрока.СтатусАутентификации = 0; // Аутентификация доступна.
		Иначе
			НоваяСтрока.СтатусАутентификации = 1; // Аутентификация не доступна.
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПользователейБазы.Код КАК Код,
		|	ТаблицаПользователейБазы.СтатусАутентификации КАК СтатусАутентификации
		|ПОМЕСТИТЬ ТаблицаПользователейБазы
		|ИЗ
		|	&ТаблицаПользователейБазы КАК ТаблицаПользователейБазы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Пользователь,
		|	Пользователи.Код КАК Код
		|ПОМЕСТИТЬ ТаблицаПользователейИзСправочника
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаПользователейИзСправочника.Пользователь КАК Пользователь,
		|	ЕСТЬNULL(ТаблицаПользователейБазы.СтатусАутентификации, 2) КАК СтатусАутентификации
		|ИЗ
		|	ТаблицаПользователейИзСправочника КАК ТаблицаПользователейИзСправочника
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаПользователейБазы КАК ТаблицаПользователейБазы
		|		ПО ТаблицаПользователейИзСправочника.Код = ТаблицаПользователейБазы.Код";
	
	Запрос.УстановитьПараметр("ТаблицаПользователейБазы", ТаблицаПользователейБазы);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции