#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Владелец = ?(Параметры.Свойство("Палата"), Параметры.Палата, Объект.Владелец);
	
	Элементы.Владелец.ТолькоПросмотр = Не Объект.Ссылка.Пустая(); // Если койка не новая, то палата меняется в списке палат перемещением койки.
	
	ЗаполнитьСостояниеКойки();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.Владелец) Тогда
		ТекущийОбъект.Владелец = Справочники.Палаты.Хранение;	
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("ЭтоНовый", Объект.Ссылка.Пустая());
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Койка = Новый Массив;
	Койка.Добавить(ТекущийОбъект.Ссылка);
	
	ОшибочныеКойки = РегистрыСведений.ДвижениеКоечногоФонда.ВыполнитьДвижениеКоечногоФонда(Койка, ТекущийОбъект.Владелец,,,ПараметрыЗаписи.ЭтоНовый);
	Если ОшибочныеКойки.Количество() = 1 Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке("Койка занята и не может быть перемещена!");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СостояниеНажатие(Элемент)
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.БронированиеКойкоМеста") Тогда
		ОткрытьФорму("Документ.БронированиеКойкоМеста.ФормаОбъекта", Новый Структура("Ключ", ДокументОснование));		
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.УстановкаУсловийПребывания") Тогда
		ОткрытьФорму("Документ.УстановкаУсловийПребывания.ФормаОбъекта", Новый Структура("Ключ", ДокументОснование));		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
Процедура ЗаполнитьСостояниеКойки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДвижениеКоечногоФондаСрезПоследних.Период КАК Период,
	               |	ДвижениеКоечногоФондаСрезПоследних.Койка КАК Койка,
	               |	ДвижениеКоечногоФондаСрезПоследних.Палата КАК Палата,
	               |	ДвижениеКоечногоФондаСрезПоследних.Статус КАК Статус,
	               |	ДвижениеКоечногоФондаСрезПоследних.Подразделение КАК Подразделение,
	               |	СостояниеКойкоМестаСрезПоследних.Клиент КАК Клиент,
	               |	ЕСТЬNULL(СостояниеКойкоМестаСрезПоследних.Состояние,ЗНАЧЕНИЕ(Справочник.ВидыСостоянийКойкоМест.Свободно)) КАК Состояние,
	               |	СостояниеКойкоМестаСрезПоследних.ДатаНачала КАК ДатаНачала,
	               |	СостояниеКойкоМестаСрезПоследних.ДатаОкончания КАК ДатаОкончания,
	               |	СостояниеКойкоМестаСрезПоследних.Регистратор КАК ДокументОснование
	               |ИЗ
	               |	РегистрСведений.ДвижениеКоечногоФонда.СрезПоследних(&Дата, Койка = &Койка) КАК ДвижениеКоечногоФондаСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеКойкоМеста.СрезПоследних(&Дата, ) КАК СостояниеКойкоМестаСрезПоследних
	               |		ПО ДвижениеКоечногоФондаСрезПоследних.Койка = СостояниеКойкоМестаСрезПоследних.КойкоМесто";
	
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Койка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.Статус <> Перечисления.СостоянияКоек.ПустаяСсылка() Тогда
			Элементы.Состояние.Заголовок = Строка(Выборка.Статус);		
		ИначеЕсли Выборка.Состояние <> Справочники.ВидыСостоянийКойкоМест.Свободно Тогда
			Элементы.Состояние.Заголовок = "Занята документом " + Строка(Выборка.ДокументОснование);
			ДокументОснование = Выборка.ДокументОснование;
		Иначе
			Элементы.Состояние.Заголовок = "Доступна";	
		КонецЕсли;
	Иначе
		Элементы.ГруппаСостояние.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
