#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НомерСтроки = ?(Параметры.Свойство("НомерСтроки"), Параметры.НомерСтроки, "");
	
	// Заголовок формы
	ПараметрЗаголовокФормы = ?(Параметры.Свойство("ПараметрЗаголовокФормы"), Параметры.ПараметрЗаголовокФормы, ""); 
	Если ЗначениеЗаполнено(ПараметрЗаголовокФормы) Тогда
		ЭтаФорма.Заголовок = ПараметрЗаголовокФормы;	
	Иначе
		ЭтаФорма.Заголовок = НСтр("ru='Ввод возраста'");	
	КонецЕсли;
	
	// Текущие значения
	Если Параметры.Свойство("Месяцев") Тогда
		
		Лет = Цел(Параметры.Месяцев/12);
		Месяцев = Параметры.Месяцев - Лет * 12;
		
	КонецЕсли;
	
	Если Параметры.Свойство("Дней") Тогда
		
		Дней = Параметры.Дней;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Лет", Лет);
	СтруктураРезультат.Вставить("Месяцев", Месяцев);
	СтруктураРезультат.Вставить("Дней", Дней);
	
	СтруктураРезультат.Вставить("НомерСтроки", НомерСтроки);
	
	Закрыть(СтруктураРезультат);
	
КонецПроцедуры

#КонецОбласти
