#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьДополнительныеНастройки();
	ОбновитьТекстСтатусРегламентногоЗадания(Элементы.СтатусРегЗадания);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Восстановить(Команда)
	ПрочитатьДополнительныеНастройки();
	Элементы.ЗаписатьДополнительныеНастройки.КнопкаПоУмолчанию = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДополнительныеНастройки(Команда)
	ЗаписатьДополнительныеНастройкиНаСервере();
	Элементы.ЗаписатьДополнительныеНастройки.КнопкаПоУмолчанию = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРегламентноеЗадание(Команда)
	ИДРегЗадание = ПолучитьИдентификаторРегЗадания();
	ОповещениеЗакрытияФормы = Новый ОписаниеОповещения("ОбновитьПослеЗакрытияФормы", ЭтотОбъект);
	ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма.РегламентноеЗадание",Новый Структура("Идентификатор, Действие",ИДРегЗадание,"Изменить"),,,,,ОповещениеЗакрытияФормы);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтатусРегламентногоЗадания(Команда)
	ОбновитьТекстСтатусРегламентногоЗадания(Элементы.СтатусРегЗадания);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписокCDNПлощадок(Команда)
	ОткрытьФорму("РегистрСведений.СостоянияCDNПлощадокИСМП.ФормаСписка");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

 &НаКлиенте
Процедура ДопПараметрыПриИзменении(Элемент)
	Элементы.ЗаписатьДополнительныеНастройки.КнопкаПоУмолчанию = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторРегЗадания()
	Возврат РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.РазрешительныйРежимОбновлениеCDNПлощадок).УникальныйИдентификатор;
КонецФункции

&НаСервере
Процедура ПрочитатьДополнительныеНастройки()
	ДатаОкончанияРазрешительногоАварийногоРежима = Константы.ДатаОкончанияРазрешительногоАварийногоРежима.Получить();
	РазрешительныйРежимТестовыйКонтур = Константы.РазрешительныйРежимТестовыйКонтур.Получить();
	ХранитьУспешныеОперацииРазрешения = Константы.ХранитьУспешныеОперацииРазрешения.Получить();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДополнительныеНастройкиНаСервере()
	Константы.ДатаОкончанияРазрешительногоАварийногоРежима.Установить(ДатаОкончанияРазрешительногоАварийногоРежима);
	Константы.РазрешительныйРежимТестовыйКонтур.Установить(РазрешительныйРежимТестовыйКонтур);
	Константы.ХранитьУспешныеОперацииРазрешения.Установить(ХранитьУспешныеОперацииРазрешения);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстСтатусРегламентногоЗадания(ЭлементНадпись)
	
	СтатусРЗ = ПолучитьСтатусРегламентногоЗаданияНаСервере();
	Если СтатусРЗ Тогда
		ТекстЗаголовка = НСтр("ru='Регламентное задание обновления включено'");
		ЦветЗаголовка = ДопСерверныеФункцииПовтИсп.ЦветСтиля("ЦветТекстаПозитивнойНадписи");
	Иначе
		ТекстЗаголовка = НСтр("ru='Регламентное задание обновления выключено'");
		ЦветЗаголовка = ДопСерверныеФункцииПовтИсп.ЦветСтиля("ЦветОтрицательногоЧисла");
	КонецЕсли;
	
	ЭлементНадпись.Заголовок = Новый ФорматированнаяСтрока(ТекстЗаголовка,,ЦветЗаголовка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусРегламентногоЗаданияНаСервере()
	
	РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.РазрешительныйРежимОбновлениеCDNПлощадок);
	Возврат РегЗадание.Использование;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПослеЗакрытияФормы(Результат, ДопПараметры) Экспорт
	
	ОбновитьТекстСтатусРегламентногоЗадания(Элементы.СтатусРегЗадания);
	
КонецПроцедуры

#КонецОбласти


