// Описание особенности применения.

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьПараметрыСТребуемымТипом();
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Результат = Новый Соответствие;
	
	Для Каждого Эл Из ПараметрыВерхнее Цикл
		Результат.Вставить(Эл, Верхнее);
	КонецЦикла; 
	
	Для Каждого Эл Из ПараметрыНижнее Цикл
		Результат.Вставить(Эл, Нижнее);
	КонецЦикла;
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыСТребуемымТипом()
	
	Запрос = Новый Запрос;
	
	ВитальныеПараметрыВидКлассификатора = Перечисления.ВидыКлассификаторовМинЗдрава.ВитальныеПараметры;
	Запрос.УстановитьПараметр("Верхнее", ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(3, ВитальныеПараметрыВидКлассификатора));
	Запрос.УстановитьПараметр("Нижнее",	 ИнтеграцияЕГИСЗОбщегоНазначенияПовтИсп.ЭлементКлассификатораПоУИДЕГИСЗ(2, ВитальныеПараметрыВидКлассификатора));
	
	ПараметрыШаблона = Новый Массив();
	ПараметрыШаблона.Добавить(Параметры.РедактируемыйПараметрШаблона);
	Если Параметры.Свойство("СвязанныеПараметрыШаблона") Тогда
		Для Каждого кзПараметр Из Параметры.СвязанныеПараметрыШаблона Цикл
			ПараметрыШаблона.Добавить(кзПараметр.Ключ);
		КонецЦикла;
	КонецЕсли;
	Запрос.УстановитьПараметр("ИспользоватьОтбор", ЗначениеЗаполнено(ПараметрыШаблона)); 
	Запрос.УстановитьПараметр("ПараметрыШаблона", ПараметрыШаблона);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыHTML.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ПараметрыHTML.Назначение = &Нижнее
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Нижнее
	|ИЗ
	|	ПланВидовХарактеристик.ПараметрыHTML КАК ПараметрыHTML
	|ГДЕ
	|	(ПараметрыHTML.Назначение = &Верхнее
	|			ИЛИ ПараметрыHTML.Назначение = &Нижнее)
	|	И (НЕ &ИспользоватьОтбор
	|			ИЛИ ПараметрыHTML.Ссылка В (&ПараметрыШаблона))";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	мВерхнее = Новый Массив;
	мНижнее = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Нижнее Тогда
			мНижнее.Добавить(Выборка.Ссылка);
		Иначе
			мВерхнее.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыВерхнее = Новый ФиксированныйМассив(мВерхнее);
	ПараметрыНижнее = Новый ФиксированныйМассив(мНижнее);
	
	Элементы.Верхнее.Видимость = мВерхнее.Количество() <> 0;
	Элементы.Нижнее.Видимость = мНижнее.Количество() <> 0;
	
	// Начальное заполнение.
	ПоляФормы = Новый Структура("Верхнее, Нижнее", мВерхнее, мНижнее);
	Для Каждого кзПолеФормы Из ПоляФормы Цикл
		
		НачальноеЗначение = Неопределено;
		
		Для Каждого ПараметрШаблона Из кзПолеФормы.Значение Цикл
			
			// Приоритет поля, по которому нажал пользователь
			Если ПараметрШаблона = Параметры.РедактируемыйПараметрШаблона Тогда
				НачальноеЗначение = Параметры.НачальноеЗначение;
				Прервать;
			ИначеЕсли Параметры.Свойство("СвязанныеПараметрыШаблона") Тогда
				Для Каждого кзПараметр Из Параметры.СвязанныеПараметрыШаблона Цикл
					Если ПараметрШаблона = кзПараметр.Ключ Тогда
						НачальноеЗначение = кзПараметр.Значение;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ЗначениеЗаполнено(НачальноеЗначение) Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ЭтотОбъект[кзПолеФормы.Ключ] = НачальноеЗначение;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти