
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипВрача = "Внешние";
	Список.Параметры.УстановитьЗначениеПараметра("ТипВрача", "Внешние");
	
КонецПроцедуры

&НаКлиенте
Процедура ТипВрачаПриИзменении(Элемент)
	
	Список.Параметры.УстановитьЗначениеПараметра("ТипВрача", ТипВрача);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Закрыть();
	КонецЕсли;
	
	Закрыть(Элементы.Список.ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Закрыть(Элементы.Список.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура БезНаправления(Команда)
	Закрыть(ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка"));
КонецПроцедуры
