
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Филиал = УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя(ОбщегоНазначения.ТекущийПользователь());  	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	мзНастройкиПользователей = РегистрыСведений.НастройкиПользователей.СоздатьМенеджерЗаписи();
	мзНастройкиПользователей.Пользователь = ОбщегоНазначения.ТекущийПользователь();
	мзНастройкиПользователей.Настройка = ПланыВидовХарактеристик.НастройкиПользователей.ОсновнойФилиал;
	мзНастройкиПользователей.Значение = Филиал;
	мзНастройкиПользователей.Записать();
	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

