#Область ПрограммныйИнтерфейс

// Обновляет идентификаторы ЭМД в разрезе приказов медосмотра в указанном документе медосмотра.
//
// Параметры:
//  ДокументМедосмотра	 - ДокументОбъект.ПрохождениеМедосмотра, ДанныеФормыСтруктура - документ медосмотра, в котором будет сделано изменение.
//  Модифицированность	 - Булево - Признак модифицированности. Устанавливается, если объект документа изменен.
//
Процедура ОбновитьИдентификаторыПриказов(ДокументМедосмотра, Модифицированность = Неопределено) Экспорт
	
	Если ДокументМедосмотра.ВидПрохожденияМО = ПредопределенноеЗначение("Перечисление.ВидыМедосмотров.СправкаПрочий") Тогда
		ОбновитьИдентификаторыПриказовСправки(ДокументМедосмотра, Модифицированность);
	Иначе
		ОбновитьИдентификаторыПриказовПМО(ДокументМедосмотра, Модифицированность);
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьСПМОЧисленностьРаботниковПериодическогоМедосмотра(Объект, СПМОСсылка = Неопределено) Экспорт
	
	Если СПМОСсылка = Неопределено Тогда
		СПМОСсылка = Объект.Ссылка;
	КонецЕсли;
	
	Если Не Объект.РучнаяКорректировка
		И ЗначениеЗаполнено(СПМОСсылка)
	Тогда
		Численности = МедосмотрыСервер.ДанныеЗаполненияЧисленностиИзСПМО(СПМОСсылка);
		Объект.РаботникиНаТяжРаботахВсего   = Численности.Кол;
		Объект.РаботникиНаТяжРаботахЖенщин  = Численности.КолЖ;  // Не используется.
		Объект.РаботникиНаТяжРаботахДо18Лет = Численности.Кол18; // Не используется.
		
		Объект.ЧисленностьРаботниковОбязМедосмотрВсего	 = Объект.РаботникиНаТяжРаботахВсего;
		Объект.ЧисленностьРаботниковОбязМедосмотрЖенщин	 = Численности.КолЖ;
		Объект.ЧисленностьРаботниковОбязМедосмотрДо18Лет = Численности.Кол18;
		
		Объект.ЧисленностьРаботниковПодлежМедосмотруВсего	 = Объект.РаботникиНаТяжРаботахВсего;
		Объект.ЧисленностьРаботниковПодлежМедосмотруЖенщин	 = Численности.КолЖ;
		Объект.ЧисленностьРаботниковПодлежМедосмотруДо18Лет	 = Численности.Кол18;
	КонецЕсли;
	
КонецФункции

// Функция-константа: Текст заключения по умолчанию
// 
// Возвращаемое значение:
//  Строка.
//
Функция ТекстЗаключенияПоУмолчанию() Экспорт
	Возврат НСтр("ru='Не имеет противопоказаний'"); 		
КонецФункции

// Функция-константа: Дата вступления приказа 29н.
// 
// Возвращаемое значение:
//  Дата.
//
Функция ДатаПриказа29н() Экспорт
	
	Возврат Дата('2021.04.01');
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьИдентификаторыПриказовСправки(ДокументМедосмотра, Модифицированность)
	
	Если Не ЗначениеЗаполнено(ДокументМедосмотра.Номенклатура) Тогда
		ДокументМедосмотра.ИдентификаторыПриказов.Очистить();
		Возврат;
	КонецЕсли;
	
	ВредныйФактор = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ДокументМедосмотра.Номенклатура, "ВредныйФакторСправки");
	Если ДокументМедосмотра.ИдентификаторыПриказов.Количество() = 0
		Или ДокументМедосмотра.ИдентификаторыПриказов[0].ПриказВредныйФактор <> ВредныйФактор
	Тогда
		ДокументМедосмотра.ИдентификаторыПриказов.Очистить();
		НоваяСтрока = ДокументМедосмотра.ИдентификаторыПриказов.Добавить();
		НоваяСтрока.ПриказВредныйФактор = ВредныйФактор;
		НоваяСтрока.УИД = Новый УникальныйИдентификатор;
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьИдентификаторыПриказовПМО(ДокументМедосмотра, Модифицированность)
	
	Если Не ЗначениеЗаполнено(ДокументМедосмотра.ДатаЗавершения) Тогда
		Возврат;
	КонецЕсли;
	
	ПриказыВредныеФакторы = МедосмотрыСервер.ПолучитьПриказыВредныеФакторыДляТаблицыИдентификаторов(ДокументМедосмотра.Ссылка, ДокументМедосмотра.Филиал, ДокументМедосмотра.Дата, ДокументМедосмотра.Номенклатура, ДокументМедосмотра.ФакторыИУсловияРаботы);
	
	Для Каждого ПриказВредныйФактор Из ПриказыВредныеФакторы Цикл
		Если ДокументМедосмотра.ИдентификаторыПриказов.НайтиСтроки(Новый Структура("ПриказВредныйФактор", ПриказВредныйФактор)).Количество() = 0 Тогда
			НоваяСтрока = ДокументМедосмотра.ИдентификаторыПриказов.Добавить();
			НоваяСтрока.ПриказВредныйФактор = ПриказВредныйФактор;
			НоваяСтрока.УИД = Новый УникальныйИдентификатор;
			Модифицированность = Истина;
		КонецЕсли;
	КонецЦикла;
	
	СтрокиКУдалению = Новый Массив;
	Для Каждого СтрокаИдентификатора Из ДокументМедосмотра.ИдентификаторыПриказов Цикл
		Если ПриказыВредныеФакторы.Найти(СтрокаИдентификатора.ПриказВредныйФактор) = Неопределено Тогда
			СтрокиКУдалению.Добавить(СтрокаИдентификатора);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаКУдалению Из СтрокиКУдалению Цикл
		ДокументМедосмотра.ИдентификаторыПриказов.Удалить(СтрокаКУдалению);
		Модифицированность = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти