
#Область ОбщиеПроцедурыФункции

Функция ПолучитьДополнительныеНастройкиПоФилиалам(Соответствием = Ложь) Экспорт
	
	ДанныеФилиаловИзБД = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ДополнительныеНастройкиИнтеграцииЛИС", "ДанныеФилиалов");
	
	Если Соответствием Тогда
		ДанныеФилиалов = Новый Соответствие;
	Иначе
		ДанныеФилиалов = Новый ТаблицаЗначений;
		//ДанныеФилиала.Колонки.Добавить("Адрес", ОбщегоНазначения.ОписаниеТипаСтрока(100));
		//ДанныеФилиала.Колонки.Добавить("Порт", ОбщегоНазначения.ОписаниеТипаЧисло(10));
		//ДанныеФилиала.Колонки.Добавить("Пользователь", ОбщегоНазначения.ОписаниеТипаСтрока(100));
		//ДанныеФилиала.Колонки.Добавить("Пароль", ОбщегоНазначения.ОписаниеТипаСтрока(100));
		//ДанныеФилиала.Колонки.Добавить("ИмяПриемника", ОбщегоНазначения.ОписаниеТипаСтрока(100));
		//ДанныеФилиала.Колонки.Добавить("Используется", Новый ОписаниеТипов("Булево"));
		//ДанныеФилиала.Колонки.Добавить("Филиал", Новый ОписаниеТипов("СправочникСсылка.Филиалы"));
	КонецЕсли;
	
	Если Не ДанныеФилиаловИзБД = Неопределено Тогда
		СоответвиеФилиалов = ДанныеФилиаловИзБД.Получить();
		Для Каждого ПозицияСоответствия Из СоответвиеФилиалов Цикл
			Если Соответствием Тогда
				ДанныеФилиалов.Вставить(ПозицияСоответствия.Ключ, ПозицияСоответствия.Значение);
			Иначе
				Если ДанныеФилиалов.Колонки.Количество() = 0 Тогда
					Для Каждого ЭлементСтруктуры Из ПозицияСоответствия.Значение Цикл
						МассивТипов = Новый Массив;
						МассивТипов.Добавить(ТипЗнч(ЭлементСтруктуры.Значение));
						ДанныеФилиалов.Колонки.Добавить(ЭлементСтруктуры.Ключ, Новый ОписаниеТипов(МассивТипов,,, Новый КвалификаторыЧисла(10), Новый КвалификаторыСтроки(100)));
					КонецЦикла;
				КонецЕсли;
				СтрокаДанных = ДанныеФилиалов.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаДанных, ПозицияСоответствия.Значение);
				СтрокаДанных.Филиал = ПозицияСоответствия.Ключ;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
	Возврат ДанныеФилиалов;
	
КонецФункции

Функция ПолучитьОсновныеНастройки() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;

	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений.омг_НастройкиИнтеграцииСЛИС КАК омг_НастройкиИнтеграцииСЛИС";
	РезультатЗапроса = Запрос.Выполнить();
	СтруктураНастроек = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СтруктураНастроек.Вставить(Колонка.Имя);
	КонецЦикла;
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
			СтруктураНастроек[Колонка.Имя] = Выборка[Колонка.Имя];
		КонецЦикла;
	КонецЕсли;
	
	ДанныеПароля = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ИнтеграцияСЛИС", "Пароль");
	СтруктураНастроек.Вставить("Пароль", ?(ДанныеПароля = Неопределено, "", ДанныеПароля.Получить()));

	ДанныеПароля = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ИнтеграцияСЛИС", "ПарольFTP");
	СтруктураНастроек.Вставить("ПарольFTP", ?(ДанныеПароля = Неопределено, "", ДанныеПароля.Получить()));

	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СтруктураНастроек;
	
КонецФункции

Функция ЭтоОтменаЗаявки(СтруктураДанных)
	
	Если СтруктураДанных.Свойство("warnings") И СтруктураДанных.warnings.Количество() > 0 Тогда
		
		Для Каждого Ошибка Из СтруктураДанных.warnings Цикл
			
			Если Не СтрНайти(НРег(Ошибка.text), "направление удалено") = 0 Тогда
				Возврат Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции

Процедура ОбработатьWarnings(СтруктураДанных, СтруктураОтветаПоЗаявке, ВыборкаДокументов, Событие, МассивОшибок = Неопределено)
	
	Если СтруктураДанных.Свойство("warnings") И СтруктураДанных.warnings.Количество() > 0 Тогда
		
		ОшибкиИзЛИС = "";
		
		Если МассивОшибок = Неопределено Тогда
			МассивОшибок = Новый Массив;
		КонецЕсли;
		
		СтруктураОтветаПоЗаявке.Вставить("Ошибки", МассивОшибок);
		
		Для Каждого Ошибка Из СтруктураДанных.warnings Цикл
			
			Если Не СтрНайти(НРег(Ошибка.text), "направление удалено") = 0 Тогда
				МассивОшибок.Очистить();
				Возврат;
			КонецЕсли;
			
			ОшибкиИзЛИС = ОшибкиИзЛИС + "
			|" + (СтруктураДанных.warnings.Найти(Ошибка) + 1) + ": " + Ошибка.text;
			
			МассивОшибок.Добавить(Ошибка.text);
		КонецЦикла;
		
		ТекстОшибки = "Заявка """ + ВыборкаДокументов.Ссылка + """ отправлена в ЛИС, но есть ошибки со стороны заполнения.";

		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОшибкиИзЛИС);
			

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки + "
		|" + ОшибкиИзЛИС;
		Сообщение.Сообщить();
		
	КонецЕсли;

	
КонецПроцедуры

Функция ПолучитьСписокПропускаемыхОшибок() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	омг_ПропускаемыеОшибкиОбновленияСтатуса.ТекстОшибки КАК ТекстОшибки
	|ИЗ
	|	РегистрСведений.омг_ПропускаемыеОшибкиОбновленияСтатуса КАК омг_ПропускаемыеОшибкиОбновленияСтатуса";
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивОшибок = Новый Массив;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат МассивОшибок;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивОшибок.Добавить(Выборка.ТекстОшибки);
	КонецЦикла;
	
	Возврат МассивОшибок;
	
КонецФункции

#Область СкопироватьРекурсивно

Функция СкопироватьСтруктуру(СтруктураИсточник, ФиксироватьДанные) Экспорт 
	
	СтруктураРезультат = Новый Структура;
	
	Для Каждого КлючИЗначение Из СтруктураИсточник Цикл
		СтруктураРезультат.Вставить(КлючИЗначение.Ключ, 
			СкопироватьРекурсивно(КлючИЗначение.Значение, ФиксироватьДанные));
	КонецЦикла;
	
	Если ФиксироватьДанные = Истина 
		Или ФиксироватьДанные = Неопределено
		И ТипЗнч(СтруктураИсточник) = Тип("ФиксированнаяСтруктура") Тогда 
		Возврат Новый ФиксированнаяСтруктура(СтруктураРезультат);
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции

Функция СкопироватьСоответствие(СоответствиеИсточник, ФиксироватьДанные) Экспорт 
	
	СоответствиеРезультат = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из СоответствиеИсточник Цикл
		СоответствиеРезультат.Вставить(КлючИЗначение.Ключ, 
			СкопироватьРекурсивно(КлючИЗначение.Значение, ФиксироватьДанные));
	КонецЦикла;
	
	Если ФиксироватьДанные = Истина 
		Или ФиксироватьДанные = Неопределено
		И ТипЗнч(СоответствиеИсточник) = Тип("ФиксированноеСоответствие") Тогда 
		Возврат Новый ФиксированноеСоответствие(СоответствиеРезультат);
	КонецЕсли;
	
	Возврат СоответствиеРезультат;
	
КонецФункции

Функция СкопироватьМассив(МассивИсточник, ФиксироватьДанные) Экспорт 
	
	МассивРезультат = Новый Массив;
	
	Для Каждого Элемент Из МассивИсточник Цикл
		МассивРезультат.Добавить(СкопироватьРекурсивно(Элемент, ФиксироватьДанные));
	КонецЦикла;
	
	Если ФиксироватьДанные = Истина 
		Или ФиксироватьДанные = Неопределено
		И ТипЗнч(МассивИсточник) = Тип("ФиксированныйМассив") Тогда 
		Возврат Новый ФиксированныйМассив(МассивРезультат);
	КонецЕсли;
	
	Возврат МассивРезультат;
	
КонецФункции

Функция СкопироватьСписокЗначений(СписокИсточник, ФиксироватьДанные) Экспорт
	
	СписокРезультат = Новый СписокЗначений;
	
	Для Каждого ЭлементСписка Из СписокИсточник Цикл
		СписокРезультат.Добавить(
			СкопироватьРекурсивно(ЭлементСписка.Значение, ФиксироватьДанные), 
			ЭлементСписка.Представление, 
			ЭлементСписка.Пометка, 
			ЭлементСписка.Картинка);
	КонецЦикла;
	
	Возврат СписокРезультат;
	
КонецФункции

#КонецОбласти

// Создает полную копию структуры, соответствия, массива, списка или таблицы значений, рекурсивно,
// с учетом типов дочерних элементов. При этом содержимое значений объектных типов
// (СправочникОбъект, ДокументОбъект и т.п.) не копируются, а возвращаются ссылки на исходный объект.
//
// См. ОбщегоНазначения.СкопироватьРекурсивно
//
// Параметры:
//  Источник - Структура, ФиксированнаяСтруктура,
//             Соответствие, ФиксированноеСоответствие,
//             Массив, ФиксированныйМассив,
//             СписокЗначений - объект, который необходимо скопировать.
//  ФиксироватьДанные - Булево, Неопределено - если Истина - фиксировать,
//                          если Ложь - снять фиксацию, если Неопределено - не изменять.
//
// Возвращаемое значение:
//  Структура - , ФиксированнаяСтруктура,
//  Соответствие, ФиксированноеСоответствие,
//  Массив, ФиксированныйМассив,
//  СписокЗначений - копия объекта, переданного в параметре Источник.
//
Функция СкопироватьРекурсивно(Источник, ФиксироватьДанные = Неопределено) Экспорт
	
	Перем Приемник;
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("Структура")
		Или ТипИсточника = Тип("ФиксированнаяСтруктура") Тогда
		Приемник = СкопироватьСтруктуру(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("Соответствие")
		Или ТипИсточника = Тип("ФиксированноеСоответствие") Тогда
		Приемник = СкопироватьСоответствие(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("Массив")
		Или ТипИсточника = Тип("ФиксированныйМассив") Тогда
		Приемник = СкопироватьМассив(Источник, ФиксироватьДанные);
	ИначеЕсли ТипИсточника = Тип("СписокЗначений") Тогда
		Приемник = СкопироватьСписокЗначений(Источник, ФиксироватьДанные);
	Иначе
		Приемник = Источник;
	КонецЕсли;
	
	Возврат Приемник;
	
КонецФункции

#КонецОбласти

#Область ОбновлениеСправочников

Процедура ОбновлениеДополнительнойИнформацииПоИсследованиям(СтруктураДанных)
	
	ЗаписьЖурналаРегистрации("ЛИС: Начало обновления дополнительных сведений", 
		УровеньЖурналаРегистрации.Информация,
		Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль);
		
	Если Не СтруктураДанных.Свойство("prices") Тогда 
		ЗаписьЖурналаРегистрации("ЛИС: Обновление дополнительных сведений", 
			УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, 
			"Обновление сведений не прошло из за отсутствия поля ""prices"".");
		Возврат;
	КонецЕсли;
	
	ТаблицаСведений = Новый ТаблицаЗначений;
	ТаблицаСведений.Колонки.Добавить("Артикул", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаСведений.Колонки.Добавить("КоличествоДнейМинимум", ОбщегоНазначения.ОписаниеТипаСтрока(2));
	ТаблицаСведений.Колонки.Добавить("КоличествоДнейМаксимум", ОбщегоНазначения.ОписаниеТипаСтрока(2));
	
	Для Каждого ДанныеПрайса Из СтруктураДанных.prices Цикл
		Если Не ДанныеПрайса.Свойство("minDuration") 
			Или Не ДанныеПрайса.Свойство("maxDuration") Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы = ТаблицаСведений.Добавить();
		СтрокаТаблицы.Артикул = ДанныеПрайса.serviceCode;
		СтрокаТаблицы.КоличествоДнейМинимум = ДанныеПрайса.minDuration;
		СтрокаТаблицы.КоличествоДнейМаксимум = ДанныеПрайса.maxDuration;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаСведений", ТаблицаСведений);
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_НастройкиИнтеграцииСЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |ПОМЕСТИТЬ ВТ_ГруппаНоменклатуры
	               |ИЗ
	               |	РегистрСведений.омг_НастройкиИнтеграцииСЛИС КАК омг_НастройкиИнтеграцииСЛИС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаСведений.Артикул КАК Артикул,
	               |	ТаблицаСведений.КоличествоДнейМинимум КАК КоличествоДнейМинимум,
	               |	ТаблицаСведений.КоличествоДнейМаксимум КАК КоличествоДнейМаксимум
	               |ПОМЕСТИТЬ ВТ_ТаблицаСведений
	               |ИЗ
	               |	&ТаблицаСведений КАК ТаблицаСведений
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаСведений.Артикул КАК Артикул,
	               |	ВТ_ТаблицаСведений.КоличествоДнейМинимум + ""-"" + ВТ_ТаблицаСведений.КоличествоДнейМаксимум + "" дней"" КАК КоличествоДней,
	               |	Номенклатура.Ссылка КАК Номенклатура
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаСведений КАК ВТ_ТаблицаСведений
	               |		ПО (Номенклатура.Артикул = ВТ_ТаблицаСведений.Артикул
	               |				И НЕ Номенклатура.омг_СрокИсполненияЛаб = ВТ_ТаблицаСведений.КоличествоДнейМинимум + ""-"" + ВТ_ТаблицаСведений.КоличествоДнейМаксимум + "" дней"")
	               |ГДЕ
	               |	Номенклатура.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ВТ_ГруппаНоменклатуры.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |			ИЗ
	               |				ВТ_ГруппаНоменклатуры КАК ВТ_ГруппаНоменклатуры)";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ЗаписьЖурналаРегистрации("ЛИС: Окончание обновления дополнительных сведений", 
			УровеньЖурналаРегистрации.Информация,
			Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, "Всего обновлено ""0"" позиций.");
		Возврат;
	КонецЕсли;
	
	ВыборкаНоменклатуры = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		
		НоменклатураОбъект = ВыборкаНоменклатуры.Номенклатура.ПолучитьОбъект();
		НоменклатураОбъект.омг_СрокИсполненияЛаб = ВыборкаНоменклатуры.КоличествоДней;
		НоменклатураОбъект.ОбменДанными.Загрузка = Истина;
		НоменклатураОбъект.Записать();
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("ЛИС: Окончание обновления дополнительных сведений", 
		УровеньЖурналаРегистрации.Информация,
		Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, "Всего обновлено """ + ВыборкаНоменклатуры.Количество() + """ позиций.");

КонецПроцедуры

Функция ЗагрузкаДанныхПоИсследованиям(СтруктураНастроек, СтруктураДанных)
	
	Событие = "Интеграция с ЛИС: Обновление номенклатуры";
	
	ЗаписьЖурналаРегистрации("ЛИС: Начало загрузки данных по исследованиям", 
		УровеньЖурналаРегистрации.Информация,
		Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль);

	ТаблицаИсследований = Новый ТаблицаЗначений;
	ТаблицаИсследований.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаИсследований.Колонки.Добавить("НаименованиеПолное", ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТаблицаИсследований.Колонки.Добавить("Артикул", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаИсследований.Колонки.Добавить("АртикулГруппы", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаИсследований.Колонки.Добавить("ДатаОбновления", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаИсследований.Колонки.Добавить("АртикулНабора", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаИсследований.Колонки.Добавить("ЭтоГруппа", Новый ОписаниеТипов("Булево"));
	ТаблицаИсследований.Колонки.Добавить("ЕстьДопПоля", Новый ОписаниеТипов("Булево"));
	
	ТаблицаДопПолейИсследований = Новый ТаблицаЗначений;
	ТаблицаДопПолейИсследований.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаДопПолейИсследований.Колонки.Добавить("Обязательное", Новый ОписаниеТипов("Булево"));
	ТаблицаДопПолейИсследований.Колонки.Добавить("Артикул", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	
	Для Каждого СтруктураИсследования Из СтруктураДанных.analyses Цикл
		Если СтруктураИсследования.Свойство("removed") И СтруктураИсследования.removed Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы = ТаблицаИсследований.Добавить();
		СтрокаТаблицы.Наименование = СтруктураИсследования.name;
		СтрокаТаблицы.НаименованиеПолное = СтруктураИсследования.name;
		СтрокаТаблицы.Артикул = СтруктураИсследования.code;
		СтрокаТаблицы.АртикулГруппы = СтруктураИсследования.analysisGroupCode;
		СтрокаТаблицы.ДатаОбновления = ПрочитатьДатуJSON(СтруктураИсследования.updateTime, ФорматДатыJSON.ISO);
		Если СтруктураИсследования.Свойство("fields") Тогда 
			Для Каждого СтруктураДопПоля Из СтруктураИсследования.fields Цикл
				СтрокаТаблицыДопПолей = ТаблицаДопПолейИсследований.Добавить();
				СтрокаТаблицыДопПолей.Код = СтруктураДопПоля.fieldCode;
				СтрокаТаблицыДопПолей.Обязательное = СтруктураДопПоля.mandatory;
				СтрокаТаблицыДопПолей.Артикул = СтруктураИсследования.code;
			КонецЦикла;
			СтрокаТаблицы.ЕстьДопПоля = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтруктураИсследования Из СтруктураДанных.analysisGroups Цикл
		Если СтруктураИсследования.Свойство("removed") И СтруктураИсследования.removed Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы = ТаблицаИсследований.Добавить();
		СтрокаТаблицы.Наименование = СтруктураИсследования.name;
		СтрокаТаблицы.Артикул = СтруктураИсследования.code;
		СтрокаТаблицы.ДатаОбновления = ПрочитатьДатуJSON(СтруктураИсследования.updateTime, ФорматДатыJSON.ISO);
		СтрокаТаблицы.ЭтоГруппа = Истина;
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТаблицаИсследований", ТаблицаИсследований);
	Запрос.УстановитьПараметр("ТаблицаДопПолейИсследований", ТаблицаДопПолейИсследований);
	Запрос.УстановитьПараметр("ТолькоИзмененияНоменклатурыИЦен", СтруктураНастроек.ТолькоИзмененияНоменклатуры);
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_НастройкиИнтеграцииСЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |ПОМЕСТИТЬ ВТ_ГруппаНоменклатурыЛИС
	               |ИЗ
	               |	РегистрСведений.омг_НастройкиИнтеграцииСЛИС КАК омг_НастройкиИнтеграцииСЛИС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДопПолейИсследований.Код КАК Код,
	               |	ТаблицаДопПолейИсследований.Артикул КАК Артикул,
	               |	ТаблицаДопПолейИсследований.Обязательное КАК Обязательное
	               |ПОМЕСТИТЬ ВТ_ТаблицаДопПолейИсследований
	               |ИЗ
	               |	&ТаблицаДопПолейИсследований КАК ТаблицаДопПолейИсследований
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаИсследований.Наименование КАК Наименование,
	               |	ТаблицаИсследований.НаименованиеПолное КАК НаименованиеПолное,
	               |	ТаблицаИсследований.Артикул КАК Артикул,
	               |	ТаблицаИсследований.ДатаОбновления КАК ДатаОбновления,
	               |	ТаблицаИсследований.ЭтоГруппа КАК ЭтоГруппа,
	               |	ТаблицаИсследований.АртикулГруппы КАК АртикулГруппы,
	               |	ТаблицаИсследований.ЕстьДопПоля КАК ЕстьДопПоля
	               |ПОМЕСТИТЬ ВТ_ТаблицаИсследований
	               |ИЗ
	               |	&ТаблицаИсследований КАК ТаблицаИсследований
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаИсследований.Наименование КАК Наименование,
	               |	ВТ_ТаблицаИсследований.НаименованиеПолное КАК НаименованиеПолное,
	               |	ВТ_ТаблицаИсследований.Артикул КАК Артикул,
	               |	ВТ_ТаблицаИсследований.ДатаОбновления КАК ДатаОбновления,
	               |	ЕСТЬNULL(Номенклатура.Ссылка, НЕОПРЕДЕЛЕНО) КАК Номенклатура,
	               |	ВТ_ТаблицаИсследований.ЭтоГруппа КАК ЭтоГруппа,
	               |	ВТ_ТаблицаИсследований.АртикулГруппы КАК АртикулГруппы,
	               |	ВТ_ТаблицаИсследований.ЕстьДопПоля КАК ЕстьДопПоля
	               |ПОМЕСТИТЬ ВТ_Номенклатура
	               |ИЗ
	               |	ВТ_ТаблицаИсследований КАК ВТ_ТаблицаИсследований
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	               |		ПО ВТ_ТаблицаИсследований.Артикул = Номенклатура.Артикул
	               |			И ВТ_ТаблицаИсследований.ЭтоГруппа = Номенклатура.ЭтоГруппа
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ТолькоИзмененияНоменклатурыИЦен
	               |				ТОГДА Номенклатура.Ссылка ЕСТЬ NULL
	               |						ИЛИ Номенклатура.омг_ДатаПоследнегоОбновленияЛИС < ВТ_ТаблицаИсследований.ДатаОбновления
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Номенклатура.Наименование КАК Наименование,
	               |	ВТ_Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	               |	ВТ_Номенклатура.Артикул КАК Артикул,
	               |	ВТ_Номенклатура.ДатаОбновления КАК ДатаОбновления,
	               |	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	               |	ВТ_Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
	               |	ВТ_Номенклатура.АртикулГруппы КАК АртикулГруппы,
	               |	ЕСТЬNULL(ВТ_НоменклатураГруппы.Номенклатура, НЕОПРЕДЕЛЕНО) КАК НоменклатураГруппа,
	               |	ВТ_Номенклатура.ЕстьДопПоля КАК ЕстьДопПоля,
	               |	ВТ_Номенклатура.Номенклатура В ИЕРАРХИИ
	               |		(ВЫБРАТЬ
	               |			ВТ_ГруппаНоменклатурыЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |		ИЗ
	               |			ВТ_ГруппаНоменклатурыЛИС КАК ВТ_ГруппаНоменклатурыЛИС) КАК НоменклатураВГруппеЛИС
	               |ИЗ
	               |	ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_НоменклатураГруппы
	               |		ПО ВТ_Номенклатура.АртикулГруппы = ВТ_НоменклатураГруппы.Артикул
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтоГруппа УБЫВ";
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	ИсследованияРезультатЗапроса = ПакетРезультатов.Получить(4);

	Если Не ИсследованияРезультатЗапроса.Пустой() Тогда
		
		НовыеГруппыНоменклатуры = Новый Соответствие;
		
		ВыборкаИсследований = ИсследованияРезультатЗапроса.Выбрать();
		Пока ВыборкаИсследований.Следующий() Цикл
			Если Не ВыборкаИсследований.Номенклатура = Неопределено Тогда 
				НоменклатураОбъект = ВыборкаИсследований.Номенклатура.ПолучитьОбъект();
				Если ВыборкаИсследований.НоменклатураВГруппеЛИС Тогда
					НоменклатураОбъект.Наименование = ВыборкаИсследований.Наименование;
					НоменклатураОбъект.НаименованиеПолное = ВыборкаИсследований.НаименованиеПолное;
				КонецЕсли;
			Иначе
				Если ВыборкаИсследований.ЭтоГруппа Тогда
					НоменклатураОбъект = Справочники.Номенклатура.СоздатьГруппу();
				Иначе
					НоменклатураОбъект = Справочники.Номенклатура.СоздатьЭлемент();
					НоменклатураОбъект.КатегорияВыработки = СтруктураНастроек.СпециализацияПоУмолчанию;
					НоменклатураОбъект.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга;
				КонецЕсли;
				НоменклатураОбъект.Наименование = ВыборкаИсследований.Наименование;
				НоменклатураОбъект.Артикул = ВыборкаИсследований.Артикул;
			КонецЕсли;
			
			Если ВыборкаИсследований.ЭтоГруппа И НоменклатураОбъект.Родитель.Пустая() Тогда
				НоменклатураОбъект.Родитель = СтруктураНастроек.ГруппаНоменклатуры;
				Если НоменклатураОбъект.ЭтоНовый() Тогда
					СсылкаГруппы = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор);
					НоменклатураОбъект.УстановитьСсылкуНового(СсылкаГруппы);
					НовыеГруппыНоменклатуры.Вставить(ВыборкаИсследований.Артикул, СсылкаГруппы);
				КонецЕсли;
			КонецЕсли;
			Если Не ВыборкаИсследований.ЭтоГруппа И НоменклатураОбъект.Родитель.Пустая() Тогда
				НоменклатураОбъект.НаименованиеПолное = ВыборкаИсследований.НаименованиеПолное;
				Если ВыборкаИсследований.НоменклатураГруппа = Неопределено Тогда
					НоменклатураОбъект.Родитель = НовыеГруппыНоменклатуры.Получить(ВыборкаИсследований.АртикулГруппы);
					Если НоменклатураОбъект.Родитель.Пустая() Тогда
						НоменклатураОбъект.Родитель = СтруктураНастроек.ГруппаНоменклатуры;
					КонецЕсли;
				Иначе
					НоменклатураОбъект.Родитель = ВыборкаИсследований.НоменклатураГруппа;
				КонецЕсли;
			КонецЕсли;
			НоменклатураОбъект.омг_ДатаПоследнегоОбновленияЛИС = ВыборкаИсследований.ДатаОбновления;
			
			НоменклатураОбъект.Записать();
						
		КонецЦикла;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_ТаблицаДопПолейИсследований.Код КАК Код,
	               |	ВТ_ТаблицаДопПолейИсследований.Артикул КАК Артикул,
	               |	ВТ_ТаблицаДопПолейИсследований.Обязательное КАК Обязательное,
	               |	СвойстваОбъектов.Ссылка КАК Свойство,
	               |	Номенклатура.Ссылка КАК Объект
	               |ИЗ
	               |	ВТ_ТаблицаДопПолейИсследований КАК ВТ_ТаблицаДопПолейИсследований
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.омг_ДополнительныеПоляЛИС КАК СвойстваОбъектов
	               |		ПО ВТ_ТаблицаДопПолейИсследований.Код = СвойстваОбъектов.КодЛИС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	               |		ПО ВТ_ТаблицаДопПолейИсследований.Артикул = Номенклатура.Артикул
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НазначенияСвойствОбъектов.Объект КАК Объект,
	               |	НазначенияСвойствОбъектов.Свойство КАК Свойство
	               |ИЗ
	               |	ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.омг_СоответствиеДопПолейНоменклатуре КАК НазначенияСвойствОбъектов
	               |		ПО ВТ_Номенклатура.Номенклатура = НазначенияСвойствОбъектов.Объект
	               |ГДЕ
	               |	НЕ НазначенияСвойствОбъектов.Свойство.КодЛИС = """"";
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();

  	ДопПоляПоРезультатЗапроса = ПакетРезультатов.Получить(0);
	СуществующиеНазначенияДопПолейРезультатЗапроса = ПакетРезультатов.Получить(1);
	
	Если Не СуществующиеНазначенияДопПолейРезультатЗапроса.Пустой() Тогда
		
		ВыборкаСуществующиеНазначенияДопПолей = СуществующиеНазначенияДопПолейРезультатЗапроса.Выбрать();
		Пока ВыборкаСуществующиеНазначенияДопПолей.Следующий() Цикл
			Запись = РегистрыСведений.омг_СоответствиеДопПолейНоменклатуре.СоздатьМенеджерЗаписи();
			Запись.Объект = ВыборкаСуществующиеНазначенияДопПолей.Объект;
			Запись.Свойство = ВыборкаСуществующиеНазначенияДопПолей.Свойство;
			Запись.Удалить();
		КонецЦикла;
		
	КонецЕсли;
	
	ВыборкаДопПолей = ДопПоляПоРезультатЗапроса.Выбрать();
	
	Пока ВыборкаДопПолей.Следующий() Цикл
		Запись = РегистрыСведений.омг_СоответствиеДопПолейНоменклатуре.СоздатьМенеджерЗаписи();
		Запись.Объект = ВыборкаДопПолей.Объект;
		Запись.Свойство = ВыборкаДопПолей.Свойство;
		Запись.Обязательное = ВыборкаДопПолей.Обязательное;
		Запись.Записать();
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("ЛИС: Окончание загрузки данных по исследованиям", 
		УровеньЖурналаРегистрации.Информация,
		Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль);

	Возврат ТаблицаИсследований;
	
КонецФункции  

Функция ЗагрузкаДанныхПоНаборамИсследований(СтруктураНастроек, СтруктураДанных, ТаблицаИсследований)
	
	Событие = "Интеграция с ЛИС: Обновление номенклатуры";
	
	ЗаписьЖурналаРегистрации("ЛИС: Начало загрузки данных по наборам исследованиям", 
		УровеньЖурналаРегистрации.Информация,
		Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль);

	ТаблицаНаборов = Новый ТаблицаЗначений;
	ТаблицаНаборов.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаНаборов.Колонки.Добавить("НаименованиеПолное", ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТаблицаНаборов.Колонки.Добавить("Артикул", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаНаборов.Колонки.Добавить("АртикулГруппы", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаНаборов.Колонки.Добавить("ДатаОбновления", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаНаборов.Колонки.Добавить("ЕстьДопПоля", Новый ОписаниеТипов("Булево"));
	
	ТаблицаИсследований.Очистить();
	
	ТаблицаДопПолейИсследований = Новый ТаблицаЗначений;
	ТаблицаДопПолейИсследований.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаДопПолейИсследований.Колонки.Добавить("Обязательное", Новый ОписаниеТипов("Булево"));
	ТаблицаДопПолейИсследований.Колонки.Добавить("Артикул", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	
	ОтборПоАртикулуНабора = ""; // Для целей отладки
	
	Для Каждого СтруктураНабора Из СтруктураДанных.panels Цикл
		Если СтруктураНабора.Свойство("removed") И СтруктураНабора.removed Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ОтборПоАртикулуНабора = "" И Не СтруктураНабора.code = ОтборПоАртикулуНабора Тогда
			Продолжить;
		КонецЕсли;
		СтрокаНабора = ТаблицаНаборов.Добавить();
		СтрокаНабора.Наименование = СтруктураНабора.name;
		СтрокаНабора.НаименованиеПолное = СтруктураНабора.name;
		СтрокаНабора.Артикул = СтруктураНабора.code;
		СтрокаНабора.АртикулГруппы = СтруктураНабора.analysisGroupCode;
		СтрокаНабора.ДатаОбновления = ПрочитатьДатуJSON(СтруктураНабора.updateTime, ФорматДатыJSON.ISO);
		Для Каждого СтруктураИсследования Из СтруктураНабора.panelAnalyses Цикл
			СтрокаИсследования = ТаблицаИсследований.Добавить();
			СтрокаИсследования.Артикул = СтруктураИсследования.analysisCode;
			СтрокаИсследования.АртикулНабора = СтрокаНабора.Артикул;
		КонецЦикла;
		Если СтруктураНабора.Свойство("fields") Тогда 
			Для Каждого СтруктураДопПоля Из СтруктураНабора.fields Цикл
				СтрокаТаблицыДопПолей = ТаблицаДопПолейИсследований.Добавить();
				СтрокаТаблицыДопПолей.Код = СтруктураДопПоля.fieldCode;
				СтрокаТаблицыДопПолей.Обязательное = СтруктураДопПоля.mandatory;
				СтрокаТаблицыДопПолей.Артикул = СтруктураНабора.code;
			КонецЦикла;
			СтрокаНабора.ЕстьДопПоля = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаНаборов", ТаблицаНаборов);
	Запрос.УстановитьПараметр("ТаблицаДопПолейИсследований", ТаблицаДопПолейИсследований);
	Запрос.УстановитьПараметр("ТаблицаИсследованийНаборов", ТаблицаИсследований);
	Запрос.УстановитьПараметр("ТолькоИзмененияНоменклатурыИЦен", СтруктураНастроек.ТолькоИзмененияНаборов);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаДопПолейИсследований.Код КАК Код,
	               |	ТаблицаДопПолейИсследований.Артикул КАК Артикул,
	               |	ТаблицаДопПолейИсследований.Обязательное КАК Обязательное
	               |ПОМЕСТИТЬ ВТ_ТаблицаДопПолейИсследований
	               |ИЗ
	               |	&ТаблицаДопПолейИсследований КАК ТаблицаДопПолейИсследований
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаНаборов.Наименование КАК Наименование,
	               |	ВТ_ТаблицаНаборов.НаименованиеПолное КАК НаименованиеПолное,
	               |	ВТ_ТаблицаНаборов.Артикул КАК Артикул,
	               |	ВТ_ТаблицаНаборов.АртикулГруппы КАК АртикулГруппы,
	               |	ВТ_ТаблицаНаборов.ДатаОбновления КАК ДатаОбновления,
	               |	ВТ_ТаблицаНаборов.ЕстьДопПоля КАК ЕстьДопПоля
	               |ПОМЕСТИТЬ ВТ_ТаблицаНаборов
	               |ИЗ
	               |	&ТаблицаНаборов КАК ВТ_ТаблицаНаборов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаИсследованийНаборов.Артикул КАК Артикул,
	               |	ТаблицаИсследованийНаборов.АртикулНабора КАК АртикулНабора
	               |ПОМЕСТИТЬ ВТ_ТаблицаИсследованийНаборов
	               |ИЗ
	               |	&ТаблицаИсследованийНаборов КАК ТаблицаИсследованийНаборов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаНаборов.Наименование КАК Наименование,
	               |	ВТ_ТаблицаНаборов.НаименованиеПолное КАК НаименованиеПолное,
	               |	ВТ_ТаблицаНаборов.Артикул КАК АртикулНабора,
	               |	ВТ_ТаблицаНаборов.ДатаОбновления КАК ДатаОбновления,
	               |	ЕСТЬNULL(НоменклатураНаборов.Ссылка, НЕОПРЕДЕЛЕНО) КАК НоменклатураНабора,
	               |	ВТ_ТаблицаИсследованийНаборов.Артикул КАК АртикулИсследования,
	               |	НоменклатураИсследований.Ссылка КАК НоменклатураИсследования,
	               |	НоменклатураГруппы.Ссылка КАК НоменклатураГруппы,
	               |	ВТ_ТаблицаНаборов.ЕстьДопПоля КАК ЕстьДопПоля
	               |ПОМЕСТИТЬ ВТ_НаборыИсследований
	               |ИЗ
	               |	ВТ_ТаблицаИсследованийНаборов КАК ВТ_ТаблицаИсследованийНаборов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаНаборов КАК ВТ_ТаблицаНаборов
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураНаборов
	               |			ПО ВТ_ТаблицаНаборов.Артикул = НоменклатураНаборов.Артикул
	               |				И (НЕ НоменклатураНаборов.ЭтоГруппа)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураГруппы
	               |			ПО ВТ_ТаблицаНаборов.АртикулГруппы = НоменклатураГруппы.Артикул
	               |		ПО ВТ_ТаблицаИсследованийНаборов.АртикулНабора = ВТ_ТаблицаНаборов.Артикул
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураИсследований
	               |		ПО ВТ_ТаблицаИсследованийНаборов.Артикул = НоменклатураИсследований.Артикул
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ТолькоИзмененияНоменклатурыИЦен
	               |				ТОГДА НоменклатураНаборов.Ссылка ЕСТЬ NULL
	               |						ИЛИ НоменклатураНаборов.омг_ДатаПоследнегоОбновленияЛИС < ВТ_ТаблицаНаборов.ДатаОбновления
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_НаборыИсследований.Наименование КАК Наименование,
	               |	ВТ_НаборыИсследований.НаименованиеПолное КАК НаименованиеПолное,
	               |	ВТ_НаборыИсследований.АртикулНабора КАК АртикулНабора,
	               |	ВТ_НаборыИсследований.ДатаОбновления КАК ДатаОбновления,
	               |	МАКСИМУМ(ВТ_НаборыИсследований.НоменклатураНабора) КАК НоменклатураНабора,
	               |	ВТ_НаборыИсследований.АртикулИсследования КАК АртикулИсследования,
	               |	МАКСИМУМ(ВТ_НаборыИсследований.НоменклатураИсследования) КАК НоменклатураИсследования,
	               |	МАКСИМУМ(ВТ_НаборыИсследований.НоменклатураГруппы) КАК НоменклатураГруппы,
	               |	ВТ_НаборыИсследований.ЕстьДопПоля КАК ЕстьДопПоля
	               |ИЗ
	               |	ВТ_НаборыИсследований КАК ВТ_НаборыИсследований
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_НаборыИсследований.АртикулНабора,
	               |	ВТ_НаборыИсследований.АртикулИсследования,
	               |	ВТ_НаборыИсследований.НаименованиеПолное,
	               |	ВТ_НаборыИсследований.Наименование,
	               |	ВТ_НаборыИсследований.ЕстьДопПоля,
	               |	ВТ_НаборыИсследований.ДатаОбновления
	               |ИТОГИ
	               |	МАКСИМУМ(Наименование),
	               |	МАКСИМУМ(НаименованиеПолное),
	               |	МАКСИМУМ(ДатаОбновления),
	               |	МАКСИМУМ(НоменклатураНабора),
	               |	МАКСИМУМ(НоменклатураГруппы),
	               |	МАКСИМУМ(ЕстьДопПоля)
	               |ПО
	               |	АртикулНабора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаДопПолейИсследований.Код КАК Код,
	               |	ВТ_ТаблицаДопПолейИсследований.Артикул КАК Артикул,
	               |	ВТ_ТаблицаДопПолейИсследований.Обязательное КАК Обязательное,
	               |	СвойстваОбъектов.Ссылка КАК Свойство
	               |ИЗ
	               |	ВТ_ТаблицаДопПолейИсследований КАК ВТ_ТаблицаДопПолейИсследований
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.омг_ДополнительныеПоляЛИС КАК СвойстваОбъектов
	               |		ПО ВТ_ТаблицаДопПолейИсследований.Код = СвойстваОбъектов.КодЛИС
	               |ИТОГИ ПО
	               |	Артикул
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	НазначенияСвойствОбъектов.Объект КАК Объект,
	               |	НазначенияСвойствОбъектов.Свойство КАК Свойство
	               |ИЗ
	               |	ВТ_НаборыИсследований КАК ВТ_НаборыИсследований
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.омг_СоответствиеДопПолейНоменклатуре КАК НазначенияСвойствОбъектов
	               |		ПО ВТ_НаборыИсследований.НоменклатураНабора = НазначенияСвойствОбъектов.Объект
	               |ГДЕ
	               |	НЕ НазначенияСвойствОбъектов.Свойство.КодЛИС = """"";
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	НаборыРезультат = ПакетРезультатов.Получить(4);
	ДопПоляПоВладельцуРезультатЗапроса = ПакетРезультатов.Получить(5);
	СуществующиеНазначенияДопПолейРезультатЗапроса = ПакетРезультатов.Получить(6);
	
	Если Не СуществующиеНазначенияДопПолейРезультатЗапроса.Пустой() Тогда
		
		ВыборкаСуществующиеНазначенияДопПолей = СуществующиеНазначенияДопПолейРезультатЗапроса.Выбрать();
		Пока ВыборкаСуществующиеНазначенияДопПолей.Следующий() Цикл
			Запись = РегистрыСведений.омг_СоответствиеДопПолейНоменклатуре.СоздатьМенеджерЗаписи();
			Запись.Объект = ВыборкаСуществующиеНазначенияДопПолей.Объект;
			Запись.Свойство = ВыборкаСуществующиеНазначенияДопПолей.Свойство;
			Запись.Удалить();
		КонецЦикла;
		
	КонецЕсли;

	Если Не НаборыРезультат.Пустой() Тогда
		
		ВыборкаДопПолейПоВладельцу = ДопПоляПоВладельцуРезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		ВыборкаНаборов = НаборыРезультат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаНаборов.Следующий() Цикл
			Если Не ВыборкаНаборов.НоменклатураНабора = Неопределено Тогда 
				НоменклатураОбъект = ВыборкаНаборов.НоменклатураНабора.ПолучитьОбъект();
				НоменклатураОбъект.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор;
			Иначе
				НоменклатураОбъект = Справочники.Номенклатура.СоздатьЭлемент();
				НоменклатураОбъект.КатегорияВыработки = СтруктураНастроек.СпециализацияПоУмолчанию;
				НоменклатураОбъект.Родитель = СтруктураНастроек.ГруппаНоменклатуры;
				НоменклатураОбъект.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Набор;
			КонецЕсли;
			
			НоменклатураОбъект.Артикул = ВыборкаНаборов.АртикулНабора;
			НоменклатураОбъект.Наименование = ВыборкаНаборов.Наименование;
			НоменклатураОбъект.НаименованиеПолное = ВыборкаНаборов.НаименованиеПолное;
			НоменклатураОбъект.омг_ДатаПоследнегоОбновленияЛИС = ВыборкаНаборов.ДатаОбновления;
			
			ВыборкаИсследований = ВыборкаНаборов.Выбрать();
			НоменклатураОбъект.КомплектующиеНоменклатуры.Очистить();
			Пока ВыборкаИсследований.Следующий() Цикл
				СтрокаНабора = НоменклатураОбъект.КомплектующиеНоменклатуры.Добавить();
				СтрокаНабора.Комплектующая = ВыборкаИсследований.НоменклатураИсследования;
				СтрокаНабора.Количество = 1;
			КонецЦикла;
			НоменклатураОбъект.Родитель = ВыборкаНаборов.НоменклатураГруппы;
			Если НоменклатураОбъект.Родитель.Пустая() Тогда 
				НоменклатураОбъект.Родитель = СтруктураНастроек.ГруппаНоменклатуры;
			КонецЕсли;
			НоменклатураОбъект.Записать();
			
			Если ВыборкаНаборов.ЕстьДопПоля Тогда
				ВыборкаДопПолейПоВладельцу.Сбросить();
				Если ВыборкаДопПолейПоВладельцу.НайтиСледующий(ВыборкаНаборов.АртикулНабора, "Артикул") Тогда
					ВыборкаДопПолей = ВыборкаДопПолейПоВладельцу.Выбрать();
					
					Пока ВыборкаДопПолей.Следующий() Цикл
						Запись = РегистрыСведений.омг_СоответствиеДопПолейНоменклатуре.СоздатьМенеджерЗаписи();
						Запись.Объект = ВыборкаНаборов.НоменклатураНабора;
						Запись.Свойство = ВыборкаДопПолей.Свойство;
						Запись.Обязательное = ВыборкаДопПолей.Обязательное;
						Запись.Записать();
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("ЛИС: Окончание загрузки данных по наборам исследованиям", 
		УровеньЖурналаРегистрации.Информация,
		Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль);

	
КонецФункции

Процедура ОбработкаПозицийЗагрузкиПрайслиста(ЦеныЛИСРезультатЗапроса, ОсновнойПрейскурант)
	
	КоличествоСформированныхДокументов = 0;
	Если Не ЦеныЛИСРезультатЗапроса.Пустой() Тогда 
		
		ТекущиеЦеныПрейскурантов = Неопределено; 
		ВыборкаПоВидам = ЦеныЛИСРезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоВидам.Следующий() Цикл
			
			ВыборкаПоОрганизациям = ВыборкаПоВидам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПоОрганизациям.Следующий() Цикл
				
				ВыборкаПоФилиалам = ВыборкаПоОрганизациям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоФилиалам.Следующий() Цикл
					
					УстановкаЦенОбъект = Документы.УстановкаЦен.СоздатьДокумент();
					Если ВыборкаПоВидам.ДокументыПоВиду = "Набор" Тогда
						УстановкаЦенОбъект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.омг_ЦеныНаборов;
					Иначе
						УстановкаЦенОбъект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.ЦеныПрейскурантов;
						Если ТекущиеЦеныПрейскурантов = Неопределено Тогда
							ТекущиеЦеныПрейскурантов = УстановкаЦенОбъект;
						КонецЕсли;
					КонецЕсли;
					
					УстановкаЦенОбъект.омг_Организация = ВыборкаПоОрганизациям.Организация;
					УстановкаЦенОбъект.омг_Прейскуранты.Добавить().Прейскурант = ОсновнойПрейскурант;
					
					УстановкаЦенОбъект.омг_Филиалы.Добавить().Филиал = ВыборкаПоФилиалам.Филиал;
					ВыборкаЦен = ВыборкаПоФилиалам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаЦен.Следующий() Цикл
						СтрокаЦен = УстановкаЦенОбъект.Номенклатура.Добавить();
						СтрокаЦен.Номенклатура = ВыборкаЦен.Номенклатура;
						СтрокаЦен.омг_ИсходнаяЦена = ВыборкаЦен.Цена;
						СтрокаЦен.Цена = ВыборкаЦен.Цена;
						ИтоговаяЦенаНабора = 0;
						Если ВыборкаПоВидам.ДокументыПоВиду = "Набор" Тогда
							ВыборкаПоКомплектам = ВыборкаЦен.Выбрать();
							
							ОбщаяЦенаКомплектующих = 0;
							Пока ВыборкаПоКомплектам.Следующий() Цикл
								ЦенаКомплектующей = 1;
								Если ВыборкаПоКомплектам.ЦенаКомплектующей = 0 И Не ТекущиеЦеныПрейскурантов = Неопределено Тогда
									НайденнаяСтрока = ТекущиеЦеныПрейскурантов.Номенклатура.Найти(ВыборкаПоКомплектам.Комплектующая, "Номенклатура");
									Если Не НайденнаяСтрока = Неопределено Тогда
										ЦенаКомплектующей = НайденнаяСтрока.Цена;
									КонецЕсли;
								ИначеЕсли Не ВыборкаПоКомплектам.ЦенаКомплектующей = 0 Тогда
									ЦенаКомплектующей = ВыборкаПоКомплектам.ЦенаКомплектующей;    
								КонецЕсли;
								
								ОбщаяЦенаКомплектующих = ОбщаяЦенаКомплектующих + ЦенаКомплектующей;
							КонецЦикла;
							ВыборкаПоКомплектам.Сбросить();
							Пока ВыборкаПоКомплектам.Следующий() Цикл
								СтрокаКомплекта = УстановкаЦенОбъект.омг_НоменклатураНаборов.Добавить();
								СтрокаКомплекта.Набор = ВыборкаЦен.Номенклатура;
								СтрокаКомплекта.Номенклатура = ВыборкаПоКомплектам.Комплектующая;
								ЦенаКомплектующей = 1;
								Если ВыборкаПоКомплектам.ЦенаКомплектующей = 0 И Не ТекущиеЦеныПрейскурантов = Неопределено Тогда
									НайденнаяСтрока = ТекущиеЦеныПрейскурантов.Номенклатура.Найти(СтрокаКомплекта.Номенклатура, "Номенклатура");
									Если Не НайденнаяСтрока = Неопределено Тогда
										ЦенаКомплектующей = НайденнаяСтрока.Цена;
									КонецЕсли;
								ИначеЕсли Не ВыборкаПоКомплектам.ЦенаКомплектующей = 0 Тогда
									ЦенаКомплектующей = ВыборкаПоКомплектам.ЦенаКомплектующей;    
								КонецЕсли;
								СтрокаКомплекта.ЦенаОбщая = ЦенаКомплектующей;
								Если ЦенаКомплектующей > 0 Тогда
									СтрокаКомплекта.Коэффициент = ВыборкаЦен.Цена / ОбщаяЦенаКомплектующих;
									СтрокаКомплекта.ЦенаВНаборе = Окр(СтрокаКомплекта.Коэффициент * ЦенаКомплектующей);
									ИтоговаяЦенаНабора = ИтоговаяЦенаНабора + СтрокаКомплекта.ЦенаВНаборе;
								КонецЕсли;
								
							КонецЦикла;
							Если НЕ СтрокаЦен.Цена = ИтоговаяЦенаНабора Тогда
								СтрокаКомплекта.ЦенаВНаборе = СтрокаКомплекта.ЦенаВНаборе + (СтрокаЦен.Цена - ИтоговаяЦенаНабора);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					УстановкаЦенОбъект.Дата = КонецДня(ТекущаяДата());
					Попытка
						УстановкаЦенОбъект.Комментарий = "#Цены загружены из ЛИС.(" + ТекущаяДата() + ")";
						УстановкаЦенОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
						
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Документ " + УстановкаЦенОбъект.Ссылка + " проведен";
						Сообщение.Сообщить();
						
					Исключение
						УстановкаЦенОбъект.Комментарий = "#Цены загружены из ЛИС.(" + ТекущаяДата() + ")";
						УстановкаЦенОбъект.Записать();

						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Документ " + УстановкаЦенОбъект.Ссылка + " записан.";
						Сообщение.Сообщить();

						ЗаписьЖурналаРегистрации("ЛИС: Ошибка записи установки цен", 
							УровеньЖурналаРегистрации.Ошибка,
							Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль,
							"Не удалось провести цены по филиалу " + ВыборкаПоФилиалам.ФилиалПредставление + ", документ записан без проведения.", 
							ОписаниеОшибки());
					КонецПопытки;
					
					КоличествоСформированныхДокументов = КоличествоСформированныхДокументов + 1;
					
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("ЛИС: Окончание загрузки прайс листов", 
		УровеньЖурналаРегистрации.Информация,
		Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, "Количество сформированных документов """ + КоличествоСформированныхДокументов + """");

	
КонецПроцедуры

Функция ПолучитьВыборкуФилиалов(Филиал = Неопределено)
	
	ДанныеФилиалов = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ДополнительныеНастройкиИнтеграцииЛИС", "ДанныеФилиалов");
	
	ДанныеПодключений = ПолучитьДополнительныеНастройкиПоФилиалам();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДанныеПодключений", ДанныеПодключений);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеПодключений.Адрес КАК Адрес,
	               |	ДанныеПодключений.Порт КАК Порт,
	               |	ДанныеПодключений.Пользователь КАК Пользователь,
	               |	ДанныеПодключений.Пароль КАК Пароль,
	               |	ДанныеПодключений.Филиал КАК Филиал,
	               |	ДанныеПодключений.Используется КАК Используется
	               |ПОМЕСТИТЬ ВТ_ДанныеПодключений
	               |ИЗ
	               |	&ДанныеПодключений КАК ДанныеПодключений
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Филиалы.Ссылка КАК Ссылка,
	               |	Филиалы.Организация КАК Организация,
	               |	ВТ_ДанныеПодключений.Адрес КАК Адрес,
	               |	ВТ_ДанныеПодключений.Порт КАК Порт,
	               |	ВТ_ДанныеПодключений.Пользователь КАК Пользователь,
	               |	ВТ_ДанныеПодключений.Пароль КАК Пароль
	               |ПОМЕСТИТЬ ВТ_Филиалы
	               |ИЗ
	               |	Справочник.Филиалы КАК Филиалы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПодключений КАК ВТ_ДанныеПодключений
	               |		ПО Филиалы.Ссылка = ВТ_ДанныеПодключений.Филиал
	               |ГДЕ
	               |	НЕ ЕСТЬNULL(ВТ_ДанныеПодключений.Адрес, """") = """"
	               |	И ЕСТЬNULL(ВТ_ДанныеПодключений.Используется, ЛОЖЬ)
	               |	И ВЫБОР
	               |			КОГДА &Филиал = НЕОПРЕДЕЛЕНО
	               |					ИЛИ &Филиал = ЗНАЧЕНИЕ(Справочник.Филиалы.ПустаяСсылка)
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ Филиалы.Ссылка = &Филиал
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Филиалы.Ссылка КАК Филиал,
	               |	ВТ_Филиалы.Организация КАК Организация,
	               |	ВТ_Филиалы.Адрес КАК Адрес,
	               |	ВТ_Филиалы.Порт КАК Порт,
	               |	ВТ_Филиалы.Пользователь КАК Пользователь,
	               |	ВТ_Филиалы.Пароль КАК Пароль,
	               |	ВТ_Филиалы.Ссылка.Представление КАК ФилиалПредставление
	               |ИЗ
	               |	ВТ_Филиалы КАК ВТ_Филиалы";
	ВыборкаФилиалов = Запрос.Выполнить().Выбрать();

	Возврат ВыборкаФилиалов;
	
КонецФункции

Процедура ЗагрузкаПрайслиста(СтруктураНастроек, СтруктураДанных)
	
	Событие = "Интеграция с ЛИС: Обновление цен номенклатуры";
	
	ЗаписьЖурналаРегистрации("ЛИС: Начало загрузки прайс листов", 
		УровеньЖурналаРегистрации.Информация,
		Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль);

	Филиал = Неопределено;
	СтруктураНастроек.ОбновляемыеДанные.Свойство("Филиал", Филиал);
		
	ВыборкаФилиалов = ПолучитьВыборкуФилиалов(Филиал);
	
	ЦеныПоФилиалам = Новый ТаблицаЗначений;
	ЦеныПоФилиалам.Колонки.Добавить("Артикул", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ЦеныПоФилиалам.Колонки.Добавить("Цена", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ЦеныПоФилиалам.Колонки.Добавить("Филиал", Новый ОписаниеТипов("СправочникСсылка.Филиалы"));
	ЦеныПоФилиалам.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ЦеныПоФилиалам.Колонки.Добавить("Прейскурант", Новый ОписаниеТипов("СправочникСсылка.Прейскуранты"));
	
	ОтборПоНоменклатуре = ""; // Для целей отладки
	
	ОсновнойПрейскурант = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойПрейскурант");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаЦен", ЦеныПоФилиалам);
	Запрос.УстановитьПараметр("ОсновнойПрейскурант", ОсновнойПрейскурант);
	Запрос.УстановитьПараметр("ТолькоИзмененияНоменклатурыИЦен", СтруктураНастроек.ТолькоИзмененияЦен);
	Запрос.УстановитьПараметр("ТекущаяДата", КонецДня(ТекущаяДата()));

	#Область ТекстЗапроса
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_НастройкиИнтеграцииСЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |ПОМЕСТИТЬ ВТ_ГруппаНоменклатуры
	               |ИЗ
	               |	РегистрСведений.омг_НастройкиИнтеграцииСЛИС КАК омг_НастройкиИнтеграцииСЛИС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЦен.Филиал КАК Филиал,
	               |	ТаблицаЦен.Артикул КАК Артикул,
	               |	ТаблицаЦен.Цена КАК Цена,
	               |	ТаблицаЦен.Прейскурант КАК Прейскурант,
	               |	ТаблицаЦен.Организация КАК Организация
	               |ПОМЕСТИТЬ ВТ_ТаблицаЦен
	               |ИЗ
	               |	&ТаблицаЦен КАК ТаблицаЦен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Номенклатура.Ссылка КАК Ссылка,
	               |	Номенклатура.Артикул КАК Артикул
	               |ПОМЕСТИТЬ ВТ_Номенклатура
	               |ИЗ
	               |	ВТ_ТаблицаЦен КАК ВТ_ТаблицаЦен
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	               |		ПО ВТ_ТаблицаЦен.Артикул = Номенклатура.Артикул
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.омг_Филиал КАК омг_Филиал,
	               |	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	               |	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Период) КАК Период
	               |ПОМЕСТИТЬ ВТ_ТекущиеЦеныПоФилиалам
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			,
	               |			(омг_Филиал, Номенклатура, Прейскурант) В
	               |					(ВЫБРАТЬ
	               |						ВТ_ТаблицаЦен.Филиал КАК Филиал,
	               |						ВТ_Номенклатура.Ссылка КАК Ссылка,
	               |						&ОсновнойПрейскурант КАК Прейскурант
	               |					ИЗ
	               |						ВТ_ТаблицаЦен КАК ВТ_ТаблицаЦен
	               |							ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	               |							ПО
	               |								ВТ_ТаблицаЦен.Артикул = ВТ_Номенклатура.Артикул)
	               |				И омг_Набор = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК ЦеныНоменклатурыСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.омг_Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(ВТ_ТаблицаЦен.Филиал КАК Справочник.Филиалы) КАК Филиал,
	               |	ВТ_ТаблицаЦен.Артикул КАК Артикул,
	               |	ВТ_ТаблицаЦен.Цена КАК Цена,
	               |	ВТ_Номенклатура.Ссылка КАК Номенклатура,
	               |	ВТ_ТаблицаЦен.Организация КАК Организация,
	               |	ВЫБОР
	               |		КОГДА ВТ_Номенклатура.Ссылка.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Набор)
	               |			ТОГДА ""Набор""
	               |		ИНАЧЕ ""Услуга""
	               |	КОНЕЦ КАК ДокументыПоВиду,
	               |	ВЫБОР
	               |		КОГДА ВТ_Номенклатура.Ссылка.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Набор)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПорядокПоВиду
	               |ПОМЕСТИТЬ ВТ_ИтоговыеНаборы
	               |ИЗ
	               |	ВТ_ТаблицаЦен КАК ВТ_ТаблицаЦен
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Номенклатура КАК ВТ_Номенклатура
	               |		ПО ВТ_ТаблицаЦен.Артикул = ВТ_Номенклатура.Артикул
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеЦеныПоФилиалам КАК ВТ_ТекущиеЦеныПоФилиалам
	               |		ПО (ВТ_Номенклатура.Ссылка = ВТ_ТекущиеЦеныПоФилиалам.Номенклатура)
	               |			И ВТ_ТаблицаЦен.Филиал = ВТ_ТекущиеЦеныПоФилиалам.омг_Филиал
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ИСТИНА = ЛОЖЬ
	               |					ИЛИ &ТолькоИзмененияНоменклатурыИЦен
	               |				ТОГДА НЕ ВТ_ТаблицаЦен.Цена = ЕСТЬNULL(ВТ_ТекущиеЦеныПоФилиалам.Цена, 0)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И НЕ ВТ_Номенклатура.Ссылка ЕСТЬ NULL
	               |	И (ВТ_Номенклатура.Ссылка В ИЕРАРХИИ
	               |				(ВЫБРАТЬ
	               |					ВТ_ГруппаНоменклатуры.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |				ИЗ
	               |					ВТ_ГруппаНоменклатуры КАК ВТ_ГруппаНоменклатуры)
	               |			ИЛИ ВТ_Номенклатура.Ссылка.Анализ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ИтоговыеНаборы.Номенклатура КАК Набор,
	               |	НоменклатураКомплектующиеНоменклатуры.Комплектующая КАК Комплектующая,
	               |	ВТ_ИтоговыеНаборы.Филиал КАК Филиал
	               |ПОМЕСТИТЬ ВТ_Комплектующие
	               |ИЗ
	               |	ВТ_ИтоговыеНаборы КАК ВТ_ИтоговыеНаборы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.КомплектующиеНоменклатуры КАК НоменклатураКомплектующиеНоменклатуры
	               |		ПО ВТ_ИтоговыеНаборы.Номенклатура = НоменклатураКомплектующиеНоменклатуры.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	НоменклатураКомплектующиеНоменклатуры.Комплектующая,
	               |	ВТ_ИтоговыеНаборы.Номенклатура,
	               |	ВТ_ИтоговыеНаборы.Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ИтоговыеНаборы.Филиал КАК Филиал,
	               |	ВТ_ИтоговыеНаборы.Артикул КАК Артикул,
	               |	ЕСТЬNULL(ВТ_ИтоговыеНаборы.Цена, 0) КАК Цена,
	               |	ВТ_ИтоговыеНаборы.Номенклатура КАК Номенклатура,
	               |	ВТ_ИтоговыеНаборы.Организация КАК Организация,
	               |	ВТ_ИтоговыеНаборы.ДокументыПоВиду КАК ДокументыПоВиду,
	               |	ВТ_Комплектующие.Комплектующая КАК Комплектующая,
	               |	ЕСТЬNULL(Цены.Цена, 0) КАК ЦенаКомплектующей,
	               |	ЕСТЬNULL(ВТ_ТекущиеЦеныПоФилиалам.Цена, 0) КАК ЦенаНабораТекущая,
	               |	ВТ_ИтоговыеНаборы.ПорядокПоВиду КАК ПорядокПоВиду,
	               |	Цены.Период КАК Период,
	               |	ВТ_ИтоговыеНаборы.Филиал.Представление КАК ФилиалПредставление
	               |ИЗ
	               |	ВТ_ИтоговыеНаборы КАК ВТ_ИтоговыеНаборы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Комплектующие КАК ВТ_Комплектующие
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ЦеныНоменклатурыСрезПоследних.омг_Филиал КАК омг_Филиал,
	               |				ЦеныНоменклатурыСрезПоследних.омг_Набор КАК омг_Набор,
	               |				ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |				МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	               |				МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Период) КАК Период
	               |			ИЗ
	               |				РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |						,
	               |						омг_Набор = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |							И Номенклатура В
	               |								(ВЫБРАТЬ
	               |									ВТ_Комплектующие.Комплектующая КАК Комплектующая
	               |								ИЗ
	               |									ВТ_Комплектующие КАК ВТ_Комплектующие)) КАК ЦеныНоменклатурыСрезПоследних
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				ЦеныНоменклатурыСрезПоследних.омг_Набор,
	               |				ЦеныНоменклатурыСрезПоследних.Номенклатура,
	               |				ЦеныНоменклатурыСрезПоследних.омг_Филиал) КАК Цены
	               |			ПО ВТ_Комплектующие.Комплектующая = Цены.Номенклатура
	               |				И ВТ_Комплектующие.Филиал = Цены.омг_Филиал
	               |		ПО ВТ_ИтоговыеНаборы.Номенклатура = ВТ_Комплектующие.Набор
	               |			И ВТ_ИтоговыеНаборы.Филиал = ВТ_Комплектующие.Филиал
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеЦеныПоФилиалам КАК ВТ_ТекущиеЦеныПоФилиалам
	               |		ПО ВТ_ИтоговыеНаборы.Филиал = ВТ_ТекущиеЦеныПоФилиалам.омг_Филиал
	               |			И ВТ_ИтоговыеНаборы.Номенклатура = ВТ_ТекущиеЦеныПоФилиалам.Номенклатура
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ТолькоИзмененияНоменклатурыИЦен
	               |				ТОГДА НЕ ВТ_ИтоговыеНаборы.Цена = ЕСТЬNULL(ВТ_ТекущиеЦеныПоФилиалам.Цена, 0)
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И НЕ ВТ_ИтоговыеНаборы.Номенклатура ЕСТЬ NULL
	               |	И (НЕ КОНЕЦПЕРИОДА(ЕСТЬNULL(ВТ_ТекущиеЦеныПоФилиалам.Период, ДАТАВРЕМЯ(1, 1, 1)), ДЕНЬ) = &ТекущаяДата
	               |			ИЛИ ВЫБОР
	               |				КОГДА ВТ_ИтоговыеНаборы.ПорядокПоВиду = 1
	               |					ТОГДА НЕ КОНЕЦПЕРИОДА(ЕСТЬNULL(Цены.Период, ДАТАВРЕМЯ(1, 1, 1)), ДЕНЬ) = &ТекущаяДата
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПорядокПоВиду,
	               |	Филиал,
	               |	Номенклатура,
	               |	Комплектующая
	               |ИТОГИ
	               |	МАКСИМУМ(Цена),
	               |	СУММА(ЦенаКомплектующей),
	               |	МАКСИМУМ(ЦенаНабораТекущая)
	               |ПО
	               |	ДокументыПоВиду,
	               |	Организация,
	               |	Филиал,
	               |	Номенклатура
	               |АВТОУПОРЯДОЧИВАНИЕ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Прейскурант КАК Прейскурант,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |	ЦеныНоменклатурыСрезПоследних.омг_Филиал КАК Филиал,
	               |	ЦеныНоменклатурыСрезПоследних.омг_Набор КАК омг_Набор,
	               |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	               |	ЦеныНоменклатурыСрезПоследних.омг_Филиал.Организация КАК Организация,
	               |	ЦеныНоменклатурыСрезПоследних.омг_Филиал.Представление КАК ФилиалПредставление
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			,
	               |			омг_Филиал В
	               |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |						ВТ_ТаблицаЦен.Филиал КАК Филиал
	               |					ИЗ
	               |						ВТ_ТаблицаЦен КАК ВТ_ТаблицаЦен)
	               |				И НЕ Номенклатура В
	               |						(ВЫБРАТЬ
	               |							ВТ_Номенклатура.Ссылка КАК Ссылка
	               |						ИЗ
	               |							ВТ_Номенклатура КАК ВТ_Номенклатура)
	               |				И Номенклатура В ИЕРАРХИИ
	               |					(ВЫБРАТЬ
	               |						ВТ_ГруппаНоменклатуры.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |					ИЗ
	               |						ВТ_ГруппаНоменклатуры КАК ВТ_ГруппаНоменклатуры)
	               |				И омг_Набор = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |				И Прейскурант = &ОсновнойПрейскурант) КАК ЦеныНоменклатурыСрезПоследних
	               |ГДЕ
	               |	НЕ ЦеныНоменклатурыСрезПоследних.Цена = 0
	               |ИТОГИ ПО
	               |	Филиал";
	
	#КонецОбласти

	Пока ВыборкаФилиалов.Следующий() Цикл
		
		ЦеныПоФилиалам.Очистить();
		
		Попытка
			HTTPСоединение = Новый HTTPСоединение(ВыборкаФилиалов.Адрес, ВыборкаФилиалов.Порт, 
				ВыборкаФилиалов.Пользователь, ВыборкаФилиалов.Пароль,, СтруктураНастроек.ВремяОжиданияСоединения);
			
		Исключение
			ТекстОшибки = "Не удалось установить соединение. Проверьте настройки.";
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			Возврат;
		КонецПопытки;
		HTTPЗапрос = Новый HTTPЗапрос("query-dictionaries?format=json");
		
		СтруктураЗапроса = Новый Структура;
		СтруктураЗапроса.Вставить("date", ЗаписатьДатуJSON(ТекущаяДата(), ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДата));
		HTTPЗапрос.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(СтруктураЗапроса));
		
		Попытка
			Ответ = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
		Исключение
			ТекстОшибки = "Не удалось выполнить запрос к серверу.";
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			Продолжить;
		КонецПопытки;
		
		Попытка
			СтруктураДанных = ПрочитатьЗначениеJSON(Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));
			
			Если Не СтруктураДанных.Свойство("prices") Тогда
				ВызватьИсключение("Не найдено поле ""prices""");
			КонецЕсли;
			
		Исключение
			ТекстОшибки = "Филиал: """ + ВыборкаФилиалов.ФилиалПредставление + """. Не удалось прочитать данные из ЛИС, невеный формат.
			|Поле ""prices"" не найдено.";
			Если СтруктураДанных.Свойство("error") Тогда
				ТекстОшибки = ТекстОшибки + "
				|Ошибка ЛИС: " + СтруктураДанных.error;
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			Продолжить;
		КонецПопытки;
		
		Для Каждого СтруктураЦен Из СтруктураДанных.prices Цикл
			Если Не ОтборПоНоменклатуре = "" И Не СтруктураЦен.serviceCode = ОтборПоНоменклатуре Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаЦен = ЦеныПоФилиалам.Добавить();
			СтрокаЦен.Организация = ВыборкаФилиалов.Организация;
			СтрокаЦен.Филиал = ВыборкаФилиалов.Филиал;
			СтрокаЦен.Артикул = СтруктураЦен.serviceCode;
			СтрокаЦен.Цена = СтруктураЦен.price;
		КонецЦикла;
		
		ЗаписьЖурналаРегистрации("ЛИС: Загрузка данных по прайс листам", 
			УровеньЖурналаРегистрации.Информация,
			Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль,,
			"Филиал: " + ВыборкаФилиалов.ФилиалПредставление + ", подготовлено """ + ЦеныПоФилиалам.Количество() + """ позиций.");

		ПакетРезультатов = Запрос.ВыполнитьПакет();
		
		ЦеныЛИСРезультатЗапроса = ПакетРезультатов.Получить(6);
		НулевыеПозицииРезультатЗапроса = ПакетРезультатов.Получить(7);
		
		ОбработкаПозицийЗагрузкиПрайслиста(ЦеныЛИСРезультатЗапроса, ОсновнойПрейскурант);

		Если Не НулевыеПозицииРезультатЗапроса.Пустой() Тогда
			
			КоличествоСформированныхДокументов = 0;
			
			ЗаписьЖурналаРегистрации("ЛИС: Начало обнуления цен по отсутствующим позициям", 
				УровеньЖурналаРегистрации.Информация,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, "Количество сформированных документов """ + КоличествоСформированныхДокументов + """");
			
			
			ВыборкаПоФилиалам = НулевыеПозицииРезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоФилиалам.Следующий() Цикл
				
				УстановкаЦенОбъект = Документы.УстановкаЦен.СоздатьДокумент();
				УстановкаЦенОбъект.омг_Организация = ВыборкаПоФилиалам.Организация; 
				УстановкаЦенОбъект.омг_Филиалы.Добавить().Филиал = ВыборкаПоФилиалам.Филиал;
				УстановкаЦенОбъект.Дата = ТекущаяДата();
				УстановкаЦенОбъект.ВидОперации = Перечисления.ВидыОперацийУстановкиЦен.ЦеныПрейскурантов;
				УстановкаЦенОбъект.омг_Прейскуранты.Добавить().Прейскурант = ОсновнойПрейскурант;
				
				ВыборкаПозиций = ВыборкаПоФилиалам.Выбрать();
				
				Пока ВыборкаПозиций.Следующий() Цикл
					СтрокаТабличнойЧасти = УстановкаЦенОбъект.Номенклатура.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыборкаПозиций);
					СтрокаТабличнойЧасти.Цена = 0;
				КонецЦикла;
				
				Попытка
					УстановкаЦенОбъект.Комментарий = "#Обнуление цен из ЛИС";
					УстановкаЦенОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					
				Исключение
					УстановкаЦенОбъект.Комментарий = "#Обнуление цен из ЛИС";
					УстановкаЦенОбъект.Записать();
					
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Документ " + УстановкаЦенОбъект.Ссылка + " записан без проведения.";
					Сообщение.Сообщить();

					ЗаписьЖурналаРегистрации("ЛИС: Ошибка обнуления цен по отсутствующим позициям", 
						УровеньЖурналаРегистрации.Ошибка,
						Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль,
						"Не удалось провести обнуление цен по филиалу " + ВыборкаПоФилиалам.ФилиалПредставление + ", документ записан без проведения.", 
						ОписаниеОшибки());
				КонецПопытки;
				
				КоличествоСформированныхДокументов = КоличествоСформированныхДокументов + 1;
				
			КонецЦикла;
			
			ЗаписьЖурналаРегистрации("ЛИС: Окончание обнуления цен по отсутствующим позициям", 
				УровеньЖурналаРегистрации.Информация,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, "Количество сформированных документов """ + КоличествоСформированныхДокументов + """");

		КонецЕсли;
	КонецЦикла;
	
	
	
		
	
КонецПроцедуры

Процедура АрхивироватьЗаблокированныеИсследованияЛИС(СтруктураНастроек, СтруктураДанных)

	Событие = "Интеграция с ЛИС: Приостановка исследований ЛИС ";
	
	ЗаписьЖурналаРегистрации("ЛИС: Начало загрузки данных по приостановленным исследованиям ЛИС", 
		УровеньЖурналаРегистрации.Информация,
		Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль);

	ДанныеФилиалов = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ДополнительныеНастройкиИнтеграцииЛИС", "ДанныеФилиалов");
	
	ВыборкаФилиалов = ПолучитьВыборкуФилиалов();
	
	ТаблицаБлокировок = Новый ТаблицаЗначений;
	ТаблицаБлокировок.Колонки.Добавить("Артикул", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаБлокировок.Колонки.Добавить("Дата", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаБлокировок.Колонки.Добавить("Причина", ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТаблицаБлокировок.Колонки.Добавить("Комментарий", ОбщегоНазначения.ОписаниеТипаСтрока(1000));
	ТаблицаБлокировок.Колонки.Добавить("Филиал", Новый ОписаниеТипов("СправочникСсылка.Филиалы"));
	
	ОтборПоНоменклатуре = ""; // Для целей отладки
	
	Пока ВыборкаФилиалов.Следующий() Цикл
		
		Попытка
			HTTPСоединение = Новый HTTPСоединение(ВыборкаФилиалов.Адрес, ВыборкаФилиалов.Порт, 
				ВыборкаФилиалов.Пользователь, ВыборкаФилиалов.Пароль,, СтруктураНастроек.ВремяОжиданияСоединения);
			
		Исключение
			ТекстОшибки = "Не удалось установить соединение. Проверьте настройки.";
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			Возврат;
		КонецПопытки;
		HTTPЗапрос = Новый HTTPЗапрос("query-dictionaries?format=json");
		
		СтруктураЗапроса = Новый Структура;
		СтруктураЗапроса.Вставить("date", ЗаписатьДатуJSON(ТекущаяДата(), ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДата));
		HTTPЗапрос.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(СтруктураЗапроса));
		
		Попытка
			Ответ = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
		Исключение
			ТекстОшибки = "Не удалось выполнить запрос к серверу.";
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			Продолжить;
		КонецПопытки;
		
		Попытка
			СтруктураДанных = ПрочитатьЗначениеJSON(Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));
			
			Если Не СтруктураДанных.Свойство("delayedTargets") Тогда
				ВызватьИсключение("Не найдено поле ""delayedTargets""");
			КонецЕсли;
			
		Исключение
			ТекстОшибки = "Филиал: """ + ВыборкаФилиалов.ФилиалПредставление + """. Не удалось прочитать данные из ЛИС, невеный формат.
			|Поле ""delayedTargets"" не найдено.";
			Если СтруктураДанных.Свойство("error") Тогда
				ТекстОшибки = ТекстОшибки + "
				|Ошибка ЛИС: " + СтруктураДанных.error;
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			Продолжить;
		КонецПопытки;
		
		Для Каждого СведенияОБлокировке Из СтруктураДанных.delayedTargets Цикл
			
			СтрокаТаблицы = ТаблицаБлокировок.Добавить();
			СтрокаТаблицы.Филиал = ВыборкаФилиалов.Филиал;
			СтрокаТаблицы.Артикул = СведенияОБлокировке.targetCode;
			СтрокаТаблицы.Причина = СведенияОБлокировке.reasonName;
			СтрокаТаблицы.Комментарий = СведенияОБлокировке.comment;
			Попытка
				СтрокаТаблицы.Дата = ПрочитатьДатуJSON(СведенияОБлокировке.startDate, ФорматДатыJSON.ISO);
			Исключение
			КонецПопытки;
			
		КонецЦикла;
		
		ЗаписьЖурналаРегистрации("ЛИС: Загрузка данных по приостановленным исследованиям. Подготовка", 
			УровеньЖурналаРегистрации.Информация,
			Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль,,
			"Филиал: " + ВыборкаФилиалов.ФилиалПредставление + ", приостановлено """ + ТаблицаБлокировок.Количество() + """ исследований.");

		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаБлокировок", ТаблицаБлокировок);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_НастройкиИнтеграцииСЛИС.ГруппаНоменклатуры КАК ГруппаНоменклатуры,
	               |	омг_НастройкиИнтеграцииСЛИС.ИспользоватьДополнительнуюПриостановкуИсследований КАК ИспользоватьДополнительнуюПриостановкуИсследований
	               |ПОМЕСТИТЬ ВТ_ГруппаНоменклатуры
	               |ИЗ
	               |	РегистрСведений.омг_НастройкиИнтеграцииСЛИС КАК омг_НастройкиИнтеграцииСЛИС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаБлокировок.Артикул КАК Артикул,
	               |	ТаблицаБлокировок.Причина КАК Причина,
	               |	ТаблицаБлокировок.Комментарий КАК Комментарий,
	               |	ТаблицаБлокировок.Филиал КАК Филиал,
	               |	ТаблицаБлокировок.Дата КАК Дата
	               |ПОМЕСТИТЬ ВТ_ТаблицаБлокировок
	               |ИЗ
	               |	&ТаблицаБлокировок КАК ТаблицаБлокировок
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ТаблицаБлокировок.Филиал КАК Филиал
	               |ПОМЕСТИТЬ ВТ_Филиалы
	               |ИЗ
	               |	ВТ_ТаблицаБлокировок КАК ВТ_ТаблицаБлокировок
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	омг_ПриостановленныеИсследованияЛИС.Номенклатура КАК Номенклатура,
	               |	омг_ПриостановленныеИсследованияЛИС.Филиал КАК Филиал,
	               |	омг_ПриостановленныеИсследованияЛИС.ДатаБлокировки КАК ДатаБлокировки,
	               |	омг_ПриостановленныеИсследованияЛИС.Причина КАК Причина,
	               |	омг_ПриостановленныеИсследованияЛИС.Комментарий КАК Комментарий
	               |ПОМЕСТИТЬ ВТ_ТекущиеБлокировки
	               |ИЗ
	               |	ВТ_Филиалы КАК ВТ_Филиалы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.омг_ПриостановленныеИсследованияЛИС КАК омг_ПриостановленныеИсследованияЛИС
	               |		ПО ВТ_Филиалы.Филиал = омг_ПриостановленныеИсследованияЛИС.Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	омг_ПрочиеПриостановленныеИсследования.Номенклатура КАК Номенклатура,
	               |	омг_ПрочиеПриостановленныеИсследования.Филиал КАК Филиал,
	               |	омг_ПрочиеПриостановленныеИсследования.ДатаБлокировки КАК ДатаБлокировки,
	               |	омг_ПрочиеПриостановленныеИсследования.Причина КАК Причина,
	               |	омг_ПрочиеПриостановленныеИсследования.Комментарий КАК Комментарий,
	               |	омг_ПрочиеПриостановленныеИсследования.РучнаяБлокировка КАК РучнаяБлокировка
	               |ПОМЕСТИТЬ ВТ_ТекущиеБлокировкиПрочие
	               |ИЗ
	               |	ВТ_Филиалы КАК ВТ_Филиалы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.омг_ПрочиеПриостановленныеИсследования КАК омг_ПрочиеПриостановленныеИсследования
	               |		ПО ВТ_Филиалы.Филиал = омг_ПрочиеПриостановленныеИсследования.Филиал
	               |ГДЕ
	               |	ИСТИНА В
	               |			(ВЫБРАТЬ
	               |				ВТ_ГруппаНоменклатуры.ИспользоватьДополнительнуюПриостановкуИсследований КАК ИспользоватьДополнительнуюПриостановкуИсследований
	               |			ИЗ
	               |				ВТ_ГруппаНоменклатуры КАК ВТ_ГруппаНоменклатуры)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаБлокировок.Артикул КАК Артикул,
	               |	ВТ_ТаблицаБлокировок.Причина КАК Причина,
	               |	ВТ_ТаблицаБлокировок.Комментарий КАК Комментарий,
	               |	СправочникНоменклатура.Ссылка КАК Номенклатура,
	               |	ВТ_ТаблицаБлокировок.Филиал КАК Филиал,
	               |	ВТ_ТаблицаБлокировок.Дата КАК Дата
	               |ПОМЕСТИТЬ ВТ_БлокированныеНоменклатурыИзЛИС
	               |ИЗ
	               |	Справочник.Номенклатура КАК СправочникНоменклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаБлокировок КАК ВТ_ТаблицаБлокировок
	               |		ПО СправочникНоменклатура.Артикул = ВТ_ТаблицаБлокировок.Артикул
	               |ГДЕ
	               |	СправочникНоменклатура.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ВТ_ГруппаНоменклатуры.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |			ИЗ
	               |				ВТ_ГруппаНоменклатуры КАК ВТ_ГруппаНоменклатуры)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.омг_Филиал КАК омг_Филиал,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.Период КАК Дата
	               |ПОМЕСТИТЬ ВТ_ИсследованияЛИСНулеваяЦена
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			,
	               |			Номенклатура В ИЕРАРХИИ
	               |					(ВЫБРАТЬ
	               |						ВТ_ГруппаНоменклатуры.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |					ИЗ
	               |						ВТ_ГруппаНоменклатуры КАК ВТ_ГруппаНоменклатуры)
	               |				И омг_Набор = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	               |				И омг_Филиал В
	               |					(ВЫБРАТЬ
	               |						ВТ_Филиалы.Филиал КАК Филиал
	               |					ИЗ
	               |						ВТ_Филиалы КАК ВТ_Филиалы)) КАК ЦеныНоменклатурыСрезПоследних
	               |ГДЕ
	               |	ЦеныНоменклатурыСрезПоследних.Цена = 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	НоменклатураКомплектующиеНоменклатуры.Ссылка КАК Набор,
	               |	ВТ_БлокированныеНоменклатурыИзЛИС.Филиал КАК Филиал,
	               |	ВТ_БлокированныеНоменклатурыИзЛИС.Причина КАК Причина,
	               |	ВТ_БлокированныеНоменклатурыИзЛИС.Комментарий КАК Комментарий,
	               |	ВТ_БлокированныеНоменклатурыИзЛИС.Артикул КАК Артикул,
	               |	ВТ_БлокированныеНоменклатурыИзЛИС.Дата КАК Дата,
	               |	ВТ_БлокированныеНоменклатурыИзЛИС.Номенклатура.Представление КАК НоменклатураПредставление
	               |ПОМЕСТИТЬ ВТ_ИтоговыеДанныеДляБлокировки
	               |ИЗ
	               |	Справочник.Номенклатура.КомплектующиеНоменклатуры КАК НоменклатураКомплектующиеНоменклатуры
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_БлокированныеНоменклатурыИзЛИС КАК ВТ_БлокированныеНоменклатурыИзЛИС
	               |		ПО НоменклатураКомплектующиеНоменклатуры.Комплектующая = ВТ_БлокированныеНоменклатурыИзЛИС.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеБлокировкиПрочие КАК ВТ_ТекущиеБлокировкиПрочие
	               |		ПО НоменклатураКомплектующиеНоменклатуры.Ссылка = ВТ_ТекущиеБлокировкиПрочие.Номенклатура
	               |			И (ВТ_БлокированныеНоменклатурыИзЛИС.Филиал = ВТ_ТекущиеБлокировкиПрочие.Филиал)
	               |			И (ВТ_БлокированныеНоменклатурыИзЛИС.Дата = ВТ_ТекущиеБлокировкиПрочие.ДатаБлокировки)
	               |ГДЕ
	               |	НЕ НоменклатураКомплектующиеНоменклатуры.Ссылка В ИЕРАРХИИ
	               |				(ВЫБРАТЬ
	               |					ВТ_ГруппаНоменклатуры.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |				ИЗ
	               |					ВТ_ГруппаНоменклатуры КАК ВТ_ГруппаНоменклатуры)
	               |	И ВТ_ТекущиеБлокировкиПрочие.Номенклатура ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ИсследованияЛИСНулеваяЦена.омг_Филиал КАК Филиал,
	               |	КомплектующиеНабора.Ссылка КАК Набор,
	               |	ВТ_ИсследованияЛИСНулеваяЦена.Номенклатура.Артикул КАК Артикул,
	               |	ВТ_ИсследованияЛИСНулеваяЦена.Дата КАК Дата,
	               |	КомплектующиеНабора.Комплектующая КАК Комплектующая,
	               |	ВТ_ИсследованияЛИСНулеваяЦена.Номенклатура.Представление КАК НоменклатураПредставление
	               |ПОМЕСТИТЬ ВТ_НаборыСНулевымиЦенами
	               |ИЗ
	               |	ВТ_ИсследованияЛИСНулеваяЦена КАК ВТ_ИсследованияЛИСНулеваяЦена
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.КомплектующиеНоменклатуры КАК КомплектующиеНабора
	               |		ПО ВТ_ИсследованияЛИСНулеваяЦена.Номенклатура = КомплектующиеНабора.Комплектующая
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтоговыеДанныеДляБлокировки КАК ВТ_ИтоговыеДанныеДляБлокировки
	               |		ПО ВТ_ИсследованияЛИСНулеваяЦена.омг_Филиал = ВТ_ИтоговыеДанныеДляБлокировки.Филиал
	               |			И (КомплектующиеНабора.Ссылка = ВТ_ИтоговыеДанныеДляБлокировки.Набор)
	               |ГДЕ
	               |	ВТ_ИтоговыеДанныеДляБлокировки.Набор ЕСТЬ NULL
	               |	И ИСТИНА В
	               |			(ВЫБРАТЬ
	               |				ВТ_ГруппаНоменклатуры.ИспользоватьДополнительнуюПриостановкуИсследований КАК ИспользоватьДополнительнуюПриостановкуИсследований
	               |			ИЗ
	               |				ВТ_ГруппаНоменклатуры КАК ВТ_ГруппаНоменклатуры)
	               |	И НЕ КомплектующиеНабора.Ссылка В ИЕРАРХИИ
	               |				(ВЫБРАТЬ
	               |					ВТ_ГруппаНоменклатуры.ГруппаНоменклатуры КАК ГруппаНоменклатуры
	               |				ИЗ
	               |					ВТ_ГруппаНоменклатуры КАК ВТ_ГруппаНоменклатуры)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ТекущиеБлокировки.Филиал КАК Филиал,
	               |	ВТ_ТекущиеБлокировки.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	ВТ_ТекущиеБлокировки КАК ВТ_ТекущиеБлокировки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_БлокированныеНоменклатурыИзЛИС КАК ВТ_БлокированныеНоменклатурыИзЛИС
	               |		ПО ВТ_ТекущиеБлокировки.Номенклатура = ВТ_БлокированныеНоменклатурыИзЛИС.Номенклатура
	               |			И ВТ_ТекущиеБлокировки.Филиал = ВТ_БлокированныеНоменклатурыИзЛИС.Филиал
	               |			И ВТ_ТекущиеБлокировки.ДатаБлокировки = ВТ_БлокированныеНоменклатурыИзЛИС.Дата
	               |ГДЕ
	               |	ВТ_БлокированныеНоменклатурыИзЛИС.Номенклатура ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ТекущиеБлокировкиПрочие.Филиал КАК Филиал,
	               |	ВТ_ТекущиеБлокировкиПрочие.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	ВТ_ТекущиеБлокировкиПрочие КАК ВТ_ТекущиеБлокировкиПрочие
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НаборыСНулевымиЦенами КАК ВТ_НаборыСНулевымиЦенами
	               |		ПО ВТ_ТекущиеБлокировкиПрочие.Номенклатура = ВТ_НаборыСНулевымиЦенами.Набор
	               |			И ВТ_ТекущиеБлокировкиПрочие.Филиал = ВТ_НаборыСНулевымиЦенами.Филиал
	               |ГДЕ
	               |	ВТ_НаборыСНулевымиЦенами.Набор ЕСТЬ NULL
	               |	И ИСТИНА В
	               |			(ВЫБРАТЬ
	               |				ВТ_ГруппаНоменклатуры.ИспользоватьДополнительнуюПриостановкуИсследований КАК ИспользоватьДополнительнуюПриостановкуИсследований
	               |			ИЗ
	               |				ВТ_ГруппаНоменклатуры КАК ВТ_ГруппаНоменклатуры)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_БлокированныеНоменклатурыИзЛИС.Артикул КАК Артикул,
	               |	ВТ_БлокированныеНоменклатурыИзЛИС.Причина КАК Причина,
	               |	ВТ_БлокированныеНоменклатурыИзЛИС.Комментарий КАК Комментарий,
	               |	ВТ_БлокированныеНоменклатурыИзЛИС.Номенклатура КАК Номенклатура,
	               |	ВТ_БлокированныеНоменклатурыИзЛИС.Филиал КАК Филиал,
	               |	ВТ_БлокированныеНоменклатурыИзЛИС.Дата КАК Дата,
	               |	ВТ_БлокированныеНоменклатурыИзЛИС.Номенклатура.Представление КАК НоменклатураПредставление
	               |ИЗ
	               |	ВТ_БлокированныеНоменклатурыИзЛИС КАК ВТ_БлокированныеНоменклатурыИзЛИС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеБлокировки КАК ВТ_ТекущиеБлокировки
	               |		ПО ВТ_БлокированныеНоменклатурыИзЛИС.Филиал = ВТ_ТекущиеБлокировки.Филиал
	               |			И ВТ_БлокированныеНоменклатурыИзЛИС.Номенклатура = ВТ_ТекущиеБлокировки.Номенклатура
	               |			И ВТ_БлокированныеНоменклатурыИзЛИС.Дата = ВТ_ТекущиеБлокировки.ДатаБлокировки
	               |ГДЕ
	               |	ВТ_ТекущиеБлокировки.Номенклатура ЕСТЬ NULL
	               |ИТОГИ ПО
	               |	Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ИтоговыеДанныеДляБлокировки.Набор КАК Набор,
	               |	ВТ_ИтоговыеДанныеДляБлокировки.Филиал КАК Филиал,
	               |	ВТ_ИтоговыеДанныеДляБлокировки.Причина КАК Причина,
	               |	ВТ_ИтоговыеДанныеДляБлокировки.Комментарий КАК Комментарий,
	               |	ВТ_ИтоговыеДанныеДляБлокировки.Артикул КАК Артикул,
	               |	ВТ_ИтоговыеДанныеДляБлокировки.Дата КАК Дата,
	               |	ВТ_ИтоговыеДанныеДляБлокировки.НоменклатураПредставление КАК НоменклатураПредставление,
	               |	ЦеныНаборов.Цена КАК Цена
	               |ИЗ
	               |	ВТ_ИтоговыеДанныеДляБлокировки КАК ВТ_ИтоговыеДанныеДляБлокировки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |			ЦеныНоменклатурыСрезПоследних.омг_Филиал КАК омг_Филиал,
	               |			МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
	               |		ИЗ
	               |			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |					,
	               |					(омг_Филиал, Номенклатура) В
	               |						(ВЫБРАТЬ
	               |							ВТ_ИтоговыеДанныеДляБлокировки.Филиал КАК Филиал,
	               |							ВТ_ИтоговыеДанныеДляБлокировки.Набор КАК Набор
	               |						ИЗ
	               |							ВТ_ИтоговыеДанныеДляБлокировки КАК ВТ_ИтоговыеДанныеДляБлокировки)) КАК ЦеныНоменклатурыСрезПоследних
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ЦеныНоменклатурыСрезПоследних.омг_Филиал,
	               |			ЦеныНоменклатурыСрезПоследних.Номенклатура) КАК ЦеныНаборов
	               |		ПО ВТ_ИтоговыеДанныеДляБлокировки.Набор = ЦеныНаборов.Номенклатура
	               |			И ВТ_ИтоговыеДанныеДляБлокировки.Филиал = ЦеныНаборов.омг_Филиал
	               |ГДЕ
	               |	ИСТИНА В
	               |			(ВЫБРАТЬ
	               |				ВТ_ГруппаНоменклатуры.ИспользоватьДополнительнуюПриостановкуИсследований КАК ИспользоватьДополнительнуюПриостановкуИсследований
	               |			ИЗ
	               |				ВТ_ГруппаНоменклатуры КАК ВТ_ГруппаНоменклатуры)
				   |	И ЕСТЬNULL(ЦеныНаборов.Цена, 0) > 0
	               |ИТОГИ
	               |	МАКСИМУМ(Дата)
	               |ПО
	               |	Филиал,
	               |	Набор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_НаборыСНулевымиЦенами.Филиал КАК Филиал,
	               |	ВТ_НаборыСНулевымиЦенами.Набор КАК Набор,
	               |	ВТ_НаборыСНулевымиЦенами.Артикул КАК Артикул,
	               |	ВТ_НаборыСНулевымиЦенами.Дата КАК Дата,
	               |	ВТ_НаборыСНулевымиЦенами.НоменклатураПредставление КАК НоменклатураПредставление,
	               |	ЦеныНаборов.Цена КАК Цена
	               |ИЗ
	               |	ВТ_НаборыСНулевымиЦенами КАК ВТ_НаборыСНулевымиЦенами
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеБлокировки КАК ВТ_ТекущиеБлокировки
	               |		ПО ВТ_НаборыСНулевымиЦенами.Филиал = ВТ_ТекущиеБлокировки.Филиал
	               |			И (ВТ_НаборыСНулевымиЦенами.Комплектующая = ВТ_ТекущиеБлокировки.Номенклатура
	               |				ИЛИ ВТ_НаборыСНулевымиЦенами.Набор = ВТ_ТекущиеБлокировки.Номенклатура)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеБлокировкиПрочие КАК ВТ_ТекущиеБлокировкиПрочие
	               |		ПО ВТ_НаборыСНулевымиЦенами.Набор = ВТ_ТекущиеБлокировкиПрочие.Номенклатура
	               |			И ВТ_НаборыСНулевымиЦенами.Филиал = ВТ_ТекущиеБлокировкиПрочие.Филиал
	               |			И (НЕ ВТ_ТекущиеБлокировкиПрочие.РучнаяБлокировка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	               |			ЦеныНоменклатурыСрезПоследних.омг_Филиал КАК омг_Филиал,
	               |			МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
	               |		ИЗ
	               |			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |					,
	               |					(омг_Филиал, Номенклатура) В
	               |						(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |							ВТ_НаборыСНулевымиЦенами.Филиал КАК Филиал,
	               |							ВТ_НаборыСНулевымиЦенами.Набор КАК Набор
	               |						ИЗ
	               |							ВТ_НаборыСНулевымиЦенами КАК ВТ_НаборыСНулевымиЦенами)) КАК ЦеныНоменклатурыСрезПоследних
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ЦеныНоменклатурыСрезПоследних.омг_Филиал,
	               |			ЦеныНоменклатурыСрезПоследних.Номенклатура) КАК ЦеныНаборов
	               |		ПО ВТ_НаборыСНулевымиЦенами.Филиал = ЦеныНаборов.омг_Филиал
	               |			И ВТ_НаборыСНулевымиЦенами.Набор = ЦеныНаборов.Номенклатура
	               |ГДЕ
	               |	ВТ_ТекущиеБлокировки.Номенклатура ЕСТЬ NULL
	               |	И ВТ_ТекущиеБлокировкиПрочие.Номенклатура ЕСТЬ NULL
	               |	И ИСТИНА В
	               |			(ВЫБРАТЬ
	               |				ВТ_ГруппаНоменклатуры.ИспользоватьДополнительнуюПриостановкуИсследований КАК ИспользоватьДополнительнуюПриостановкуИсследований
	               |			ИЗ
	               |				ВТ_ГруппаНоменклатуры КАК ВТ_ГруппаНоменклатуры)
	               |	И ЕСТЬNULL(ЦеныНаборов.Цена, 0) > 0
	               |ИТОГИ
	               |	МАКСИМУМ(Дата)
	               |ПО
	               |	Филиал,
	               |	Набор";
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаТекущихБлокировок = ПакетРезультатов.Получить(9).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаТекущихБлокировокПрочие = ПакетРезультатов.Получить(10).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТекущихБлокировок.Следующий() Цикл
		
		Запись = РегистрыСведений.омг_ПриостановленныеИсследованияЛИС.СоздатьМенеджерЗаписи();
		Запись.Филиал = ВыборкаТекущихБлокировок.Филиал;
		Запись.Номенклатура = ВыборкаТекущихБлокировок.Номенклатура;
		Запись.Удалить();
		
	КонецЦикла;
	
	Пока СтруктураНастроек.ИспользоватьДополнительнуюПриостановкуИсследований И ВыборкаТекущихБлокировокПрочие.Следующий() Цикл
		
		Запись = РегистрыСведений.омг_ПрочиеПриостановленныеИсследования.СоздатьМенеджерЗаписи();
		Запись.Филиал = ВыборкаТекущихБлокировокПрочие.Филиал;
		Запись.Номенклатура = ВыборкаТекущихБлокировокПрочие.Номенклатура;
		Запись.Удалить();
		
	КонецЦикла;
	
	ВыборкаИсследованийПоФилиалам = ПакетРезультатов.Получить(11).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПрочихИсследованийПоФилиалам = ПакетРезультатов.Получить(12).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПрочихИсследованийПоФилиаламБезЦен = ПакетРезультатов.Получить(13).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	
	Пока ВыборкаИсследованийПоФилиалам.Следующий() Цикл
		
		
		ВыборкаИсследований = ВыборкаИсследованийПоФилиалам.Выбрать();
		
		Пока ВыборкаИсследований.Следующий() Цикл
			
			Запись = РегистрыСведений.омг_ПриостановленныеИсследованияЛИС.СоздатьМенеджерЗаписи();
			Запись.Номенклатура = ВыборкаИсследований.Номенклатура;
			Запись.Филиал = ВыборкаИсследований.Филиал;
			Запись.ДатаБлокировки = ВыборкаИсследований.Дата;
			Запись.Причина = ВыборкаИсследований.Причина;
			Запись.Комментарий = ВыборкаИсследований.Комментарий;
			Запись.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
	
	Пока СтруктураНастроек.ИспользоватьДополнительнуюПриостановкуИсследований И ВыборкаПрочихИсследованийПоФилиалам.Следующий() Цикл
		
		ВыборкаНаборов = ВыборкаПрочихИсследованийПоФилиалам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНаборов.Следующий() Цикл
			
			ВыборкаИсследований = ВыборкаНаборов.Выбрать();
			
			Запись = РегистрыСведений.омг_ПрочиеПриостановленныеИсследования.СоздатьМенеджерЗаписи();
			Запись.Номенклатура = ВыборкаНаборов.Набор;
			Запись.Филиал = ВыборкаНаборов.Филиал;
			Запись.ДатаБлокировки = ВыборкаНаборов.Дата;
			Запись.Причина = "Блокировка исследований ЛИС";
			
			Запись.Комментарий = "Состав блокированных позиций:";
			
			Пока ВыборкаИсследований.Следующий() Цикл
				
				Запись.Комментарий = Запись.Комментарий + Символы.ПС + "Артикул: " + 
					ВыборкаИсследований.Артикул + ", Наименование: " + ВыборкаИсследований.НоменклатураПредставление;
				
			КонецЦикла;
			Запись.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
	
	Пока СтруктураНастроек.ИспользоватьДополнительнуюПриостановкуИсследований И ВыборкаПрочихИсследованийПоФилиаламБезЦен.Следующий() Цикл
		
		ВыборкаНаборов = ВыборкаПрочихИсследованийПоФилиаламБезЦен.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаНаборов.Следующий() Цикл
			
			ВыборкаИсследований = ВыборкаНаборов.Выбрать();
			
			Запись = РегистрыСведений.омг_ПрочиеПриостановленныеИсследования.СоздатьМенеджерЗаписи();
			Запись.Номенклатура = ВыборкаНаборов.Набор;
			Запись.Филиал = ВыборкаНаборов.Филиал;
			Запись.ДатаБлокировки = ВыборкаНаборов.Дата;
			Запись.Причина = "Нулевая цена в составе";
			
			Запись.Комментарий = "Состав с нулевыми ценами:";

			Пока ВыборкаИсследований.Следующий() Цикл
				
				Запись.Комментарий = Запись.Комментарий + Символы.ПС + "Артикул: " + 
					ВыборкаИсследований.Артикул + ", Наименование: " + ВыборкаИсследований.НоменклатураПредставление;
				
			КонецЦикла;
			Запись.Записать();
			
		КонецЦикла;
		
	КонецЦикла;
	ЗаписьЖурналаРегистрации("ЛИС: Загрузка данных по приостановленным исследованиям.Окончание", 
		УровеньЖурналаРегистрации.Информация,
		Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль,,);

КонецПроцедуры

Функция ЕстьКлючОбновления(СтруктураНастроек, Ключ)
	
	Возврат Не СтруктураНастроек.ОбновляемыеДанные.Ключи.Найти(Ключ) = Неопределено;
	
КонецФункции

Процедура ЗагрузкаСправочниковИсследований(СтруктураНастроек, СтруктураДанных)

	ОбновлениеАнализовЛИС = ЕстьКлючОбновления(СтруктураНастроек, Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеАнализовЛИС);
	ОбновлениеЦенЛИС = ЕстьКлючОбновления(СтруктураНастроек, Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеЦенЛИС);
	ОбновлениеАрхивированных = ЕстьКлючОбновления(СтруктураНастроек, Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеАрхивированных);
	
	Если ОбновлениеАнализовЛИС Тогда
		
		ОбновлениеДопРеквизитовИсследований(СтруктураНастроек, СтруктураДанных);
	
		ТаблицаИсследований = ЗагрузкаДанныхПоИсследованиям(СтруктураНастроек, СтруктураДанных);
	
		ЗагрузкаДанныхПоНаборамИсследований(СтруктураНастроек, СтруктураДанных, ТаблицаИсследований);
		
	КонецЕсли;
	
	Если ОбновлениеАнализовЛИС Или ОбновлениеАрхивированных Тогда
		
		АрхивироватьЗаблокированныеИсследованияЛИС(СтруктураНастроек, СтруктураДанных);
		
	КонецЕсли;

	Если ОбновлениеАнализовЛИС Тогда

		ОбновлениеДополнительнойИнформацииПоИсследованиям(СтруктураДанных);
		
	КонецЕсли;

	Если ОбновлениеЦенЛИС Тогда
		ЗагрузкаПрайслиста(СтруктураНастроек, СтруктураДанных);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузкаСправочниковБиоматериалов(СтруктураНастроек, СтруктураДанныхОбщие)
	
	Если Не ЕстьКлючОбновления(СтруктураНастроек, Перечисления.омг_КлючиОбновленийСправочников.ОбновлениеБиоматериаловЛИС) Тогда
		Возврат;
	КонецЕсли;
	
	Событие = "Интеграция с ЛИС: Обновление биоматериалов и контейнеров";
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Начало обновления биоматериалов и контейнеров";
	Сообщение.Сообщить();
	                                      
	ТаблицаАнализов = Новый ТаблицаЗначений;
	ТаблицаАнализов.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаАнализов.Колонки.Добавить("КодБиоматериала", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаАнализов.Колонки.Добавить("КодКонтейнера", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаАнализов.Колонки.Добавить("Филиал", Новый ОписаниеТипов("СправочникСсылка.Филиалы"));
	ТаблицаАнализов.Колонки.Добавить("ПоУмолчанию", Новый ОписаниеТипов("Булево"));
	ТаблицаАнализов.Колонки.Добавить("ЕстьКолонкаПоУмолчанию", Новый ОписаниеТипов("Булево"));
	ТаблицаАнализов.Колонки.Добавить("КоличествоКонтейнеров", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ТаблицаАнализов.Колонки.Добавить("Преаналитика", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	
	ТаблицаБиоматериалов = Новый ТаблицаЗначений;
	ТаблицаБиоматериалов.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаБиоматериалов.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаБиоматериалов.Колонки.Добавить("КодКонтейнера", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаБиоматериалов.Колонки.Добавить("ДатаОбновления", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаБиоматериалов.Колонки.Добавить("Филиал", Новый ОписаниеТипов("СправочникСсылка.Филиалы"));
	
	ТаблицаКонтейнеров = Новый ТаблицаЗначений;
	ТаблицаКонтейнеров.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаКонтейнеров.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаКонтейнеров.Колонки.Добавить("ДатаОбновления", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаКонтейнеров.Колонки.Добавить("ИндексКартинки", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ТаблицаКонтейнеров.Колонки.Добавить("Филиал", Новый ОписаниеТипов("СправочникСсылка.Филиалы"));
	ТаблицаКонтейнеров.Колонки.Добавить("КоличествоИсследований", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	
	ТаблицаДопСоответствия = Новый ТаблицаЗначений;
	ТаблицаДопСоответствия.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаДопСоответствия.Колонки.Добавить("КодБиоматериала", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаДопСоответствия.Колонки.Добавить("КодКонтейнера", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаДопСоответствия.Колонки.Добавить("Филиал", Новый ОписаниеТипов("СправочникСсылка.Филиалы"));
	ТаблицаДопСоответствия.Колонки.Добавить("КоличествоИсследований", ОбщегоНазначения.ОписаниеТипаЧисло(10));
 	ТаблицаДопСоответствия.Колонки.Добавить("КодГруппыЗабора", ОбщегоНазначения.ОписаниеТипаСтрока(20));

	ВыборкаФилиалов = ПолучитьВыборкуФилиалов();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаАнализов", ТаблицаАнализов);
	Запрос.УстановитьПараметр("ТаблицаБиоматериалов", ТаблицаБиоматериалов);
	Запрос.УстановитьПараметр("ТаблицаКонтейнеров", ТаблицаКонтейнеров);
	Запрос.УстановитьПараметр("ТаблицаДопСоответствия", ТаблицаДопСоответствия);
	Запрос.УстановитьПараметр("ТолькоИзменения", СтруктураНастроек.ТолькоИзмененияБиоматериаловИКонтейнеров);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаАнализов.Код КАК Код,
	               |	ТаблицаАнализов.ПоУмолчанию КАК ПоУмолчанию,
	               |	ТаблицаАнализов.КодБиоматериала КАК КодБиоматериала,
	               |	ТаблицаАнализов.КодКонтейнера КАК КодКонтейнера,
	               |	ТаблицаАнализов.Филиал КАК Филиал,
	               |	ТаблицаАнализов.ЕстьКолонкаПоУмолчанию КАК ЕстьКолонкаПоУмолчанию,
	               |	ТаблицаАнализов.Преаналитика КАК Преаналитика,
	               |	ТаблицаАнализов.КоличествоКонтейнеров КАК КоличествоКонтейнеров
	               |ПОМЕСТИТЬ ВТ_ТаблицаАнализов
	               |ИЗ
	               |	&ТаблицаАнализов КАК ТаблицаАнализов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаБиоматериалов.Наименование КАК Наименование,
	               |	ТаблицаБиоматериалов.Код КАК Код,
	               |	ТаблицаБиоматериалов.ДатаОбновления КАК ДатаОбновления,
	               |	ТаблицаБиоматериалов.КодКонтейнера КАК КодКонтейнера,
	               |	ТаблицаБиоматериалов.Филиал КАК Филиал
	               |ПОМЕСТИТЬ ВТ_ТаблицаБиоматериалов
	               |ИЗ
	               |	&ТаблицаБиоматериалов КАК ТаблицаБиоматериалов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаДопСоответствия.Код КАК Код,
	               |	ТаблицаДопСоответствия.КодКонтейнера КАК КодКонтейнера,
	               |	ТаблицаДопСоответствия.КодБиоматериала КАК КодБиоматериала,
	               |	ТаблицаДопСоответствия.Филиал КАК Филиал,
	               |	ТаблицаДопСоответствия.КодГруппыЗабора КАК КодГруппыЗабора,
	               |	ТаблицаДопСоответствия.КоличествоИсследований КАК КоличествоИсследований
	               |ПОМЕСТИТЬ ВТ_ТаблицаДопСоответствия
	               |ИЗ
	               |	&ТаблицаДопСоответствия КАК ТаблицаДопСоответствия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаКонтейнеров.Наименование КАК Наименование,
	               |	ТаблицаКонтейнеров.Код КАК Код,
	               |	ТаблицаКонтейнеров.ДатаОбновления КАК ДатаОбновления,
	               |	ТаблицаКонтейнеров.ИндексКартинки КАК ИндексКартинки,
	               |	ТаблицаКонтейнеров.Филиал КАК Филиал,
	               |	ТаблицаКонтейнеров.КоличествоИсследований КАК КоличествоИсследований
	               |ПОМЕСТИТЬ ВТ_ТаблицаКонтейнеров
	               |ИЗ
	               |	&ТаблицаКонтейнеров КАК ТаблицаКонтейнеров
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаКонтейнеров.Наименование КАК Наименование,
	               |	ВТ_ТаблицаКонтейнеров.Код КАК Код,
	               |	ВТ_ТаблицаКонтейнеров.ДатаОбновления КАК ДатаОбновления,
	               |	ЕСТЬNULL(ВнутренняяЛаборатория_ВидыКонтейнеров.Ссылка, НЕОПРЕДЕЛЕНО) КАК СсылкаНаСправочник,
	               |	""Контейнеры"" КАК ТипСправочника,
	               |	ВТ_ТаблицаКонтейнеров.ИндексКартинки КАК ИндексКартинки,
	               |	ВТ_ТаблицаКонтейнеров.Филиал КАК Филиал,
	               |	ВТ_ТаблицаКонтейнеров.КоличествоИсследований КАК КоличествоИсследований
	               |ПОМЕСТИТЬ ВТ_СуществующиеКонтейнеры
	               |ИЗ
	               |	ВТ_ТаблицаКонтейнеров КАК ВТ_ТаблицаКонтейнеров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнутренняяЛаборатория_ВидыКонтейнеров КАК ВнутренняяЛаборатория_ВидыКонтейнеров
	               |		ПО ВТ_ТаблицаКонтейнеров.Код = ВнутренняяЛаборатория_ВидыКонтейнеров.омг_КодЛИС
	               |			И ВТ_ТаблицаКонтейнеров.Филиал = ВнутренняяЛаборатория_ВидыКонтейнеров.омг_Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаАнализов.Код КАК Код,
	               |	ВТ_ТаблицаАнализов.ПоУмолчанию КАК ПоУмолчанию,
	               |	ВТ_ТаблицаАнализов.КодБиоматериала КАК КодБиоматериала,
	               |	ЕСТЬNULL(Номенклатура.Ссылка, НЕОПРЕДЕЛЕНО) КАК Номенклатура,
	               |	ЕСТЬNULL(ВнутренняяЛаборатория_Биоматериалы.Ссылка, НЕОПРЕДЕЛЕНО) КАК Биоматериал,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ВТ_СуществующиеКонтейнеры1.СсылкаНаСправочник, ЕСТЬNULL(ВТ_СуществующиеКонтейнеры.СсылкаНаСправочник, НЕОПРЕДЕЛЕНО)) = НЕОПРЕДЕЛЕНО
	               |				И ВТ_ТаблицаАнализов.КодКонтейнера = """"
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.ВнутренняяЛаборатория_ВидыКонтейнеров.ПустаяСсылка)
	               |		ИНАЧЕ ЕСТЬNULL(ВТ_СуществующиеКонтейнеры1.СсылкаНаСправочник, ЕСТЬNULL(ВТ_СуществующиеКонтейнеры.СсылкаНаСправочник, НЕОПРЕДЕЛЕНО))
	               |	КОНЕЦ КАК СсылкаНаКонтейнер,
	               |	ВЫБОР
	               |		КОГДА НЕ ВТ_ТаблицаАнализов.КодКонтейнера = """"
	               |			ТОГДА ВТ_ТаблицаАнализов.КодКонтейнера
	               |		ИНАЧЕ ВТ_ТаблицаБиоматериалов.КодКонтейнера
	               |	КОНЕЦ КАК КодКонтейнера,
	               |	ВТ_ТаблицаАнализов.Филиал КАК Филиал,
	               |	ВТ_ТаблицаАнализов.ЕстьКолонкаПоУмолчанию КАК ЕстьКолонкаПоУмолчанию,
	               |	ВТ_ТаблицаАнализов.КоличествоКонтейнеров КАК КоличествоКонтейнеров,
	               |	ВТ_ТаблицаАнализов.Преаналитика КАК Преаналитика
	               |ПОМЕСТИТЬ ВТ_ДанныеЛИС
	               |ИЗ
	               |	ВТ_ТаблицаАнализов КАК ВТ_ТаблицаАнализов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	               |		ПО ВТ_ТаблицаАнализов.Код = Номенклатура.Артикул
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнутренняяЛаборатория_Биоматериалы КАК ВнутренняяЛаборатория_Биоматериалы
	               |		ПО ВТ_ТаблицаАнализов.КодБиоматериала = ВнутренняяЛаборатория_Биоматериалы.Код
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаБиоматериалов КАК ВТ_ТаблицаБиоматериалов
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуществующиеКонтейнеры КАК ВТ_СуществующиеКонтейнеры
	               |			ПО ВТ_ТаблицаБиоматериалов.КодКонтейнера = ВТ_СуществующиеКонтейнеры.Код
	               |				И ВТ_ТаблицаБиоматериалов.Филиал = ВТ_СуществующиеКонтейнеры.Филиал
	               |				И (ВТ_СуществующиеКонтейнеры.ТипСправочника = ""Контейнеры"")
	               |		ПО ВТ_ТаблицаАнализов.КодБиоматериала = ВТ_ТаблицаБиоматериалов.Код
	               |			И ВТ_ТаблицаАнализов.Филиал = ВТ_ТаблицаБиоматериалов.Филиал
	               |			И (ВТ_ТаблицаАнализов.КодКонтейнера = """")
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуществующиеКонтейнеры КАК ВТ_СуществующиеКонтейнеры1
	               |		ПО ВТ_ТаблицаАнализов.КодКонтейнера = ВТ_СуществующиеКонтейнеры1.Код
	               |			И ВТ_ТаблицаАнализов.Филиал = ВТ_СуществующиеКонтейнеры1.Филиал
	               |			И (ВТ_СуществующиеКонтейнеры1.ТипСправочника = ""Контейнеры"")
	               |			И (НЕ ВТ_ТаблицаАнализов.КодКонтейнера = """")
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТ_ДанныеЛИС.Код, ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Номенклатура.Артикул) КАК Код,
	               |	ЕСТЬNULL(ВТ_ДанныеЛИС.ПоУмолчанию, ЛОЖЬ) КАК ПоУмолчанию,
	               |	ЕСТЬNULL(ВТ_ДанныеЛИС.КодБиоматериала, ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Биоматериал.Код) КАК КодБиоматериала,
	               |	ЕСТЬNULL(ВТ_ДанныеЛИС.Номенклатура, ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Номенклатура) КАК Номенклатура,
	               |	ЕСТЬNULL(ВТ_ДанныеЛИС.Биоматериал, ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Биоматериал) КАК Биоматериал,
	               |	ЕСТЬNULL(ВТ_ДанныеЛИС.СсылкаНаКонтейнер, ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Контейнер) КАК СсылкаНаКонтейнер,
	               |	ЕСТЬNULL(ВТ_ДанныеЛИС.КодКонтейнера, ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Контейнер.омг_КодЛИС) КАК КодКонтейнера,
	               |	ВЫБОР
	               |		КОГДА НЕ ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Номенклатура ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЕстьВРегистре,
	               |	ВЫБОР
	               |		КОГДА НЕ ВТ_ДанныеЛИС.Номенклатура ЕСТЬ NULL
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЕстьВЛИС,
	               |	ЕСТЬNULL(ВТ_ДанныеЛИС.Филиал, ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_Филиал) КАК Филиал,
	               |	ЕСТЬNULL(ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_КоличествоИсследований, 0) КАК КоличествоИсследованийМИС,
	               |	ЕСТЬNULL(ВТ_ТаблицаДопСоответствия.КоличествоИсследований, 0) КАК КоличествоИсследованийЛИС,
	               |	ВТ_ТаблицаДопСоответствия.КодГруппыЗабора КАК КодГруппыЗабора,
	               |	ВЫБОР
	               |			КОГДА ВТ_ДанныеЛИС.ЕстьКолонкаПоУмолчанию
	               |				ТОГДА НЕ ВТ_ДанныеЛИС.ПоУмолчанию = ЕСТЬNULL(ВнутренняяЛаборатория_СопоставлениеНоменклатуры.ПоУмолчанию, ЛОЖЬ)
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |		ИЛИ НЕ ЕСТЬNULL(ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_КодГруппыЗабора, """") = ВТ_ТаблицаДопСоответствия.КодГруппыЗабора
	               |		ИЛИ НЕ ВТ_ТаблицаДопСоответствия.КоличествоИсследований = ЕСТЬNULL(ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_КоличествоИсследований, 0)
	               |		ИЛИ ВТ_ДанныеЛИС.КоличествоКонтейнеров <> ЕСТЬNULL(ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_КоличествоКонтейнеров, 0)
	               |		ИЛИ ВТ_ДанныеЛИС.Преаналитика <> ЕСТЬNULL(ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_Преаналитика, """") КАК ЕстьРазличия,
	               |	ВТ_ДанныеЛИС.КоличествоКонтейнеров КАК КоличествоКонтейнеров,
	               |	ВТ_ДанныеЛИС.Преаналитика КАК Преаналитика
	               |ПОМЕСТИТЬ ВТ_ГотовыеДанные
	               |ИЗ
	               |	ВТ_ДанныеЛИС КАК ВТ_ДанныеЛИС
	               |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ВнутренняяЛаборатория_СопоставлениеНоменклатуры КАК ВнутренняяЛаборатория_СопоставлениеНоменклатуры
	               |		ПО ВТ_ДанныеЛИС.Номенклатура = ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Номенклатура
	               |			И ВТ_ДанныеЛИС.Биоматериал = ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Биоматериал
	               |			И ВТ_ДанныеЛИС.СсылкаНаКонтейнер = ВнутренняяЛаборатория_СопоставлениеНоменклатуры.Контейнер
	               |			И ВТ_ДанныеЛИС.Филиал = ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_Филиал
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаДопСоответствия КАК ВТ_ТаблицаДопСоответствия
	               |		ПО ВТ_ДанныеЛИС.Код = ВТ_ТаблицаДопСоответствия.Код
	               |			И ВТ_ДанныеЛИС.КодБиоматериала = ВТ_ТаблицаДопСоответствия.КодБиоматериала
	               |			И ВТ_ДанныеЛИС.КодКонтейнера = ВТ_ТаблицаДопСоответствия.КодКонтейнера
	               |			И ВТ_ДанныеЛИС.Филиал = ВТ_ТаблицаДопСоответствия.Филиал
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_Филиал ЕСТЬ NULL
	               |				ТОГДА ВнутренняяЛаборатория_СопоставлениеНоменклатуры.омг_Филиал = &Филиал
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_СуществующиеКонтейнеры.Наименование КАК Наименование,
	               |	ВТ_СуществующиеКонтейнеры.Код КАК Код,
	               |	ВТ_СуществующиеКонтейнеры.ДатаОбновления КАК ДатаОбновления,
	               |	ВТ_СуществующиеКонтейнеры.СсылкаНаСправочник КАК СсылкаНаСправочник,
	               |	ВТ_СуществующиеКонтейнеры.ТипСправочника КАК ТипСправочника,
	               |	ВТ_СуществующиеКонтейнеры.ИндексКартинки КАК ИндексКартинки,
	               |	ВТ_СуществующиеКонтейнеры.КоличествоИсследований КАК КоличествоИсследований,
	               |	ВТ_СуществующиеКонтейнеры.Филиал КАК Филиал
	               |ИЗ
	               |	ВТ_СуществующиеКонтейнеры КАК ВТ_СуществующиеКонтейнеры
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ТолькоИзменения
	               |				ТОГДА ВТ_СуществующиеКонтейнеры.СсылкаНаСправочник = НЕОПРЕДЕЛЕНО
	               |						ИЛИ ВТ_СуществующиеКонтейнеры.ДатаОбновления > ВТ_СуществующиеКонтейнеры.СсылкаНаСправочник.омг_ДатаПоследнегоОбновленияЛИС
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ТаблицаБиоматериалов.Наименование,
	               |	ВТ_ТаблицаБиоматериалов.Код,
	               |	ВТ_ТаблицаБиоматериалов.ДатаОбновления,
	               |	ЕСТЬNULL(ВнутренняяЛаборатория_Биоматериалы.Ссылка, НЕОПРЕДЕЛЕНО),
	               |	""Биоматериалы"",
	               |	NULL,
	               |	NULL,
	               |	NULL
	               |ИЗ
	               |	ВТ_ТаблицаБиоматериалов КАК ВТ_ТаблицаБиоматериалов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнутренняяЛаборатория_Биоматериалы КАК ВнутренняяЛаборатория_Биоматериалы
	               |		ПО ВТ_ТаблицаБиоматериалов.Код = ВнутренняяЛаборатория_Биоматериалы.Код
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ТолькоИзменения
	               |				ТОГДА ВнутренняяЛаборатория_Биоматериалы.Ссылка ЕСТЬ NULL
	               |						ИЛИ ВТ_ТаблицаБиоматериалов.ДатаОбновления > ВнутренняяЛаборатория_Биоматериалы.омг_ДатаПоследнегоОбновленияЛИС
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ГотовыеДанные.Номенклатура КАК Номенклатура,
	               |	ВТ_ГотовыеДанные.Биоматериал КАК Биоматериал,
	               |	ВТ_ГотовыеДанные.СсылкаНаКонтейнер КАК Контейнер,
	               |	ВТ_ГотовыеДанные.Филиал КАК Филиал,
	               |	ВТ_ГотовыеДанные.ЕстьВРегистре КАК ЕстьВРегистре,
	               |	ВТ_ГотовыеДанные.ЕстьВЛИС КАК ЕстьВЛИС
	               |ИЗ
	               |	ВТ_ГотовыеДанные КАК ВТ_ГотовыеДанные
	               |ГДЕ
	               |	ВТ_ГотовыеДанные.ЕстьВРегистре
	               |	И НЕ ВТ_ГотовыеДанные.ЕстьВЛИС
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ГотовыеДанные.Код КАК Код,
	               |	ВТ_ГотовыеДанные.ПоУмолчанию КАК ПоУмолчанию,
	               |	ВТ_ГотовыеДанные.КодБиоматериала КАК КодБиоматериала,
	               |	ВТ_ГотовыеДанные.Номенклатура КАК Номенклатура,
	               |	ВТ_ГотовыеДанные.Биоматериал КАК Биоматериал,
	               |	ВТ_ГотовыеДанные.СсылкаНаКонтейнер КАК СсылкаНаКонтейнер,
	               |	ВТ_ГотовыеДанные.КодКонтейнера КАК КодКонтейнера,
	               |	ВТ_ГотовыеДанные.ЕстьВРегистре КАК ЕстьВРегистре,
	               |	ВТ_ГотовыеДанные.ЕстьВЛИС КАК ЕстьВЛИС,
	               |	ВТ_ГотовыеДанные.Филиал КАК Филиал,
	               |	ВТ_ГотовыеДанные.КоличествоИсследованийЛИС КАК КоличествоИсследованийЛИС,
	               |	ВТ_ГотовыеДанные.КодГруппыЗабора КАК КодГруппыЗабора,
	               |	ВТ_ГотовыеДанные.КоличествоКонтейнеров КАК КоличествоКонтейнеров,
	               |	ВТ_ГотовыеДанные.Преаналитика КАК Преаналитика
	               |ИЗ
	               |	ВТ_ГотовыеДанные КАК ВТ_ГотовыеДанные
	               |ГДЕ
	               |	ВТ_ГотовыеДанные.ЕстьВЛИС
	               |	И (НЕ ВТ_ГотовыеДанные.ЕстьВРегистре
	               |			ИЛИ ВЫБОР
	               |				КОГДА ВТ_ГотовыеДанные.КоличествоИсследованийЛИС = 0
	               |					ТОГДА ЛОЖЬ
	               |				ИНАЧЕ НЕ ВТ_ГотовыеДанные.КоличествоИсследованийМИС = ВТ_ГотовыеДанные.КоличествоИсследованийЛИС
	               |			КОНЕЦ
	               |			ИЛИ ВТ_ГотовыеДанные.ЕстьРазличия)
	               |	И НЕ ВТ_ГотовыеДанные.Номенклатура = НЕОПРЕДЕЛЕНО";
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "--- Всего к обновлению филиалов: " + ВыборкаФилиалов.Количество();
	Сообщение.Сообщить();

	Пока ВыборкаФилиалов.Следующий() Цикл
		
		Попытка
			HTTPСоединение = Новый HTTPСоединение(ВыборкаФилиалов.Адрес, ВыборкаФилиалов.Порт, 
				ВыборкаФилиалов.Пользователь, ВыборкаФилиалов.Пароль,, СтруктураНастроек.ВремяОжиданияСоединения);
			
		Исключение
			ТекстОшибки = "Не удалось установить соединение. Проверьте настройки.";
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			Возврат;
		КонецПопытки;
		HTTPЗапрос = Новый HTTPЗапрос("query-dictionaries?format=json");
		
		СтруктураЗапроса = Новый Структура;
		СтруктураЗапроса.Вставить("date", ЗаписатьДатуJSON(ТекущаяДата(), ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДата));
		HTTPЗапрос.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(СтруктураЗапроса));
		
		Попытка
			Ответ = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
		Исключение
			ТекстОшибки = "Не удалось выполнить запрос к серверу.";
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			Продолжить;
		КонецПопытки;
		
		Попытка
			СтруктураДанных = ПрочитатьЗначениеJSON(Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));
			
   		Исключение
			ТекстОшибки = "Филиал: """ + ВыборкаФилиалов.ФилиалПредставление + """. Не удалось прочитать данные из ЛИС, невеный формат. ";
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			Продолжить;
		КонецПопытки;

		Если СтруктураДанных.Свойство("error") Тогда
			ТекстОшибки = "Филиал: """ + ВыборкаФилиалов.ФилиалПредставление + """. Не удалось прочитать данные из ЛИС, ошибка от ЛИС. ";
			ТекстОшибки = ТекстОшибки + "
			|Ошибка ЛИС: " + СтруктураДанных.error;
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "--- Начало обновления по филиалу: " + ВыборкаФилиалов.ФилиалПредставление;
		Сообщение.Сообщить();
		
		
		ТаблицаАнализов.Очистить();
		ТаблицаБиоматериалов.Очистить();
		ТаблицаКонтейнеров.Очистить();
		ТаблицаДопСоответствия.Очистить();
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;;
	
		Для Каждого СтруктураЗначенияАнализов Из СтруктураДанных.analyses Цикл
			Если СтруктураЗначенияАнализов.Свойство("removed") И СтруктураЗначенияАнализов.removed Тогда
				Продолжить;
			КонецЕсли;
			ЕстьПоУмолчанию = Ложь;
			Для Каждого СтруктураЗначенияБиоматериалов Из СтруктураЗначенияАнализов.analysisBiomaterials Цикл
				Если СтруктураЗначенияБиоматериалов.Свойство("isDefault") Тогда
					ЕстьПоУмолчанию = Истина;
				КонецЕсли;
			КонецЦикла;
			Для Каждого СтруктураЗначенияБиоматериалов Из СтруктураЗначенияАнализов.analysisBiomaterials Цикл
				СтрокаТаблицы = ТаблицаАнализов.Добавить();
				СтрокаТаблицы.Код = СтруктураЗначенияАнализов.code;
				СтрокаТаблицы.КодБиоматериала = СтруктураЗначенияБиоматериалов.biomaterialCode;
				СтрокаТаблицы.ПоУмолчанию = Ложь;
				СтрокаТаблицы.ЕстьКолонкаПоУмолчанию = ЕстьПоУмолчанию;
				Если СтруктураЗначенияБиоматериалов.Свойство("isDefault") Тогда
					СтрокаТаблицы.ПоУмолчанию = СтруктураЗначенияБиоматериалов.isDefault; 
				КонецЕсли;
				Если СтруктураЗначенияБиоматериалов.Свойство("containerTypeCode") Тогда
					СтрокаТаблицы.КодКонтейнера = СтруктураЗначенияБиоматериалов.containerTypeCode; 
				КонецЕсли;
				Если СтруктураЗначенияБиоматериалов.Свойство("containersCount") Тогда
					СтрокаТаблицы.КоличествоКонтейнеров = СтруктураЗначенияБиоматериалов.containersCount; 
				КонецЕсли;
				Если СтруктураЗначенияБиоматериалов.Свойство("preanalyticInfoName") Тогда
					СтрокаТаблицы.Преаналитика = СтруктураЗначенияБиоматериалов.preanalyticInfoName; 
				КонецЕсли;
				СтрокаТаблицы.Филиал = ВыборкаФилиалов.Филиал;

				СтрокаТаблицы = ТаблицаДопСоответствия.Добавить();
				СтрокаТаблицы.Код = СтруктураЗначенияАнализов.code;
				СтрокаТаблицы.КодБиоматериала = СтруктураЗначенияБиоматериалов.biomaterialCode;
				Если СтруктураЗначенияБиоматериалов.Свойство("containerTypeCode") Тогда
					СтрокаТаблицы.КодКонтейнера = СтруктураЗначенияБиоматериалов.containerTypeCode; 
				КонецЕсли;
				Если СтруктураЗначенияБиоматериалов.Свойство("maxTestsCount") Тогда
					СтрокаТаблицы.КоличествоИсследований = СтруктураЗначенияБиоматериалов.maxTestsCount; 
				КонецЕсли;
				Если СтруктураЗначенияБиоматериалов.Свойство("samplingGroupCode") Тогда
					СтрокаТаблицы.КодГруппыЗабора = СтруктураЗначенияБиоматериалов.samplingGroupCode; 
				КонецЕсли;
				СтрокаТаблицы.Филиал = ВыборкаФилиалов.Филиал;
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого СтруктураЗначения Из СтруктураДанных.biomaterials Цикл
			
			Если СтруктураЗначения.Свойство("removed") И СтруктураЗначения.removed Тогда
				Продолжить;
			КонецЕсли;
			СтрокаТаблицы = ТаблицаБиоматериалов.Добавить();
			СтрокаТаблицы.Наименование = СтруктураЗначения.name;
			СтрокаТаблицы.Код = СтруктураЗначения.code;
			Если СтруктураЗначения.Свойство("containerTypeCode") Тогда
				СтрокаТаблицы.КодКонтейнера = СтруктураЗначения.containerTypeCode;
			КонецЕсли;
			СтрокаТаблицы.ДатаОбновления = ПрочитатьДатуJSON(СтруктураЗначения.updateTime, ФорматДатыJSON.ISO);
			СтрокаТаблицы.Филиал = ВыборкаФилиалов.Филиал;
			Если СтрокаТаблицы.КодКонтейнера = "" Тогда
				Для Каждого ДанныеАнализа Из СтруктураДанных.analyses Цикл
					Для Каждого ДанныеБиоматериала ИЗ ДанныеАнализа.analysisBiomaterials Цикл
						Если ДанныеБиоматериала.Свойство("containerTypeCode") 
							И СтрокаТаблицы.Код = ДанныеБиоматериала.biomaterialCode Тогда 
							СтрокаТаблицы.КодКонтейнера = ДанныеБиоматериала.containerTypeCode;
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
				
			КонецЕсли;
		КонецЦикла;

		Для Каждого СтруктураЗначения Из СтруктураДанных.containerTypes Цикл
			Если СтруктураЗначения.Свойство("removed") И СтруктураЗначения.removed Тогда
				Продолжить;
			КонецЕсли;
			СтрокаТаблицы = ТаблицаКонтейнеров.Добавить();
			СтрокаТаблицы.Наименование = СтруктураЗначения.name;
			СтрокаТаблицы.Код = СтруктураЗначения.code;
			СтрокаТаблицы.ДатаОбновления = ПрочитатьДатуJSON(СтруктураЗначения.updateTime, ФорматДатыJSON.ISO);
			Если СтруктураЗначения.Свойство("imageIndex") Тогда
				СтрокаТаблицы.ИндексКартинки = СтруктураЗначения.imageIndex
			КонецЕсли;
			СтрокаТаблицы.Филиал = ВыборкаФилиалов.Филиал;
			Если СтруктураЗначения.Свойство("maxTestsCount") Тогда
				СтрокаТаблицы.КоличествоИсследований = СтруктураЗначения.maxTestsCount;
			КонецЕсли;
		КонецЦикла;
		
		Запрос.УстановитьПараметр("Филиал", ВыборкаФилиалов.Филиал);
		ПакетРезультатов = Запрос.ВыполнитьПакет();
		НовыеКонтейнеры = Новый Соответствие;
		НовыеБиоматериалы = Новый Соответствие;
		
		Если Не ПакетРезультатов.Получить(7).Пустой() Тогда       
			
			ВыборкаСправочников = ПакетРезультатов.Получить(7).Выбрать();
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "--- По филиалу обновляемые справочники: " + ВыборкаСправочников.Количество();
			Сообщение.Сообщить();
			
			Пока ВыборкаСправочников.Следующий() Цикл
				
				Если ВыборкаСправочников.ТипСправочника = "Биоматериалы" Тогда
					МенеджерСправочника = Справочники.ВнутренняяЛаборатория_Биоматериалы;
				Иначе
					МенеджерСправочника = Справочники.ВнутренняяЛаборатория_ВидыКонтейнеров;
				КонецЕсли;
				
				Если ВыборкаСправочников.СсылкаНаСправочник = Неопределено Тогда
					СправочникОбъект = МенеджерСправочника.СоздатьЭлемент();
					Если ВыборкаСправочников.ТипСправочника = "Биоматериалы" Тогда
						СправочникОбъект.Код = ВыборкаСправочников.Код; 
					КонецЕсли;
					СсылкаНаОбъект = МенеджерСправочника.ПолучитьСсылку(Новый УникальныйИдентификатор);
					СправочникОбъект.УстановитьСсылкуНового(СсылкаНаОбъект);
				Иначе
					СправочникОбъект = ВыборкаСправочников.СсылкаНаСправочник.ПолучитьОбъект();
					СсылкаНаОбъект = СправочникОбъект.Ссылка;
				КонецЕсли;
				
				СправочникОбъект.Наименование = ВыборкаСправочников.Наименование;
				СправочникОбъект.омг_ДатаПоследнегоОбновленияЛИС = ВыборкаСправочников.ДатаОбновления;
				Если Не ВыборкаСправочников.ТипСправочника = "Биоматериалы" И СправочникОбъект.ЭтоНовый() Тогда
					НовыеКонтейнеры.Вставить(ВыборкаСправочников.Код, СсылкаНаОбъект);
				ИначеЕсли ВыборкаСправочников.ТипСправочника = "Биоматериалы" И СправочникОбъект.ЭтоНовый() Тогда
					НовыеБиоматериалы.Вставить(ВыборкаСправочников.Код, СсылкаНаОбъект);
				КонецЕсли;
				Если ВыборкаСправочников.ТипСправочника = "Контейнеры" Тогда
					СправочникОбъект.омг_КодЛИС = ВыборкаСправочников.Код;
					СправочникОбъект.омг_ИндексКартинки = ВыборкаСправочников.ИндексКартинки;
					СправочникОбъект.омг_КоличествоИсследований = ВыборкаСправочников.КоличествоИсследований;
					СправочникОбъект.омг_Филиал = ВыборкаФилиалов.Филиал;
				КонецЕсли;
				СправочникОбъект.Записать();
				
				//Если ВыборкаСправочников.ТипСправочника = "Биоматериалы" Тогда
				//	ЗаписьСвязи = РегистрыСведений.ВнутренняяЛаборатория_СопоставлениеНоменклатуры.СоздатьМенеджерЗаписи();
				//	ЗаписьСвязи.Биоматериал = СправочникОбъект.Ссылка;
				//	Если Не ВыборкаСправочников.СсылкаНаКонтейнер = Неопределено Тогда
				//		ЗаписьСвязи.Контейнер = ВыборкаСправочников.СсылкаНаКонтейнер;
				//	Иначе
				//		ЗаписьСвязи.Контейнер = НовыеКонтейнеры.Получить(ВыборкаСправочников.КодКонтейнера);
				//	КонецЕсли;
				//	ЗаписьСвязи.Записать();
				//	
				//КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		ВыборкаУдаляемых = ПакетРезультатов.Получить(8).Выбрать();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "--- По филиалу удаляемые сопоставления: " + ВыборкаУдаляемых.Количество();
		Сообщение.Сообщить();
		
		Пока ВыборкаУдаляемых.Следующий() Цикл
			
			Запись = РегистрыСведений.ВнутренняяЛаборатория_СопоставлениеНоменклатуры.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, ВыборкаУдаляемых);
			Запись.омг_Филиал = ВыборкаУдаляемых.Филиал;
			Запись.Удалить();
			
		КонецЦикла;
		
		ВыборкаАнализов = ПакетРезультатов.Получить(9).Выбрать();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "--- По филиалу добавляемые сопоставления: " + ВыборкаАнализов.Количество();
		Сообщение.Сообщить();
		
		Пока ВыборкаАнализов.Следующий() Цикл
			Если ВыборкаАнализов.Биоматериал = Неопределено Тогда
				Биоматериал = НовыеБиоматериалы.Получить(ВыборкаАнализов.КодБиоматериала);
			Иначе
				Биоматериал = ВыборкаАнализов.Биоматериал;
			КонецЕсли;
			
			Если Не ВыборкаАнализов.СсылкаНаКонтейнер = Неопределено Тогда
				Контейнер = ВыборкаАнализов.СсылкаНаКонтейнер;
			Иначе
				Контейнер = НовыеКонтейнеры.Получить(ВыборкаАнализов.КодКонтейнера);
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Биоматериал) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаписьСвязи = РегистрыСведений.ВнутренняяЛаборатория_СопоставлениеНоменклатуры.СоздатьМенеджерЗаписи();
			ЗаписьСвязи.Номенклатура = ВыборкаАнализов.Номенклатура;
			ЗаписьСвязи.Биоматериал = Биоматериал;
			ЗаписьСвязи.Контейнер = Контейнер;
			ЗаписьСвязи.ПоУмолчанию = ВыборкаАнализов.ПоУмолчанию;
			ЗаписьСвязи.омг_Филиал = ВыборкаАнализов.Филиал;
			ЗаписьСвязи.омг_КоличествоИсследований = ВыборкаАнализов.КоличествоИсследованийЛИС;
			ЗаписьСвязи.омг_КодГруппыЗабора = ВыборкаАнализов.КодГруппыЗабора;
			ЗаписьСвязи.омг_КоличествоКонтейнеров = ВыборкаАнализов.КоличествоКонтейнеров;
			ЗаписьСвязи.омг_Преаналитика = ВыборкаАнализов.Преаналитика;
			ЗаписьСвязи.Записать();
		КонецЦикла;
		
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Окончание обновления биоматериалов и контейнеров";
	Сообщение.Сообщить();
	
КонецПроцедуры 

Процедура ОбновлениеДанныхПоСведениямОтЛИС(ОбновляемыеДанные = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбновляемыеДанные = Неопределено Тогда
		ОбновляемыеДанные = Новый Структура;
	КонецЕсли;
	
	СтруктураНастроек = ПолучитьОсновныеНастройки();
	
	ТекстОшибки = "";
	
	#Область ОбщиеДействияПоСервису
	
	Событие = "Интеграция с ЛИС: Обновление номенклатуры";
	
	Если СтруктураНастроек.Количество() = 0 Тогда
		
		ТекстОшибки = "Не установлены настройки интеграции";
		
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
			
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	ДанныеПароля = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ИнтеграцияСЛИС", "Пароль");
	СтруктураНастроек.Вставить("Пароль", ?(ДанныеПароля = Неопределено, "", ДанныеПароля.Получить()));
	
	Попытка
		HTTPСоединение = Новый HTTPСоединение(СтруктураНастроек.Адрес, СтруктураНастроек.Порт, 
			СтруктураНастроек.Пользователь, СтруктураНастроек.Пароль,, СтруктураНастроек.ВремяОжиданияСоединения);
		
	Исключение
		ТекстОшибки = "Не удалось установить соединение. Проверьте настройки.";
		
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
			
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	HTTPЗапрос = Новый HTTPЗапрос("query-dictionaries?format=json");
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("date", ЗаписатьДатуJSON(ТекущаяДата(), ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДата));
	HTTPЗапрос.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(СтруктураЗапроса));
	
	Попытка
		Ответ = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	Исключение
		ТекстОшибки = "Не удалось выполнить запрос к серверу.";
		
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
			
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	Попытка
		СтруктураДанных = ПрочитатьЗначениеJSON(Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8));
		
		Если Не СтруктураДанных.Свойство("analyses") Тогда
			ВызватьИсключение("Не найдено поле ""analyses""");
		КонецЕсли;
		
	Исключение
		ТекстОшибки = "Не удалось прочитать данные из ЛИС, невеный формат.";
		
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
			
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	#КонецОбласти
	
	СтруктураНастроек.Вставить("ОбновляемыеДанные", ОбновляемыеДанные);
	
	ЗагрузкаСправочниковИсследований(СтруктураНастроек, СтруктураДанных);
	
	ЗагрузкаСправочниковБиоматериалов(СтруктураНастроек, СтруктураДанных);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура омг_СинхронизацияДанныхСЛИС(Ключи, Филиал = Неопределено) Экспорт
	
	ОбновляемыеДанные = Новый Структура("Ключи", Ключи);
	ОбновляемыеДанные.Вставить("Филиал", Филиал);
	ОбновлениеДанныхПоСведениямОтЛИС(ОбновляемыеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеОбновленияЗаявок

Функция СоздатьЗаявкуВЛИСИПолучитьКонтейнеры(Заявки, Отмена = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Пациент КАК Пациент,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Пациент.ИНН КАК ПациентИНН,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Пациент.Фамилия КАК ПациентФамилия,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Пациент.Имя КАК ПациентИмя,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Пациент.Отчество КАК ПациентОтчество,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Пациент.Пол КАК ПациентПол,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Пациент.ДатаРождения КАК ПациентДатаРождения,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Ссылка КАК Ссылка,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.НомерЗаявки КАК НомерЗаявки,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Дата КАК Дата,
	               |	ЕСТЬNULL(омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Врач.Наименование, """") КАК ВрачНаименование,
	               |	ЕСТЬNULL(омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Врач.КодАгента, """") КАК ВрачКод,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Пациент.Код КАК ПациентКод,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ПарольЗаявки КАК ПарольЗаявки,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Филиал КАК Филиал,
	               |	ВЫРАЗИТЬ(омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Комментарий КАК СТРОКА(1000)) КАК Примечание,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Филиал.Представление КАК ФилиалПредставление,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.НомерТелефона КАК НомерТелефона,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.АдресЭлПочты КАК АдресЭлПочты,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.СообщитьПоНомеру КАК СообщитьПоНомеру,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ОтправитьПоЭлПочте КАК ОтправитьПоЭлПочте,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ИдентификаторЛИС КАК ИдентификаторЛИС,
	               |	ЕСТЬNULL(омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ИсходнаяЗаявка.ИдентификаторЛИС, """") КАК ИсходнаяЗаявкаИдентификаторЛИС
	               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
	               |ИЗ
	               |	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС
	               |ГДЕ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Ссылка В(&Ссылки)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ДанныеДокумента.Пациент КАК Пациент,
	               |	КонтактнаяИнформация.Тип КАК Тип,
	               |	КонтактнаяИнформация.Вид КАК Вид,
	               |	КонтактнаяИнформация.Представление КАК Представление
	               |ПОМЕСТИТЬ ВТ_ВсяКонтактнаяИнформация
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	               |		ПО ВТ_ДанныеДокумента.Пациент = КонтактнаяИнформация.Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Клиентыомг_КартыСкидок.Ссылка КАК Пациент,
	               |	Клиентыомг_КартыСкидок.НомерСтроки КАК НомерСтроки,
	               |	Клиентыомг_КартыСкидок.НомерКарты КАК НомерКарты
	               |ПОМЕСТИТЬ ВТ_ВсеКартыСкидок
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Клиенты.омг_КартыСкидок КАК Клиентыомг_КартыСкидок
	               |		ПО ВТ_ДанныеДокумента.Пациент = Клиентыомг_КартыСкидок.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Пациент КАК Пациент,
	               |	ВТ_ДанныеДокумента.ПациентИНН КАК ПациентИНН,
	               |	ВТ_ДанныеДокумента.ПациентФамилия КАК ПациентФамилия,
	               |	ВТ_ДанныеДокумента.ПациентИмя КАК ПациентИмя,
	               |	ВТ_ДанныеДокумента.ПациентОтчество КАК ПациентОтчество,
	               |	ВТ_ДанныеДокумента.ПациентПол КАК ПациентПол,
	               |	ВТ_ДанныеДокумента.ПациентДатаРождения КАК ПациентДатаРождения,
	               |	ВТ_ДанныеДокумента.Ссылка КАК Ссылка,
	               |	ВТ_ДанныеДокумента.НомерЗаявки КАК НомерЗаявки,
	               |	ВТ_ДанныеДокумента.Дата КАК Дата,
	               |	ВТ_ДанныеДокумента.ВрачНаименование КАК ВрачНаименование,
	               |	ВТ_ДанныеДокумента.ВрачКод КАК ВрачКод,
	               |	ВТ_ДанныеДокумента.ПациентКод КАК ПациентКод,
	               |	ВТ_ДанныеДокумента.ПарольЗаявки КАК ПарольЗаявки,
	               |	ВТ_ДанныеДокумента.Филиал КАК Филиал,
	               |	ВТ_ДанныеДокумента.Примечание КАК Примечание,
	               |	ВТ_ДанныеДокумента.ФилиалПредставление КАК ФилиалПредставление,
	               |	ЕСТЬNULL(ВТ_ВсеКартыСкидок.НомерКарты, НЕОПРЕДЕЛЕНО) КАК НомерКартыСкидки,
	               |	ВТ_ВсеКартыСкидок.НомерСтроки КАК НомерСтрокиКартыСкидки,
	               |	ВТ_ДанныеДокумента.НомерТелефона КАК НомерТелефона,
	               |	ВТ_ДанныеДокумента.АдресЭлПочты КАК АдресЭлПочты,
	               |	ВТ_ДанныеДокумента.СообщитьПоНомеру КАК СообщитьПоНомеру,
	               |	ВТ_ДанныеДокумента.ОтправитьПоЭлПочте КАК ОтправитьПоЭлПочте,
	               |	ВТ_ДанныеДокумента.ИдентификаторЛИС КАК ИдентификаторЛИС,
	               |	ВТ_ДанныеДокумента.ИсходнаяЗаявкаИдентификаторЛИС КАК ИсходнаяЗаявкаИдентификаторЛИС
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВТ_ВсеКартыСкидок.Пациент КАК Пациент,
	               |			МАКСИМУМ(ВТ_ВсеКартыСкидок.НомерСтроки) КАК НомерСтроки
	               |		ИЗ
	               |			ВТ_ВсеКартыСкидок КАК ВТ_ВсеКартыСкидок
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВТ_ВсеКартыСкидок.Пациент) КАК ВложенныйЗапрос
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсеКартыСкидок КАК ВТ_ВсеКартыСкидок
	               |			ПО ВложенныйЗапрос.Пациент = ВТ_ВсеКартыСкидок.Пациент
	               |				И ВложенныйЗапрос.НомерСтроки = ВТ_ВсеКартыСкидок.НомерСтроки
	               |		ПО ВТ_ДанныеДокумента.Пациент = ВложенныйЗапрос.Пациент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеДокумента.Пациент КАК Пациент,
	               |	ЕСТЬNULL(ВложенныйЗапрос.ЭлектроннаяПочта, """") КАК ЭлектроннаяПочта,
	               |	ЕСТЬNULL(ВложенныйЗапрос.Телефон, """") КАК Телефон
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_ВсяКонтактнаяИнформация.Пациент КАК Пациент,
	               |		МАКСИМУМ(ВЫБОР
	               |				КОГДА ВТ_ВсяКонтактнаяИнформация.Тип = &ТипЭлектроннаяПочта
	               |						И ВТ_ВсяКонтактнаяИнформация.Вид = &ВидЭлектроннаяПочта
	               |					ТОГДА ВЫРАЗИТЬ(ВТ_ВсяКонтактнаяИнформация.Представление КАК СТРОКА(1000))
	               |				ИНАЧЕ """"
	               |			КОНЕЦ) КАК ЭлектроннаяПочта,
	               |		МАКСИМУМ(ВЫБОР
	               |				КОГДА ВТ_ВсяКонтактнаяИнформация.Тип = &ТипТелефон
	               |						И ВТ_ВсяКонтактнаяИнформация.Вид = &ВидТелефон
	               |					ТОГДА ВЫРАЗИТЬ(ВТ_ВсяКонтактнаяИнформация.Представление КАК СТРОКА(1000))
	               |				ИНАЧЕ """"
	               |			КОНЕЦ) КАК Телефон
	               |	ИЗ
	               |		ВТ_ВсяКонтактнаяИнформация КАК ВТ_ВсяКонтактнаяИнформация
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_ВсяКонтактнаяИнформация.Пациент) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ПО ВложенныйЗапрос.Пациент = ВТ_ДанныеДокумента.Пациент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Биоматериалы.Проба КАК Проба,
	               |	Биоматериалы.Биоматериал.Код КАК БиоматериалКод,
	               |	ВЫБОР
	               |		КОГДА АнализыПоКонтейнерам.Номенклатура = АнализыПоКонтейнерам.Набор
	               |			ТОГДА АнализыПоКонтейнерам.Номенклатура.Артикул
	               |		ИНАЧЕ АнализыПоКонтейнерам.Набор.Артикул
	               |	КОНЕЦ КАК АнализКод,
	               |	ВТ_ДанныеДокумента.Ссылка КАК Ссылка,
	               |	Биоматериалы.НомерСтроки КАК НомерСтроки
	               |ИЗ
	               |	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Биоматериалы КАК Биоматериалы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.АнализыПоКонтейнерам КАК АнализыПоКонтейнерам
	               |			ПРАВОЕ СОЕДИНЕНИЕ ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |			ПО (ВТ_ДанныеДокумента.Ссылка = АнализыПоКонтейнерам.Ссылка)
	               |		ПО Биоматериалы.Ссылка = АнализыПоКонтейнерам.Ссылка
	               |			И Биоматериалы.КодСтроки = АнализыПоКонтейнерам.КодСтроки
	               |ГДЕ
	               |	ВТ_ДанныеДокумента.Ссылка В(&Ссылки)
	               |	И НЕ АнализыПоКонтейнерам.ПропускатьПриВыгрузке
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	БиоматериалКод
	               |ИТОГИ
	               |	МАКСИМУМ(Проба),
	               |	МАКСИМУМ(БиоматериалКод)
	               |ПО
	               |	Ссылка,
	               |	НомерСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСДополнительныеСведения.Ссылка КАК Ссылка,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСДополнительныеСведения.Свойство КАК Свойство,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСДополнительныеСведения.Значение, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	               |			ТОГДА """"
	               |		ИНАЧЕ омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСДополнительныеСведения.Значение
	               |	КОНЕЦ КАК Значение,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСДополнительныеСведения.Свойство.КодЛИС КАК СвойствоКодЛИС,
	               |	ЕСТЬNULL(омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСДополнительныеСведения.Значение.КодЛИС, """") КАК ЗначениеКодЛИС,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСДополнительныеСведения.Свойство.ТипЗначения КАК СвойствоТипЗначения
	               |ИЗ
	               |	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ДополнительныеСведения КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСДополнительныеСведения
	               |ГДЕ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСДополнительныеСведения.Ссылка В(&Ссылки)
	               |ИТОГИ ПО
	               |	Ссылка";
	Запрос.УстановитьПараметр("Ссылки", Заявки);
	Запрос.УстановитьПараметр("ТипЭлектроннаяПочта", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("ВидЭлектроннаяПочта", Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
	Запрос.УстановитьПараметр("ТипТелефон", Перечисления.ТипыКонтактнойИнформации.Телефон);
	Запрос.УстановитьПараметр("ВидТелефон", Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
	ПакетыРезультатов = Запрос.ВыполнитьПакет();
	ДокументыРезультатЗапроса = ПакетыРезультатов.Получить(3);
	Если Не ДокументыРезультатЗапроса.Пустой() Тогда
		//ВыборкаКонтактнойИнформации = ПакетыРезультатов.Получить(4).Выбрать();
		ВыборкаБиоматериаловПоДокументам = ПакетыРезультатов.Получить(5).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВыборкаДопЗначенийАнализовПоДокументам = ПакетыРезультатов.Получить(6).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	КонецЕсли;
	ВыборкаДокументов = ДокументыРезультатЗапроса.Выбрать();
	
	УстановитьПривилегированныйРежим(Истина);
	
	СоответствиеЗаявокИКонтейнеров = Новый Соответствие;
	
	СоответствиеНастроекФилиалов = ПолучитьДополнительныеНастройкиПоФилиалам(Истина);
	
	СтруктураНастроек = ПолучитьОсновныеНастройки();
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		Если ВыборкаДокументов.ПациентПол = Перечисления.ПолФизическихЛиц.Женский Тогда
			Пол = 2;
		ИначеЕсли ВыборкаДокументов.ПациентПол = Перечисления.ПолФизическихЛиц.Мужской Тогда
			Пол = 1;
		Иначе
			Пол = 0;
		КонецЕсли; 
		
		Попытка
			ДатаРождения = ЗаписатьДатуJSON(ВыборкаДокументов.ПациентДатаРождения, ФорматДатыJSON.ISO);
		Исключение
			ДатаРождения = ЗаписатьДатуJSON(Дата(1,1,1), ФорматДатыJSON.ISO);
		КонецПопытки;
		
		
		СтруктураПациента = Новый Структура;
		СтруктураПациента.Вставить("misId", Строка(ВыборкаДокументов.Пациент.УникальныйИдентификатор()));
		СтруктураПациента.Вставить("code1", ВыборкаДокументов.ПациентКод);
		СтруктураПациента.Вставить("lastName", ВыборкаДокументов.ПациентФамилия);
		СтруктураПациента.Вставить("firstName", ВыборкаДокументов.ПациентИмя);
		СтруктураПациента.Вставить("middleName", ВыборкаДокументов.ПациентОтчество);
		СтруктураПациента.Вставить("Gender", Пол);
		СтруктураПациента.Вставить("BirthDate", ДатаРождения);

		ДатаДокумента = ЗаписатьДатуJSON(ВыборкаДокументов.Дата, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.ЛокальнаяДатаСоСмещением);
		
		ПарольЗаявки = ВыборкаДокументов.ПарольЗаявки.Получить();
		
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("misId", Строка(ВыборкаДокументов.Ссылка.УникальныйИдентификатор()));
		Если ЗначениеЗаполнено(ВыборкаДокументов.ИсходнаяЗаявкаИдентификаторЛИС) Тогда
			СтруктураДокумента.Вставить("MasterLisId", ВыборкаДокументов.ИсходнаяЗаявкаИдентификаторЛИС);
		КонецЕсли;
		СтруктураДокумента.Вставить("nr", ВыборкаДокументов.НомерЗаявки);
		СтруктураДокумента.Вставить("date", ДатаДокумента);
		СтруктураДокумента.Вставить("samplingDate", ДатаДокумента);
		СтруктураДокумента.Вставить("doctorName", ВыборкаДокументов.ВрачНаименование);
		СтруктураДокумента.Вставить("doctorCode", СокрЛП(ВыборкаДокументов.ВрачКод));
		СтруктураДокумента.Вставить("password", ПарольЗаявки);
		СтруктураДокумента.Вставить("note", ВыборкаДокументов.Примечание);
		СтруктураДокумента.Вставить("iin", ВыборкаДокументов.ПациентИНН);
		Если ЗначениеЗаполнено(ВыборкаДокументов.ИдентификаторЛИС) и Не ВыборкаДокументов.ИдентификаторЛИС = 0 Тогда
			СтруктураДокумента.Вставить("lisId", ВыборкаДокументов.ИдентификаторЛИС);
		КонецЕсли;
		
		НомерКартыСкидки = ПроверитьИЗаписатьНомерКартыСкидки(ВыборкаДокументов);
		
		СтруктураДокумента.Вставить("DiscountCard", НомерКартыСкидки);
		
		Если Не ВыборкаДокументов.АдресЭлПочты = "" И ВыборкаДокументов.ОтправитьПоЭлПочте Тогда
			СтруктураДокумента.Вставить("patient_email_address", ВыборкаДокументов.АдресЭлПочты);
		КонецЕсли;
		Если Не ВыборкаДокументов.НомерТелефона = "" И ВыборкаДокументов.СообщитьПоНомеру Тогда
			Телефон = омг_ИнтеграцияСЛИСОбщегоНазначенияКлиентСервер.УбратьСимволыИзТелефона(ВыборкаДокументов.НомерТелефона);
			СтруктураДокумента.Вставить("Phone", Прав(Телефон, 10));
		КонецЕсли;
		
		ВыборкаДопЗначенийАнализовПоДокументам.Сбросить();
		Если ВыборкаДопЗначенийАнализовПоДокументам.НайтиСледующий(ВыборкаДокументов.Ссылка, "Ссылка") Тогда
			ВыборкаДопЗначенийАнализов = ВыборкаДопЗначенийАнализовПоДокументам.Выбрать();
			Пока ВыборкаДопЗначенийАнализов.Следующий() Цикл
				
				ЭтоПеречисление = ТипЗнч(ВыборкаДопЗначенийАнализов.Значение) = Тип("СправочникСсылка.омг_ЗначенияДопПолейЛИС");
				
				ЗначениеДопПоля = ?(ЭтоПеречисление, ВыборкаДопЗначенийАнализов.ЗначениеКодЛИС, ВыборкаДопЗначенийАнализов.Значение);
				
				Если Не ТипЗнч(ЗначениеДопПоля) = Тип("Булево") Или ЗначениеДопПоля = Истина Тогда
					Если ТипЗнч(ЗначениеДопПоля) = Тип("Дата") Тогда
						СтруктураДокумента.Вставить(ВыборкаДопЗначенийАнализов.СвойствоКодЛИС, Строка(ЗначениеДопПоля)); 
					ИначеЕсли ТипЗнч(ЗначениеДопПоля) = Тип("Число") Тогда
						СтруктураДокумента.Вставить(ВыборкаДопЗначенийАнализов.СвойствоКодЛИС, Формат(ЗначениеДопПоля, "ЧРД=.; ЧГ=")); 
					Иначе
						СтруктураДокумента.Вставить(ВыборкаДопЗначенийАнализов.СвойствоКодЛИС, ЗначениеДопПоля); 
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
			
		МассивБиоматериалов = Новый Массив;
		
		Если Не Отмена Тогда
			ВыборкаБиоматериаловПоДокументам.Сбросить();
			Если ВыборкаБиоматериаловПоДокументам.НайтиСледующий(ВыборкаДокументов.Ссылка) Тогда
				ВыборкаБиоматериалов = ВыборкаБиоматериаловПоДокументам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаБиоматериалов.Следующий() Цикл
					
					МассивАнализов = Новый Массив;
					
					ВыборкаАнализов = ВыборкаБиоматериалов.Выбрать();
					
					Пока ВыборкаАнализов.Следующий() Цикл
						СтруктураАнализа = Новый Структура("code", ВыборкаАнализов.АнализКод);
						МассивАнализов.Добавить(СтруктураАнализа);
					КонецЦикла;
					
					СтруктураБиоматериала = Новый Структура("barcode, biomaterialCode, orders", 
						ВыборкаБиоматериалов.Проба, ВыборкаБиоматериалов.БиоматериалКод, МассивАнализов);
					
					МассивБиоматериалов.Добавить(СтруктураБиоматериала);
					
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
			
		СтруктураЗаявки = Новый Структура("patient, referral, assays", СтруктураПациента, СтруктураДокумента, МассивБиоматериалов);
		
		ТекстОшибки = "";
		
		#Область ОбщиеДействияПоСервису
		
		Событие = "Интеграция с ЛИС: Отправка заявки в ЛИС";
		
		НастройкиПоФилиалу = СоответствиеНастроекФилиалов.Получить(ВыборкаДокументов.Филиал);
		
		Если НастройкиПоФилиалу = Неопределено Тогда
			
			ТекстОшибки = "Не установлены настройки интеграции по филиалу """ + ВыборкаДокументов.ФилиалПредставление + """";
			
			ОписаниеОшибки = ОписаниеОшибки();
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки);
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			
			Продолжить;
		КонецЕсли;
		
		//ДанныеПароля = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ИнтеграцияСЛИС", "Пароль");
		//СтруктураНастроек.Вставить("Пароль", ?(ДанныеПароля = Неопределено, "", ДанныеПароля.Получить()));
		
		Попытка
			HTTPСоединение = Новый HTTPСоединение(НастройкиПоФилиалу.Адрес, НастройкиПоФилиалу.Порт, 
				НастройкиПоФилиалу.Пользователь, НастройкиПоФилиалу.Пароль,, СтруктураНастроек.ВремяОжиданияСоединенияСозданиеНаправления);
			
		Исключение
			ТекстОшибки = "Не удалось установить соединение. Проверьте настройки.";
			
			ОписаниеОшибки = ОписаниеОшибки();
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки);
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			Продолжить;
		КонецПопытки;
		
		//Если СтруктураДокумента.Свойство("lisId") Тогда
		//	HTTPЗапрос = Новый HTTPЗапрос("query-edit-referral?format=json");
		//Иначе
			HTTPЗапрос = Новый HTTPЗапрос("query-create-referral?format=json");
		//КонецЕсли;
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Windows, Символы.Таб);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
		ЗаписатьJSON(ЗаписьJSON, СтруктураЗаявки);
		ТелоЗапроса = ЗаписьJSON.Закрыть();

		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		
		Попытка
			Ответ = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
		Исключение
			ТекстОшибки = "Не удалось выполнить запрос к серверу. Подробности в журнале регистрации.";
			
			ОписаниеОшибки = ОписаниеОшибки();
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки);
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			Продолжить;
		КонецПопытки;
		
		Попытка
			
			ТелоОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			СтруктураДанных = ПрочитатьЗначениеJSON(ТелоОтвета);
			
			ЗаписьJSON = Новый ЗаписьJSON;
			ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Windows, Символы.Таб);
			ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
			ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
			ТелоОтвета = ЗаписьJSON.Закрыть();
			
		Исключение
			ТекстОшибки = "Не удалось прочитать данные из ЛИС, невеный формат.";
			
			ОписаниеОшибки = ОписаниеОшибки();
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки + "
				|Тело ответа: " + ТелоОтвета);
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			Продолжить;
		КонецПопытки;
		
		#КонецОбласти
		
		Если Не СтруктураДанных.Свойство("referral") 
			Или Не СтруктураДанных.referral.Свойство("lisId") 
			Или Не ЗначениеЗаполнено(СтруктураДанных.referral.lisId) Тогда
			
			Если Не ЭтоОтменаЗаявки(СтруктураДанных) Тогда
			
				ТекстОшибки = "Не удалось отправить заявку в ЛИС. Подробности в журнале регистрации.";
				
				Если СтруктураДанных.Свойство("error") Тогда
					ТекстОшибки = ТекстОшибки + "
					|Ошибка ЛИС: " + СтруктураДанных.error;
				КонецЕсли;
				
				ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
					Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ТелоОтвета);
					
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ТекстОшибки;
				Сообщение.Сообщить();
			
			КонецЕсли;
			
			МассивОшибок = Новый Массив;
			
			Если СтруктураДанных.Свойство("error") Тогда
				МассивОшибок.Добавить(СтруктураДанных.error);
			КонецЕсли;
			
			СтруктураОтветаПоЗаявке = Новый Структура("Ошибки, Контейнеры, ЕстьКритическиеОшибки, ТелоОтвета, ТелоЗапроса", 
				МассивОшибок, Новый Массив, ,ТелоОтвета, ТелоЗапроса);
			
			ОбработатьWarnings(СтруктураДанных, СтруктураОтветаПоЗаявке, ВыборкаДокументов, Событие, МассивОшибок);
			
			СоответствиеЗаявокИКонтейнеров.Вставить(ВыборкаДокументов.Ссылка, СтруктураОтветаПоЗаявке);
			
			Продолжить;
			
		КонецЕсли;
		
		
		Контейнеры = Неопределено;
		СтруктураДанных.Свойство("containers", Контейнеры);
		
		Если Контейнеры = Неопределено Тогда
			Контейнеры = Новый Массив;
		КонецЕсли;
		
		Если СтруктураДанных.Свойство("containers") Тогда
			СоответствиеКонтейнеров = Новый Соответствие;
			Для Каждого ДанныеКонтейнера Из СтруктураДанных.containers Цикл
				ТекущееКоличество = СоответствиеКонтейнеров.Получить(ДанныеКонтейнера.code);
				Если ТекущееКоличество = Неопределено Тогда
					СоответствиеКонтейнеров.Вставить(ДанныеКонтейнера.code, 
						?(ДанныеКонтейнера.Свойство("planCount"), ДанныеКонтейнера.planCount, 1));
				Иначе
					СоответствиеКонтейнеров.Вставить(ДанныеКонтейнера.code, ТекущееКоличество + 
						?(ДанныеКонтейнера.Свойство("planCount"), ДанныеКонтейнера.planCount, 1));
				КонецЕсли;
			КонецЦикла;
			Контейнеры.Очистить();
			Для Каждого ДанныеКОнтейнера ИЗ СоответствиеКонтейнеров Цикл
				Контейнеры.Добавить(Новый Структура("code, planCount", ДанныеКонтейнера.Ключ, ДанныеКонтейнера.Значение));
			КонецЦикла;
		КонецЕсли;
		
		СтруктураОтветаПоЗаявке = Новый Структура("Филиал, Контейнеры, ТелоОтвета, ТелоЗапроса", ВыборкаДокументов.Филиал, Контейнеры, ТелоОтвета, ТелоЗапроса);
		СтруктураОтветаПоЗаявке.Вставить("ИдентификаторЛИС", СтруктураДанных.referral.lisId);
		
		ОбработатьWarnings(СтруктураДанных, СтруктураОтветаПоЗаявке, ВыборкаДокументов, Событие, МассивОшибок);
		
		СоответствиеЗаявокИКонтейнеров.Вставить(ВыборкаДокументов.Ссылка, СтруктураОтветаПоЗаявке);
		
	КонецЦикла;
	
	ТаблицаКонтейнеров = Новый ТаблицаЗначений;
	ТаблицаКонтейнеров.Колонки.Добавить("КодКонтейнера", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ТаблицаКонтейнеров.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(15));
	ТаблицаКонтейнеров.Колонки.Добавить("Филиал", Новый ОписаниеТипов("СправочникСсылка.Филиалы"));
	
	Для Каждого Заявка Из СоответствиеЗаявокИКонтейнеров Цикл
		Для Каждого Контейнер Из Заявка.Значение.Контейнеры Цикл
			СтрокаТаблицы = ТаблицаКонтейнеров.Добавить();
			СтрокаТаблицы.КодКонтейнера = Контейнер.code;
			СтрокаТаблицы.Количество = ?(Контейнер.Свойство("planCount"), Контейнер.planCount, 1);
			СтрокаТаблицы.Филиал = Заявка.Значение.Филиал;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаКонтейнеров.Свернуть("КодКонтейнера, Филиал", "Количество");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаКонтейнеров.КодКонтейнера КАК КодКонтейнера,
	               |	ТаблицаКонтейнеров.Количество КАК Количество,
	               |	ТаблицаКонтейнеров.Филиал КАК Филиал
	               |ПОМЕСТИТЬ ВТ_ТаблицаКонтейнеров
	               |ИЗ
	               |	&ТаблицаКонтейнеров КАК ТаблицаКонтейнеров
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВнутренняяЛаборатория_ВидыКонтейнеров.Ссылка КАК Ссылка,
	               |	ВнутренняяЛаборатория_ВидыКонтейнеров.омг_КодЛИС КАК Код,
	               |	ВТ_ТаблицаКонтейнеров.Количество КАК Количество,
	               |	ВТ_ТаблицаКонтейнеров.Филиал КАК Филиал
	               |ИЗ
	               |	ВТ_ТаблицаКонтейнеров КАК ВТ_ТаблицаКонтейнеров
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВнутренняяЛаборатория_ВидыКонтейнеров КАК ВнутренняяЛаборатория_ВидыКонтейнеров
	               |		ПО ВТ_ТаблицаКонтейнеров.КодКонтейнера = ВнутренняяЛаборатория_ВидыКонтейнеров.омг_КодЛИС
	               |			И ВТ_ТаблицаКонтейнеров.Филиал = ВнутренняяЛаборатория_ВидыКонтейнеров.омг_Филиал";
	Запрос.УстановитьПараметр("ТаблицаКонтейнеров", ТаблицаКонтейнеров);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКонтейнеров = РезультатЗапроса.Выбрать();
	
	СтруктураПоиска = Новый Структура("Филиал, Код");
	Для Каждого Заявка Из СоответствиеЗаявокИКонтейнеров Цикл
		МассивКонтейнеров = Новый Массив;
	
		Для Каждого Контейнер Из Заявка.Значение.Контейнеры Цикл
			
			СтруктураПоиска.Филиал = Заявка.Значение.Филиал;
			СтруктураПоиска.Код = Контейнер.code;
			ВыборкаКонтейнеров.Сбросить();
			Если ВыборкаКонтейнеров.НайтиСледующий(СтруктураПоиска) Тогда
				МассивКонтейнеров.Добавить(Новый Структура("Контейнер, Количество", ВыборкаКонтейнеров.Ссылка, ВыборкаКонтейнеров.Количество));
			КонецЕсли;
		КонецЦикла;
		
		Заявка.Значение.Контейнеры = МассивКонтейнеров;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СоответствиеЗаявокИКонтейнеров;
	
КонецФункции

Функция ПрочитатьФайлИзFTP(ПутьКФайлу) Экспорт
	
	СтруктураНастроек = ПолучитьОсновныеНастройки();
	
	Порт = ?(ЗначениеЗаполнено(СтруктураНастроек.ПортFTP), СтруктураНастроек.ПортFTP, Неопределено);
	
	ЗащищенноеСоединение = ?(СтруктураНастроек.ЗащищенноеСоединениеFTP, Новый ЗащищенноеСоединениеOpenSSL, Неопределено);
	
	Попытка
		СоединениеFTP = Новый FTPСоединение(СтруктураНастроек.АдресFTP, Порт, 
			СтруктураНастроек.ЛогинFTP, СтруктураНастроек.ПарольFTP,, Истина, 5, ЗащищенноеСоединение);
		
	Исключение
		
		Событие = "Интеграция с ЛИС: Чтение бланка с FTP";
		
		ТекстОшибки = "Чтение файла бланка с FTP. Не удалось установить соединение. Проверьте настройки.";
		
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
			
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Попытка
		СоединениеFTP.УстановитьТекущийКаталог("/" + СтруктураНастроек.ПутьККаталогуFTP);
	Исключение
		
		Событие = "Интеграция с ЛИС: Чтение бланка с FTP";
		
		ТекстОшибки = "Чтение файла бланка с FTP. Не удалось установить каталог хранения. Проверьте настройки.";
		
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
			
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	Попытка
		
		Расширение = ОбщегоНазначения.ПолучитьРасширениеФайла(ПутьКФайлу);
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
		
		СоединениеFTP.Получить(ПутьКФайлу, ИмяВременногоФайла);
		
	Исключение
		
		
		Событие = "Интеграция с ЛИС: Чтение бланка с FTP";
		
		ТекстОшибки = "Чтение файла бланка с FTP. Неверный путь к файлу.";
		
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
			Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
			
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		
		Возврат Неопределено;
		
	КонецПопытки;
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
	
	Возврат ДвоичныеДанные;
	
КонецФункции

Функция БракованаяПроба(СтрокаБланка)
	
	Возврат СтрНайти(СтрокаБланка.НаименованиеИсследованияЛИС, "брак") > 0 
		И СтрНайти(СтрокаБланка.НаименованиеИсследованияЛИС, "проб") > 0;
	
КонецФункции

Функция ПолучитьХешДокумента(ЗаписьXML, Документ)
	
	ЗаписьXML.УстановитьСтроку();
	ЗаписатьXML(ЗаписьXML, Документ);
	ДокументXML = ЗаписьXML.Закрыть();
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.CRC32);
	Хеширование.Добавить(ДокументXML);
	НовыйХеш = Хеширование.ХешСумма;

	Возврат НовыйХеш;
	
КонецФункции

Функция ЕстьИзмененияДокумента(ЗаписьXML, Документ, ИсходныйХеш)
	
	НовыйХеш = ПолучитьХешДокумента(ЗаписьXML, Документ);
	
	Возврат Не НовыйХеш = ИсходныйХеш;
	
КонецФункции

Процедура ОбновлениеСостоянияОтправленныхЗаявокВЛИС(Заявка = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ТекстыОшибокОбновленияСтатусов = ПолучитьСписокПропускаемыхОшибок();
	
	СоответствиеЗаявок = ПроверитьСтатусЗаявкиВЛИС(Заявка);
	
	СтруктураПоиска = Новый Структура("ИдентификаторБланка");
	
	Сеанс = ПолучитьТекущийСеансИнформационнойБазы();
	
	ВыполнениеВФоновомЗадании = Не Сеанс.ПолучитьФоновоеЗадание() = Неопределено;
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ИзмененныеДокументы = Новый Соответствие;
	
	Для Каждого СоответствиеДокумента Из СоответствиеЗаявок Цикл
		Попытка
			
			НачатьТранзакцию();
			
			Если Заявка = Неопределено Тогда
				ЗаблокироватьДанныеДляРедактирования(СоответствиеДокумента.Ключ);
			КонецЕсли;
			
			БланкиРезультатов = РегистрыСведений.омг_БланкиРезультатовИсследованийЛИС.СоздатьНаборЗаписей();
			БланкиРезультатов.Отбор.Заявка.Установить(СоответствиеДокумента.Ключ);
			БланкиРезультатов.Прочитать();
			
			Для Каждого ДанныеБланка ИЗ СоответствиеДокумента.Значение.Бланки Цикл
				
				НоваяЗапись = Истина;
				Для Каждого ЗаписьБланков Из БланкиРезультатов Цикл
					Если ЗаписьБланков.ИдентификаторБланка = ДанныеБланка.ИдентификаторБланка Тогда 
						ЗаполнитьЗначенияСвойств(ЗаписьБланков, ДанныеБланка);
						НоваяЗапись = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если НоваяЗапись Тогда
					ЗаписьБланков = БланкиРезультатов.Добавить();
					ЗаписьБланков.Заявка = СоответствиеДокумента.Ключ;
					ЗаполнитьЗначенияСвойств(ЗаписьБланков, ДанныеБланка);
				КонецЕсли;
			КонецЦикла;
			
			БланкиРезультатов.Записать();
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ТекстОшибки = "Не удалось обновить данные по исследованию документа """ + СоответствиеДокумента.Ключ + """";
			
			СообщенияФона = ПолучитьСообщенияПользователю(Истина);

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки + ". Подробности в журнале регистрации.";
			Сообщение.КлючДанных = СоответствиеДокумента.Ключ;
			Сообщение.Сообщить();
			
			ТекстКомментария = "";
			
			Если Не ВыполнениеВФоновомЗадании Тогда 
				Для Каждого Сообщение Из СообщенияФона Цикл
					ТекстКомментария = ТекстКомментария + Символы.ПС + Сообщение.Текст;
				КонецЦикла;
			КонецЕсли;
			
			ЗаписьЖурналаРегистрации("ЛИС: Обновление результатов по исследованию в ЛИС",
				УровеньЖурналаРегистрации.Ошибка, Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль,
				ТекстОшибки, ОписаниеОшибки() + ТекстКомментария);
			
			ОтменитьТранзакцию();
			
			ЗафиксироватьОшибочныйДокумент(СоответствиеДокумента.Ключ, ТекстОшибки + Символы.ПС + ОписаниеОшибки(), ТекстыОшибокОбновленияСтатусов);

		КонецПопытки;
	КонецЦикла;
	
	СоответствиеБланковЗаявкам = ПолучитьБланкРезультатаВБинарномВиде(Заявка);
	
	СтруктураНастроек = ПолучитьОсновныеНастройки();

	ВременныеФайлы = Новый Массив;
	
	Для Каждого СоответствиеДокумента Из СоответствиеЗаявок Цикл
		
		Бланки = СоответствиеБланковЗаявкам.Получить(СоответствиеДокумента.Ключ);
		
		Если Бланки = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Порт = ?(ЗначениеЗаполнено(СтруктураНастроек.ПортFTP), СтруктураНастроек.ПортFTP, Неопределено);
		
		ЗащищенноеСоединение = ?(СтруктураНастроек.ЗащищенноеСоединениеFTP, Новый ЗащищенноеСоединениеOpenSSL, Неопределено);
		
		Попытка
			СоединениеFTP = Новый FTPСоединение(СтруктураНастроек.АдресFTP, Порт, 
				СтруктураНастроек.ЛогинFTP, СтруктураНастроек.ПарольFTP,, Истина, 5, ЗащищенноеСоединение);
			
		Исключение
			
			Событие = "Интеграция с ЛИС: Отправка бланка на FTP";
			
			ТекстОшибки = "Отправка результата на FTP. Не удалось установить соединение. Проверьте настройки.";
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			
			Продолжить;
			
		КонецПопытки;
		
		Попытка
			СоединениеFTP.УстановитьТекущийКаталог("/" + СтруктураНастроек.ПутьККаталогуFTP);
		Исключение
			
			Событие = "Интеграция с ЛИС: Отправка бланка на FTP";
			
			ТекстОшибки = "Отправка результата на FTP. Не удалось установить каталог хранения. Проверьте настройки.";
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			
			Продолжить;
			
		КонецПопытки;
		
		БланкиРезультатов = РегистрыСведений.омг_БланкиРезультатовИсследованийЛИС.СоздатьНаборЗаписей();
		БланкиРезультатов.Отбор.Заявка.Установить(СоответствиеДокумента.Ключ);
		БланкиРезультатов.Прочитать();
		
		Для Каждого ДанныеБланка Из Бланки Цикл
			
			Для Каждого ЗаписьБланков Из БланкиРезультатов Цикл
				Если ЗаписьБланков.ИдентификаторБланка = ДанныеБланка.Значение.ИдентификаторБланка Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ЗаписьБланков.БланкПолучен Тогда
				Продолжить;
			КонецЕсли;
			
			СимволСлеш = 0;
			Для НСимвола = 1 По СтрДлина(ДанныеБланка.Значение.ПутьКФайлу) Цикл
				Если Сред(ДанныеБланка.Значение.ПутьКФайлу, НСимвола, 1) = "\" Тогда
					СимволСлеш = НСимвола;
				КонецЕсли;
			КонецЦикла;
			
			Каталог = Сред(ДанныеБланка.Значение.ПутьКФайлу, 1, СимволСлеш -1);
			
			Каталоги = СтрРазделить(СокрЛП(Каталог), "\");
			
			ПолныйПуть = СтруктураНастроек.ПутьККаталогуFTP;
			
			КоличествоПопыток = 10;
			
			ПрерватьПолучениеБланка = Ложь;
			
			Для Каждого Каталог Из Каталоги Цикл
				
				Если СоединениеFTP.НайтиФайлы(Каталог).Количество() = 0 Тогда
					СоединениеFTP.СоздатьКаталог(Каталог);
				КонецЕсли;
				
				ПолныйПуть = ПолныйПуть + "/" + Каталог;
				
				Для НомерПопытки = 1 По КоличествоПопыток Цикл
					Попытка
						СоединениеFTP.УстановитьТекущийКаталог("/" + ПолныйПуть);
						Прервать;
					Исключение
						Если НомерПопытки = КоличествоПопыток Тогда
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = "Документ " + СоответствиеДокумента.Ключ + ". Не удалось установить каталог хранения бланка. Подробности в журнале регистрации.";
							Сообщение.Сообщить();
							ЗаписьЖурналаРегистрации("Интеграция с ЛИС: Получение бланка результата", УровеньЖурналаРегистрации.Ошибка,
								Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, "Ошибка получения каталога", 
								"Документ " + СоответствиеДокумента.Ключ + ". Путь к файлу: " + ДанныеБланка.Значение.ПутьКФайлу + ". Ошибка: " + Символы.ПС + ОписаниеОшибки()); 
							ЗафиксироватьОшибочныйДокумент(СоответствиеДокумента.Ключ, ОписаниеОшибки(), ТекстыОшибокОбновленияСтатусов);
							ПрерватьПолучениеБланка = Истина; 
						КонецЕсли;
					КонецПопытки;
				КонецЦикла;
				Если ПрерватьПолучениеБланка Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ПрерватьПолучениеБланка Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяФайлаНаFTP = Сред(ДанныеБланка.Значение.ПутьКФайлу, СимволСлеш + 1, СтрДлина(ДанныеБланка.Значение.ПутьКФайлу) - СимволСлеш);
			
			Расширение = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяФайлаНаFTP);
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
			
			ВременныеФайлы.Добавить(ИмяВременногоФайла);
			
			БланкРезультата = ДанныеБланка.Значение.Файл;
			БланкРезультата.Записать(ИмяВременногоФайла);
			
			ИмяФайлаНаFTP = "/" + ПолныйПуть + "/" + ИмяФайлаНаFTP;
			Если СоединениеFTP.НайтиФайлы(ИмяФайлаНаFTP).Количество() > 0 Тогда
				СоединениеFTP.Удалить(ИмяФайлаНаFTP);
			КонецЕсли;
			
			СоединениеFTP.Записать(ИмяВременногоФайла, ИмяФайлаНаFTP);
			                                        
			ЗаписьБланков.БланкПолучен = Истина;
			
		КонецЦикла;
		
		БланкиРезультатов.Записать();
		
		Для Каждого ИмяВременногоФайла Из ВременныеФайлы Цикл
			УдалитьФайлы(ИмяВременногоФайла);
		КонецЦикла;
		
		
	КонецЦикла;
	
	Для Каждого СоответствиеДокумента Из СоответствиеЗаявок Цикл
		
		ДокументЗаявка = ИзмененныеДокументы.Получить(СоответствиеДокумента.Ключ);
		Если ДокументЗаявка = Неопределено Тогда	
			ДокументЗаявка = СоответствиеДокумента.Ключ.ПолучитьОбъект(); 
		КонецЕсли;
		
		ХешДокумента = ПолучитьХешДокумента(ЗаписьXML, ДокументЗаявка);
		
		ДокументЗаявка.Выполнена = СоответствиеДокумента.Значение.Завершено;

		ЕстьБрак = Ложь;
		ЕстьНеВыполненные = Ложь;
		ЕстьВыполненные = Ложь;
		
		БланкиРезультатов = РегистрыСведений.омг_БланкиРезультатовИсследованийЛИС.СоздатьНаборЗаписей();
		БланкиРезультатов.Отбор.Заявка.Установить(СоответствиеДокумента.Ключ);
		БланкиРезультатов.Прочитать();
		
		Для Каждого СтрокаБланка Из БланкиРезультатов Цикл
			Если Не СтрокаБланка.Выполнено Или Не СтрокаБланка.БланкПолучен Тогда
				ДокументЗаявка.Выполнена = Ложь;
				ЕстьНеВыполненные = Истина;
			ИначеЕсли Не ДокументЗаявка.Статус = Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Отменена
				И Не ДокументЗаявка.Статус = Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Закрыта Тогда
				
				Если БракованаяПроба(СтрокаБланка) Тогда
					ЕстьБрак = Истина;
				Иначе
					ЕстьВыполненные = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если ЕстьБрак Тогда
			ДокументЗаявка.Статус = Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ЕстьБракованныеПробы;
		ИначеЕсли ЕстьНеВыполненные И ЕстьВыполненные Тогда
			ДокументЗаявка.Статус = Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ПолученЧастичныйРезультатИзЛИС;
		ИначеЕсли ЕстьВыполненные Тогда
			ДокументЗаявка.Статус = Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ПолученРезультатИзЛИС;
		Иначе
			ДокументЗаявка.Статус = Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ОтправленаВЛИС;
		КонецЕсли;
		
		Если ДокументЗаявка.Выполнена Тогда
			ДокументЗаявка.ДатаВыполнения = СоответствиеДокумента.Значение.ДатаВыполнения;
		КонецЕсли;
		
		Попытка
			
			Если ЕстьИзмененияДокумента(ЗаписьXML, ДокументЗаявка, ХешДокумента) Тогда
				ДокументЗаявка.ДополнительныеСвойства.Вставить("ПропускПроверкиДатыЗапрета");
				
				ИзмененныеДокументы.Вставить(ДокументЗаявка.Ссылка, ДокументЗаявка);
			КонецЕсли;
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось записать документ " + ДокументЗаявка.Ссылка + ". Подробности в журнале регистрации.";
			Сообщение.КлючДанных = ДокументЗаявка.Ссылка;
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Интеграция с ЛИС: Получение бланка результата. Запись документа. ", УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, "Ошибка записи документа", 
				"Документ " + ДокументЗаявка.Ссылка + ". Ошибка: " + Символы.ПС + ОписаниеОшибки()); 
			ЗафиксироватьОшибочныйДокумент(ДокументЗаявка.Ссылка, ОписаниеОшибки(), ТекстыОшибокОбновленияСтатусов);
		КонецПопытки;

		
	КонецЦикла;
	
	Для Каждого ЭлементИзменений Из ИзмененныеДокументы Цикл
		Попытка
			ДокументЗаявка = ЭлементИзменений.Значение;
			НачатьТранзакцию();
			Если ДокументЗаявка.Проведен Тогда
				ДокументЗаявка.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Иначе
				ДокументЗаявка.Записать();
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		Исключение                    
			ОтменитьТранзакцию();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось записать документ " + ДокументЗаявка.Ссылка + ". Подробности в журнале регистрации.";
			Сообщение.КлючДанных = ДокументЗаявка.Ссылка;
			Сообщение.Сообщить();
			
			ЗаписьЖурналаРегистрации("Интеграция с ЛИС: Запись документа после изменений от ЛИС. ", УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, "Ошибка записи документа", 
				"Документ " + ДокументЗаявка.Ссылка + ". Ошибка: " + Символы.ПС + ОписаниеОшибки()); 
			ЗафиксироватьОшибочныйДокумент(ДокументЗаявка.Ссылка, ОписаниеОшибки(), ТекстыОшибокОбновленияСтатусов);
		КонецПопытки;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура омг_ПроверкаВыполненияЗаявокЛИС() Экспорт
	
	ОбновлениеСостоянияОтправленныхЗаявокВЛИС();
	
КонецПроцедуры

Функция ПроверитьИЗаписатьНомерКартыСкидки(ВыборкаДокументов)
	
	НомерКартыСкидки = "";
	
	
	Если ВыборкаДокументов.НомерКартыСкидки = "" Тогда
		ДанныеКлиента = ИнтеграцияЕИП.ПоискКартыПоИИН(ВыборкаДокументов.ПациентИНН);
		Если ЗначениеЗаполнено(ДанныеКлиента.НомерКарты) Тогда
			НомерКартыСкидки = ДанныеКлиента.НомерКарты;
			
			УстановитьПривилегированныйРежим(Истина);
			
			ПациентОбъект = ВыборкаДокументов.Пациент.ПолучитьОбъект();
			ПациентОбъект.омг_КартыСкидок[ВыборкаДокументов.НомерСтрокиКартыСкидки - 1].НомерКарты = НомерКартыСкидки;
			ПациентОбъект.ОбменДанными.Загрузка = Истина;
			ПациентОбъект.Записать();
			
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	ИначеЕсли Не ВыборкаДокументов.НомерКартыСкидки = Неопределено Тогда
		НомерКартыСкидки = ВыборкаДокументов.НомерКартыСкидки;
	КонецЕсли;
	
	Возврат НомерКартыСкидки;
	
КонецФункции

Процедура ЗафиксироватьОшибочныйДокумент(Документ, Ошибка, ТекстыОшибокОбновленияСтатусов) Экспорт
	
	Для Каждого ТекстОшибки Из ТекстыОшибокОбновленияСтатусов Цикл
		Если СтрНайти(НРег(Ошибка), НРег(ТекстОшибки)) > 0 Тогда 
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запись = РегистрыСведений.омг_РезультатыОбменаССервисами.СоздатьМенеджерЗаписи();
	Запись.Документ = Документ;
	Запись.ОписаниеОшибки = Ошибка;
	Запись.ДатаОшибки = ТекущаяДата();
	Запись.Записать();
	
КонецПроцедуры

Процедура УдалитьЗаписьПоОшибкам(Ссылка)
	
	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запись = РегистрыСведений.омг_РезультатыОбменаССервисами.СоздатьМенеджерЗаписи();
	Запись.Документ = Ссылка;
	Запись.Удалить();
	
КонецПроцедуры

Функция ЕстьОшибкиОбновленияСтатуса(Документ) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_РезультатыОбменаССервисами.Документ КАК Документ,
	               |	омг_РезультатыОбменаССервисами.ОписаниеОшибки КАК ОписаниеОшибки
	               |ИЗ
	               |	РегистрСведений.омг_РезультатыОбменаССервисами КАК омг_РезультатыОбменаССервисами
	               |ГДЕ
	               |	омг_РезультатыОбменаССервисами.Документ = &Документ";
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

Функция ПроверитьСтатусЗаявкиВЛИС(Заявки = Неопределено, ПроверкаСостояния = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_РезультатыОбменаССервисами.Документ КАК Документ
	               |ПОМЕСТИТЬ ВТ_Ошибки
	               |ИЗ
	               |	РегистрСведений.омг_РезультатыОбменаССервисами КАК омг_РезультатыОбменаССервисами
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Ссылка КАК Ссылка,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Дата КАК Дата,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.НомерЗаявки КАК НомерЗаявки,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Филиал КАК Филиал,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Филиал.Представление КАК ФилиалПредставление,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Представление КАК ПредставлениеДокумента,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ИдентификаторЛИС КАК ИдентификаторЛИС,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.НомерЗаявки КАК НомерЗаявки1
	               |ИЗ
	               |	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Ошибки КАК ВТ_Ошибки
	               |		ПО (ВТ_Ошибки.Документ = омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Ссылка)
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ВсеЗаявки
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Ссылка В (&Заявки)
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ПроверкаСостояния
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ВЫБОР
	               |						КОГДА &ВсеЗаявки
	               |							ТОГДА НЕ омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Выполнена
	               |						ИНАЧЕ ИСТИНА
	               |					КОНЕЦ
	               |					И НЕ омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Статус = &СтатусОтмена
	               |					И НЕ омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Статус = &СтатусОткрыта
	               |					И НЕ омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Статус = &СтатусЗакрыта
	               |					И НЕ омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Статус = &СтатусОтклонена
	               |		КОНЕЦ
	               |	И НЕ омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.ИдентификаторЛИС = 0
	               |	И омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Проведен
	               |	И ВЫБОР
	               |			КОГДА &ВсеЗаявки
	               |				ТОГДА ВТ_Ошибки.Документ ЕСТЬ NULL
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("Заявки", Заявки);
	Запрос.УстановитьПараметр("ПроверкаСостояния", ПроверкаСостояния);
	Запрос.УстановитьПараметр("СтатусОтмена", Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Отменена);
	Запрос.УстановитьПараметр("СтатусОткрыта", Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Открыта);
	Запрос.УстановитьПараметр("СтатусЗакрыта", Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.Закрыта);
	Запрос.УстановитьПараметр("СтатусОтклонена", Перечисления.омг_СтатусыЗаякиНаЛабИсследованиеВЛИС.ОтклоненоЛИС);
	Запрос.УстановитьПараметр("ВсеЗаявки", ?(Заявки = Неопределено, Истина, Ложь));
	РезультатЗапроса = Запрос.Выполнить();
	
	СоответствиеРезультатов = Новый Соответствие;
	
	ВыборкаДокументов = РезультатЗапроса.Выбрать();
	
	СоответствиеНастроекФилиалов = ПолучитьДополнительныеНастройкиПоФилиалам(Истина);
	
	ТекстыОшибокОбновленияСтатусов = ПолучитьСписокПропускаемыхОшибок();
	
	СтруктураНастроек = ПолучитьОсновныеНастройки();
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		УдалитьЗаписьПоОшибкам(ВыборкаДокументов.Ссылка);
		
		СтруктураЗапросаЗаявки = Новый Структура;
		//СтруктураЗапросаЗаявки.Вставить("lisId", ВыборкаДокументов.ИдентификаторЛИС);
		СтруктураЗапросаЗаявки.Вставить("nr", ВыборкаДокументов.НомерЗаявки);
		//СтруктураЗапросаЗаявки.Вставить("misId", Строка(ВыборкаДокументов.Ссылка.УникальныйИдентификатор()));
		
		СтруктураЗаявки = Новый Структура("date, query", ЗаписатьДатуJSON(ТекущаяДата(), ФорматДатыJSON.ISO), СтруктураЗапросаЗаявки);
		
		ТекстОшибки = "";
		
		#Область ОбщиеДействияПоСервису
		
		Событие = "Интеграция с ЛИС: Отправка заявки в ЛИС";
		
		НастройкиПоФилиалу = СоответствиеНастроекФилиалов.Получить(ВыборкаДокументов.Филиал);
		
		Если НастройкиПоФилиалу = Неопределено Тогда
			
			ТекстОшибки = "Не установлены настройки интеграции";
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.КлючДанных = ВыборкаДокументов.Ссылка;
			Сообщение.Сообщить();
			
			Продолжить;
		КонецЕсли;
		
		//ДанныеПароля = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ИнтеграцияСЛИС", "Пароль");
		//СтруктураНастроек.Вставить("Пароль", ?(ДанныеПароля = Неопределено, "", ДанныеПароля.Получить()));
		
		Попытка
			HTTPСоединение = Новый HTTPСоединение(НастройкиПоФилиалу.Адрес, НастройкиПоФилиалу.Порт, 
				НастройкиПоФилиалу.Пользователь, НастройкиПоФилиалу.Пароль,, СтруктураНастроек.ВремяОжиданияСоединения);
			
		Исключение
			ТекстОшибки = "Не удалось установить соединение. Проверьте настройки по филиалу """ + ВыборкаДокументов.ФилиалПредставление + """";
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.КлючДанных = ВыборкаДокументов.Ссылка;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			
			Продолжить;
		КонецПопытки;
		HTTPЗапрос = Новый HTTPЗапрос("query-referral-results?format=json");
		
		HTTPЗапрос.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(СтруктураЗаявки));
		
		Попытка
			Ответ = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
		Исключение
			ТекстОшибки = "Не удалось выполнить запрос к серверу.";
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.КлючДанных = ВыборкаДокументов.Ссылка;
			Сообщение.Сообщить();
			
			ЗафиксироватьОшибочныйДокумент(ВыборкаДокументов.Ссылка, ТекстОшибки + Символы.ПС + ОписаниеОшибки(), ТекстыОшибокОбновленияСтатусов);
			
			Продолжить;
		КонецПопытки;
		
		Попытка
			
			ТелоОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
			
			СтруктураДанных = ПрочитатьЗначениеJSON(ТелоОтвета);
			
		Исключение
			ТекстОшибки = "Не удалось прочитать данные из ЛИС, невеный формат. Документ: " + ВыборкаДокументов.ПредставлениеДокумента;
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки() + "
				|Тело ответа: " + ТелоОтвета);
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.КлючДанных = ВыборкаДокументов.Ссылка;
			Сообщение.Сообщить();
			
			ЗафиксироватьОшибочныйДокумент(ВыборкаДокументов.Ссылка, ТекстОшибки + Символы.ПС + ОписаниеОшибки(), ТекстыОшибокОбновленияСтатусов);

			Продолжить;
		КонецПопытки;
		
		#КонецОбласти
		
		Если СтруктураДанных.Свойство("error") Тогда
			
			ТекстОшибки = "Не удалось получить результат направления ЛИС. Документ: " + ВыборкаДокументов.ПредставлениеДокумента +". Подробности в журнале регистрации.";
			
			ТекстОшибки = ТекстОшибки + "
			|Ошибка ЛИС: " + СтруктураДанных.error;
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ТелоОтвета);
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.КлючДанных = ВыборкаДокументов.Ссылка;
			Сообщение.Сообщить();
			
			ЗафиксироватьОшибочныйДокумент(ВыборкаДокументов.Ссылка, ТекстОшибки + Символы.ПС + ОписаниеОшибки(), ТекстыОшибокОбновленияСтатусов);

			Продолжить;
		КонецЕсли;
		
		МассивБланков = Новый Массив;
		
		Для Каждого ДанныеБланка Из СтруктураДанных.blanks Цикл
			
			Если СтрНайти(ДанныеБланка.groups, "Изображения") > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ДатаЗавршения = ?(ДанныеБланка.done, ПрочитатьДатуJSON(ДанныеБланка.doneDate, ФорматДатыJSON.ISO), Дата(1,1,1));
			
			СтруктураБланка = Новый Структура("НаименованиеИсследованияЛИС, Группа, 
				|Выполнено, ДатаВыполнения, Файл, Комментарий, ИдентификаторБланка",
				ДанныеБланка.name, ДанныеБланка.groups, ДанныеБланка.done, 
				, 
				ДанныеБланка.fileName, ДанныеБланка.comment, ДанныеБланка.blankGUID);
				
			МассивБланков.Добавить(СтруктураБланка);
		КонецЦикла;
		
		ДатаЗавршения = ?(СтруктураДанных.referral.done, ПрочитатьДатуJSON(СтруктураДанных.referral.doneDate, ФорматДатыJSON.ISO), Дата(1,1,1));
		
		СтруктураРезультатов = Новый Структура("Завершено, ДатаВыполнения, Бланки", 
			СтруктураДанных.referral.done, 
			ДатаЗавршения, МассивБланков);
		
		СоответствиеРезультатов.Вставить(ВыборкаДокументов.Ссылка, СтруктураРезультатов);
	КонецЦикла;
	
	Возврат СоответствиеРезультатов;
	
КонецФункции

Функция ПолучитьБланкРезультатаВБинарномВиде(Заявки = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБланкиРезультатовИсследования.Заявка КАК Ссылка,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБланкиРезультатовИсследования.ИдентификаторБланка КАК ИдентификаторБланка,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБланкиРезультатовИсследования.Файл КАК Файл,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБланкиРезультатовИсследования.Заявка.Филиал КАК Филиал,
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБланкиРезультатовИсследования.Заявка.Филиал.Наименование КАК ФилиалПредставление
	               |ИЗ
	               |	РегистрСведений.омг_БланкиРезультатовИсследованийЛИС КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБланкиРезультатовИсследования
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ВсеЗаявки
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ Заявка В (&Заявки)
	               |		КОНЕЦ
	               |	И омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБланкиРезультатовИсследования.Выполнено
	               |	И омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБланкиРезультатовИсследования.Заявка.Проведен
	               |	И НЕ омг_ЗаявкаНаЛабораторноеИсследованиеВЛИСБланкиРезультатовИсследования.БланкПолучен
	               |ИТОГИ
	               |	МАКСИМУМ(Филиал),
	               |	МАКСИМУМ(ФилиалПредставление)
	               |ПО
	               |	Ссылка";
	
	Запрос.УстановитьПараметр("Заявки", Заявки);
	Запрос.УстановитьПараметр("ВсеЗаявки", ?(Заявки = Неопределено, Истина, Ложь));
	РезультатЗапроса = Запрос.Выполнить();
	
	СоответствиеДокументов = Новый Соответствие;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СоответствиеДокументов;
	КонецЕсли;
	
	СтруктураНастроек = ПолучитьОсновныеНастройки();
	
	ТекстОшибки = "";
	
	Событие = "Интеграция с ЛИС: Отправка заявки в ЛИС";
	
	СоответствиеНастроекФилиалов = ПолучитьДополнительныеНастройкиПоФилиалам(Истина); 
	
	
	ТекстыОшибокОбновленияСтатусов = ПолучитьСписокПропускаемыхОшибок();
	
	ВыборкаДокументов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументов.Следующий() Цикл
		
		НастройкиПоФилиалу = СоответствиеНастроекФилиалов.Получить(ВыборкаДокументов.Филиал);
		
		Если НастройкиПоФилиалу = Неопределено Тогда
			
			ТекстОшибки = "Не установлены настройки интеграции по филиалу """ + ВыборкаДокументов.ФилиалПредставление + """";
			
			ОписаниеОшибки = ОписаниеОшибки();
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки);
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			
			Продолжить;
		КонецЕсли;

		Попытка
			HTTPСоединение = Новый HTTPСоединение(НастройкиПоФилиалу.Адрес, НастройкиПоФилиалу.Порт, 
				НастройкиПоФилиалу.Пользователь, НастройкиПоФилиалу.Пароль,, СтруктураНастроек.ВремяОжиданияСоединения);
			
		Исключение
			ТекстОшибки = "Не удалось установить соединение. Проверьте настройки по филиалу.";
			
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
				Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
				
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ТекстОшибки;
			Сообщение.Сообщить();
			Продолжить;
		КонецПопытки;

		ВыборкаБланков = ВыборкаДокументов.Выбрать();
		
		СоответствиеБланков = Новый Соответствие;
		
		Пока ВыборкаБланков.Следующий() Цикл
			
			СтруктураЗаявки = Новый Структура("query, BlankId, FileType", 
				Новый Структура("blankGUID", ВыборкаБланков.ИдентификаторБланка), "", 0);
			
			#Область ОбщиеДействияПоСервису
			
			HTTPЗапрос = Новый HTTPЗапрос("query-blank-file?format=json");
			
			HTTPЗапрос.УстановитьТелоИзСтроки(ЗаписатьЗначениеJSON(СтруктураЗаявки));
			
			Попытка
				Ответ = HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
			Исключение
				ТекстОшибки = "Не удалось выполнить запрос к серверу.";
				
				ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
					Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки());
					
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ТекстОшибки;
				Сообщение.Сообщить();
				
				ЗафиксироватьОшибочныйДокумент(ВыборкаДокументов.Ссылка, ТекстОшибки + Символы.ПС + ОписаниеОшибки(), ТекстыОшибокОбновленияСтатусов);
				
				Продолжить;
			КонецПопытки;
			
			Попытка
				
				Если Ответ.Заголовки.Получить("Content-Type") = "application/pdf" 
					Или Ответ.Заголовки.Получить("Content-Type") = "image/jpeg"  Тогда
					ТелоОтвета = Ответ.ПолучитьТелоКакДвоичныеДанные();
				Иначе
					ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
				КонецЕсли;
				
				Если ТипЗнч(ТелоОтвета) = Тип("Строка") Тогда
					
					Попытка
						СтруктураОтвета = ПрочитатьЗначениеJSON(ТелоОтвета);
						
						Если СтруктураОтвета.error = "Бланк не готов" Тогда
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = "Исследование выполнено, но бланк с идентификатором (" + ВыборкаБланков.ИдентификаторБланка + ") еще не готов.";
							Сообщение.Сообщить();
							Продолжить;
						Иначе
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = "Исследование выполнено, но возращена ошибка. Невозможно получить бланк. Ошибка ЛИС: " + СтруктураОтвета.error + Символы.ПС + "
							|Идентификатор бланка: " + ВыборкаБланков.ИдентификаторБланка;
							Сообщение.Сообщить();
										
							Продолжить;
						КонецЕсли;
					Исключение
						ВызватьИсключение("Неверные параметры запроса к бланку. Тело ответа:" + "
						|" + ТелоОтвета);
					КонецПопытки;
				КонецЕсли;
				
			Исключение
				ТекстОшибки = "Не удалось прочитать данные из ЛИС, невеный формат.";
				
				ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
					Метаданные.ОбщиеМодули.омг_ИнтеграцияСЛИС.Модуль, ТекстОшибки, ОписаниеОшибки() + "
					|Тело ответа: " + ОписаниеОшибки());
					
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ТекстОшибки;
				Сообщение.Сообщить();
				
				ЗафиксироватьОшибочныйДокумент(ВыборкаДокументов.Ссылка, ТекстОшибки + Символы.ПС + ОписаниеОшибки(), ТекстыОшибокОбновленияСтатусов);

				Продолжить;
			КонецПопытки;
			
			#КонецОбласти
			
			СтруктураБланка = Новый Структура("Файл, ПутьКФайлу, ИдентификаторБланка", 
				ТелоОтвета, ВыборкаБланков.Файл, ВыборкаБланков.ИдентификаторБланка);
			
			СоответствиеБланков.Вставить(ВыборкаБланков.ИдентификаторБланка, СтруктураБланка);
			
		КонецЦикла;
		
		СоответствиеДокументов.Вставить(ВыборкаДокументов.Ссылка, СоответствиеБланков);
	КонецЦикла;
	
	Возврат СоответствиеДокументов;
	
КонецФункции

Процедура ОбновлениеДопРеквизитовИсследований(СтруктураНастроек, СтруктураДанных)
	
	ТаблицаВсехДопПолей = Новый ТаблицаЗначений;
	ТаблицаВсехДопПолей.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаВсехДопПолей.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаВсехДопПолей.Колонки.Добавить("ДатаОбновления", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ТаблицаВсехДопПолей.Колонки.Добавить("ТипЗначения", ОбщегоНазначения.ОписаниеТипаЧисло(1));
	
	ТаблицаЗначенийСвойств = Новый ТаблицаЗначений;
	ТаблицаЗначенийСвойств.Колонки.Добавить("КодВладельца", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаЗначенийСвойств.Колонки.Добавить("Код", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаЗначенийСвойств.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	
	Для Каждого СтруктураДопПоля Из СтруктураДанных.fields Цикл
		Если СтруктураДопПоля.Свойство("removed") И СтруктураДопПоля.removed Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы = ТаблицаВсехДопПолей.Добавить();
		СтрокаТаблицы.Наименование = СтруктураДопПоля.name;
		СтрокаТаблицы.Код = СтруктураДопПоля.code;
		СтрокаТаблицы.ДатаОбновления = ПрочитатьДатуJSON(СтруктураДопПоля.updateTime, ФорматДатыJSON.ISO);
		СтрокаТаблицы.ТипЗначения = СтруктураДопПоля.fieldType;
		Если СтрокаТаблицы.ТипЗначения = 5 Тогда
			Для Каждого СтруктураЗначенияСвойства Из СтруктураДопПоля.dictionaryValues Цикл
				СтрокаТаблицыЗначений = ТаблицаЗначенийСвойств.Добавить();
				СтрокаТаблицыЗначений.КодВладельца = СтрокаТаблицы.Код;
				СтрокаТаблицыЗначений.Код = СтруктураЗначенияСвойства.code;
				СтрокаТаблицыЗначений.Наименование = СтруктураЗначенияСвойства.name;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТаблицаВсехДопПолей", ТаблицаВсехДопПолей);
	Запрос.УстановитьПараметр("ТаблицаЗначенийСвойств", ТаблицаЗначенийСвойств);
	Запрос.УстановитьПараметр("ТолькоИзменения", СтруктураНастроек.ТолькоИзмененияДопПолейНоменклатуры);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаВсехДопПолей.Код КАК Код,
	               |	ТаблицаВсехДопПолей.Наименование КАК Наименование,
	               |	ТаблицаВсехДопПолей.ДатаОбновления КАК ДатаОбновления,
	               |	ТаблицаВсехДопПолей.ТипЗначения КАК ТипЗначения
	               |ПОМЕСТИТЬ ВТ_ТаблицаВсехДопПолей
	               |ИЗ
	               |	&ТаблицаВсехДопПолей КАК ТаблицаВсехДопПолей
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаЗначенийСвойств.КодВладельца КАК КодВладельца,
	               |	ТаблицаЗначенийСвойств.Код КАК Код,
	               |	ТаблицаЗначенийСвойств.Наименование КАК Наименование
	               |ПОМЕСТИТЬ ВТ_ТаблицаЗначенийСвойств
	               |ИЗ
	               |	&ТаблицаЗначенийСвойств КАК ТаблицаЗначенийСвойств
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТаблицаВсехДопПолей.Код КАК Код,
	               |	ВТ_ТаблицаВсехДопПолей.Наименование КАК Наименование,
	               |	ВТ_ТаблицаВсехДопПолей.ДатаОбновления КАК ДатаОбновления,
	               |	ЕСТЬNULL(СвойстваОбъектов.Ссылка, НЕОПРЕДЕЛЕНО) КАК Свойство,
	               |	ВТ_ТаблицаВсехДопПолей.ТипЗначения КАК ТипЗначения
	               |ПОМЕСТИТЬ ВТ_СущесвтующиеСвойства
	               |ИЗ
	               |	ВТ_ТаблицаВсехДопПолей КАК ВТ_ТаблицаВсехДопПолей
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.омг_ДополнительныеПоляЛИС КАК СвойстваОбъектов
	               |		ПО ВТ_ТаблицаВсехДопПолей.Код = СвойстваОбъектов.КодЛИС
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА &ТолькоИзменения
	               |				ТОГДА ЕСТЬNULL(СвойстваОбъектов.ДатаПоследнегоОбновленияЛИС, ДАТАВРЕМЯ(1, 1, 1)) <> ВТ_ТаблицаВсехДопПолей.ДатаОбновления
	               |						ИЛИ СвойстваОбъектов.Ссылка ЕСТЬ NULL
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СущесвтующиеСвойства.Код КАК Код,
	               |	ВТ_СущесвтующиеСвойства.Наименование КАК Наименование,
	               |	ВТ_СущесвтующиеСвойства.ДатаОбновления КАК ДатаОбновления,
	               |	ВТ_СущесвтующиеСвойства.Свойство КАК Свойство,
	               |	ВТ_СущесвтующиеСвойства.ТипЗначения КАК ТипЗначения
	               |ИЗ
	               |	ВТ_СущесвтующиеСвойства КАК ВТ_СущесвтующиеСвойства
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СущесвтующиеСвойства.Код КАК Код,
	               |	ВТ_СущесвтующиеСвойства.Наименование КАК Наименование,
	               |	ВТ_СущесвтующиеСвойства.ДатаОбновления КАК ДатаОбновления,
	               |	ВТ_СущесвтующиеСвойства.Свойство КАК Свойство,
	               |	ВТ_СущесвтующиеСвойства.ТипЗначения КАК ТипЗначения,
	               |	ЕСТЬNULL(ЗначенияСвойствОбъектов.Ссылка, НЕОПРЕДЕЛЕНО) КАК Значение,
	               |	ВТ_ТаблицаЗначенийСвойств.Код КАК КодЗначения,
	               |	ВТ_ТаблицаЗначенийСвойств.Наименование КАК НаименованиеЗначения
	               |ИЗ
	               |	ВТ_СущесвтующиеСвойства КАК ВТ_СущесвтующиеСвойства
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаЗначенийСвойств КАК ВТ_ТаблицаЗначенийСвойств
	               |		ПО ВТ_СущесвтующиеСвойства.Код = ВТ_ТаблицаЗначенийСвойств.КодВладельца
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.омг_ЗначенияДопПолейЛИС КАК ЗначенияСвойствОбъектов
	               |		ПО (ВТ_ТаблицаЗначенийСвойств.Код = ЗначенияСвойствОбъектов.КодЛИС)
	               |			И ВТ_СущесвтующиеСвойства.Свойство = ЗначенияСвойствОбъектов.Владелец
	               |ИТОГИ ПО
	               |	Код";
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	СвойстваРезультатЗапроса = ПакетРезультатов.Получить(3);
	ЗначенияРезультатЗапроса = ПакетРезультатов.Получить(4);
	
	Если СвойстваРезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаЗначенийПоВладельцу = ЗначенияРезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаСвойства = СвойстваРезультатЗапроса.Выбрать();
	
	Пока ВыборкаСвойства.Следующий() Цикл
		Если Не ВыборкаСвойства.Свойство = Неопределено Тогда
			СвойствоОбъект = ВыборкаСвойства.Свойство.ПолучитьОбъект();
		Иначе
			СвойствоОбъект = ПланыВидовХарактеристик.омг_ДополнительныеПоляЛИС.СоздатьЭлемент();
			СвойствоОбъект.Наименование = ВыборкаСвойства.Наименование;
			СвойствоОбъект.КодЛИС = ВыборкаСвойства.Код;
			Если ВыборкаСвойства.ТипЗначения = 2 Тогда
				СвойствоОбъект.ТипЗначения = ОбщегоНазначения.ОписаниеТипаЧисло(12, 2);
			ИначеЕсли ВыборкаСвойства.ТипЗначения = 3 Тогда
				СвойствоОбъект.ТипЗначения = Новый ОписаниеТипов("Булево");
			ИначеЕсли ВыборкаСвойства.ТипЗначения = 4 Тогда
				СвойствоОбъект.ТипЗначения = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
			ИначеЕсли ВыборкаСвойства.ТипЗначения = 5 Тогда
				СвойствоОбъект.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.омг_ЗначенияДопПолейЛИС");
			ИначеЕсли ВыборкаСвойства.ТипЗначения = 8 Тогда
				СвойствоОбъект.ТипЗначения = Новый ОписаниеТипов("ПеречислениеСсылка.ПолФизическихЛиц");
			Иначе
				СвойствоОбъект.ТипЗначения = ОбщегоНазначения.ОписаниеТипаСтрока(100);
			КонецЕсли;

			СвойствоОбъект.Записать();
		КонецЕсли;
		
		Если ВыборкаСвойства.ТипЗначения = 5 Тогда
			ВыборкаЗначенийПоВладельцу.Сбросить();
			Если ВыборкаЗначенийПоВладельцу.НайтиСледующий(ВыборкаСвойства.Код, "Код") Тогда
				
				ВыборкаЗначений = ВыборкаЗначенийПоВладельцу.Выбрать();
				Пока ВыборкаЗначений.Следующий() Цикл
					Если Не ВыборкаЗначений.Значение = Неопределено Тогда
						ЗначениеОбъект = ВыборкаЗначений.Значение.ПолучитьОбъект();
					Иначе
						ЗначениеОбъект = Справочники.омг_ЗначенияДопПолейЛИС.СоздатьЭлемент();
						ЗначениеОбъект.Владелец = СвойствоОбъект.Ссылка;
					КонецЕсли;
					ЗначениеОбъект.Наименование = ВыборкаЗначений.НаименованиеЗначения;
					ЗначениеОбъект.КодЛИС = ВыборкаЗначений.КодЗначения;
					ЗначениеОбъект.Записать();
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьЗаявкуНаВыполнение(Заявка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "";
	
КонецФункции

#КонецОбласти

#Область ОтправкаОповещений

Процедура ФормированиеИОтправкаОтчетовОПриостановлении()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_ПользователиОповещенияОПриостановленииИсследований.Пользователь КАК Пользователь,
	               |	омг_ПользователиОповещенияОПриостановленииИсследований.ЭлектронныйАдрес КАК ЭлектронныйАдрес,
	               |	омг_ПользователиОповещенияОПриостановленииИсследований.Филиал КАК Филиал,
	               |	омг_ПользователиОповещенияОПриостановленииИсследований.Пользователь.Представление КАК ПользовательПредставление,
	               |	омг_ПользователиОповещенияОПриостановленииИсследований.Филиал.Представление КАК ФилиалПредставление
	               |ИЗ
	               |	РегистрСведений.омг_ПользователиОповещенияОПриостановленииИсследований КАК омг_ПользователиОповещенияОПриостановленииИсследований
	               |ИТОГИ ПО
	               |	Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	омг_ПрочиеПриостановленныеИсследования.Номенклатура КАК Номенклатура,
	               |	омг_ПрочиеПриостановленныеИсследования.Филиал КАК Филиал,
	               |	омг_ПрочиеПриостановленныеИсследования.РучнаяБлокировка КАК РучнаяБлокировка,
	               |	омг_ПрочиеПриостановленныеИсследования.ДатаБлокировки КАК ДатаБлокировки,
	               |	омг_ПрочиеПриостановленныеИсследования.Причина КАК Причина,
	               |	омг_ПрочиеПриостановленныеИсследования.Комментарий КАК Комментарий,
	               |	омг_ПрочиеПриостановленныеИсследования.Номенклатура.Представление КАК НоменклатураПредставление,
	               |	омг_ПрочиеПриостановленныеИсследования.Филиал.Представление КАК ФилиалПредставление,
	               |	омг_ПрочиеПриостановленныеИсследования.Номенклатура.Артикул КАК НоменклатураАртикул
	               |ИЗ
	               |	РегистрСведений.омг_ПрочиеПриостановленныеИсследования КАК омг_ПрочиеПриостановленныеИсследования
	               |ГДЕ
	               |	омг_ПрочиеПриостановленныеИсследования.ДатаБлокировки >= &ДатаНачала
	               |ИТОГИ ПО
	               |	Филиал
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	омг_ХешОповещений.Пользователь КАК Пользователь,
	               |	омг_ХешОповещений.Хеш КАК Хеш
	               |ИЗ
	               |	РегистрСведений.омг_ХешОповещений КАК омг_ХешОповещений";
	
	ДатаНачалаОтправки = Константы.омг_ДатаНачалаОтправкиУведомленийОПриостановкеИсследований.Получить();
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаОтправки);
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаФилиалов = ПакетРезультатов.Получить(0).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаИсследованийПоФилиалам = ПакетРезультатов.Получить(1).Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаХешаОповещений = ПакетРезультатов.Получить(2).Выбрать();
	
	ОтправляемыеДанные = Новый Соответствие;
	НовыйХеш = Новый Массив;
	
	СтруктураПоиска = Новый Структура("Пользователь, Хеш");
	
	Пока ВыборкаИсследованийПоФилиалам.Следующий() Цикл
		
		ВыборкаИсследований = ВыборкаИсследованийПоФилиалам.Выбрать();
		
		МассивДанных = Новый Массив;
		
		ОтправляемыеДанные.Вставить(ВыборкаИсследованийПоФилиалам.Филиал, МассивДанных);
		
		Пока ВыборкаИсследований.Следующий() Цикл

			ДанныеПриостановки = Новый Структура("Хеш, ДанныеОтправки");
			МассивДанных.Добавить(ДанныеПриостановки);
			
			ДанныеОтправки = Новый Структура;
			ДанныеПриостановки.ДанныеОтправки = ДанныеОтправки;
			
			ДанныеОтправки.Вставить("Номенклатура", ВыборкаИсследований.Номенклатура);
			ДанныеОтправки.Вставить("Артикул", ВыборкаИсследований.НоменклатураАртикул);
			ДанныеОтправки.Вставить("Филиал", ВыборкаИсследований.ФилиалПредставление);
			ДанныеОтправки.Вставить("РучнаяБлокировка", ВыборкаИсследований.РучнаяБлокировка);
			ДанныеОтправки.Вставить("ДатаБлокировки", ВыборкаИсследований.ДатаБлокировки);
			ДанныеОтправки.Вставить("Причина", ВыборкаИсследований.Причина);
			ДанныеОтправки.Вставить("Комментарий", ВыборкаИсследований.Комментарий);

			Хеширование = Новый ХешированиеДанных(ХешФункция.MD5);
			Хеширование.Добавить(Строка(ВыборкаИсследований.Номенклатура.УникальныйИдентификатор()));
			Хеширование.Добавить(Строка(ВыборкаИсследований.Филиал.УникальныйИдентификатор()));
			Хеширование.Добавить(Строка(ВыборкаИсследований.РучнаяБлокировка));
			Хеширование.Добавить(Строка(ВыборкаИсследований.ДатаБлокировки));
			Хеширование.Добавить(Строка(ВыборкаИсследований.Причина));
			Хеширование.Добавить(Строка(ВыборкаИсследований.Комментарий));
			
			ДанныеПриостановки.Хеш = Строка(Хеширование.ХешСумма);
			Если НовыйХеш.Найти(ДанныеПриостановки.Хеш) = Неопределено Тогда
				НовыйХеш.Добавить(ДанныеПриостановки.Хеш);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Пока ВыборкаХешаОповещений.Следующий() Цикл
		Если НовыйХеш.Найти(ВыборкаХешаОповещений.Хеш) = Неопределено Тогда
			Запись = РегистрыСведений.омг_ХешОповещений.СоздатьНаборЗаписей();
			Запись.Отбор.Хеш.Установить(ВыборкаХешаОповещений.Хеш);
			Запись.Записать();
		КонецЕсли;
	КонецЦикла;
	
	ТекстПисьма = "<html><head></head>
	|<body>Добрый день.&nbsp;
	|<div>Список приостановленных исследований на " + Формат(ТекущаяДата(), "ДЛФ=DD")+ ".&nbsp;</div>
	|<div>Филиал.&nbsp;</div>
	|<div>Необходимо ознакомится и проверить список во вложенном файле</div></body></html>";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты
	               |ИЗ
	               |	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	               |ГДЕ
	               |	УчетныеЗаписиЭлектроннойПочты.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты);
	ВыборкаПочтыОтправителя = Запрос.Выполнить().Выбрать();
	ВыборкаПочтыОтправителя.Следующий();  
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	
	Отчет = Отчеты.омг_ОтчетПоПриостановленнымИсследованиям.Создать();
	СхемаКомпоновкиДанных = Отчет.СхемаКомпоновкиДанных;
	
	МассивОтправки = Новый Массив;
	Пока ВыборкаФилиалов.Следующий() Цикл
		
		ВыборкаПользователей = ВыборкаФилиалов.Выбрать();
		
		МассивОтправки.Очистить();
		КоличествоПозицийВсего = 0;
		Пока ВыборкаПользователей.Следующий() Цикл
			МассивДанных = ОтправляемыеДанные.Получить(ВыборкаФилиалов.Филиал);
			Если МассивДанных = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ОтправитьПисьмо = Ложь;
			Для Каждого ДанныеОтправки Из МассивДанных Цикл
				КоличествоПозицийВсего = КоличествоПозицийВсего + 1;
				ВыборкаХешаОповещений.Сбросить();
				СтруктураПоиска.Пользователь = ВыборкаПользователей.Пользователь;
				СтруктураПоиска.Хеш = ДанныеОтправки.Хеш;
				Если Не ВыборкаХешаОповещений.НайтиСледующий(СтруктураПоиска) Тогда
					ОтправитьПисьмо = Истина;
					МассивОтправки.Добавить(ДанныеОтправки.ДанныеОтправки.Номенклатура);
				КонецЕсли;				
			КонецЦикла;
			
			Если Не ОтправитьПисьмо Тогда
				Продолжить;
			КонецЕсли;
			
			Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Филиал");
			ЭлементОтбора.ПравоеЗначение = ВыборкаФилиалов.Филиал;
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

			ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПриостановленоЛИС");
			ЭлементОтбора.ПравоеЗначение = Ложь;
			Отчет.КомпоновщикНастроек.Настройки.Выбор.Элементы[3].Использование = Ложь;
			Отчет.КомпоновщикНастроек.Настройки.ПараметрыВывода.УстановитьЗначениеПараметра("ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить);

			КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Отчет.КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанных"));
			
			ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
			
			ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			
			ДокументРезультат = Новый ТабличныйДокумент;
			
			ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
			ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
			
			ДокументРезультат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
			АдресВложения1 = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			АдресВложения2 = Неопределено;
			
			Если Не КоличествоПозицийВсего = МассивОтправки.Количество() Тогда
				
				ЭлементОтбора = Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
				ЭлементОтбора.ПравоеЗначение = МассивОтправки;
				ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
				
				КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
				МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Отчет.КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанных"));
				
				ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
				ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
				
				ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
				
				ДокументРезультат = Новый ТабличныйДокумент;
				
				ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
				ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
				
				ДокументРезультат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
				
				ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
				АдресВложения2 = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
			КонецЕсли;

			
			Попытка
				
				НачатьТранзакцию();
				
				ИтоговыйТекстПисьма = СтрЗаменить(ТекстПисьма, "Филиал", "Филиал: """ + ВыборкаФилиалов.ФилиалПредставление + """");
				
				Письмо = Документы.ЭлектронноеПисьмоИсходящее.СоздатьДокумент();
				Письмо.Заполнить(Неопределено);
				Письмо.Текст = ИтоговыйТекстПисьма;
				Письмо.ТекстHTML = ИтоговыйТекстПисьма;
				Письмо.Кодировка = "utf-8";
				Письмо.ЕстьВложения = Истина;
				Письмо.СписокПолучателейПисьма = ВыборкаПользователей.ЭлектронныйАдрес;
				Письмо.Тема = "Приостановленные исследования на " + НачалоДня(ТекущаяДата()) + ". Филиал: " + ВыборкаФилиалов.ФилиалПредставление;
				Письмо.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
				Письмо.СтатусПисьма = Перечисления.СтатусыИсходящегоЭлектронногоПисьма.Исходящее;
				Письмо.Дата = ТекущаяДата();
				Письмо.ДатаОтправления = ТекущаяДата();
				Получатель = Письмо.ПолучателиПисьма.Добавить();
				Получатель.Адрес = ВыборкаПользователей.ЭлектронныйАдрес;
				Получатель.Представление = ВыборкаПользователей.ПользовательПредставление + " <" + ВыборкаПользователей.ЭлектронныйАдрес + ">";
				Письмо.Записать();
				
				СсылкаНаФайл = УправлениеЭлектроннойПочтой.ЗаписатьВложениеЭлектронногоПисьмаИзВременногоХранилища(
					Письмо.Ссылка, АдресВложения1, "Полный список по филиалу " + ВыборкаФилиалов.ФилиалПредставление + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") + ".xlsx", 0);

				Если Не АдресВложения2 = Неопределено Тогда
					СсылкаНаФайл = УправлениеЭлектроннойПочтой.ЗаписатьВложениеЭлектронногоПисьмаИзВременногоХранилища(
						Письмо.Ссылка, АдресВложения2, "Новые блокировки по филиалу " + ВыборкаФилиалов.ФилиалПредставление + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") + ".xlsx", 0);
				КонецЕсли;
				
				ПараметрыПисьма = Неопределено;
				Взаимодействия.ВыполнитьОтправкуПисьма(Письмо,,ПараметрыПисьма,"Все");
				
				Для Каждого ДанныеОтправки Из МассивДанных Цикл
					ВыборкаХешаОповещений.Сбросить();
					СтруктураПоиска.Пользователь = ВыборкаПользователей.Пользователь;
					СтруктураПоиска.Хеш = ДанныеОтправки.Хеш;
					Если Не ВыборкаХешаОповещений.НайтиСледующий(СтруктураПоиска) Тогда
						Запись = РегистрыСведений.омг_ХешОповещений.СоздатьМенеджерЗаписи();
						Запись.Пользователь = ВыборкаПользователей.Пользователь;
						Запись.Хеш = ДанныеОтправки.Хеш;
						Запись.Записать();
					КонецЕсли;				
				КонецЦикла;
				
				ЗафиксироватьТранзакцию();
				Прервать;
			Исключение
				
				ОтменитьТранзакцию();
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
				
			КонецПопытки;

			
		КонецЦикла;
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ВыполнитьОтправкуОповещенийОПриостановленииИсследований() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ФормированиеИОтправкаОтчетовОПриостановлении();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

Функция КоличествоВерсийДокумента(Документ) Экспорт 
	
	Отбор = Новый Структура;
	Отбор.Вставить(
	    "Данные", Документ);
	
	ИсторияДанных.ОбновитьИсторию(Документ);
	
	Версии = ИсторияДанных.ВыбратьВерсии(
	    Отбор,
	    "НомерВерсии, Дата, Комментарий");	

	Возврат Версии.Количество();
		
КонецФункции

