
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если Элементы.СписокШаблонов.ТекущиеДанные = Неопределено Тогда 
		Закрыть();
	КонецЕсли;
	
	Закрыть(Элементы.СписокШаблонов.ТекущиеДанные.ШаблонСообщения);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ШаблонСообщения") Тогда
		Элементы.СписокШаблонов.ТекущаяСтрока = Параметры.ШаблонСообщения;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокШаблоновВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОК(Неопределено);
КонецПроцедуры
