#Область ПрограммныйИнтерфейс

Функция ШаблонВидовНозологическихЕдиницМедкарты(СтандартнаяОбработка, ВидКарты) Экспорт
	
	// СтандартнаяОбработка = Ложь;
	// Шаблон = Новый Массив;
	// ...
	// Возврат Шаблон;
	
КонецФункции

#Область ПечатьМедкарт

Функция ПечатьКарты(МедКарта, ЗначенияПараметровМедкарты, ЗначенияВычисляемыхПараметровМедкарты, ИмяМакета, ДляРедактирования) Экспорт
	
	Если ИмяМакета = "МедицинскаяКарта003у_530н" Тогда
		
		Возврат Стационар.ПечатьКарты530н(МедКарта, ЗначенияПараметровМедкарты, ЗначенияВычисляемыхПараметровМедкарты, ИмяМакета, ДляРедактирования);
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

Функция РольДоступнаТекущемуПользователю(МедицинскийДокумент, Роль) Экспорт
	
	ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(МедицинскийДокумент);
	
	Если ИмяТипаДокумента = "Справочник.МедицинскиеКарты" Тогда
		Если МедицинскийДокумент.ВидКарты.Макет = "МедицинскаяКарта003у_530н" Тогда
			Возврат Стационар.РольДоступнаТекущемуПользователю(МедицинскийДокумент, Роль);
		КонецЕсли;
	ИначеЕсли ИмяТипаДокумента = "Документ.Форма066" Тогда
		Возврат Стационар.РольДоступнаТекущемуПользователю(МедицинскийДокумент.МедицинскаяКарта, Роль);
	ИначеЕсли ИмяТипаДокумента = "Документ.ВрачебнаяКомиссия" Тогда
		Возврат Документы.ВрачебнаяКомиссия.РольДоступнаТекущемуПользователю(МедицинскийДокумент, Роль);
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

Процедура ДополнитьМакетыСРучнымРедактированием(МакетыСРучнымРедактированием) Экспорт
	
	МакетыСРучнымРедактированием.Добавить("МедицинскаяКарта003у_530н");
	
КонецПроцедуры

Функция ПолучитьРолиДляПодписанияПоВидуМедкарты(ВидКарты) Экспорт
	
	Роли = Новый Массив;
	Если ВидКарты.Макет = "МедицинскаяКарта003у_530н" Тогда
		Роли.Добавить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(18, "РолиПриПодписиМедДокументов"));
		Роли.Добавить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(5, "РолиПриПодписиМедДокументов"));
		Возврат Роли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДополнитьМакетыМедкартБезВычисляемыхПараметров(МакетыБезВычисляемыхПараметров) Экспорт
	
	МакетыБезВычисляемыхПараметров.Добавить("МедицинскаяКарта003у_530н");
	
КонецПроцедуры

Функция ПолучитьПараметрыРасшифровокПоВидуМедкарты(ВидКарты) Экспорт
	
	ПараметрыРасшифровок = Новый Соответствие;
	Если ВидКарты.Макет = "МедицинскаяКарта003у_530н" Тогда
		ПараметрыРасшифровок.Вставить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(18, "РолиПриПодписиМедДокументов"), "ЭЦПЛечащегоВрача");
		ПараметрыРасшифровок.Вставить(ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(5, "РолиПриПодписиМедДокументов"), "ЭЦПЗаведующего");
		Возврат ПараметрыРасшифровок;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьОбластьЭЦППоВидуМедкарты(ВидКарты) Экспорт
	
	Если ВидКарты.Макет = "МедицинскаяКарта003у_530н" Тогда
		Возврат Справочники.ВидыМедицинскихКарт.ПолучитьМакет("МедицинскаяКарта003у_530н").ПолучитьОбласть("ЭЦП");
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДополнитьМетаданныеВстроенныхОбработок(ВстроенныеОбработки) Экспорт
	
	ВстроенныеОбработки.Добавить(Метаданные.Обработки.доп_ВыписнойЭпикриз);
	
КонецПроцедуры

Функция РолиДляПодписанияМедицинскогоДокумента(МедицинскийДокумент, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ДопСерверныеФункции.ИмяСсылочногоТипа(МедицинскийДокумент) = "Документ.Форма066" Тогда
		Возврат Документы.Форма066.РолиДляПодписания();
	ИначеЕсли ДопСерверныеФункции.ИмяСсылочногоТипа(МедицинскийДокумент) = "Документ.ВрачебнаяКомиссия" Тогда
		Возврат Документы.ВрачебнаяКомиссия.РолиДляПодписания();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция СформироватьЭМДМедицинскогоДокумента(МедицинскийДокумент, ТекстОшибки, СохранитьЭМД = Истина) Экспорт
	
	Если ДопСерверныеФункции.ИмяСсылочногоТипа(МедицинскийДокумент) = "Документ.Форма066" Тогда
		Возврат Документы.Форма066.СохранитьЭМД(МедицинскийДокумент, ТекстОшибки, СохранитьЭМД);
	ИначеЕсли ДопСерверныеФункции.ИмяСсылочногоТипа(МедицинскийДокумент) = "Документ.ВрачебнаяКомиссия" Тогда
		Возврат Документы.ВрачебнаяКомиссия.СохранитьЭМД(МедицинскийДокумент, ТекстОшибки, СохранитьЭМД);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьЗначенияПустыхПараметровПоУмолчанию(ВидКарты) Экспорт
	
	Если ВидКарты.Макет = "МедицинскаяКарта003у_530н" Тогда
		Возврат Стационар.ПолучитьЗначенияПустыхПараметровПоУмолчанию530н();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ПередРассчетомДвиженийВыполненияПланаЛечения(ВыполнениеПлана, Регистратор, МедицинскаяКарта) Экспорт
	
	Стационар.ПередРассчетомДвиженийВыполненияПланаЛечения(ВыполнениеПлана, Регистратор, МедицинскаяКарта);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПередНачаломРаботыСистемы_ПодготовитьКлиентскиеМедицинскиеКеши(Кеши) Экспорт
	
	Кеши.Вставить("глНоменклатураСправокЦенаПоПолуКлиента", МедосмотрыСервер.НоменклатураСправокЦенаПоПолуКлиента());
	Кеши.Вставить("глКешВидыКлассификаторовПараметровПриемаФРНСИ",		 ОбщегоНазначенияСервер.ФункцияМенеджера("Перечисления.ВидыКлассификаторовМинЗдрава", "ВидыКлассификаторовПараметровПриемаФРНСИ", Истина));
	Кеши.Вставить("глКешПараметрыШаблоновСвязанныхНазначенийПараметров", ОбщегоНазначенияСервер.ФункцияМенеджера("Перечисления.КодировкаПолейЭМД", "ПараметрыШаблоновСвязанныхНазначенийПараметров", Истина));
	
КонецПроцедуры

#КонецОбласти
