
&НаСервереБезКонтекста
Функция ПолучитьСсылкуПоШтрихкоду(Штрихкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС КАК омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС
	               |ГДЕ
	               |	омг_ЗаявкаНаЛабораторноеИсследованиеВЛИС.НомерЗаявки = &Номер";
	Запрос.УстановитьПараметр("Номер", Штрихкод);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура НайтиИОткрытьЗаявкуПоШтрихкоду(Штрихкод)
	
	Если Не ЗначениеЗаполнено(Штрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаЗаявку = ПолучитьСсылкуПоШтрихкоду(Штрихкод);
	
	Если СсылкаНаЗаявку = Неопределено Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "По данному штрихкоду заявка не обнаружена!";
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	Элементы.Список.ТекущаяСтрока = СсылкаНаЗаявку;
	
	ПоказатьЗначение(, СсылкаНаЗаявку);

КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеВводаШтрихкодаЗаявки(Штрихкод, ДопПараметры) Экспорт 
	
	НайтиИОткрытьЗаявкуПоШтрихкоду(Штрихкод);
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоШтрихкоду(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВводаШтрихкодаЗаявки", ЭтаФорма);
	ПоказатьВводСтроки(ОписаниеОповещения,, "Штрихкод", 100, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Не ТипЗнч(Данные) = Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	НайтиИОткрытьЗаявкуПоШтрихкоду(Данные)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омг_ДополнительныеАлгоритмы.УстановитьЗапретСортировки(Список);
КонецПроцедуры
