
//
// КЛИЕНТСКИЙ МОДУЛЬ СИСТЕМЫ ЛИЦЕНЗИРОВАНИЯ 1.6
//

#Область ПрограммныйИнтерфейс

// Инициализирует глобальные переменные, подключает обработчик ожидания
Процедура ИнициализацияКлиентаЛицензирования() Экспорт
	
	ВремяЗадержкиСоединения = доп_сл_сервер.ПолучитьВремяЗадержки();
	ВремяЗадержки = ?(ВремяЗадержкиСоединения <> 0, ВремяЗадержкиСоединения, 2);
	
	Если СтрНайти(ПараметрЗапуска, "LSDEBUG") <> 0 Тогда			
		доп_сл_сервер_ассистент.ВключитьТестирование(); 			
	КонецЕсли;
	
	Если ВремяЗадержкиСоединения <> 0 Тогда      
		ПодключитьОбработчикОжидания("доп_сл_Подключаемый_ОтложеннаяАктивация", ВремяЗадержкиСоединения, Истина);
	КонецЕсли;
	
	Если доп_сл_сервер.ЭтоСервернаяБаза() Тогда
		
		Если доп_сл_сервер_ассистент.РегламентноеЗаданиеОтключено() Тогда			
			доп_сл_общий.ВывестиСообщение(доп_сл_общий.ПолучитьСтрокуСообщения("РегламентноеЗаданиеОтключено"));			
		КонецЕсли; 
		
	Иначе
		
		ПодключитьОбработчикОжидания("доп_сл_Подключаемый_РасширениеВозможностейПлатформы", 6, Истина);
		ПодключитьОбработчикОжидания("доп_сл_Подключаемый_РасширениеВозможностейПлатформы", 600, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

// Получает подходящую форму клиента лицензирования
//
Функция ПолучитьФормуКлиентаЛицензирования() Экспорт
	
	СовместимостьФорм_8_3_6 = доп_сл_сервер.ИспользоватьРежимСовместимостиФормСПлатформой_8_3_6();
	
	Если СовместимостьФорм_8_3_6 Тогда
		
		ИмяФормы = "СистемаЛицензирования_упр_8_3_6";
		
	Иначе
		
		ИмяФормы = "СистемаЛицензирования_упр";
		
	КонецЕсли; 
	
	П = Новый Структура("ФормаОткрытаКодом", Истина);
	
	ФормаКлиентаЛицензирования = ПолучитьФорму("Обработка.доп_сл_КлиентЛицензирования.Форма." + ИмяФормы
	,П
	,
	,"{EC01D58C-9935-4CA4-9255-867EF04B38B7}"
	,ВариантОткрытияОкна.ОтдельноеОкно);
	
	Возврат ФормаКлиентаЛицензирования;							
	
КонецФункции 

// Открывает на клиенте форму системы лицензирования
//
Процедура ОткрытьФормуКлиентаЛицензирования() Экспорт
	
	ФормаКлиентаЛицензирования = ПолучитьФормуКлиентаЛицензирования();
	ФормаКлиентаЛицензирования.Открыть();
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ_КЛИЕНТА_ЛИЦЕНЗИРОВАНИЯ

// Вызывается при нажатии на кнопку обновить формы системы лицензирования перед обновлением лицензии.
// Процедура предназначена для расширения функционала
Процедура ПередОбновлениемСостояния() Экспорт
	
	// Обработчик не заполнен, вставьте ваш код сюда.	
	
КонецПроцедуры // ПередОбновлениемСостояния() 

// Вызывается при нажатии на кнопку обновить формы системы лицензирования после обновления лицензии.
// Процедура предназначена для расширения функционала.
Процедура ПриОбновленииСостояния() Экспорт
	
	// Обработчик не заполнен, вставьте ваш код сюда.
	
КонецПроцедуры // ПриОбновленииСостояния()

// Вызывается при нажатии гиперссылки "Изменить версию продукта", 
// формы системы лицензирования (при наличии в продукте такой функциональности)
Процедура ПриОткрытииФормыВыбораВерсииПродукта() Экспорт

	// Обработчик не заполнен, вставьте ваш код сюда.	
	
КонецПроцедуры 

#КонецОбласти

#КонецОбласти