
Функция ПолучитьНастройки() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*, Пользователь.Код КАК ИмяПользователя
	               |ИЗ
	               |	РегистрСведений.омг_НастройкиИнтеграции КАК омг_НастройкиИнтеграции";
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураНастроек = Новый Структура;
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СтруктураНастроек.Вставить(Колонка.Имя);
	КонецЦикла;
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ЗаполнитьЗначенияСвойств(СтруктураНастроек, Выборка);
		
	КонецЕсли;
	
	ДанныеПароля = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("омг_ИнтеграцияСMedreview", "Пароль");
	
	СтруктураНастроек.Вставить("ПарольВнешнегоДоступа", ?(ДанныеПароля = Неопределено, "", ДанныеПароля.Получить()));
	
	Возврат СтруктураНастроек;
	
КонецФункции