Функция ПроверкаНаИсключениеИзВыработки(СписокНоменклатуры,Сотрудник,Филиал) Экспорт
	
	СписокВхождений = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	омг_НоменклатураВыработки.Номенклатура КАК Номенклатура,
	|	омг_НоменклатураВыработки.ЭтоИскл КАК ЭтоИскл
	|ИЗ
	|	РегистрСведений.омг_НоменклатураВыработки КАК омг_НоменклатураВыработки
	|ГДЕ
	|	омг_НоменклатураВыработки.Сотрудник = &Сотрудник
	|	И омг_НоменклатураВыработки.Должность = &Должность
	|	И омг_НоменклатураВыработки.Филиал = &Филиал
	|	И омг_НоменклатураВыработки.Номенклатура.ЭтоГруппа = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	омг_НоменклатураВыработки.ЭтоИскл,
	|	омг_НоменклатураВыработки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	омг_НоменклатураВыработки.Номенклатура КАК Номенклатура,
	|	омг_НоменклатураВыработки.ЭтоИскл КАК ЭтоИскл
	|ИЗ
	|	РегистрСведений.омг_НоменклатураВыработки КАК омг_НоменклатураВыработки
	|ГДЕ
	|	омг_НоменклатураВыработки.Филиал = &Филиал
	|	И омг_НоменклатураВыработки.Сотрудник = &Сотрудник
	|	И омг_НоменклатураВыработки.Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|	И омг_НоменклатураВыработки.Номенклатура.ЭтоГруппа = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	омг_НоменклатураВыработки.Номенклатура,
	|	омг_НоменклатураВыработки.ЭтоИскл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	омг_НоменклатураВыработки.Номенклатура КАК Номенклатура,
	|	омг_НоменклатураВыработки.ЭтоИскл КАК ЭтоИскл
	|ИЗ
	|	РегистрСведений.омг_НоменклатураВыработки КАК омг_НоменклатураВыработки
	|ГДЕ
	|	омг_НоменклатураВыработки.Филиал = &Филиал
	|	И омг_НоменклатураВыработки.Должность = &Должность
	|	И омг_НоменклатураВыработки.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И омг_НоменклатураВыработки.Номенклатура.ЭтоГруппа = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	омг_НоменклатураВыработки.Номенклатура,
	|	омг_НоменклатураВыработки.ЭтоИскл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	омг_НоменклатураВыработки.Номенклатура КАК Номенклатура,
	|	омг_НоменклатураВыработки.ЭтоИскл КАК ЭтоИскл
	|ИЗ
	|	РегистрСведений.омг_НоменклатураВыработки КАК омг_НоменклатураВыработки
	|ГДЕ
	|	омг_НоменклатураВыработки.Сотрудник = &Сотрудник
	|	И омг_НоменклатураВыработки.Должность = &Должность
	|	И омг_НоменклатураВыработки.Филиал = &Филиал
	|	И омг_НоменклатураВыработки.Номенклатура.ЭтоГруппа = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	омг_НоменклатураВыработки.ЭтоИскл,
	|	омг_НоменклатураВыработки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	омг_НоменклатураВыработки.Номенклатура КАК Номенклатура,
	|	омг_НоменклатураВыработки.ЭтоИскл КАК ЭтоИскл
	|ИЗ
	|	РегистрСведений.омг_НоменклатураВыработки КАК омг_НоменклатураВыработки
	|ГДЕ
	|	омг_НоменклатураВыработки.Филиал = &Филиал
	|	И омг_НоменклатураВыработки.Сотрудник = &Сотрудник
	|	И омг_НоменклатураВыработки.Должность = ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
	|	И омг_НоменклатураВыработки.Номенклатура.ЭтоГруппа = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	омг_НоменклатураВыработки.ЭтоИскл,
	|	омг_НоменклатураВыработки.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	омг_НоменклатураВыработки.Номенклатура КАК Номенклатура,
	|	омг_НоменклатураВыработки.ЭтоИскл КАК ЭтоИскл
	|ИЗ
	|	РегистрСведений.омг_НоменклатураВыработки КАК омг_НоменклатураВыработки
	|ГДЕ
	|	омг_НоменклатураВыработки.Филиал = &Филиал
	|	И омг_НоменклатураВыработки.Должность = &Должность
	|	И омг_НоменклатураВыработки.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	И омг_НоменклатураВыработки.Номенклатура.ЭтоГруппа = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	омг_НоменклатураВыработки.Номенклатура,
	|	омг_НоменклатураВыработки.ЭтоИскл";
	
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник); 
	Запрос.УстановитьПараметр("Должность", Сотрудник.Должность);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	// элементы	
	ВыборкаДетальныеЗаписи1 = РезультатЗапроса[0].Выбрать();  
	ВыборкаДетальныеЗаписи2 = РезультатЗапроса[1].Выбрать(); 
	ВыборкаДетальныеЗаписи3 = РезультатЗапроса[2].Выбрать();        
	// группы	
	ВыборкаДетальныеЗаписи4Группа = РезультатЗапроса[3].Выбрать();  
	ВыборкаДетальныеЗаписи5Группа = РезультатЗапроса[4].Выбрать(); 
	ВыборкаДетальныеЗаписи6Группа = РезультатЗапроса[5].Выбрать();
	
	
	Для каждого СтрокаНоменклатуры из СписокНоменклатуры Цикл
		
		НеСчитать = 0;

		//поиск по элементам исключения 
		
		///////////////////////////////////////////////////
		// Индивидуально 
		//  по номенклатуре  
		
		СтрПоиска = Новый Структура("Номенклатура",СтрокаНоменклатуры);
		
		ВыборкаДетальныеЗаписи1.Сбросить(); 
		
		Если ВыборкаДетальныеЗаписи1.НайтиСледующий(СтрПоиска) Тогда  
			Если ВыборкаДетальныеЗаписи1.ЭтоИскл Тогда
					НеСчитать = 1;
				Иначе
					НеСчитать = 2
			КонецЕсли;
		КонецЕсли;	 
		
		Если НеСчитать = 1 Тогда
			Продолжить
		КонецЕсли;
		
		Если НеСчитать = 2 Тогда
			
			СписокВхождений.Добавить(СтрокаНоменклатуры);
            Продолжить; 
			
		КонецЕсли;
		
		//  по группе
		ВыборкаДетальныеЗаписи4Группа.Сбросить();
		
		Пока ВыборкаДетальныеЗаписи4Группа.Следующий() Цикл
			
			Если СтрокаНоменклатуры.ПринадлежитЭлементу(ВыборкаДетальныеЗаписи4Группа.Номенклатура) Тогда
				
				Если ВыборкаДетальныеЗаписи4Группа.ЭтоИскл Тогда
					НеСчитать = 1;
				Иначе
					НеСчитать = 2
				КонецЕсли;	
				
				Если НеСчитать = 1 Тогда
					Прервать
				КонецЕсли;
				
			КонецЕсли;	
						
		КонецЦикла;
		
		Если НеСчитать = 1 Тогда
			Продолжить
		КонецЕсли;   
		
		Если НеСчитать = 0 Тогда
			
			СтрПоиска = Новый Структура("Номенклатура",СтрокаНоменклатуры);
			
			ВыборкаДетальныеЗаписи1.Сбросить(); 
			
			Если ВыборкаДетальныеЗаписи1.НайтиСледующий(СтрПоиска) Тогда  
				Если ВыборкаДетальныеЗаписи1.ЭтоИскл Тогда
					НеСчитать = 1;
				Иначе
					НеСчитать = 2
				КонецЕсли;
			КонецЕсли;	 
			
		КонецЕсли; 
		
		Если НеСчитать = 2 Тогда
			
			СписокВхождений.Добавить(СтрокаНоменклатуры);
            Продолжить; 
			
		КонецЕсли;
		
		// Индивидуально
	    ///////////////////////////////////////////////////	
		
		ВыборкаДетальныеЗаписи2.Сбросить(); 
		
		Если ВыборкаДетальныеЗаписи2.НайтиСледующий(СтрПоиска) Тогда
			
			Если ВыборкаДетальныеЗаписи2.ЭтоИскл Тогда
					НеСчитать = 1;
				Иначе
					НеСчитать = 2
				КонецЕсли;

		КонецЕсли;	 
		
		Если НеСчитать = 1 Тогда
			Продолжить
		КонецЕсли;	
		
		ВыборкаДетальныеЗаписи3.Сбросить(); 
		
		Если ВыборкаДетальныеЗаписи3.НайтиСледующий(СтрПоиска) Тогда
			
				Если ВыборкаДетальныеЗаписи3.ЭтоИскл Тогда
					НеСчитать = 1;
				Иначе
					НеСчитать = 2
				КонецЕсли;

		КонецЕсли;	    
		
		Если НеСчитать = 1 Тогда
			Продолжить
		КонецЕсли;	
		//поиск по элементам вхождения
		
		СтрПоиска = Новый Структура("Номенклатура",СтрокаНоменклатуры);
		
		ВыборкаДетальныеЗаписи1.Сбросить();    
		
		Если ВыборкаДетальныеЗаписи1.НайтиСледующий(СтрПоиска) Тогда
				Если ВыборкаДетальныеЗаписи1.ЭтоИскл Тогда
					НеСчитать = 1;
				Иначе
					НеСчитать = 2
				КонецЕсли;
		КонецЕсли;	    
		
		ВыборкаДетальныеЗаписи2.Сбросить(); 
		
		Если ВыборкаДетальныеЗаписи2.НайтиСледующий(СтрПоиска) Тогда
			
				Если ВыборкаДетальныеЗаписи2.ЭтоИскл Тогда
					НеСчитать = 1;
				Иначе
					НеСчитать = 2
				КонецЕсли;

		КонецЕсли;	    
		
		ВыборкаДетальныеЗаписи3.Сбросить(); 
		
		Если ВыборкаДетальныеЗаписи3.НайтиСледующий(СтрПоиска) Тогда
				Если ВыборкаДетальныеЗаписи3.ЭтоИскл Тогда
					НеСчитать = 1;
				Иначе
					НеСчитать = 2
				КонецЕсли;

		КонецЕсли;	    
		
		//поиск по группам исключения    
		
		ВыборкаДетальныеЗаписи4Группа.Сбросить();
		
		Пока ВыборкаДетальныеЗаписи4Группа.Следующий() Цикл
			
			Если СтрокаНоменклатуры.ПринадлежитЭлементу(ВыборкаДетальныеЗаписи4Группа.Номенклатура) Тогда
				
				Если ВыборкаДетальныеЗаписи4Группа.ЭтоИскл Тогда
					НеСчитать = 1;
				Иначе
					НеСчитать = 2
				КонецЕсли;	
				
				Если НеСчитать = 1 Тогда
					Прервать
				КонецЕсли;
				
			КонецЕсли;	
						
		КонецЦикла;	
		
		Если  НеСчитать = 1  Тогда
			Продолжить
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи5Группа.Сбросить();
		
		Пока ВыборкаДетальныеЗаписи5Группа.Следующий() Цикл
			
			Если СтрокаНоменклатуры.ПринадлежитЭлементу(ВыборкаДетальныеЗаписи5Группа.Номенклатура) Тогда
				
				Если ВыборкаДетальныеЗаписи5Группа.ЭтоИскл Тогда
					НеСчитать = 1;
				Иначе
					НеСчитать = 2
				КонецЕсли;	
				
				Если НеСчитать = 1 Тогда
					Прервать
				КонецЕсли;
				
			КонецЕсли;			
			
		КонецЦикла;	
		
		Если НеСчитать = 1 Тогда
			Продолжить
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи6Группа.Сбросить();
		
		Пока ВыборкаДетальныеЗаписи6Группа.Следующий() Цикл
			
			Если СтрокаНоменклатуры.ПринадлежитЭлементу(ВыборкаДетальныеЗаписи6Группа.Номенклатура) Тогда
				
				Если ВыборкаДетальныеЗаписи6Группа.ЭтоИскл Тогда
					НеСчитать = 1;
				Иначе
					НеСчитать = 2
				КонецЕсли;	
				
				Если НеСчитать = 1 Тогда
					Прервать
				КонецЕсли;
				
			КонецЕсли;	
			
			
		КонецЦикла;	
		
		Если НеСчитать = 2 Тогда
			СписокВхождений.Добавить(СтрокаНоменклатуры);			
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат СписокВхождений;
	
КонецФункции	       

Функция омг_УчетВыработки(ДатаДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	ВозЗначение = Ложь;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	омг_НастройкаУчетаВыработкипоЗПСрезПоследних.УчитыватьВыработкиЗП КАК УчитыватьВыработкиЗП
		|ИЗ
		|	РегистрСведений.омг_НастройкаУчетаВыработкипоЗП.СрезПоследних(&ДатаДокумента, ) КАК омг_НастройкаУчетаВыработкипоЗПСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
	ВозЗначение = ВыборкаДетальныеЗаписи.УчитыватьВыработкиЗП;	
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

	Возврат ВозЗначение
		
КонецФункции

Процедура омг_ПриПроведенииВводаЗПИСписковНоменклатурыОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если ТипЗНЧ(Источник) = Тип("ДокументОбъект.ВводСведенийОНачисленияхРаботников") Тогда
		
		ОбновитьСписокУслуг(Источник)
		
	иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_СписокУслугПоСотрудникамДляЗП.ВводСведенийЗП КАК ВводСведенийЗП
		|ИЗ
		|	РегистрСведений.омг_СписокУслугПоСотрудникамДляЗП КАК омг_СписокУслугПоСотрудникамДляЗП
		|ГДЕ
		|	омг_СписокУслугПоСотрудникамДляЗП.ДокументСписок = &ДокументСписок
		|
		|СГРУППИРОВАТЬ ПО
		|	омг_СписокУслугПоСотрудникамДляЗП.ВводСведенийЗП";
		
		Запрос.УстановитьПараметр("ДокументСписок", Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбновитьСписокУслуг(ВыборкаДетальныеЗаписи.ВводСведенийЗП.ПолучитьОбъект())
		КонецЦикла;
		
	КонецЕсли;	

КонецПроцедуры    

Процедура ОбновитьСписокУслуг(Источник)
	
		Если не Источник = неопределено Тогда
		
		СписокЗаписей = РегистрыСведений.омг_СписокУслугПоСотрудникамДляЗП.СоздатьНаборЗаписей();
		СписокЗаписей.Отбор.ВводСведенийЗП.Установить(Источник.Ссылка);

		ВТОсновынеНачисления = Источник.ОсновныеНачисления.Выгрузить();
		ВТОсновынеНачисления.Свернуть("Сотрудник,ВидРасчета,Действие,Показатель1,Показатель2");
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВТОсновынеНачисления.Сотрудник КАК Сотрудник,
		|	ВТОсновынеНачисления.ВидРасчета КАК ВидРасчета,
		|	ВТОсновынеНачисления.Действие КАК Действие,
		|	ВТОсновынеНачисления.Показатель1 КАК Показатель1,
		|	ВТОсновынеНачисления.Показатель2 КАК Показатель2
		|ПОМЕСТИТЬ ВтНачисления
		|ИЗ
		|	&ВТОсновынеНачисления КАК ВТОсновынеНачисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВтНачисления.Сотрудник КАК Сотрудник,
		|	Начисления.Ссылка КАК Ссылка,
		|	ВтНачисления.Показатель1 КАК Показатель1,
		|	ПараметрыРасчетаЗППараметры.Значение КАК Значение,
		|	ВтНачисления.Показатель2 КАК Показатель2,
		|	омг_СпискиУслугДляРасчетаЗарплатыУслугиПодробно.Услуга КАК Услуга,
		|	омг_СпискиУслугДляРасчетаЗарплатыУслугиПодробно.Приоритет КАК Приоритет,
		|	ВтНачисления.ВидРасчета КАК ВидРасчета,
		|	омг_СпискиУслугДляРасчетаЗарплатыУслугиПодробно.Ссылка КАК ДокументСписок,
		|	&ВводСведенийЗП КАК ВводСведенийЗП
		|ИЗ
		|	ВтНачисления КАК ВтНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.Начисления КАК Начисления
		|		ПО ВтНачисления.ВидРасчета = Начисления.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПараметрыРасчетаЗП.Параметры КАК ПараметрыРасчетаЗППараметры
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.омг_СпискиУслугДляРасчетаЗарплаты.УслугиПодробно КАК омг_СпискиУслугДляРасчетаЗарплатыУслугиПодробно
		|			ПО ПараметрыРасчетаЗППараметры.Значение = омг_СпискиУслугДляРасчетаЗарплатыУслугиПодробно.Ссылка
		|		ПО ВтНачисления.Показатель2 = ПараметрыРасчетаЗППараметры.Ссылка
		|ГДЕ
		|	ВтНачисления.Действие В(&СписокДействий)
		|	И Начисления.омг_ИспользуетсяПриоритизацияУслуг
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник,
		|	ВтНачисления.ВидРасчета";  
		
		СписокДействий = Новый СписокЗначений;
		СписокДействий.Добавить(Перечисления.ВидыДействияСНачислением.Начать);
		СписокДействий.Добавить(Перечисления.ВидыДействияСНачислением.НеИзменять);
		СписокДействий.Добавить(Перечисления.ВидыДействияСНачислением.Изменить);

		Запрос.УстановитьПараметр("СписокДействий", СписокДействий);
		Запрос.УстановитьПараметр("ВТОсновынеНачисления", ВТОсновынеНачисления); 
		Запрос.УстановитьПараметр("ВводСведенийЗП", Источник.Ссылка);
		
		
		РезультатЗапроса = Запрос.Выполнить();
		ТабДвижения = РезультатЗапроса.Выгрузить();
		ТабДвижения.Свернуть("Сотрудник,Ссылка,Показатель1,Значение,Показатель2,Услуга,Приоритет,ВидРасчета,ДокументСписок,ВводСведенийЗП");
		СписокЗаписей.Загрузить(ТабДвижения);
		СписокЗаписей.Записать(); 
		
		КонецЕсли;
	
КонецПроцедуры	

Функция ПроверкаНаПриоритизациюУслуг(ОбъектПроверки) Экспорт
	
	ВозНачение = Ложь;
	
	Если ТипЗнч(ОбъектПроверки) = Тип("СправочникСсылка.ПараметрыРасчетаЗП") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПараметрыРасчетаЗП.омг_ИспользуетсяПриоритизацияУслуг КАК омг_ИспользуетсяПриоритизацияУслуг
		|ИЗ
		|	Справочник.ПараметрыРасчетаЗП КАК ПараметрыРасчетаЗП
		|ГДЕ
		|	ПараметрыРасчетаЗП.Ссылка = &ОбъектПроверки";
		
		Запрос.УстановитьПараметр("ОбъектПроверки", ОбъектПроверки);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ВозНачение = ВыборкаДетальныеЗаписи.омг_ИспользуетсяПриоритизацияУслуг
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат ВозНачение;
	
КонецФункции

Функция ВернутьАктуальнуюШкалу(Шкала,Дата) Экспорт	
	
	ТабВозв = Новый ТаблицаЗначений;
	ТабВозв.Колонки.Добавить("ЗначениеС",Новый ОписаниеТипов("Число"));	
	ТабВозв.Колонки.Добавить("ЗначениеПо",Новый ОписаниеТипов("Число"));	
	ТабВозв.Колонки.Добавить("Размер",Новый ОписаниеТипов("Число"));	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШкалыРасчетаСоставШкалы.ЗначениеС КАК ЗначениеС,
	|	ШкалыРасчетаСоставШкалы.ЗначениеПо КАК ЗначениеПо,
	|	ШкалыРасчетаСоставШкалы.Размер КАК Размер,
	|	ШкалыРасчетаСоставШкалы.омг_Период КАК омг_Период
	|ИЗ
	|	Справочник.ШкалыРасчета.СоставШкалы КАК ШкалыРасчетаСоставШкалы
	|ГДЕ
	|	ШкалыРасчетаСоставШкалы.Ссылка = &Шкала
	|	И ШкалыРасчетаСоставШкалы.омг_Период <= &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШкалыРасчетаСоставШкалы.омг_Период УБЫВ,
	|	ШкалыРасчетаСоставШкалы.ЗначениеС";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Шкала", Шкала);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Сч = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Сч = 0 Тогда 
			ЗаполнитьЗначенияСвойств(ТабВозв.Добавить(),ВыборкаДетальныеЗаписи); 
			Сч = 1;
			ДатаСтроки = ВыборкаДетальныеЗаписи.омг_Период;
			Продолжить;
		КонецЕсли; 
		
		Если ДатаСтроки = ВыборкаДетальныеЗаписи.омг_Период Тогда 
			ЗаполнитьЗначенияСвойств(ТабВозв.Добавить(),ВыборкаДетальныеЗаписи);
		иначе
			Возврат ТабВозв
		КонецЕсли;  
		
	КонецЦикла;
	
	Возврат ТабВозв;
	
КонецФункции

Функция ВернутьФилиалыПоОрганизации(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Филиалы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Филиалы КАК Филиалы
		|ГДЕ
		|	Филиалы.Организация = &Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	Филиалы.Ссылка";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции	