// Данная форма изначально разработана для работы с dcm4chee
// В последующем, использование этой формы предполагается для работы с другими
// PACS и RIS системами, К примеру, Orthanc.
#Область РазделОписанияПеременных

&НаКлиенте
Перем СоответствиеРасширений;

#КонецОбласти 

#Область СтандартныеСобытия

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//  ВладелецФормы обязан быть (на него записываем файлы), иначе мы прерываем открытие
	Если Параметры.Свойство("ДокументВладелец") И ЗначениеЗаполнено(Параметры.ДокументВладелец) Тогда
		ДокументВладелец = Параметры.ДокументВладелец;	
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(НСтр("ru='Ошибка получения документа-владельца исследований!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Сотрудник") Тогда	
		Сотрудник = Параметры.Сотрудник;		
	КонецЕсли;
	Если Параметры.Свойство("Филиал") Тогда	
		Филиал = Параметры.Филиал;		
	КонецЕсли;
	Если Параметры.Свойство("Клиент") Тогда	
		Клиент = Параметры.Клиент;		
	КонецЕсли;
	
	
	// Заполняем данными из регистра + переданные
	Если Параметры.Свойство("МассивУслуг") Тогда	
		ЗаполнениеТаблицыИсходныхДанных(Параметры.МассивУслуг);	
	Иначе		
		ЗаполнениеТаблицыИсходныхДанных(Новый Массив);
	КонецЕсли;
	
КонецПроцедуры

// Заполнение таблицы исходных данных в порядке приоритета - сначала регистр, потом переданный массив услуг/наборов
//
// Параметры:
//  МассивУслуг	 - Массив - Массив ссылок на справочник Номенклатуры, передаётся документом-родителем
//
&НаСервере
Процедура ЗаполнениеТаблицыИсходныхДанных(МассивУслуг)
	
	// Получаем данные по ДокументуРодителю, если они есть - значит это переоткрытие и массив услуг только дополняет 
	// Мы преоретизируем фактически отправленные данные (со StudyUID), если была ситуация где удалены данные из приёма
	// Отправленные данные будут удаляться в последнюю очередь
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	DICOMДанныеУченийСРасшифровкой.StudyUID КАК StudyUID,
		|	DICOMДанныеУченийСРасшифровкой.ВремяОтправки КАК ВремяОтправки,
		|	DICOMДанныеУченийСРасшифровкой.Номенклатура КАК Номенклатура,
		|	DICOMДанныеУченийСРасшифровкой.Оборудование КАК Оборудование,
		|	DICOMДанныеУченийСРасшифровкой.УдаленПользователем КАК УдаленПользователем,
		|	DICOMДанныеУченийСРасшифровкой.SPSUID КАК SPSUID
		|ИЗ
		|	РегистрСведений.DICOMДанныеУченийСРасшифровкой КАК DICOMДанныеУченийСРасшифровкой
		|ГДЕ
		|	DICOMДанныеУченийСРасшифровкой.Документ = &ДокументВладелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	StudyUID";
	
	Запрос.УстановитьПараметр("ДокументВладелец", ДокументВладелец);	
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтрокаStudyUID = Строка(ВыборкаДетальныеЗаписи.StudyUID);
		СтрокаSPSUID = ВыборкаДетальныеЗаписи.SPSUID;
		// Заполняем таблицу старыми данными, удаленные данные необходимо закинуть в скрытую таблицу, т.к.
		// Иначе они будут затерты при закрытии, но пользователю их нельзя показывать
		// Возможно, в будущем позволим пользователю "восстановить" их
		ИндексМассива = МассивУслуг.Найти(ВыборкаДетальныеЗаписи.Номенклатура);
		
		Если ВыборкаДетальныеЗаписи.УдаленПользователем
			ИЛИ ИндексМассива = Неопределено
			Тогда
			
			// Такая запись была удалена в какой-то момент работы (т.е. она была, мы её запомнили, но потом пользователь её удалил)
			// Просто записываем в альтернативную таблицу для удалённых
			НоваяСтрокаИсх = УникальныеДанныеПоDICOMСопрДанные.Добавить();
			// Не нужно генерировать скрытый номер, мы используем сохранённое значение
			НоваяСтрокаИсх.УникальныйНомер = СгенерироватьИЗапомнитьStudyUID(СтрокаStudyUID,СтрокаSPSUID);		 
			
		Иначе
			// Выкидываем из массива повторки - по одной за раз, т.к. одна номенклатура = одно исследование
			// Поскольку "удаленные" работы не пропадают, а находятся в скрытой таблице - то удаляем только при нахождении видимых
			МассивУслуг.Удалить(ИндексМассива);
				
			НоваяСтрокаИсх = ИсходныеДанныеStudy.Добавить(); 
			
			// Не нужно генерировать скрытый номер, мы используем сохранённое значение
			НоваяСтрокаИсх.СкрытыйНомер = СгенерироватьИЗапомнитьStudyUID(СтрокаStudyUID,СтрокаSPSUID);		 
			ФорматРендераОборудования = ВыборкаДетальныеЗаписи.Оборудование.ФорматРендера;
			ФорматРендераОборудования = СтрЗаменить(ФорматРендераОборудования," ","");
			ФорматРендераОборудования = СтрЗаменить(ФорматРендераОборудования,".","");
			НоваяСтрокаИсх.ФорматРендера = ?(ФорматРендераОборудования = "","jpeg",ФорматРендераОборудования);
			
		КонецЕсли;
		
		НоваяСтрокаИсх.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура; 
		НоваяСтрокаИсх.ВремяОтправки = ВыборкаДетальныеЗаписи.ВремяОтправки;
		НоваяСтрокаИсх.УжеОтправлялся = ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВремяОтправки);
		НоваяСтрокаИсх.Оборудование = ВыборкаДетальныеЗаписи.Оборудование;
		
	КонецЦикла;
	
	// Из переданного массива мы удалили повторы с регистром, заполним новые строки
	// Из Документа-Родителя ВСЕГДА в исходную таблицу добавляем что осталось, т.к. в приёме ВСЕГДА актуальная информация
	// Т.е. в массиве новые ещё не выполненные и не занесённые в базу данные об услугах
	Для каждого СсылкаУслуги Из МассивУслуг Цикл
		
		НоваяСтрокаИсх = ИсходныеДанныеStudy.Добавить();	
		НоваяСтрокаИсх.Номенклатура = СсылкаУслуги; 
		// На данный момент МЫ ГЕНЕРИРУЕМ НОВЫЕ ЗНАЧЕНИЯ УИД, это сделано потому что есть ситуации,
		// Когда UID услуг может быть перепутан из Приема и это НЕДОПУСТИМО. Мы не знаем какая конкретно услуга 		
		// (если две одинаковых номенклатуры) должна быть удалена.
		// УИД приёма используется в "старой"/"универсальной" версии, где берётся запрос по приёму с самого начала
		// Но в каждой версии мы создаём учение как новое. Т.е. в старой версии мы создали учение, сменили настройки
		// И теперь создаём новое в dcm4chee, это должно трактоваться КАК ДВА РАЗНЫХ УЧЕНИЯ. В целях безопасности информации
		// Если так хочется закинуть в новый PACS сделанное как-либо учение, то это будет функционал загрузки старого.
		// Следовательно, использовать УИД из Приема НЕ МОЖЕМ. Генерируем свой.
		НоваяСтрокаИсх.СкрытыйНомер = СгенерироватьИЗапомнитьStudyUID();		
		ПодобратьОборудование(НоваяСтрокаИсх.Номенклатура, НоваяСтрокаИсх.ПолучитьИдентификатор());
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Заполним данные и проверим их доступность
	НастройкиСистемыDICOM = DICOMОбщий.ЗаполнитьНастройкиСистемыDICOM(ОбщегоНазначенияКлиент.КлиентПодключенЧерезВебСервер());
	// Без KeyCloak реализации - запрещаем внешнее подключение (без VPN). Т.к. запросы работать не будут
	Если НастройкиСистемыDICOM = Неопределено Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(НСтр("ru='Ошибка внешнего подключения: Внешнее подключение запрещено. Используйте VPN'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ПриОткрытии_ПросмотрРезультатовИсследований();	
	
	Если НастройкиСистемыDICOM.НайтиПоЗначению("AETLМенеджера").Представление = Неопределено Тогда
		//PACS-часть не может быть доступна
	    Элементы.КомандыРаботыСStudy.Доступность = Ложь;
		Элементы.ГруппаРезультатыИсследования.Доступность = Ложь;
	КонецЕсли;
	Если НастройкиСистемыDICOM.НайтиПоЗначению("AETLЛистов").Представление = Неопределено Тогда	
		//RIS-часть не может быть доступна
	    Элементы.КомандыРаботыСWorklist.Доступность = Ложь;
	КонецЕсли;

	// Заполняем сразу же относительно статичные данные
	ЗаполнитьОбщиеДанныеWorklist();
	
	// Веб клиенту не запрещено использовать форму, но только с ограничениями
	#Если ВебКлиент Или МобильныйКлиент Тогда
		Элементы.КомандыРаботыСStudy.Видимость = Ложь;
		Элементы.ГруппаРезультатыИсследования.Видимость = Ложь;
	#КонецЕсли
	  
	// Особенность работы с dcm4chee
	// Проверим наличие пациента в базе PACS. Если его нет - необходимо его создать
	// Если не найден - то это ошибка работы и мы "уходим" - Оповещение пользователю находится внутри функции 
	// Функция вызывается ПОСЛЕ заполнения статичных данных, т.к. при отсутствии пациента эти данные его создают
	ПациентЕстьВPacs = НайтиПациентаВPACS(Истина);
	Если ПациентЕстьВPacs = Неопределено Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(НСтр("ru='Ошибка нахождения пациента в системе dcm4chee. Проверьте ваше подключение к серверу dcm4chee!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	// Для удобства пользователя отметим все НЕ отправленные учения галочкой.
	Для каждого СтрокаТаблицыИсх Из ИсходныеДанныеStudy Цикл	
		СтрокаТаблицыИсх.Выбрано =  НЕ	СтрокаТаблицыИсх.УжеОтправлялся;	
	КонецЦикла;
	
КонецПроцедуры

// Заполняем уникальные данные. Это скрытая таблица, которая существует всё время и сохраняется в памяти, имеет все необходимые UID
&НаКлиенте
Процедура ЗаполнитьОбщиеДанныеWorklist()

	ДанныеДляWorklistСтатичные.Очистить();
	
	// Таблицу УникальныхДанных лучше заполнять отдельно
	ДобавитьДанныеВТаблицу(УникальныеДанныеПоDICOM,Новый Структура("Название, ОписаниеТега, Значение","PatientID", "а00100020", Строка(Клиент.УникальныйИдентификатор())),
							Новый Структура("Название, Значение","PatientID", Строка(Клиент.УникальныйИдентификатор())) );	

	// Теги всегда одинаковые, мы их формируем в общем модуле и получаем массивом структур
	ПолученныйМассивСтруктур = DICOMОбщийКлиент.СформироватьМассивСтатичнойСериализации(Клиент, Сотрудник);	
	Для каждого СтрокаСтруктурой Из ПолученныйМассивСтруктур Цикл	
		
		СтруктураДобавленияВТаблицу = Новый Структура("Тег, Визуализация, Описание, ЗначЗаполнения", СтрокаСтруктурой.Тег,
														СтрокаСтруктурой.Визуализация, СтрокаСтруктурой.Описание, 
														СтрокаСтруктурой.ЗначЗаполнения);
														
		ДобавитьДанныеВТаблицу(ДанныеДляWorklistСтатичные, СтруктураДобавленияВТаблицу);					
	КонецЦикла;
	
КонецПроцедуры             
              
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ ЗавершениеРаботы 
	И DCM4CHEEКлиент.ПолучитьДоступКРегиструУчений()	Тогда	
		// Заполним регистр сведений
		ЗаписатьДанныеФормыВРегистрDICOMДанныеУченийСРасшифровкой();				
	КонецЕсли; 	
	
	// При просмотре программа создаёт временные файлы, которые потом надо удалить
	// У нас есть перечень созданных файлов - УДАЛЯЕМ ВСЁ
	УдалитьВсеСтарыеВременныеФайлы(Неопределено, Неопределено, Истина); 
		
КонецПроцедуры

#КонецОбласти

#Область ОбработкиСобытий

// Проверяем в удаляемых строках - есть ли они уже в системе - 
// MWL -> удаляем MWL и запись об УИД
// Study/MPPS -> Делаем пометку, что пользователь удалил эту строку нафиг
// Нигде нет -> Удаляем запись об УИД
&НаКлиенте
Процедура ИсходныеДанныеStudyПередУдалением(Элемент, Отказ)
	
	// Обрабатываем все удаляемые строки
	ИндетификаторыСтрокНаУдаление = Элемент.ВыделенныеСтроки;
	УдалениеСПроверкойУстаревшихУИДОВ(ИндетификаторыСтрокНаУдаление);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходныеДанныеStudyОборудованиеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИзменяемыеДанные = ТекущийЭлемент.ТекущиеДанные; 
	
	ПараметрыОткрытия = Новый Структура("Номенклатура, Филиал",ИзменяемыеДанные.Номенклатура, Филиал);
	ОткрытьФорму("Справочник.МедицинскоеОборудование.ФормаВыбора", ПараметрыОткрытия, Элемент);
		
КонецПроцедуры

&НаКлиенте
Процедура ИсходныеДанныеStudyОборудованиеПриИзменении(Элемент)
	
	// При изменении оборудования - подтягиваем его формат рендера (после выбора)
	ИзменяемыеДанные = ТекущийЭлемент.ТекущиеДанные;
	Если Не ЗначениеЗаполнено(ИзменяемыеДанные.Оборудование) Тогда	
		Возврат;		
	КонецЕсли;
	
	Попытка
		ЗначениеРеквизита = ДопСерверныеФункции.ПолучитьРеквизит(ИзменяемыеДанные.Оборудование,"ФорматРендера");		
	Исключение
		// Реквизита нет 
		ИзменяемыеДанные.ФорматРендера = "jpeg";
		Возврат;
	КонецПопытки;
	
	Если ЗначениеРеквизита = "" Тогда
		ИзменяемыеДанные.ФорматРендера = "jpeg";
	Иначе
		ЗначениеРеквизита = СтрЗаменить(ЗначениеРеквизита," ","");
		ЗначениеРеквизита = СтрЗаменить(ЗначениеРеквизита,".","");

		ИзменяемыеДанные.ФорматРендера = ЗначениеРеквизита;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсходныеДанныеStudyНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	// При смене номенклатуры мы ВСЕГДА должны изменять скрытый номер, т.к. могут быть повторы. 
	ИзменяемыеДанные = ТекущийЭлемент.ТекущиеДанные;
	
	// Создадим копию старой записи, если мы уже её отправляли (В ином случае, запись является пустышкой)
	Если ИзменяемыеДанные.УжеОтправлялся Тогда
		               
		НоваяСтрокаДанных = ИсходныеДанныеStudy.Вставить(ИсходныеДанныеStudy.Индекс(ИзменяемыеДанные));
		ЗаполнитьЗначенияСвойств(НоваяСтрокаДанных,ИзменяемыеДанные);
		ИзменяемыеДанные.ВремяОтправки = Неопределено;
		ИзменяемыеДанные.УжеОтправлялся = Ложь;
		
		ИзменяемыеДанные.СкрытыйНомер = СгенерироватьИЗапомнитьStudyUID();
	ИначеЕсли Не ЗначениеЗаполнено(ИзменяемыеДанные.СкрытыйНомер) Тогда
		
		// Новая строка, присваиваем скрытый номер
		ИзменяемыеДанные.СкрытыйНомер = СгенерироватьИЗапомнитьStudyUID();
	КонецЕсли;
	
	ИзменяемыеДанные.Номенклатура = ВыбранноеЗначение;
	
	// Обновляем список данных на выбор оборудования
	ПодобратьОборудование(ВыбранноеЗначение, ИзменяемыеДанные.ПолучитьИдентификатор());
	
КонецПроцедуры

#Область ПросмотрРезультатовИсследования

//Элемент -	ТаблицаФормы
&НаКлиенте
Процедура ПолученныеФайлыПриАктивизацииСтроки(Элемент)
		
	ТекДанные = Элемент.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Позволяем удалять данные из ХранилищаДополнительнойИнформации, если они вообще есть
	Если ЗначениеЗаполнено(ТекДанные.СкрытаяСсылкаХДИ) Тогда
		Элементы.ФормаУдалитьИзХранилища.Видимость = Истина;
	Иначе	
	    Элементы.ФормаУдалитьИзХранилища.Видимость = Ложь;
	КонецЕсли;
	
	// Обновляем отображение выбранной строки
	ОбновитьПредпросмотр(ТекДанные);
	
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти

#Область КомандыФормыБезПривязкиК_PACS_RIS_Серверам

// Обновление после ручного изменения приёма - повторно получаем всё для Worklists
// Также повторно получаем услуги
&НаКлиенте
Процедура ОбновитьРеквизиты(Команда)
		
	// Филиал, ДанныеСотрудник, Клиент
	Клиент = ДопСерверныеФункции.ПолучитьРеквизит(ДокументВладелец, "Клиент");
	Филиал = ДопСерверныеФункции.ПолучитьРеквизит(ДокументВладелец, "Филиал");
	Врач = ДопСерверныеФункции.ПолучитьРеквизит(ДокументВладелец, "Врач");

	// Обновляем данные таблицы - клиент
	ЗаполнитьОбщиеДанныеWorklist();
	
	// Обновляем список услуг на исследование
	ПерезаполнитьПоДокументуУслуги();	
	
	// Обновляем Настройки использования DICOM. Возможна ситуация, когда мы перезаписали настройки
	// И надо проверить отдельно доступ к RIS и к PACS.
	НастройкиСистемыDICOM = DICOMОбщий.ЗаполнитьНастройкиСистемыDICOM(ОбщегоНазначенияКлиент.КлиентПодключенЧерезВебСервер());
	Если НастройкиСистемыDICOM.НайтиПоЗначению("AETLЛистов").Представление = Неопределено Тогда	
		//RIS-часть не может быть доступна
		Элементы.КомандыРаботыСWorklist.Доступность = Ложь;
	Иначе
		Элементы.КомандыРаботыСWorklist.Доступность = Истина;
	КонецЕсли;
	
	#Если НЕ ВебКлиент Или НЕ МобильныйКлиент Тогда	
		Если НастройкиСистемыDICOM.НайтиПоЗначению("AETLМенеджера").Представление = Неопределено Тогда
			//PACS-часть не может быть доступна
		    Элементы.КомандыРаботыСStudy.Доступность = Ложь;
			Элементы.ГруппаРезультатыИсследования.Доступность = Ложь;
		Иначе
			Элементы.КомандыРаботыСStudy.Доступность = Истина;
			Элементы.ГруппаРезультатыИсследования.Доступность = Истина;
		КонецЕсли; 
	#КонецЕсли
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВсеУченияВыделить(Команда) 
	      
	Если Команда.Имя="ВсеУченияВыделить" Тогда
		ЗначениеВыделения = Истина;
	ИначеЕсли Команда.Имя="ВсеУченияСнятьВыделение" Тогда
	    ЗначениеВыделения = Ложь;
	Иначе
		Возврат;
	КонецЕсли;
		
	Для каждого СтрокаДанных Из ИсходныеДанныеStudy Цикл	
		СтрокаДанных.Выбрано = ЗначениеВыделения;		
	КонецЦикла;
	                            
КонецПроцедуры

#Область КомандыПросмотраРезультатовИсследования
&НаКлиенте
Процедура СохранитьКак(Команда)
	
	// Проверяем что мы хотим скачать
	СписокВыбранныхФайлов = Элементы.Просмотр_ПолученныеФайлы.ВыделенныеСтроки;
	Если СписокВыбранныхФайлов.Количество() = 0 Тогда	
		Возврат;
	КонецЕсли;

	// Получаем от пользователя каталог куда сохранять
	ДиалогСохраненияФайлов = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
    ДиалогСохраненияФайлов.Заголовок = "Выбор каталога сохранения файлов";
	ДиалогСохраненияФайлов.МножественныйВыбор = Ложь;
	
	// Модальный вызов, можно в будущем переделать на немодальный при желании
	Если ДиалогСохраненияФайлов.Выбрать() Тогда
		КаталогСохр = СтрШаблон("%1%2",ДиалогСохраненияФайлов.Каталог,ПолучитьРазделительПути());	
	Иначе
		Возврат;
	КонецЕсли;
	
	// Файл уже хранится физически в известной нам директиве (временные файлы), нам нужно только его продублировать
	Для каждого ИндексСтроки Из СписокВыбранныхФайлов Цикл
		
		МассивСтрок = Просмотр_КешПутейКФайлам.НайтиСтроки(Новый Структура("Исследование",Просмотр_ПолученныеФайлы.Получить(ИндексСтроки).Исследование));
		Для каждого СтрокаКешаПутей Из МассивСтрок Цикл	
			ИмяФайлаСРасширением = СтрокаКешаПутей.Исследование + "." + СтрокаКешаПутей.Расширение;
			КопироватьФайл(СтрокаКешаПутей.ПолныйПутьКФайлу,СтрШаблон("%1%2",КаталогСохр,ИмяФайлаСРасширением));		
		КонецЦикла;	
	КонецЦикла;
	
	// "Ошибка:успех"
	СтрокаОшибки = СтрШаблон(НСтр("ru='Успешно сохранено %1 файл(ов) в %2'"), СписокВыбранныхФайлов.Количество(), ДиалогСохраненияФайлов.Каталог);
	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИзХранилища(Команда)  
	
	// Позволим удалять только по одному элементу
	ДанныеТекущаяСтрока = Элементы.Просмотр_ПолученныеФайлы.ТекущиеДанные;
	Если ДанныеТекущаяСтрока = Неопределено 
		ИЛИ ДанныеТекущаяСтрока.СкрытаяСсылкаХДИ = Неопределено
		Тогда	
		Возврат;	
	КонецЕсли;	
	
	// Позволяем только удалять (без восстановления), чтоб не возникала проблема с данными
	СсылкаХДИ = ДанныеТекущаяСтрока.СкрытаяСсылкаХДИ; 
	РаботаСФайламиКлиент.УдалитьВосстановитьФайл(СсылкаХДИ,УчетнаяПолитика);
	Если НЕ УчетнаяПолитика.ХранитьФотоКлиентовКакФайлы Тогда
		УдалитьИзХранилищаСервер(СсылкаХДИ);
	КонецЕсли;	
	
	// редактируем таблицу
	ДанныеТекущаяСтрока.СкрытаяСсылкаХДИ = Неопределено;
	ДанныеТекущаяСтрока.ФайлСохранен = Ложь;
	ДанныеТекущаяСтрока.Сохранить = Ложь;
	Элементы.ФормаУдалитьИзХранилища.Видимость = Ложь;

	// ЭЦП - код взят из формы работы с файлами. Нужно ли? Код внутри закомментирован
	Если ЭЦП_УМЦ_Сервер.ПроверитьНеобходимостьПроверятьПодпись(ДокументВладелец) Тогда
		ЭЦП_УМЦ_Клиент.ПроверитьВсеПодписиОбъекта(ДокументВладелец);
	КонецЕсли;
	
	ОповеститьОбИзмененииСоставаФайлов(ДокументВладелец);
	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru='Исследование ""%1"" было удалено из базы'"),ДанныеТекущаяСтрока.Исследование));
	
КонецПроцедуры

// Процедура по очистке хранилища  
//
// Параметры:
//  СсылкаХДИ  - СправочникСсылка.ХранилищеДополнительнойИнформации - ссылка на элемент справочника у которого надо почистить хранилище
//
&НаСервереБезКонтекста
Процедура УдалитьИзХранилищаСервер(СсылкаХДИ)
	
	// Проверить удаление одного объекта дважды (т.е. наименование у них будет одинаковое)
	ОбъектХДИ = СсылкаХДИ.ПолучитьОбъект();
	ОбъектХДИ.Хранилище = Неопределено;
	ОбъектХДИ.Наименование = СтрШаблон("Стар_%1",ОбъектХДИ.Наименование); 
	ОбъектХДИ.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайлМодально(Команда)
	
	ДанныеТекущаяСтрока = Элементы.Просмотр_ПолученныеФайлы.ТекущиеДанные;
	Если ДанныеТекущаяСтрока = Неопределено Тогда	
		Возврат;	
	КонецЕсли;	
	
	// В таблице Кеша уже содержится полный путь к временным файлам
	МассивДанныхКеша = Просмотр_КешПутейКФайлам.НайтиСтроки(Новый Структура("Исследование",ДанныеТекущаяСтрока.Исследование));
	Если МассивДанныхКеша.Количество() = 0 Тогда	
		Возврат;	
	КонецЕсли;
	СтрокаКешаТекДанных = МассивДанныхКеша[0];	
	
	// Используем программу по умолчанию для открытия файлов заданного типа
	Файл = Новый Файл(СтрокаКешаТекДанных.ПолныйПутьКФайлу);
	Если Файл.Существует() Тогда
		ЗапуститьПриложение(Файл.ПолноеИмя);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьФайлыКДокументу(Команда)
		
	СписокВыбранныхФайлов = Просмотр_ПолученныеФайлы.НайтиСтроки(Новый Структура("Сохранить,ФайлСохранен",Истина,Ложь));
    Если СписокВыбранныхФайлов.Количество() = 0 Тогда		
        СтрокаОшибки = НСтр("ru='Ни один файл не выбран, отметьте нужные файлы флагом ""Прикрепить"" и попробуйте ещё раз'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаОшибки);
		Возврат;
	Иначе
		СохранитьФайлыСогласноУП(СписокВыбранныхФайлов);
	КонецЕсли;
	
	КоличествоСохраненных = Просмотр_ПолученныеФайлы.НайтиСтроки(Новый Структура("Сохранить,ФайлСохранен",Истина,Истина)).Количество();	
	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru='Из %1 файлов успешно прикреплено - %2'"),
														СписокВыбранныхФайлов.Количество(),КоличествоСохраненных));
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область RISОтправкаДанных

// Процедура - Отправить помеченные строки из таблицы с данными приёма в worklists 
//  используются данные таблицы ИсходныеДанныеStudy!
&НаКлиенте
Процедура ОтправитьПомеченныеWorklists(Команда)
		
	// Если мы пытаемся отправить повторно уже отправленные данные -
	// а) Мы ошиблись и хотим уйти
	// б) Мы хотим отправить новые и проигнорировать старые
	// в) Мы хотим отправить новые и изменить старые/ отвергнуть старые и заново их отправить  - это определяется в коде
	МассивДанныхЗаполнения = ИсходныеДанныеStudy.НайтиСтроки(Новый Структура("Выбрано, УжеОтправлялся", Истина, Истина));
	Если МассивДанныхЗаполнения.Количество() > 0 Тогда

		ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПовторноОтправитьПомеченныеWorklists",ЭтаФорма,МассивДанныхЗаполнения);
		
		СписокВариантовДействий = Новый СписокЗначений;
		СписокВариантовДействий.Добавить("Новые","Только новые");
		СписокВариантовДействий.Добавить("Все","Новые и старые");
		СписокВариантовДействий.Добавить("Отмена","Отмена");

		ПоказатьВопрос(ОписаниеОповещенияОЗавершении,
						НСтр("ru='Среди выбранных работ есть те, что уже были отправлены. Какие работы вы хотите отправить?'"),
						СписокВариантовДействий);	
	    Возврат;
	КонецЕсли;
	
	ПовторноОтправитьПомеченныеWorklists("Новые",Неопределено);
	
КонецПроцедуры

// Новые - Мы хотим отправить новые и проигнорировать старые
// Все - Мы хотим отправить новые и изменить старые/ отвергнуть старые и заново их отправить  - это определяется в коде
// Отмена - Мы ошиблись и хотим уйти
&НаКлиенте
Процедура ПовторноОтправитьПомеченныеWorklists(Результат, ДополнительныеСвойства) Экспорт
	
	// При отправке Worklists допускается переотправка
	// Сначала проверяем, что ответил пользователь (Будем ли мы переотправлять данные) 
	Если Результат = "Отмена" Тогда
		Возврат;
	ИначеЕсли Не DCM4CHEEКлиент.ПолучитьДоступКРегиструУчений() Тогда
		Возврат;
	ИначеЕсли Результат = "Все" Тогда
		
		// УДАЛЯЕМ СТАРЫЕ ВОРКЛИСТЫ (с сохранением важных)
		
		// Если не проходит соединение - мы прерываем все отправки
		Если Не DCM4CHEEКлиент.БыстраяПроверкаПодключенияDCM4CHEE(НастройкиСистемыDICOM.НайтиПоЗначению("AETLЛистовХост").Представление,
																НастройкиСистемыDICOM.НайтиПоЗначению("AETLЛистовПорт").Представление)
			Тогда			
				Возврат;			
		КонецЕсли;
		
		// Обрабатываем старые - проверяем их нахождение как MWL и Study в PACs
		// Если есть Worklist - то мы отвергаем старое WL (необходимо) и в штатном режиме отправляем MWL 
		Если ТипЗнч(ДополнительныеСвойства) <> Тип("Массив") Тогда
			Возврат;	
		КонецЕсли;	
		
		// Массив содержит элементы формы, поэтому изменяем сразу же в СтрокаДопСвойства
		Для каждого СтрокаДопСвойств Из ДополнительныеСвойства Цикл
			
			Попытка
				СтрокаУИДStudy = УникальныеДанныеПоDICOM.НайтиСтроки(Новый Структура("Название,ДопОпределитель","StudyInstanceUID",СтрокаДопСвойств.СкрытыйНомер))[0].Значение;				
			Исключение
				Продолжить;
			КонецПопытки;				
			
			// В DCM4CHEE RIS-сервере (минимум) ворклисты хранятся до момента начала работы по нему или удалению
			// Т.е. ворклист мы можем найти ТОЛЬКО если он не был удалён или что по нему не проводится(лась) работа
			Если НайтиДанныеMWL(СтрокаУИДStudy) = Истина Тогда
				
				// Мы будем заменять WL, это делается штатным методом
				ОтменитьWorklist(Неопределено, СтрокаУИДStudy);
				
			// Если Истина - то Study существует или в процессе работы, мы генерируем новый вариант
			ИначеЕсли НайтиДанныеStudy(СтрокаУИДStudy,Истина) = Истина 
				ИЛИ НайтиДанныеMPPS(СтрокаУИДStudy, Истина) = Истина
				Тогда
				
				// Сохраняем старый вариант
				// Создать новый УИД для учения (и запоминаем его в таблице)
				НоваяСтрокаКопияДанных = ИсходныеДанныеStudy.Добавить();	
				ЗаполнитьЗначенияСвойств(НоваяСтрокаКопияДанных,СтрокаДопСвойств);
				
				СтрокаДопСвойств.УжеОтправлялся = Неопределено;
				СтрокаДопСвойств.СкрытыйНомер = СгенерироватьИЗапомнитьStudyUID();				
			КонецЕсли;
			
			СтрокаДопСвойств.УжеОтправлялся = Ложь;
			// Помечаем как не отправленный, чтоб его отправили вместе с обычными	
		КонецЦикла;	
		
	КонецЕсли;
	

	// ОТПРАВЛЯЕМ ВОРКЛИСТЫ (все новые)
	
	// Если не проходит соединение - мы прерываем все отправки (принимаем, что соединение может сломаться в любой момент)
	Если Не DCM4CHEEКлиент.БыстраяПроверкаПодключенияDCM4CHEE(НастройкиСистемыDICOM.НайтиПоЗначению("AETLЛистовХост").Представление,
																НастройкиСистемыDICOM.НайтиПоЗначению("AETLЛистовПорт").Представление)
		Тогда			
		Возврат;			
	КонецЕсли;
	
	// Определяем все помеченные строки, чтоб с ними работать
	МассивДанныхЗаполнения = ИсходныеДанныеStudy.НайтиСтроки(Новый Структура("Выбрано, УжеОтправлялся", Истина, Ложь));	
	Если МассивДанныхЗаполнения.Количество() = 0 Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(НСтр("ru='Не выбрано ни одно исследование!'"));
		Возврат;
	КонецЕсли;
	
	// Для предотвращения поломки данных - проверяем наличие изменений в документе-владельце ДО отправки
	// Напоминание, что выше мы только УДАЛЯЛИ старые ворклисты и их данные
	//(или запоминали их, если они уже использовались/используются)
	Если DICOMОбщий.ДокументИзмененПоКритическимЗначениям(ДокументВладелец,Филиал,Клиент) Тогда
		
		ОбновитьРеквизиты(Неопределено);
		
		// Параноидальная проверка на очень тупую ситуацию, когда помеченный ворклист мы удалили из оригинального приёма
		МассивДанныхЗаполнения = ИсходныеДанныеStudy.НайтиСтроки(Новый Структура("Выбрано, УжеОтправлялся", Истина, Ложь));
		Если МассивДанныхЗаполнения.Количество() = 0 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(НСтр("ru='После обновлении списка услуг не осталось выбранных услуг!'"));
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	// Каждую по отдельности мы сериализуем, сохраняем значимую информацию на форме,
	// Отправляем ворклист(И проверяем, что он был доставлен корректно)
	//Сотрудник СкрытыйНомер Оборудование Номенклатура Клиент ДокументОснование	
	Для каждого СтрокаИзначальныхДанных Из МассивДанныхЗаполнения Цикл
		
		// Проверяем на пустышку (нам необходимо иметь Уникальный код. который создаётся при выборе номенклатуры)
		// Так же если нет AEtitle - то ворклист будет заранее порченным. Мы заранее знаем, что все доступные оборудования корректны
		Если ПустаяСтрока(СтрокаИзначальныхДанных.СкрытыйНомер)
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаИзначальныхДанных.Оборудование)
			Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru='У номенклатуры (%1) не указано оборудование, его отправка отменена'"), СтрокаИзначальныхДанных.Номенклатура));
			Продолжить;	
		КонецЕсли;
		
		// Обновляем динамические данные по Worklist
		ДанныеДляWorklist.Очистить();
		СериализоватьДанныеДляWorkList(СтрокаИзначальныхДанных.Номенклатура,СтрокаИзначальныхДанных.Оборудование,СтрокаИзначальныхДанных.СкрытыйНомер);
		   
		РезультатОтправки = ОтправитьДанныеMWL();
		Если РезультатОтправки Тогда
			// В ответе возвращается неактуальный тег 0040,0009. поэтому мы должны его получить отдельно
			НайтиДанныеMWL(СтрокаИзначальныхДанных.СкрытыйНомер,Истина);
			СтрокаИзначальныхДанных.УжеОтправлялся = Истина; 
			СтрокаИзначальныхДанных.ВремяОтправки = ТекущаяДата();	
		КонецЕсли;
		
	КонецЦикла;	
	
	// Для предотвращения утечки данных после редактирования - перезаписываем в регистр данные по учениям
	// Критически необходимо помнить StudyUID
	ЗаписатьДанныеФормыВРегистрDICOMДанныеУченийСРасшифровкой();
	
КонецПроцедуры

// Сериализация данных, изменяемых пользователем в процессе использования. Использует таблицу ВытянутыеДанныеДляWorklist
//
// Параметры:
//  ДанныеНоменклатура	 - СсылкаНоменклатура 				- 
//  ДанныеСотрудник		 - СсылкаСотрудник	 				- Сотрудник, фактически проводящий работу. Предполагается, что в будущем может быть изменён 
//  ДанныеОборудование	 - СсылкаМедицинскоеОборудование	- 
//  СкрытыйНомер		 - Строка							- Значение, по которому однозначно определяется строка данных по учению среди всех допустимых таблиц
//
&НаКлиенте
Процедура СериализоватьДанныеДляWorkList(Знач ДанныеНоменклатура,Знач ДанныеОборудование,Знач СкрытыйНомер)

	// По STUDY UID необходимо проверить - существуют ли такие study в целом в уникальном (а значит мы их уже видели), если нет - создаём, если да - записываем только во временные данные
	СгенерироватьИЗапомнитьStudyUID(СкрытыйНомер);	
	
	МассивДинамСериализДанных = DICOMОбщийКлиент.СформироватьМассивДинамическойСериализации(ДанныеДляWorklistСтатичные,ДанныеНоменклатура,ДанныеОборудование);
												
	Для каждого СтрокаСтруктурой Из МассивДинамСериализДанных Цикл	
		
		СтруктураДобавленияВТаблицу = Новый Структура("Тег, Визуализация, Описание, ЗначЗаполнения, ТегРодитель", СтрокаСтруктурой.Тег,СтрокаСтруктурой.Визуализация,
														СтрокаСтруктурой.Описание, СтрокаСтруктурой.ЗначЗаполнения, СтрокаСтруктурой.ТегРодитель);
														
		ДобавитьДанныеВТаблицу(ДанныеДляWorklist, СтруктураДобавленияВТаблицу);			
		
	КонецЦикла;																		
																		
КонецПроцедуры 

//POST запрос к MWL-RS "create/Update Scheduled Procedure Step" - Т.е. Если данные уже были в PACS - то мы его просто перезаписываем 
//
&НаКлиенте
Функция ОтправитьДанныеMWL()
	
	Если ДанныеДляWorklist.Количество() < 1 Тогда
		//ОбщегоНазначенияКлиентСервер.СообщитьОбОшибке(НСтр("ru='Проверка не пройдена по причине нет данных исследования'"));	
		Возврат Ложь;
	КонецЕсли;
			
	ОписаниеНоменклатуры = "";
    СтруктураТелаЗапроса = Новый Структура();
	Для каждого СтрДанныхВорклиста Из ДанныеДляWorklist Цикл
		// Запомним какая номенклатура обрабатывается
		Если СтрДанныхВорклиста.Описание = "RequestedProcedureDescription" Тогда
			ОписаниеНоменклатуры = DICOMОбщий.ОбратнаяТранслитерация(СтрДанныхВорклиста.ЗначЗаполнения);
		КонецЕсли;
		
		Если ПустаяСтрока(СтрДанныхВорклиста.ТегРодитель) Тогда
			
			// стандартный тег со значением
			ВнутрСтруктура= Новый Структура;
			ВнутрСтруктура.Вставить("ЗначValue",СтрДанныхВорклиста.ЗначЗаполнения);
			ВнутрСтруктура.Вставить("Визуализация",СтрДанныхВорклиста.Визуализация);
			СтруктураТелаЗапроса.Вставить(СтрДанныхВорклиста.Тег,ВнутрСтруктура);	
			
		Иначе
			// У тега есть родитель, а значит надо затолкать во внутрь.
			// Теги могут быть неупорядоченными по родителю 
			ЗначениеПоиска = Неопределено;
			Если СтруктураТелаЗапроса.Свойство(СтрДанныхВорклиста.ТегРодитель,ЗначениеПоиска) Тогда
				// Мы уже встретили значение в структуре
				// Только добавляем. Возвращается ВнутрСтруктура
				ПодВнутрСтруктура= Новый Структура;
				ПодВнутрСтруктура.Вставить("ЗначValue",СтрДанныхВорклиста.ЗначЗаполнения);
				ПодВнутрСтруктура.Вставить("Визуализация",СтрДанныхВорклиста.Визуализация);
				ЗначениеПоиска.Вставить(СтрДанныхВорклиста.Тег, ПодВнутрСтруктура);
				
				СтруктураТелаЗапроса.Вставить(СтрДанныхВорклиста.ТегРодитель,ЗначениеПоиска);
				
			Иначе	
				// Значения этого нет - создаём по новой
				ПодВнутрСтруктура= Новый Структура;
				ПодВнутрСтруктура.Вставить("ЗначValue",СтрДанныхВорклиста.ЗначЗаполнения);
				ПодВнутрСтруктура.Вставить("Визуализация",СтрДанныхВорклиста.Визуализация);
				ВнутрСтруктура = Новый Структура(СтрДанныхВорклиста.Тег, ПодВнутрСтруктура);
				
				СтруктураТелаЗапроса.Вставить(СтрДанныхВорклиста.ТегРодитель,ВнутрСтруктура);
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Ответ = DICOMОбщийКлиент.ПолучитьОтветПоЗапросуDICOM("ОтправитьДанныеMWL", "POST", НастройкиСистемыDICOM,"AETLЛистов",СтруктураТелаЗапроса);
	               
	// Обработка ответа	
	Если (Ответ = Неопределено) Тогда
		// Ошибка соединения
		Возврат Ложь;
	ИначеЕсли DICOMОбщийКлиент.КодВозвратаУспех(Ответ.КодСостояния) Тогда		
		// Тело содержит только ID нового элемента (с указанием источника ID)
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru='MWL (%1) успешно создан'"), ОписаниеНоменклатуры));	
		Возврат Истина;	
	Иначе                                                                                                              
		СтрокаОшибки = СтрШаблон(НСтр("ru='Ошибка создания MWL номенклатуры (%1), код: %2'"), ОписаниеНоменклатуры, Ответ.КодСостояния);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаОшибки);
		Возврат Ложь;	
	КонецЕсли;
	// 200 - Объект успешно добавлен, ЕСТЬ ТЕЛО - надо обрабоать, вернётся строка
	// 403 - Ошибка - НЕЛЬЗЯ создавать для связанных пациентов MWL
	// 404 в основном связана с тем, что нет такого пациента или какое-то значение неправильно сформировано
	
КонецФункции  

// DELETE запрос к MWL-RS "Delete Scheduled Procedure Step" 
&НаКлиенте
Процедура ОтменитьWorklist(Команда, ДопЗначение = Неопределено)
	
	Если Не DCM4CHEEКлиент.ПолучитьДоступКРегиструУчений() Тогда
		Возврат;
	КонецЕсли;
	
	// Вызываем при повторном отправлении WL, когда те ещё не были обработаны, мы передаём СтрокаУИДStudy	
	Если ДопЗначение <> Неопределено Тогда

		ScheduledProcedureStepID = УникальныеДанныеПоDICOM.НайтиСтроки(Новый Структура("Название,Значение","StudyInstanceUID",ДопЗначение))[0].СвязанноеЗначение;				
		
		СтруктураТелаЗапроса = Новый Структура("ScheduledProcedureStepID, StudyUID",ScheduledProcedureStepID, ДопЗначение);		
		Ответ = DICOMОбщийКлиент.ПолучитьОтветПоЗапросуDICOM("ОтменитьWorklist", "DELETE", НастройкиСистемыDICOM,"AETLЛистов",СтруктураТелаЗапроса);	
	
		// В целом не особо важно как вернулся ответ для текущего состояния программы, возможно изменить в будущем
		// Т.к. это вызывается из места, где удаление нужно для оптимизации данных и не является обязательным
		Возврат;
	КонецЕсли;	
	
	// Мы не будем проверять - отправляли ли уже в этой форме строки
	МассивДанныхЗаполнения = ИсходныеДанныеStudy.НайтиСтроки(Новый Структура("Выбрано", Истина));	
	Для каждого ТекСтрокаДанные Из МассивДанныхЗаполнения Цикл
		
		// AET, StudyУИД, ScheduledProcedureStepID
		Попытка
			СтрокаУникальных = УникальныеДанныеПоDICOM.НайтиСтроки(Новый Структура("Название,ДопОпределитель","StudyInstanceUID",ТекСтрокаДанные.СкрытыйНомер))[0];				
			StudyУИД = СтрокаУникальных.Значение;			
			ScheduledProcedureStepID = СтрокаУникальных.СвязанноеЗначение; 
			Если ПустаяСтрока(StudyУИД) Тогда			
				Продолжить;				
			КонецЕсли;
		Исключение
			Продолжить;
		КонецПопытки;
		
		СтруктураТелаЗапроса = Новый Структура("ScheduledProcedureStepID, StudyUID",ScheduledProcedureStepID, StudyУИД);
		
		Ответ = DICOMОбщийКлиент.ПолучитьОтветПоЗапросуDICOM("ОтменитьWorklist", "DELETE", НастройкиСистемыDICOM,"AETLЛистов",СтруктураТелаЗапроса);	
		                 
		// 204 - Объект успешно удалён
		// 404 - Ошибка УИДов (один из двух) - Либо нет учения вовсе (не ошибка в данной функции), либо нет такого AEтла
		Если (Ответ = Неопределено) Тогда
			// Ошибка соединения, продолжать не имеет смысла
			СтрокаСообщения = СтрШаблон(НСтр("ru='В ходе операции с учением (%1) возникли технические проблемы. Для безопасности данных, процедура прервана'"), Строка(ТекСтрокаДанные.Номенклатура));
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
			Возврат;
		ИначеЕсли DICOMОбщийКлиент.КодВозвратаУспех(Ответ.КодСостояния) Тогда
			ТекСтрокаДанные.УжеОтправлялся = Ложь;
			ТекСтрокаДанные.ВремяОтправки = Неопределено;
			СтрокаСообщения = СтрШаблон(НСтр("ru='Worklist с учением  ""%1"" успешно отменён'"),Строка(ТекСтрокаДанные.Номенклатура));
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		Иначе
			СтрокаСообщения = СтрШаблон(НСтр("ru='Не получилось отменить Worklist с учением  ""%1"", (код: %2). Этого учения нет!'"),Строка(ТекСтрокаДанные.Номенклатура), Ответ.КодСостояния);
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		КонецЕсли;
	КонецЦикла;
	
	// Для предотвращения утечки данных после редактирования - перезаписываем в регистр данные по учениям
	// Критически необходимо помнить StudyUID
	
	ЗаписатьДанныеФормыВРегистрDICOMДанныеУченийСРасшифровкой();
	
КонецПроцедуры

#КонецОбласти

#Область PACSПолучениеДанных
// ОБРАБАТЫВАЕМ ВСЕ ПОТЕНЦИАЛЬНЫЕ STUDY, в Т.Ч. Из "СкрытыеСвязи"
// Позволяем работать только с одним исследованием за раз&НаКлиенте
&НаКлиенте
Процедура РаботаСStudy(Команда)
	
	// Если каким-то образом получилось сюда зайти
	#Если ВебКлиент Или МобильныйКлиент Тогда
		СтрокаОшибки = НСтр("ru='В режиме Веб-клиента данная операция не доступна.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаОшибки);
		Возврат;
	#КонецЕсли
	
	// Получаем данные формы элемента коллекции
	Если Элементы.ИсходныеДанныеStudy.ТекущаяСтрока = Неопределено Тогда
		СтрокаОшибки = НСтр("ru='Не выделено исследование'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаОшибки);
		Возврат;	
	КонецЕсли;
	
	Попытка
		ИскомаяСтрока = ИсходныеДанныеStudy.Получить(Элементы.ИсходныеДанныеStudy.ТекущаяСтрока);	
		СтрокаУникальныеДанные = УникальныеДанныеПоDICOM.НайтиСтроки(Новый Структура("Название,ДопОпределитель","StudyInstanceUID",ИскомаяСтрока.СкрытыйНомер))[0];				
		СтрокаУИДStudy = СтрокаУникальныеДанные.Значение;
		ИмяНоменклатуры = Строка(ИскомаяСтрока.Номенклатура);
	Исключение 
		СтрокаОшибки = НСтр("ru='Не получилось открыть исследование: ошибка хранения данных в базе'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаОшибки);
		Возврат;
	КонецПопытки;
	
	//Проверяем есть ли по у нас скаченные временно файлы (папка под названием учения + кол-во рендеров и dcm файлов)
	// Неопределено если Ошибка получения файлов или работы сервера (нужно перезапустить сервер)
	ОжидаемоеКоличествоФайлов = DICOMОбщийКлиент.ПолучитьОтветПоЗапросуDICOM("ПолучитьКоличествоФрагментовУченияDCM4CHEE", "GET",
										НастройкиСистемыDICOM,"AETLМенеджера", Новый Структура("StudyUID",СтрокаУИДStudy));										
	Если ОжидаемоеКоличествоФайлов = Неопределено Тогда
		Возврат;
	ИначеЕсли DICOMОбщийКлиент.КодВозвратаУспех(ОжидаемоеКоличествоФайлов.КодСостояния) Тогда
		ОжидаемоеКоличествоФайлов = DICOMОбщийКлиент.ПрочитатьJSONОбъектаHTTP(ОжидаемоеКоличествоФайлов);
		ОжидаемоеКоличествоФайлов.Свойство("count",ОжидаемоеКоличествоФайлов);		
	Иначе
		Возврат;
	КонецЕсли;
	
	// Проверяем исследования. Мы всегда скачиваем в формате dcm любое исследование, поэтому будем по нему ориентироваться
	КолСоздВремФайловНужногоТипа = ПосчитатьКоличествоВремФайловНужногоФормата(СтрокаУИДStudy,"dcm");
	Если КолСоздВремФайловНужногоТипа <> ОжидаемоеКоличествоФайлов Тогда
		                
		УспешноСкачено = СкачатьStudy(СтрокаУИДStudy,"dcm",,ИмяНоменклатуры);
		Если УспешноСкачено = Неопределено Тогда
			СтрокаОшибки = НСтр("ru='Скаченные данные с сервера повреждены: Повреждены файлы исследования'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаОшибки);
			//Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	//Проверяем рендеры. Формат рендеров может изменяться, нельзя допустить отсутствие формата
	Если ЗначениеЗаполнено(ИскомаяСтрока.ФорматРендера) Тогда
		
		//МассивНайденныхФайлов = НайтиФайлы(ПутККаталогуStudy,СтрШаблон("*.%1", ИскомаяСтрока.ФорматРендера));	
		КолСоздВремФайловНужногоТипа = ПосчитатьКоличествоВремФайловНужногоФормата(СтрокаУИДStudy, ИскомаяСтрока.ФорматРендера);

		Если КолСоздВремФайловНужногоТипа <> ОжидаемоеКоличествоФайлов Тогда	
			
			УспешноСкачено = СкачатьStudy(СтрокаУИДStudy,ИскомаяСтрока.ФорматРендера,Истина,ИмяНоменклатуры);
			Если УспешноСкачено = Неопределено Тогда 
				СтрокаОшибки = НСтр("ru='Скаченные данные с сервера повреждены: Повреждены рендеры исследования'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаОшибки);
				//Возврат;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	// работа с просмотром результатов исследования 
	// Т.к. теперь это происходит на той же форме - мы просто заполняем/перезаполняем таблицу
	// Считаем, что только в этом месте мы влияем на данные в 
	Просмотр_ПолученныеФайлы.Очистить(); 
	Просмотр_КешПутейКФайлам.Очистить();
	Для Каждого Элемент Из Элементы.ГруппаПредпросмотр.ПодчиненныеЭлементы Цикл 
		Элемент.Видимость = Ложь;
	КонецЦикла;
	ЗаполнитьТаблицуФайловПросмотр_ПолученныеФайлы(СтрокаУИДStudy, ИмяНоменклатуры);
	
КонецПроцедуры 

// Функция, которая скачивает Study. Важно, что при скачивании получается единый файл, то он сразу будет записан, а HTTPОтвет будет без двоичных данных 
//
// Параметры:
//  ПутьКаталога			 - Строка - Путь каталога учения, куда временно скачиваются файлы
//  StudyUID				 - Строка - Значение УИДа Учения, который скачивается
//  РасширениеВозвращаемых	 - Строка - Расширение, которое должен иметь итоговый файл скачивания
//  ЭтоРендер				 - Булево - Скачиваем отрендеренные данные-результат
//	ИмяФайлов				 - Строка - Строка-название предпочтительное для создаваемых файлов, нужно только для понимания пользователя
// 
// Возвращаемое значение:
//  HTTPОтвет, Неопределено - Если Неопределено, то значит произошла ошибка при скачивании файлов
//
&НаКлиенте
Функция СкачатьStudy(StudyUID,РасширениеВозвращаемых,ЭтоРендер = Ложь, ИмяНоменклатуры)
		
	// Если всё же каким-то образом удалось дойти сюда извне
	#Если ВебКлиент Или МобильныйКлиент Тогда
		СтрокаОшибки = НСтр("ru='В режиме Веб-клиента данная операция не доступна.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаОшибки);
		Возврат Неопределено;
	#КонецЕсли
	
	// Мы не знаем что именно изменилось, для безопасности - стираем всё	
	УдалитьВсеСтарыеВременныеФайлы(StudyUID, РасширениеВозвращаемых);	
		
	// У Рендеров приходит формат jpeg или другой, его надо привести в подобающий вид 
	ФорматВозвращаемых = DICOMОбщийКлиент.ФорматРендераДляЗапроса(РасширениеВозвращаемых); 
	
	Если СтрНайти(ФорматВозвращаемых,"multipart") = 0 Тогда
		// Просто application - самостоятельно записываем, зная расширение и полный путь
		// Сразу же записываем промежуточный файл	
		ИмяПромежуточногоФайла = КаталогВременныхФайлов() + ИмяНоменклатуры + "." + РасширениеВозвращаемых;
		
		Ответ = DICOMОбщийКлиент.ПолучитьОтветПоЗапросуDICOM("СкачатьStudy", "GET", НастройкиСистемыDICOM, "AETLМенеджера",
					Новый Структура("ФорматВозвращаемых, StudyUID, ЭтоРендер",ФорматВозвращаемых,StudyUID,ЭтоРендер),ИмяПромежуточногоФайла);	
					
		Если (Ответ = Неопределено) Тогда
			// Данные ещё не найдены 
			Возврат Неопределено;
		ИначеЕсли DICOMОбщийКлиент.КодВозвратаУспех(Ответ.КодСостояния) Тогда
			НоваяСтрокаВременныйФайл = ИменаВременныхФайлов.Добавить();
			НоваяСтрокаВременныйФайл.ИмяФайла = ИмяПромежуточногоФайла;
			НоваяСтрокаВременныйФайл.РасширениеФайла = РасширениеВозвращаемых;
			НоваяСтрокаВременныйФайл.StudyUID = StudyUID;
			Возврат Ответ;	
		Иначе
			Возврат Неопределено
		КонецЕсли;	
	Иначе
		Ответ = DICOMОбщийКлиент.ПолучитьОтветПоЗапросуDICOM("СкачатьStudy", "GET", НастройкиСистемыDICOM, "AETLМенеджера",
					Новый Структура("ФорматВозвращаемых, StudyUID, ЭтоРендер",ФорматВозвращаемых,StudyUID,ЭтоРендер));	

		Если (Ответ = Неопределено) Тогда
			Возврат Неопределено;
		ИначеЕсли DICOMОбщийКлиент.КодВозвратаУспех(Ответ.КодСостояния) Тогда
			
			// Прочитаем multipart						
			СтруктураДанных = DICOMОбщийКлиент.ПолучитьТипИРазделительОтвета(Ответ.Заголовки,"boundary,type");	
			Если СтруктураДанных = Неопределено Тогда
				// Ошибка - нет подходящих заголовков
				Возврат Неопределено;
			КонецЕсли;
						
			// MIME сообщение для исследования (dcm) использует отдельную обработку
			Если РасширениеВозвращаемых = "dcm" Тогда	
				ТелоДвоичныеДанные = Ответ.ПолучитьТелоКакДвоичныеДанные(); 
				ИмяПромежуточногоФайла = КаталогВременныхФайлов() + ИмяНоменклатуры;
				НовыеИменаВременных = DICOMОбщийКлиент.ПрочитатьСообщениеMIMEФайлDCM(СтруктураДанных.boundary,СтруктураДанных.type,ИмяПромежуточногоФайла,ТелоДвоичныеДанные);
			Иначе
				ТелоПотоковыеДанные = Ответ.ПолучитьТелоКакПоток();
				ИмяПромежуточногоФайла = КаталогВременныхФайлов() + ИмяНоменклатуры + "_Рендер";
	           	НовыеИменаВременных = DICOMОбщийКлиент.ПрочитатьСообщениеMIMEУниверсальное(СтруктураДанных.boundary,СтруктураДанных.type,ИмяПромежуточногоФайла,ТелоПотоковыеДанные);	
			КонецЕсли;
			
			// Обрабатываем массив имён
			Для каждого ИмяВременногоФайла Из НовыеИменаВременных Цикл	
				НоваяСтрокаВременныйФайл = ИменаВременныхФайлов.Добавить();
				НоваяСтрокаВременныйФайл.ИмяФайла = ИмяВременногоФайла;
				НоваяСтрокаВременныйФайл.РасширениеФайла = РасширениеВозвращаемых;
				НоваяСтрокаВременныйФайл.StudyUID = StudyUID;		
			КонецЦикла;
			
			Возврат Ответ;	
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
#КонецОбласти 

#Область ВспомогательныеКомандыDCM4CHEE

// функция, проверяющая наличие текущего пациента в программе
//
// Параметры:
//  СоздатьЕслиНеНайден  - Булево - Если при проверке оказалось, что пациента нет - он будет создан
//                 на основе статистических данных текущего пациента
//
// Возвращаемое значение:
//   HTTPОтвет,Неопределено   - Если пациент был найден, то возвращается HTTPОтвет, иначе Неопредеделено, ЕСЛИ БЫЛ СОЗДАН ПАЦИЕНТ - он повторно ищется
//
&НаКлиенте
Функция НайтиПациентаВPACS(СоздатьЕслиНеНайден)
	
	Попытка
		УИПациента = ДанныеДляWorklistСтатичные.НайтиСтроки(Новый Структура("Описание","PatientID"))[0].ЗначЗаполнения;
	Исключение
	    УИПациента = "";
	КонецПопытки; 
	
	Ответ = DICOMОбщийКлиент.ПолучитьОтветПоЗапросуDICOM("НайтиПациентаВPACS", "GET", НастройкиСистемыDICOM, "AETLМенеджера",
															Новый Структура("PatientUID",УИПациента));	
								
	Если (Ответ = Неопределено) Тогда
		// Ошибка соединения
        Возврат Неопределено; 
	ИначеЕсли DICOMОбщийКлиент.КодВозвратаУспех(Ответ.КодСостояния,200) Тогда		
		Возврат Ответ;	
	ИначеЕсли DICOMОбщийКлиент.КодВозвратаУспех(Ответ.КодСостояния,204) Тогда
		// Тела нет при таком ответе 
		Если СоздатьЕслиНеНайден Тогда
		    СоздатьПациента();
			Возврат НайтиПациентаВPACS(Ложь);
		КонецЕсли;
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура СоздатьПациента()
	
	// Составим структуру, состоящую из структур, называемых тегом, а внутри ЗначN и Визуализация	
	СтруктураТелаЗапроса = Новый Структура();

	Для каждого СтрДанныхПациента Из ДанныеДляWorklistСтатичные Цикл

		Если СтрНайти(СтрДанныхПациента.Описание,"Patient") = 0 Тогда	
			Продолжить;			
		КонецЕсли;
		
		Если ПустаяСтрока(СтрДанныхПациента.ТегРодитель) Тогда
			
			// стандартный тег со значением
			ВнутрСтруктура= Новый Структура;
			ВнутрСтруктура.Вставить("ЗначValue",СтрДанныхПациента.ЗначЗаполнения);
			ВнутрСтруктура.Вставить("Визуализация",СтрДанныхПациента.Визуализация);
			СтруктураТелаЗапроса.Вставить(СтрДанныхПациента.Тег,ВнутрСтруктура);				
		Иначе
			
			// У тега есть родитель, а значит надо затолкать во внутрь.
			// Теги могут быть неупорядоченными по родителю 
			ЗначениеПоиска = Неопределено;
			Если СтруктураТелаЗапроса.Свойство(СтрДанныхПациента.ТегРодитель,ЗначениеПоиска) Тогда
				// Мы уже встретили значение в структуре
				// Только добавляем. Возвращается ВнутрСтруктура
				ПодВнутрСтруктура= Новый Структура;
				ПодВнутрСтруктура.Вставить("ЗначValue",СтрДанныхПациента.ЗначЗаполнения);
				ПодВнутрСтруктура.Вставить("Визуализация",СтрДанныхПациента.Визуализация);
				ЗначениеПоиска.Вставить(СтрДанныхПациента.Тег, ПодВнутрСтруктура);
				
				СтруктураТелаЗапроса.Вставить(СтрДанныхПациента.ТегРодитель,ЗначениеПоиска);				
			Иначе
				
				// Значения этого нет - создаём по новой
				ПодВнутрСтруктура= Новый Структура;
				ПодВнутрСтруктура.Вставить("ЗначValue",СтрДанныхПациента.ЗначЗаполнения);
				ПодВнутрСтруктура.Вставить("Визуализация",СтрДанныхПациента.Визуализация);
				ВнутрСтруктура = Новый Структура(СтрДанныхПациента.Тег, ПодВнутрСтруктура);
				
				СтруктураТелаЗапроса.Вставить(СтрДанныхПациента.ТегРодитель,ВнутрСтруктура);				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	
	Ответ = DICOMОбщийКлиент.ПолучитьОтветПоЗапросуDICOM("СоздатьПациента", "POST", НастройкиСистемыDICOM,"AETLМенеджера",СтруктураТелаЗапроса);	
								
	Если (Ответ = Неопределено) Тогда
    	// Ошибка соединения
        Возврат;
	ИначеЕсли DICOMОбщийКлиент.КодВозвратаУспех(Ответ.КодСостояния) Тогда
		// Тело содержит только ID нового элемента (с указанием источника ID)
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Пациент успешно создан'"));
	Иначе
		СтрокаОшибки = СтрШаблон(НСтр("ru='Ошибка создания пациента, код: %1'"), Ответ.КодСостояния);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаОшибки);
	КонецЕсли;
	
КонецПроцедуры

//GET запрос к UPS-RS "Search for Scheduled Procedure Steps"  
//http://localhost:8080/dcm4chee-arc/aets/DCM4CHEE/rs/mwlitems?PatientID=P-00000001&StudyInstanceUID=ProdamBibki
&НаКлиенте
Функция НайтиДанныеMWL(StudyInstanceUID, ПереприсвоитьSPS = Ложь)
		
	Ответ = DICOMОбщийКлиент.ПолучитьОтветПоЗапросуDICOM("НайтиДанныеMWL", "GET", НастройкиСистемыDICOM, "AETLЛистов",
															Новый Структура("StudyUID",StudyInstanceUID));	

	// Обработка ответа	
	Если (Ответ = Неопределено) Тогда
		// Ошибка соединения
		Возврат Неопределено;
	ИначеЕсли DICOMОбщийКлиент.КодВозвратаУспех(Ответ.КодСостояния, 200) Тогда		
		Если ПереприсвоитьSPS Тогда
			// Обрезаем до нужного тега, потом до ближайшего к тегу Value , а потом до конца этого массива Value 
			СтрокаSPS = Сред(Ответ.ПолучитьТелоКакСтроку(),СтрНайти(Ответ.ПолучитьТелоКакСтроку(),"00400009"));
			СтрокаSPS = Сред(СтрокаSPS,СтрНайти(СтрокаSPS,"Value")); // останется примерно Value":["SPS-00000015"]}...
			СтрокаSPS = Сред(СтрокаSPS,10);	//SPS-00000015"]}...
		    СтрокаSPS = Лев(СтрокаSPS,(СтрНайти(СтрокаSPS,"""]") - 1));
			
			// Присваиваем значение. Заведомо знаем, что тут есть данные
			СтрокаУникальныеДанные = УникальныеДанныеПоDICOM.НайтиСтроки(Новый Структура("Название,ДопОпределитель","StudyInstanceUID",StudyInstanceUID))[0];	
			СтрокаУникальныеДанные.СвязанноеЗначение = СтрокаSPS;	
		КонецЕсли;
		
		Возврат Истина;
	ИначеЕсли DICOMОбщийКлиент.КодВозвратаУспех(Ответ.КодСостояния, 204) Тогда		
		Возврат Ложь;	
	Иначе
		Возврат Неопределено;
	КонецЕсли; 
	
    // 200 - Возврат результата массивом
	// 204 - Успешная работа, но исследований нет	
КонецФункции

// Функция - Проверяем - есть ли искомое Study. Если оно есть - значит мы можем его корректно получить
&НаКлиенте
Функция НайтиДанныеStudy(StudyInstanceUID, ПолучитьБулевым = Ложь)
	
	// Процедура запрашивает study по заранее известному УИД учения, в будущем возможно добавить проверку по УИд пациента
	////http://localhost:8080/dcm4chee-arc/aets/DCM4CHEE/rs/studies?PatientID=c350a9f2-c65d-11ee-951b-08979885f491&StudyInstanceUID=c350a9f2-c65d-11ee-951b-08979885f49122c92ff5-b5f5-11ee-9519-08979885f491202402120
	Ответ = DICOMОбщийКлиент.ПолучитьОтветПоЗапросуDICOM("НайтиДанныеStudy", "GET", НастройкиСистемыDICOM, "AETLМенеджера",
														Новый Структура("StudyUID",StudyInstanceUID));
														
	Если (Ответ = Неопределено) Тогда
		// Данные ещё не найдены 
		Возврат ?(ПолучитьБулевым,Ложь,Неопределено);
	ИначеЕсли DICOMОбщийКлиент.КодВозвратаУспех(Ответ.КодСостояния,200) Тогда
		//СоответствиеОтветаJSON = ПрочитатьJSONОбъектаHTTP(Ответ,Истина);
		Возврат ?(ПолучитьБулевым,Истина,Ответ);				
	Иначе
		Возврат ?(ПолучитьБулевым,Ложь,Неопределено);
	КонецЕсли;

	// 200 - у нас есть все данные
	// 204 - пациента с такими данными нет (не ошибка)
КонецФункции

// Функция - Проверяем - Находится ли в активной обработке MWL (Он существует только в MWL)
&НаКлиенте
Функция НайтиДанныеMPPS(StudyInstanceUID, ПолучитьБулевым = Ложь)
	
		
	// Процедура запрашивает study по заранее известному УИД учения
	Ответ = DICOMОбщийКлиент.ПолучитьОтветПоЗапросуDICOM("НайтиДанныеStudy", "GET", НастройкиСистемыDICOM, "AETLЛистов",
														Новый Структура("StudyUID",StudyInstanceUID));
	
	Если (Ответ = Неопределено) Тогда
		// Данные ещё не найдены 
		Возврат ?(ПолучитьБулевым,Ложь,Неопределено);
	ИначеЕсли DICOMОбщийКлиент.КодВозвратаУспех(Ответ.КодСостояния,200) Тогда
		//СоответствиеОтветаJSON = ПрочитатьJSONОбъектаHTTP(Ответ,Истина);
		Возврат ?(ПолучитьБулевым,Истина,Ответ);				
	Иначе
		Возврат ?(ПолучитьБулевым,Ложь,Неопределено);
	КонецЕсли;

	// 200 - у нас есть все данные
	// 204 - пациента с такими данными нет (не ошибка)
КонецФункции

#КонецОбласти

#Область ПросмотрРезультатаИсследования

// действия, выполняемые для части по работе с результатами исследований (взято из отдельной формы)
&НаКлиенте
Процедура ПриОткрытии_ПросмотрРезультатовИсследований()

	УчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	// Проверяем объект-владелец(приём), есть ли он и подписан ли он
	Если НЕ ЗначениеЗаполнено(ДокументВладелец)
		ИЛИ ЭЦП_УМЦ_Сервер.ПроверитьНеобходимостьПроверятьПодпись(ДокументВладелец) Тогда	
		Элементы.КнопкиРаботыХДИ.Доступность = Ложь;
	КонецЕсли;
	
	СоответствиеРасширений = DICOMОбщийКлиент.ПолучитьСоответствиеРасширения();

КонецПроцедуры

// Процедура по прочтению и заполнению данных таблицы через 
// Мы должны проверить И папку хранения
// И справочник ХДИ
// Т.к. мы можем повторно открывать данные.
//
&НаСервере
Процедура ЗаполнитьТаблицуФайловПросмотр_ПолученныеФайлы(ЗначениеStudyUID, ЗначениеИмяНоменклатуры)
	
	// Получим все данные, которые были скачены во временный каталог. 
	// Чтобы не было путаницы, получим данные по переданным именам
	Для каждого ИмяВременногоФайла Из ИменаВременныхФайлов Цикл
		
		// Проверяем, что работаем с правильными временными файлами (привязанными к учению)
		Если ИмяВременногоФайла.StudyUID <> ЗначениеStudyUID Тогда
			Продолжить;	
		КонецЕсли;
		
		НоваяСтрокаКеша = Просмотр_КешПутейКФайлам.Добавить();
		НоваяСтрокаКеша.Расширение = ИмяВременногоФайла.РасширениеФайла;
		НоваяСтрокаКеша.ПолныйПутьКФайлу = ИмяВременногоФайла.ИмяФайла;
		
		// В качестве имени просто обрежем полный путь к файлу
		//   one/two/file.dcm
		ОбрезанноеИмяФайла = СтрРазделить(ИмяВременногоФайла.ИмяФайла,ПолучитьРазделительПути(),Ложь);
		НоваяСтрокаКеша.Исследование = СокрЛП(ОбрезанноеИмяФайла[ОбрезанноеИмяФайла.Количество() - 1]);
		
		//// Последним элементом всегда будет имя файла с расширением, где последней точкой является точка перед расширением 
		//НоваяСтрокаКеша.Исследование = Лев(ОбрезанноеИмяФайла[ОбрезанноеИмяФайла.Количество() - 1],
		//									(СтрНайти(ОбрезанноеИмяФайла[ОбрезанноеИмяФайла.Количество() - 1],".",НаправлениеПоиска.СКонца) - 1));
	КонецЦикла;
	
	Если Просмотр_КешПутейКФайлам.Количество() = 0 Тогда	
		Возврат;	
	КонецЕсли;
	
	// Проверяем при помощи запроса - есть ли у нас уже эти файлы
	//|	ВЫРАЗИТЬ(ДанныеФайлов.Исследование + ""."" + ДанныеФайлов.Расширение КАК СТРОКА(150)) КАК ИмяФайла,
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ДанныеФайлов.Исследование КАК СТРОКА(150)) КАК ИмяФайла,
		|	ДанныеФайлов.Расширение КАК Расширение
		|ПОМЕСТИТЬ ДанныеФайлов
		|ИЗ
		|	&КешПутейКФайлам КАК ДанныеФайлов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ХранилищеДополнительнойИнформации.Ссылка КАК Ссылка,
		|	ХранилищеДополнительнойИнформации.Идентификатор КАК Наименование
		|ПОМЕСТИТЬ ЗначенияИзХранилища
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
		|ГДЕ
		|	НЕ ХранилищеДополнительнойИнформации.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДанныеФайлов.ИмяФайла КАК ИмяФайла,
		|	ДанныеФайлов.Расширение КАК Расширение,
		|	ЗначенияИзХранилища.Ссылка КАК Ссылка
		|ИЗ
		|	ДанныеФайлов КАК ДанныеФайлов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияИзХранилища КАК ЗначенияИзХранилища
		|		ПО ДанныеФайлов.ИмяФайла = ЗначенияИзХранилища.Наименование";
	Запрос.УстановитьПараметр("КешПутейКФайлам", Просмотр_КешПутейКФайлам.Выгрузить());		
	ВыборкаДетальныеЗаписи = Запрос.ВыполнитьПакет()[2].Выбрать();
			
	// Заполняем данные в таблицу Просмотр_ПолученныеФайлы, скрытая таблица Просмотр_КешПутейКФайлам уже заполнена всеми данными
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//ИмяИсследования = Лев(ВыборкаДетальныеЗаписи.ИмяФайла,(СтрНайти(ВыборкаДетальныеЗаписи.ИмяФайла,".",НаправлениеПоиска.СКонца) - 1));

		НоваяСтрокаОснТабл = Просмотр_ПолученныеФайлы.Добавить();	
		НоваяСтрокаОснТабл.Исследование = СокрЛП(ВыборкаДетальныеЗаписи.ИмяФайла); 
		НоваяСтрокаОснТабл.РасширениеИсследования = ВыборкаДетальныеЗаписи.Расширение; 
		НоваяСтрокаОснТабл.СкрытаяСсылкаХДИ = ВыборкаДетальныеЗаписи.Ссылка; 
		НоваяСтрокаОснТабл.Сохранить = ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка);
		НоваяСтрокаОснТабл.ФайлСохранен = ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;	

КонецПроцедуры

// Процедура - Сохранить файлы в базе согласно УП - Сохраняем файл по его полному пути в системе в кеш
//
// Параметры:
//  ДанныеСтрокиТаблицы	 - Массив - Массив строк таблицы, которые нужно записать 
//
&НаКлиенте
Процедура СохранитьФайлыСогласноУП(ДанныеСтрокиТаблицы)
		
	// Есть возможность, что документ будет подписан в момент, когда работает эта процедура
	НеобходимоПроверятьПодпись = ЭЦП_УМЦ_Сервер.ПроверитьНеобходимостьПроверятьПодпись(ДокументВладелец);
	Если НеобходимоПроверятьПодпись Тогда 
		Если Не ЗаблокироватьВладельцаФайлов(ДокументВладелец) Тогда 
	    	ПоказатьПредупреждение(, Строка(ДокументВладелец) + " заблокирован другим пользователем");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Проходим по каждой строке массива
	Для каждого СтрокаДанныхСохранения Из ДанныеСтрокиТаблицы Цикл
		
		КешФайла = Просмотр_КешПутейКФайлам.НайтиСтроки(Новый Структура("Исследование",СтрокаДанныхСохранения.Исследование));
		Если КешФайла.Количество() = 0 Тогда
			Продолжить;
		Иначе
			КешФайла = КешФайла[0];
		КонецЕсли;
		
		СсылкаНаФайл = РаботаСФайламиКлиент.ДобавитьНовыйФайл(ДокументВладелец, КешФайла.ПолныйПутьКФайлу, УчетнаяПолитика);
		
		// ЭЦП
		Если НеобходимоПроверятьПодпись Тогда
			ЭЦП_УМЦ_Клиент.ПроверитьВсеПодписиОбъекта(ДокументВладелец);
			РазблокироватьВладельцаФайлов(ДокументВладелец);
		КонецЕсли;
		
		СтрокаДанныхСохранения.СкрытаяСсылкаХДИ = СсылкаНаФайл;
		СтрокаДанныхСохранения.ФайлСохранен = Истина;
		ОповеститьОбИзмененииСоставаФайлов(ДокументВладелец);
	КонецЦикла;
	
КонецПроцедуры

// Обновление предпросмотра - меняется место отображения и получается ссылка на врем. хранилище для отображения
//
// Параметры:                 
//  ДанныеСтрокиТаблицы  - ДанныеФормыЭлементКоллекции - Данные строки таблицы, которую выбрал пользователь для отображения
//
&НаКлиенте
Процедура ОбновитьПредпросмотр(ДанныеСтрокиТаблицы)
	
	ТипФайла = СоответствиеРасширений.Получить(НРег(ДанныеСтрокиТаблицы.РасширениеИсследования));
	Если ТипФайла = Неопределено Тогда	
		ТипФайла = "НеОбрабатывается";	
	КонецЕсли; 
	        
	ИмяРеквизита = "Просмотр_Предпросмотр" + ТипФайла; 
	 
	// Отображаем только один из элементов, в соответствии с типом полученных данных
	Для Каждого Элемент Из Элементы.ГруппаПредпросмотр.ПодчиненныеЭлементы Цикл 
		Если Элемент.Имя = ИмяРеквизита Тогда 
			Элемент.Видимость = Истина;
		Иначе
			Элемент.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;

	Если ТипФайла = "НеОбрабатывается" Тогда	
		Возврат;		
	КонецЕсли;
	
	// Получаем Кэшированные данные по Имени файла (оно уникально в рамках этой формы)
	СтрокаТаблицыКэша = Просмотр_КешПутейКФайлам.НайтиСтроки(Новый Структура("Исследование",СокрЛП(ДанныеСтрокиТаблицы.Исследование)));
	Если СтрокаТаблицыКэша.Количество() = 0 Тогда
		Возврат;
	Иначе
		СтрокаТаблицыКэша = СтрокаТаблицыКэша[0];
	КонецЕсли;
			
	// Получаем отображение файла по его полному пути 
	Если ТипФайла = "Текст" Тогда
		Текст = Новый ЧтениеТекста(СтрокаТаблицыКэша.ПолныйПутьКФайлу, КодировкаТекста.UTF8);
		ЭтаФорма[ИмяРеквизита] = Текст.Прочитать(); 
	ИначеЕсли ТипФайла = "Картинка" Тогда
		ЭтаФорма[ИмяРеквизита] = ПоместитьВоВременноеХранилище(Новый Картинка(СтрокаТаблицыКэша.ПолныйПутьКФайлу),УникальныйИдентификатор);
	ИначеЕсли ТипФайла = "PDF" Тогда 		
		ДокументPDF = Новый ДокументPDF; 
		ДокументPDF.Прочитать(СтрокаТаблицыКэша.ПолныйПутьКФайлу);
		ЭтаФорма[ИмяРеквизита] = ДокументPDF;
	КонецЕсли;

КонецПроцедуры

#Область ЭлектроннаяПодпись

&НаСервере
Функция ЗаблокироватьВладельцаФайлов(Владелец) 
	ЗаблокироватьДанныеДляРедактирования(Владелец, , УникальныйИдентификатор);
	Возврат Истина;		
КонецФункции

&НаСервере
Процедура РазблокироватьВладельцаФайлов(Владелец) 
	РазблокироватьДанныеДляРедактирования(Владелец, УникальныйИдентификатор); 	
КонецПроцедуры

#КонецОбласти

// Взято с файлов
&НаКлиенте
Процедура ОповеститьОбИзмененииСоставаФайлов(ТекВладелец)	
	Оповестить("ИзмененСоставФайлов", РаботаСФайлами.ПолучитьКоличествоФайловОбъекта(ТекВладелец), ТекВладелец);	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеФункцииИПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеФормыВРегистрDICOMДанныеУченийСРасшифровкой()
	
	// Комплектуем значения в массив структур и отправляем их на замещающую запись в регистр по отбору по Документу-Родителю
	МассивСтруктур = Новый Массив;
	
	// Запоминаем все уникальные строки с их доп. данными - данные WL
	// УИД Study связан с таблицей исходных данных (пользовательская) через скрытый номер-допОпределитель
	// С таблицей для резервного хранения через УникальныйНомер-Значение (StudyUID)
	Для каждого СтрокаУникальныхДанных Из УникальныеДанныеПоDICOM Цикл
		
		ПомеченПользователемНаУдаление = СтрокаУникальныхДанных.ПомеченНаУдаление;
		Если ПомеченПользователемНаУдаление Тогда
			НайденнаяПараСтрока = УникальныеДанныеПоDICOMСопрДанные.НайтиСтроки(Новый Структура("УникальныйНомер",СтрокаУникальныхДанных.Значение));					
		Иначе
			НайденнаяПараСтрока = ИсходныеДанныеStudy.НайтиСтроки(Новый Структура("СкрытыйНомер",СтрокаУникальныхДанных.ДопОпределитель));
		КонецЕсли;	
		
		Если НайденнаяПараСтрока.Количество() = 0 Тогда			
			// Это Пустышка без данных (К примеру, пациент)
			Продолжить;	
		Иначе
			НайденнаяПараСтрока = НайденнаяПараСтрока[0];
		КонецЕсли;
				
		// Сохраняем данные из НайденнойПарыСтроки (доп данные) и Значение из УникальныхДанных (StudyUID)		
		МассивСтруктур.Добавить(Новый Структура("StudyUID, ВремяОтправки, Номенклатура, Оборудование, УдаленПользователем, SPSUID", Новый УникальныйИдентификатор(СтрокаУникальныхДанных.Значение),
								НайденнаяПараСтрока.ВремяОтправки, НайденнаяПараСтрока.Номенклатура, НайденнаяПараСтрока.Оборудование, ПомеченПользователемНаУдаление,СтрокаУникальныхДанных.СвязанноеЗначение));
	КонецЦикла;
	
	// Передаём в бесконтекстный серверный вызов
	ЗаписатьМассивСтруктурВРегистрDICOMДанныеУченийСРасшифровкой(МассивСтруктур,ДокументВладелец);
	
КонецПроцедуры

// Записать массив структур учений с расшифровкой в регистр DICOMДанные
//
// Параметры:
//  МассивСтруктур	 - Массив - содержит в себе структуры со свойствами StudyUID, ВремяОтправки, Номенклатура,
//					Оборудование (значение справочника МедицинскоеОборудование), УдаленПользователем (Булево)		
//  ДокументВладелец - ДокументСсылка - ссылка на Прием, к которому привязаны учения
//
&НаСервереБезКонтекста
Процедура ЗаписатьМассивСтруктурВРегистрDICOMДанныеУченийСРасшифровкой(Знач МассивСтруктур, Знач ДокументВладелец)
	
	// Получаем набор записей. В регистре DICOMДанныеУченийСРасшифровкой мы отбираем все записи за один документ
	// Т.к. учения уникальны хотя бы в рамках приема.  
	НовыйНаборЗаписей = РегистрыСведений.DICOMДанныеУченийСРасшифровкой.СоздатьНаборЗаписей();
	НовыйНаборЗаписей.Отбор.Документ.Установить(ДокументВладелец);
	
	Для Каждого ЭлементСтруктурой Из МассивСтруктур Цикл
	
		НоваяЗапись = НовыйНаборЗаписей.Добавить();	
	    ЗаполнитьЗначенияСвойств(НоваяЗапись,ЭлементСтруктурой);
		НоваяЗапись.Документ = ДокументВладелец;
	КонецЦикла;
	
	НовыйНаборЗаписей.Записать(Истина);
	
КонецПроцедуры

// Происходить запрос к регистру СвязьОборудованияСИсследованиями для получения доступных значений оборудования, 
// После чего идёт заполнение данных в исходной таблице
//
// Параметры:
//  Номенклатура  - СправочникСсылка.Номенклатура - Полученное значение номенклатуры текущей строки
//  ИндексСтрокиИсходнойТабл  - Число - индекс строки таблица исходных данных, с которой идёт работа
//
&НаСервере
Процедура ПодобратьОборудование(Номенклатура, ИдентификаторСтрокиИсходный)
	
	//Получим исследование из ссылки номенклатуры
	Исследование = Номенклатура.ИнструментальноеИсследование;
	
	// Получим список оборудования
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	DICOMОборудованиеПоИнструментИсследованиям.Оборудование КАК Оборудование
		|ИЗ
		|	РегистрСведений.DICOMОборудованиеПоИнструментИсследованиям КАК DICOMОборудованиеПоИнструментИсследованиям
		|ГДЕ
		|	DICOMОборудованиеПоИнструментИсследованиям.Исследование = &Исследование
		|	И DICOMОборудованиеПоИнструментИсследованиям.Филиал = &Филиал";
	
	Запрос.УстановитьПараметр("Исследование", Исследование);
	Запрос.УстановитьПараметр("Филиал", Филиал);
	
	ТекСтрокаИсходнойТаблицы = ИсходныеДанныеStudy.НайтиПоИдентификатору(ИдентификаторСтрокиИсходный);	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		
		ВыборкаДетальныеЗаписи.Следующий();
		ТекСтрокаИсходнойТаблицы.Оборудование = ВыборкаДетальныеЗаписи.Оборудование;
		
		ФорматРендераНовогоОборудования = ТекСтрокаИсходнойТаблицы.Оборудование.ФорматРендера;
		ФорматРендераНовогоОборудования = СтрЗаменить(ФорматРендераНовогоОборудования," ","");
		ФорматРендераНовогоОборудования = СтрЗаменить(ФорматРендераНовогоОборудования,".","");
		ТекСтрокаИсходнойТаблицы.ФорматРендера = ?(ФорматРендераНовогоОборудования = "","jpeg",ФорматРендераНовогоОборудования);
			
	Иначе	
		ТекСтрокаИсходнойТаблицы.Оборудование = Неопределено;
		ТекСтрокаИсходнойТаблицы.ФорматРендера = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры 

// Процедура - Вызывается перед созданием или удалением строки-формирователя Worklist. 
//
// Параметры:
//  ИндексыСтрокНаУдаление		 - Массив,строка,число -  массив индексов или одного Идентификатора (Элемент.ВыделенныеСтроки)
//		соответствующее строке таблицы Исходных данных, с которым взаимодействует пользователь
&НаКлиенте
Процедура УдалениеСПроверкойУстаревшихУИДОВ(Знач ИндетификаторыСтрокНаУдаление)
	
	Для каждого ЗначениеИдентификатора Из ИндетификаторыСтрокНаУдаление Цикл
		
		ТекСтрокаДанные = ИсходныеДанныеStudy.НайтиПоИдентификатору(ЗначениеИдентификатора);
		Попытка
			СтрокаУникальныеДанные = УникальныеДанныеПоDICOM.НайтиСтроки(Новый Структура("Название,ДопОпределитель","StudyInstanceUID",ТекСтрокаДанные.СкрытыйНомер))[0];				
			СтрокаУИДStudy = СтрокаУникальныеДанные.Значение;	
		Исключение
			Продолжить;
		КонецПопытки;	
		
		// Первые две позволяют безвозвратно удалить значение, третий необходимо хранить, поэтому он не доходит дальше
		Если ТекСтрокаДанные.УжеОтправлялся <> Истина Тогда
			// ничего делать не надо, просто предотвращаем три дополнительных запроса
		ИначеЕсли НайтиДанныеMWL(СтрокаУИДStudy) = Истина Тогда
			// удаляем MWL и запись об УИД
			ОтменитьWorklist(Неопределено, СтрокаУИДStudy);
			
		ИначеЕсли НайтиДанныеStudy(СтрокаУИДStudy,Истина) = Истина 
			ИЛИ НайтиДанныеMPPS(СтрокаУИДStudy, Истина) = Истина
			Тогда
			
			// Делаем пометку, что пользователь удалил эту строку, но мы не должны терять запись данных в таблице уник. данных			
			СтрокаУникальныеДанные.ПомеченНаУдаление = Истина;
			
			// Отдельно сохраняем данные для записей в регистр (сторонние данные, которые нужны только пользователю)
			СтрокаРезервногоКопированияДанных = УникальныеДанныеПоDICOMСопрДанные.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезервногоКопированияДанных,ТекСтрокаДанные);
			Продолжить;
			
		КонецЕсли;
		
		//Удаляем запись об УИД (из таблицы уникальных данных DICOM)
		УникальныеДанныеПоDICOM.Удалить(УникальныеДанныеПоDICOM.Индекс(СтрокаУникальныеДанные));
	КонецЦикла;		
КонецПроцедуры 

// Создаём новую запись УИД учения и связанный с нею уникальный порядковый номер
//  ТабУникЗнач  - ДанныеФормыКоллекции, ТаблицаЗначений - таблица уникальных значений, которая будет сохранять
//                 данные, по которым можно однозначно всё определить
//  ТабНаЗаполнение  - ДанныеФормыКоллекции, ТаблицаЗначений - Перезаполняемая таблица, в которой хранятся данные
//                 об одном учении, которые будут потом заменены
//
// Параметры:
//	ТекущийПорядковыйНомер - Строка - значение УИД строки, если его нет - то формируем новый. Заполняем, когда данные повторно
//					сериализуем для отправки данных (когда таблицу уникальных значений менять не надо) ИЛИ когда восстанавливаем StudyUID
//	КлиентСсылка - Справочник.Ссылка.Клиент - Ссылка на клиента для создания уникального значения
//
// Возвращаемое значение:
//   Число   - Значение колонки "скрытое число", которое уникально в рамках формы
//
&НаСервере
Функция СгенерироватьИЗапомнитьStudyUID(Знач ТекущийПорядковыйНомер = Неопределено, знач СтрокаSPSUID="0")

	// Используем только эти таблицы на форме
	ТабУникЗнач = УникальныеДанныеПоDICOM;
	ТабНаЗаполнение = ДанныеДляWorklist;	
	
	////Если ТипЗнч(ТабУникЗнач) = Тип("Строка") Тогда	
	////	ТабУникЗнач = ЭтаФорма[ТабУникЗнач];	
	////КонецЕсли;
	////Если ТипЗнч(ТабНаЗаполнение) = Тип("Строка") Тогда	
	////	ТабНаЗаполнение = ЭтаФорма[ТабНаЗаполнение];	
	////КонецЕсли;
	
	// Генерируем новый порядковый номер, если не задан, записываем исключительно в уникальное
	НовыйПорядковыйНомер = ?(ТекущийПорядковыйНомер = Неопределено,Новый УникальныйИдентификатор,ТекущийПорядковыйНомер);
																		
	Если ТекущийПорядковыйНомер = Неопределено Тогда
		
		// Значение UID учения заведомо уникально и должно быть запомнено
		ДобавитьДанныеВТаблицу(ТабУникЗнач,
								Новый Структура("Название,ОписаниеТега,Значение,ДопОпределитель,СвязанноеЗначение","StudyInstanceUID", "б0020000D", НовыйПорядковыйНомер,НовыйПорядковыйНомер, СтрокаSPSUID),
								Новый Структура("Название,ДопОпределитель","StudyInstanceUID",НовыйПорядковыйНомер));		
	Иначе
		
		// Иначе мы повторно сериализуем данные и просто возьмём их из таблицы уникальных данных
		МассивStudyУИД = УникальныеДанныеПоDICOM.НайтиСтроки(Новый Структура("Название,ДопОпределитель","StudyInstanceUID",НовыйПорядковыйНомер));				
		
		// Мы заполняем данные извне (регистр DICOMДанныеУченийСРасшифровкой)
		Если МассивStudyУИД.Количество() = 0 Тогда			
			// Записать в уникальную таблицу
			// Значение UID учения уникально и должно быть запомнено
			ДобавитьДанныеВТаблицу(ТабУникЗнач,
									Новый Структура("Название,ОписаниеТега,Значение,ДопОпределитель,СвязанноеЗначение","StudyInstanceUID", "б0020000D", НовыйПорядковыйНомер, НовыйПорядковыйНомер, СтрокаSPSUID),
									Новый Структура("Название,ДопОпределитель","StudyInstanceUID",НовыйПорядковыйНомер));		
									
			ДобавитьДанныеВТаблицу(ТабНаЗаполнение,Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","б0020000D", "UI","StudyInstanceUID", НовыйПорядковыйНомер));
		Иначе
			
			ВычПромежДанныеWL = МассивStudyУИД[0].Значение;
			ДобавитьДанныеВТаблицу(ТабНаЗаполнение,Новый Структура("Тег,Визуализация,Описание,ЗначЗаполнения","б0020000D","UI","StudyInstanceUID", ВычПромежДанныеWL));

		КонецЕсли;				
	КонецЕсли;						
				
	Возврат НовыйПорядковыйНомер;

КонецФункции

 // Процедура - Добавить данные в таблицу
//
// Параметры:
//  ЗаполняемаяТаблица			 - 	ДанныеФормыКоллекция, ТаблицаЗначений - Таблица, которая принимает новые строки
//  СтруктураДанныхЗаполнения	 - 	Структура - Структура с данными, где ключи соответствуют 1...n колонкам Заполняемой таблицы
//	ПроверяемоеСвойствоСтруктура -	Структура - Структура с данными для отбора-поиска (ищется в заполняемой таблице, если строка найдена - запись заменяется на новую)
//
&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьДанныеВТаблицу(ЗаполняемаяТаблица, СтруктураДанныхЗаполнения,ПроверяемоеСвойствоСтруктура = Неопределено)	
	
	Если ТипЗнч(ПроверяемоеСвойствоСтруктура) = Тип("Структура") Тогда
		
		НайденныеУникальныеСтроки = ЗаполняемаяТаблица.НайтиСтроки(ПроверяемоеСвойствоСтруктура);
		// Не позволять дублировать уникальные данные - мы их заменяем
		Если НайденныеУникальныеСтроки.Количество() <> 0 Тогда		
			ЗаполнитьЗначенияСвойств(НайденныеУникальныеСтроки[0],СтруктураДанныхЗаполнения);
			Возврат;			
		КонецЕсли;	
	КонецЕсли;
	
	НоваяСтрокаДанных = ЗаполняемаяТаблица.Добавить();	
	ЗаполнитьЗначенияСвойств(НоваяСтрокаДанных,СтруктураДанныхЗаполнения);

КонецПроцедуры	
	
// Перезаполнение таблицы Исходных данных
//
&НаКлиенте
Процедура ПерезаполнитьПоДокументуУслуги()
	
	МассивУслуг = DICOMОбщий.ИзменитьМассивУслугДляDICOMПоОборудованию(МассивУслуг, Филиал);
	
	// Сверяем значения из массива с текущими в ИсходныеТаблицы
	// Мы не восстанавливаем старые учения из Удалённых
	// Приоритезируем МассивУслуг над текущей таблицей - всё "выпавшее" из таблицы переносим в УникальныеДанныеПоDICOMСопрДанные
    МассивИдентификаторовНаУдалениеИзИсходных = Новый Массив;
	
	Для каждого СтрокаИсходныхДанных Из ИсходныеДанныеStudy Цикл
	
		ИндексМассива = МассивУслуг.Найти(СтрокаИсходныхДанных.Номенклатура);
		
		Если ИндексМассива = Неопределено Тогда		 		
			// Удалять будем отдельно, чтоб не было проблем с обходом таблицы
			МассивИдентификаторовНаУдалениеИзИсходных.Добавить(СтрокаИсходныхДанных.ПолучитьИдентификатор());	
		Иначе
			// Нашли - удаляем из массива и идём дальше
			МассивУслуг.Удалить(ИндексМассива);
		КонецЕсли;
		
	КонецЦикла; 
	
	// Удаляем все "выпавшие" документом-родителем работы
	УдалениеСПроверкойУстаревшихУИДОВ(МассивИдентификаторовНаУдалениеИзИсходных);
	Для каждого ИдентификаторИсходных Из МассивИдентификаторовНаУдалениеИзИсходных Цикл	
		ИсходныеДанныеStudy.Удалить(ИсходныеДанныеStudy.НайтиПоИдентификатору(ИдентификаторИсходных));	
	КонецЦикла;
	
	// Добавляем новые работы из документа-родителя
	Для каждого СсылкаУслуги Из МассивУслуг Цикл
	
		НоваяСтрокаИсх = ИсходныеДанныеStudy.Добавить();	
		НоваяСтрокаИсх.Номенклатура = СсылкаУслуги;
		НоваяСтрокаИсх.СкрытыйНомер = СгенерироватьИЗапомнитьStudyUID(,Клиент);		
		ПодобратьОборудование(НоваяСтрокаИсх.Номенклатура, НоваяСтрокаИсх.ПолучитьИдентификатор());
	
	КонецЦикла;	
	
КонецПроцедуры

// Возвращаемое значение:
//   Число   - сколько файлов
//
&НаКлиенте
Функция ПосчитатьКоличествоВремФайловНужногоФормата(StudyUID,ФорматФайла)

	РезультатКоличество = 0;
	
	Для каждого ЭлементВремФайл Из ИменаВременныхФайлов Цикл
		
		// Т.к. все файлы в одном месте и не известна между ними разница - проверяем ещё и по имени и по расширению
		Если ЭлементВремФайл.РасширениеФайла = ФорматФайла
			И ЭлементВремФайл.StudyUID = StudyUID
			Тогда
		
			РезультатКоличество = РезультатКоличество + 1;	
		
		КонецЕсли;	
	
	КонецЦикла;
	
	Возврат РезультатКоличество;
	
КонецФункции

// Возвращаемое значение:
//   Булево   - Истина - найден, Ложь - нет
//
&НаКлиенте
Процедура УдалитьВсеСтарыеВременныеФайлы(StudyUID, ФорматФайла, УдаляемВсе = Ложь)
	
	Если УдаляемВсе Тогда
		
		// Проходимся по списку и удаляем по именам все файлы
		Для каждого ЭлементВремФайл Из ИменаВременныхФайлов Цикл
			Попытка
				УдалитьФайлы(ЭлементВремФайл.ИмяФайла);			
			Исключение	
			КонецПопытки;
		КонецЦикла;
		
		ИменаВременныхФайлов.Очистить();
	
	Иначе		
		// Т.к. мы удаляем выборочно из списка, то обходим обратным индексом
		Индекс = ИменаВременныхФайлов.Количество() - 1;
		
		Пока Индекс >= 0 Цикл  
			
			ЭлементВремФайл = ИменаВременныхФайлов.Получить(Индекс);
			
			// Т.к. все файлы в одном месте и не известна между ними разница - проверяем ещё и по имени и по расширению
			Если ЭлементВремФайл.РасширениеФайла = ФорматФайла
				И ЭлементВремФайл.StudyUID = StudyUID
				Тогда
				
					Попытка
						УдалитьФайлы(ЭлементВремФайл.ИмяФайла);			
					Исключение	
					КонецПопытки;
	
					ИменаВременныхФайлов.Удалить(ЭлементВремФайл); 				
			КонецЕсли;
			
			Индекс = Индекс - 1; 
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  
