
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму("Справочник.КалендариСотрудников.Форма.КалендариСотрудника", Новый Структура("Сотрудник", ПараметрКоманды), ПараметрыВыполненияКоманды.Источник, ПараметрКоманды);
	
//	ОткрытьФорму("Справочник.КалендариСотрудников.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
