&НаКлиенте
Перем мПараметрыОткрытияОказанияУслуг;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументОснование = Параметры.ДокументОснование;
	СоздаваемыйОбъект = Параметры.СоздаваемыйОбъект;
	
	Если СоздаваемыйОбъект = Неопределено Тогда
		Элементы.Закрыть.Видимость = Ложь;
	ИначеЕсли ТипЗнч(СоздаваемыйОбъект) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
		Элементы.Закрыть.Заголовок = НСтр("ru='Создать оказание услуг на другого клиента'");
	ИначеЕсли ТипЗнч(СоздаваемыйОбъект) = Тип("ДокументСсылка.Прием") Тогда
		Элементы.Закрыть.Заголовок = НСтр("ru='Создать прием на другого клиента'");
	КонецЕсли; 
	
	ЗаполнитьСписокКлиентов();
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСписокКлиентов()
	
	Если ТипЗнч(СоздаваемыйОбъект) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ Таб.Клиент КАК Клиент
		|ПОМЕСТИТЬ Клиенты
		|ИЗ &Таб КАК Таб
		|;
		|ВЫБРАТЬ
		|	Клиенты.Клиент КАК Клиент
		|ИЗ
		|	Клиенты КАК Клиенты
		|	
		|ГДЕ
		|	Клиенты.Клиент НЕ В (ВЫБРАТЬ Клиент ИЗ Документ.ОказаниеУслуг ГДЕ ДокументОснование = &ДокументОснование)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Клиент.Наименование");
		Запрос.УстановитьПараметр("Таб", ДокументОснование.Клиенты.Выгрузить(,"Клиент"));
		Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
		Клиенты = Запрос.Выполнить().Выгрузить();
		
	ИначеЕсли ТипЗнч(СоздаваемыйОбъект) = Тип("ДокументСсылка.Прием") Тогда 
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Прием.Клиент
		|ПОМЕСТИТЬ тбПриемы
		|ИЗ
		|	Документ.Прием КАК Прием
		|ГДЕ
		|	Прием.ДокументОснование = &ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаКлиенты.Клиент КАК Клиент
		|ИЗ
		|	Документ.Заявка.Клиенты КАК ЗаявкаКлиенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ тбПриемы КАК тбПриемы
		|		ПО ЗаявкаКлиенты.Клиент = тбПриемы.Клиент
		|ГДЕ
		|	ЗаявкаКлиенты.Ссылка = &ДокументОснование
		|	И тбПриемы.Клиент ЕСТЬ NULL ");
		
		Запрос.УстановитьПараметр("ДокументОснование",ДокументОснование);
		Клиенты = Запрос.Выполнить().Выгрузить();
	Иначе
		Клиенты = ДокументОснование.Клиенты.Выгрузить(,"Клиент");
	КонецЕсли;

	ЗначениеВРеквизитФормы(Клиенты,"СписокКлиентов");

КонецФункции

&НаКлиенте
Процедура ВыполнитьВыборКлиента()
	
	ТекущиеДанные = Элементы.СписокКлиентов.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		Клиент = ТекущиеДанные.Клиент;
	Иначе
		Клиент = Неопределено;
	КонецЕсли;
	
	Закрыть(Клиент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКлиента(Команда)
	ВыполнитьВыборКлиента();
КонецПроцедуры

&НаКлиенте
Процедура СписокКлиентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыполнитьВыборКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьБезВыбора(Команда)
	Закрыть(ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка"));
КонецПроцедуры


