
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформлениеСостояний();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформлениеСостояний()
	
	Выборка = Справочники.стомСостоянияЗубов.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЦветФона = Выборка.Цвет.Получить();
		
		ЭлементУсловногоОформления = Список.УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.ИдентификаторПользовательскойНастройки = "СостоянияЗубов";
		ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("КраткоеОбозначение");
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = Выборка.Ссылка;
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
		
	КонецЦикла;
	
КонецПроцедуры
