#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.ФормаСкрытьПоказатьАрхивные, Список, Ложь);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоместитьВАрхив(Команда)
	
	РаботаСДиалогамиКлиент.ПоместитьВАрхив(Элементы.Список.ВыделенныеСтроки);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьАрхивные(Команда)
	
	РаботаСДиалогамиКлиент.СкрытьПоказатьАрхивные(Элементы.ФормаСкрытьПоказатьАрхивные, Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСправочникИзЕГИСЗ(Команда)
	
	СтруктураПараметры = Новый Структура("НаименованиеСправочника", "удалитьПричиныОтказаВГоспитализации");
	Оповещение = Новый ОписаниеОповещения("ЗагрузкаКлассификатораЗавершена",ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ЗагрузкаНСИЕГИСЗ", СтруктураПараметры, Элементы.Список, ЭтаФорма,,,Оповещение);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура ЗагрузкаКлассификатораЗавершена(Результат, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
