#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Документ.Тестовый Тогда
		ПометкаУдаления = Истина;
	КонецЕсли;
	
	Если Не Справочники.СообщенияРЭМД.ТребуетсяСозданиеВерсий(Транспорт) Тогда
		Версии.Очистить();
	КонецЕсли;
	
	Если Не ЭтоНовый()
		И Не Справочники.СообщенияРЭМД.ВсегдаСохранятьИсходноеСообщение(Ссылка)
		И Не ВПроцессеРегистрации
		И Ссылка.ВПроцессеРегистрации
	Тогда
		// Процесс регистрации завершился
		Если ЗначениеЗаполнено(ИдентификаторРЭМД) Тогда
			// Успешно
			Справочники.СообщенияРЭМД.ПометитьНаУдалениеНеактуальныеСообщения(ДатаСоздания, Документ, ИдентификаторШаблонаЭМД);
		ИначеЕсли Справочники.СообщенияРЭМД.ИмеютсяБолееАктуальныеСообщения(ДатаСоздания, Документ, ИдентификаторШаблонаЭМД) Тогда
			// Неуспешно, при этом сообщение не актально
			Отправить = Ложь;
			Обновить = Ложь;
			ПометкаУдаления = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти