#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверяем, требуется ли указание склада в документе (есть ли материалы)
	НоменклатураДокумента = Новый Массив;
	Для Каждого СтрокаТабЧасти Из ДействияСтационара Цикл
		Если ТипЗнч(СтрокаТабЧасти.ДействиеСтационара) = Тип("СправочникСсылка.Номенклатура")
			И Не ЗначениеЗаполнено(СтрокаТабЧасти.Склад)
		Тогда
			НоменклатураДокумента.Добавить(СтрокаТабЧасти.ДействиеСтационара);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаТабЧасти Из Перерасход Цикл
		Если Не ЗначениеЗаполнено(СтрокаТабЧасти.Склад) Тогда
			НоменклатураДокумента.Добавить(СтрокаТабЧасти.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НоменклатураДокумента", НоменклатураДокумента);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&НоменклатураДокумента)
	|	И Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Материал)"
	;
	Рез = Запрос.Выполнить();
	Если Не Рез.Пустой() Тогда
		
		МатериалыДокумента = Рез.Выгрузить().ВыгрузитьКолонку("Ссылка");
		ПроверяемыеРеквизиты.Добавить("Склад");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем ТаблицаПроцедуры, ТаблицаМанипуляции, ТаблицаМедикаменты;
	
	Если Не Отказ Тогда 
		
		ВыбратьСтрокиПоВидуДействия(Перечисления.ВидыДействийСтационара.Процедуры,ТаблицаПроцедуры, Перечисления.ВидыНоменклатуры.Услуга);
		ВыбратьСтрокиПоВидуДействия(Перечисления.ВидыДействийСтационара.Манипуляции,ТаблицаМанипуляции);
		ВыбратьСтрокиПоВидуДействия(Перечисления.ВидыДействийСтационара.Медикаменты,ТаблицаМедикаменты);
		
		ДвижениеВыполнениеПланаЛечения(ТаблицаПроцедуры);
		ДвижениеВыполнениеПланаЛечения(ТаблицаМедикаменты);
		РаботаСДокументамиСервер.СвернутьДвиженияРегистра(Движения.ВыполнениеПланаЛечения, "Количество");
		
		// Запись в регистр ВыполнениеДействийСтационара
		ДвижениеВыполнениеДействийСтационара(ТаблицаПроцедуры,ТаблицаМедикаменты,ТаблицаМанипуляции);
		
		// Движения по складскому учету (списание медикаментов при соответствующих настройках)
		ДвижениеПоСкладскомуУчету(ТаблицаМедикаменты, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыбратьСтрокиПоВидуДействия(ВидДействия, Таблица, ВидНоменклатуры = Неопределено)
	
	// Изменения Макеев 18-12-2025 (
	Таблица = ДействияСтационара.Выгрузить(Новый Массив);
	
	Если ВидДействия = Перечисления.ВидыДействийСтационара.Медикаменты Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДействияЗаСуткиДействияСтационара.ИдентификаторЭлемента КАК ИдентификаторЭлемента,
		               |	ЕСТЬNULL(ПланыЛечения.ПриемовВДень * ПланыЛечения.Дозировка, 0) КАК ДозировкаВДень,
		               |	ПланыЛечения.Дозировка КАК Дозировка,
		               |	ПланыЛечения.ПриемовВДень КАК ПриемовВДень
		               |ИЗ
		               |	Документ.ДействияЗаСутки.ДействияСтационара КАК ДействияЗаСуткиДействияСтационара
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПланыЛечения КАК ПланыЛечения
		               |		ПО ДействияЗаСуткиДействияСтационара.ИдентификаторЭлемента = ПланыЛечения.ИдентификаторЭлемента
		               |ГДЕ
		               |	ДействияЗаСуткиДействияСтационара.Ссылка = &Ссылка
		               |	И ДействияЗаСуткиДействияСтационара.ВидыДействийСтационара = &ВидыДействийСтационара";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("ВидыДействийСтационара", Перечисления.ВидыДействийСтационара.Медикаменты);
		СоответствиеДозировок = Новый Соответствие;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ОстаткиПриемов = Новый Массив;
			Для НДня = 1 По Выборка.ПриемовВДень Цикл
				ОстаткиПриемов.Добавить(Новый Структура("Дозировка", Выборка.Дозировка));
			КонецЦикла;
			
			СтруктураДозировки = Новый Структура("ДозировкаВДень, Дозировка, ПриемовВДень, Остатки",,,, ОстаткиПриемов);
			ЗаполнитьЗначенияСвойств(СтруктураДозировки, Выборка);
			СоответствиеДозировок.Вставить(Выборка.ИдентификаторЭлемента, СтруктураДозировки);
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого СтрокаДействия Из ДействияСтационара Цикл
		Если СтрокаДействия.ВидыДействийСтационара = ВидДействия
			И (ВидНоменклатуры = Неопределено Или СтрокаДействия.ДействиеСтационара.ВидНоменклатуры = ВидНоменклатуры)
		Тогда
			СтрокаЗаписи = Таблица.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗаписи, СтрокаДействия);
			Если ВидДействия = Перечисления.ВидыДействийСтационара.Медикаменты Тогда
				
				СписатьВыполнение = Ложь;
				НужнаяДозировка = СтрокаДействия.Значение;
				СтруктураДозировки = СоответствиеДозировок.Получить(СтрокаДействия.ИдентификаторЭлемента);
				Для Каждого Остаток Из СтруктураДозировки.Остатки Цикл
					Если Остаток.Дозировка = 0 Тогда
						Продолжить;
					КонецЕсли;
					Если Остаток.Дозировка >= НужнаяДозировка Тогда
						Остаток.Дозировка = Остаток.Дозировка - НужнаяДозировка;
						НужнаяДозировка = 0;
					Иначе
						НужнаяДозировка = НужнаяДозировка - Остаток.Дозировка;
						Остаток.Дозировка = 0;
					КонецЕсли;
					Если Остаток.Дозировка = 0 Тогда
						СписатьВыполнение = Истина;
					КонецЕсли;
				КонецЦикла;
				Если СписатьВыполнение Тогда
					СтрокаЗаписи.Количество = 1;
				Иначе 
					СтрокаЗаписи.Количество = 0;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Процедура ДвижениеВыполнениеПланаЛечения(ТаблицаВыполнения)
	
	Если ТаблицаВыполнения.Количество() > 0 Тогда 
		
		ТаблицаВыполненияКопия = ТаблицаВыполнения.Скопировать();
		ТаблицаВыполненияКопия.Колонки.ДействиеСтационара.Имя = "Номенклатура";
		
		ОтборПП = Новый Структура("ПервичныйПрием");
		ПервичныеПриемы = ОбщегоНазначения.ВыгрузитьКолонку(ТаблицаВыполнения, "ПервичныйПрием", Истина);
		Для Каждого ПервичныйПрием Из ПервичныеПриемы Цикл
			Если ЗначениеЗаполнено(ПервичныйПрием) Тогда
				
				ОтборПП.ПервичныйПрием = ПервичныйПрием;
				ВыполнениеТекущегоОбращения = ТаблицаВыполненияКопия.Скопировать(ТаблицаВыполненияКопия.НайтиСтроки(ОтборПП));
				
				ПланЛечения = МедицинскаяДеятельность.ПланЛеченияСВыполнением(ПервичныйПрием);
				
				МедицинскаяДеятельностьПереопределяемый.ПередРассчетомДвиженийВыполненияПланаЛечения(ВыполнениеТекущегоОбращения, Ссылка, ВыполнениеТекущегоОбращения[0].МедицинскаяКарта);
				ДвиженияВыполнения = МедицинскаяДеятельность.РассчитатьДвиженияВыполненияПланаЛечения(ПланЛечения, ВыполнениеТекущегоОбращения);
				
				Для Каждого ДвижениеВыполнения Из ДвиженияВыполнения Цикл
					НовоеДвижение 						= Движения.ВыполнениеПланаЛечения.Добавить();
					НовоеДвижение.Период				= Дата;
					НовоеДвижение.Регистратор 			= Ссылка;
					НовоеДвижение.ИдентификаторЭлемента = ДвижениеВыполнения.ИдентификаторЭлемента;
					НовоеДвижение.ПервичныйПрием 		= ПервичныйПрием;
					НовоеДвижение.Количество 			= ДвижениеВыполнения.Количество;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
		
КонецПроцедуры

// Запись в регистр ВыполнениеДействийСтационара
Процедура ДвижениеВыполнениеДействийСтационара(ТаблицаПроцедуры,ТаблицаМедикаменты,ТаблицаМанипуляции);
	
	Движения.ВыполнениеДействийСтационара.Записывать = Истина;
	
	Источники = Новый Массив;
	Источники.Добавить(ТаблицаПроцедуры);
	Источники.Добавить(ТаблицаМедикаменты);
	Источники.Добавить(ТаблицаМанипуляции);
	
	Для Каждого Источник Из Источники Цикл
		Для Каждого СтрокаТаблицы Из Источник Цикл 
			НовоеДвижение = Движения.ВыполнениеДействийСтационара.Добавить();
			НовоеДвижение.Регистратор = Ссылка;
			ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТаблицы);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ДвижениеПоСкладскомуУчету(ТаблицаМедикаменты, Отказ)
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	Если УправлениеНастройками.ПолучитьПериодическийПараметрУчетнойПолитики("СписыватьМатериалыСтационараСразу", Дата) Тогда
		
		ТаблицаМедикаменты.Колонки.Добавить("ЭтоНоменклатура", Новый ОписаниеТипов("Булево"));
		Для Каждого СтрокаТаблицы Из ТаблицаМедикаменты Цикл
			СтрокаТаблицы.ЭтоНоменклатура = ТипЗнч(СтрокаТаблицы.ДействиеСтационара) = Тип("СправочникСсылка.Номенклатура");
		КонецЦикла;
		
		ТаблицаСписания = ТаблицаМедикаменты.Скопировать(ТаблицаМедикаменты.НайтиСтроки(Новый Структура("ЭтоНоменклатура", Истина)));
		ТаблицаСписания.Колонки.Добавить("Номенклатура");
		Для Каждого СтрокаСписания Из ТаблицаСписания Цикл 
			СтрокаСписания.Номенклатура = СтрокаСписания.ДействиеСтационара;
		КонецЦикла;
		
		Для Каждого СтрокаПерерасход Из Перерасход Цикл
			СтрокаСписания = ТаблицаСписания.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСписания, СтрокаПерерасход);
		КонецЦикла;
		
		Для Каждого СтрокаСписания Из ТаблицаСписания Цикл 
			Если Не ЗначениеЗаполнено(СтрокаСписания.Склад) Тогда
				СтрокаСписания.Склад = Склад;
			КонецЕсли;
		КонецЦикла;
		
		ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаСписания, Отказ); 
		ПартионныйУчет.пуДвижениеПартийТоваров(Ссылка, Движения.СписанныеТовары.Выгрузить(), Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ДвиженияПоРегиструСписанныеТовары(СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ) 
	// ТОВАРЫ ПО РЕГИСТРУ СписанныеТовары.
	НаборДвижений = Движения.СписанныеТовары;
	// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	ТаблицаДвижений.Очистить();
	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
	// Недостающие поля.
	Инд = 0;
	Для каждого Строка Из ТаблицаДвижений Цикл
		Инд = Инд+1;
		Строка.НомерСтрокиДокумента = Инд;
	КонецЦикла;
	ТаблицаДвижений.ЗаполнитьЗначения(Дата,   "Период");
	ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "Регистратор");
	ТаблицаДвижений.ЗаполнитьЗначения(Истина, "Активность");
	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
	Если Не Отказ Тогда
		Движения.СписанныеТовары.ВыполнитьДвижения();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти