
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметр = Параметры.Параметр;
	Регулирование = Параметр.Регулирование;
	
	Для Каждого СтрокаСегмент Из Параметры.СписокСегментов Цикл
		ЗаполнитьЗначенияСвойств(СписокСегментов.Добавить(), СтрокаСегмент);
	КонецЦикла;	
	ЭтаФорма.Заголовок = "Зуб " + Параметры.ОбозначениеЗуба + " - " + Строка(Параметр);
	
	КолонкаЗуб = Элементы.СписокСегментовЗначение;
	КолонкаЗуб.РедактированиеТекста = Не Параметр.ЗапретРучногоРедактирования;
	КолонкаЗуб.КнопкаВыбора = ?(Параметр.ЗапретРучногоРедактирования, Ложь, Неопределено);
	КолонкаЗуб.МинимальноеЗначение = Параметр.МинимальноеЗначение;
	КолонкаЗуб.МаксимальноеЗначение = Параметр.МаксимальноеЗначение;
	КолонкаЗуб.КнопкаРегулирования = ?(Параметр.Регулирование > 0, Истина, Неопределено);
	КолонкаЗуб.ФорматРедактирования = Параметр.ФорматРедактирования;
	КолонкаЗуб.Формат = Параметр.ФорматПредставления;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	Закрыть(СписокСегментов);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСегментовЗначениеРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.СписокСегментов.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	НовоеЗначение = ТекДанные.Значение + Направление * Регулирование;
	
	// Проверка выхода за диапазон
	Если Элемент.МинимальноеЗначение <> 0 Или Элемент.МаксимальноеЗначение <> 0 Тогда
		НовоеЗначение = Макс(НовоеЗначение, Элемент.МинимальноеЗначение);
		НовоеЗначение = Мин(НовоеЗначение, Элемент.МаксимальноеЗначение);	
	КонецЕсли;
	
	ТекДанные.Значение = НовоеЗначение;
	
КонецПроцедуры
