 &НаКлиенте
Процедура ОтборПодвидПриИзменении(Элемент)
    УстановитьОтборПоПодвиду();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПодвиду()

    ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
        Список.Отбор, "Ссылка");

    Если НЕ ЗначениеЗаполнено(ОтборПодвид) Тогда
        Возврат;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ РАЗЛИЧНЫЕ
    |   РС.Приложение КАК Приложение
    |ИЗ
    |   РегистрСведений.омг_ЛицензированныеВидыДеятельности КАК РС
    |ГДЕ
    |   РС.ПодвидДеятельности В ИЕРАРХИИ (&Подвид)";
    Запрос.УстановитьПараметр("Подвид", ОтборПодвид);

    Приложения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Приложение");

    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
        Список, "Ссылка", Приложения,
        ВидСравненияКомпоновкиДанных.ВСписке, , Истина);

КонецПроцедуры