#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Филиал.Видимость = УправлениеНастройками.ТребуетсяУчетПоФилиалам();
	
	//////////////////////////////////////////////////////////
	// ОМГ
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Организация", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.омг_Организация";
	// ОМГ
    //////////////////////////////////////////////////////////

КонецПроцедуры

#КонецОбласти