
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Справочник = Параметры.Справочник;
	Заголовок = Метаданные.Справочники[Справочник].Синоним;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокВыбранных", Параметры.СписокВыбранных);
	Запрос.Текст = "ВЫБРАТЬ
	|	Справочник.Ссылка КАК Значение,
	|";
	Если Метаданные.Справочники[Справочник].Иерархический
		И Метаданные.Справочники[Справочник].ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
		Запрос.Текст = Запрос.Текст + "
		|	Справочник.ЭтоГруппа КАК Группа,
		|";
	Иначе
		Запрос.Текст = Запрос.Текст + "
		|	ЛОЖЬ КАК Группа,
		|";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + "
	|	Ссылка В (&СписокВыбранных) КАК Пометка,
	|	Справочник.Наименование КАК Наименование
	|ИЗ
	|	Справочник." + Справочник + " КАК Справочник
	|ГДЕ ИСТИНА
	|";
	Если Метаданные.Справочники[Справочник].Иерархический 
		И Метаданные.Справочники[Справочник].ВидИерархии = Метаданные.СвойстваОбъектов.ВидИерархии.ИерархияГруппИЭлементов Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И НЕ Справочник.ЭтоГруппа
		|";
	КонецЕсли;
	Если Параметры.Свойство("Отбор") Тогда
		Для Каждого ЭлементОтбора Из Параметры.Отбор Цикл
			Если ЭлементОтбора.Ключ = "ПараметрыЗапроса" Тогда
				Для Каждого ПараметрЗапроса Из ЭлементОтбора.Значение Цикл
					Запрос.УстановитьПараметр(ПараметрЗапроса.Параметр, ПараметрЗапроса.Значение);
				КонецЦикла;
				Продолжить;
			КонецЕсли;
			Если ЭлементОтбора.Ключ = "СложныеОтборы" Тогда
				Для Каждого СложныйОтбор Из ЭлементОтбора.Значение Цикл
					Запрос.Текст = Запрос.Текст + "
					|	И " + СложныйОтбор + "
					|";
				КонецЦикла;
				Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
			Иначе
				Запрос.Текст = Запрос.Текст + "
				|	И " + ЭлементОтбора.Ключ + " = &" + ЭлементОтбора.Ключ + "
				|";
				Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
			КонецЕсли;
		КонецЦикла;;
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|ИТОГИ ПО
	|	Значение ТОЛЬКО ИЕРАРХИЯ";
	ДеревоЗначений = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого СтрокаДерева Из ДеревоЗначений.Строки Цикл
		Если Не ЗначениеЗаполнено(СтрокаДерева.Значение) Тогда
			Для Каждого ПодстрокаДерева Из СтрокаДерева.Строки Цикл
				ЗаполнитьЗначенияСвойств(ДеревоЗначений.Строки.Добавить(), ПодстрокаДерева);
			КонецЦикла;
			ДеревоЗначений.Строки.Удалить(СтрокаДерева);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ДеревоЗначений.Строки.Сортировать("Наименование");
	
	ЗначениеВРеквизитФормы(ДеревоЗначений, "Список");
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	ТекущийРодитель = ТекущиеДанные.ПолучитьРодителя();
	
	Если ТекущиеДанные.Пометка = 2 Тогда
		ТекущиеДанные.Пометка = 0;
	КонецЕсли;
	
	УстановитьПометкуРекурсивно(ТекущиеДанные, ТекущиеДанные.Пометка);
	
	Пометка = Ложь;
	Частично = Ложь;
	Если Не ТекущийРодитель = Неопределено Тогда 
		Для Каждого СтрокаДерева Из ТекущийРодитель.ПолучитьЭлементы() Цикл
			Если Не СтрокаДерева.Пометка = 0 Тогда
				Пометка = Истина;
			Иначе
				Частично = Истина;
			КонецЕсли;
		КонецЦикла;
		Если Пометка Тогда
			ТекущийРодитель.Пометка = 1;
		КонецЕсли;
		Если Частично Тогда
			ТекущийРодитель.Пометка = 2;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокРекурсивно(СтрокаДерева, СписокЗначений)
	
	Для Каждого ПодстрокаДерева Из СтрокаДерева.ПолучитьЭлементы() Цикл
		Если ПодстрокаДерева.Группа Или Не ПодстрокаДерева.Пометка Тогда
			Продолжить;
		КонецЕсли;
		СписокЗначений.Добавить(ПодстрокаДерева.Значение);
		ЗаполнитьСписокРекурсивно(ПодстрокаДерева, СписокЗначений); 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	СписокЗначений = Новый СписокЗначений;
	ЗаполнитьСписокРекурсивно(Список, СписокЗначений);
	ОповеститьОВыборе(СписокЗначений);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуРекурсивно(СтрокаДерева, Пометка)
	
	Для Каждого ПодстрокаДерева Из СтрокаДерева.ПолучитьЭлементы() Цикл
		ПодстрокаДерева.Пометка = Пометка;
		УстановитьПометкуРекурсивно(ПодстрокаДерева, Пометка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометку(Команда)
	УстановитьПометкуРекурсивно(Список, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометку(Команда)
	УстановитьПометкуРекурсивно(Список, Ложь);
КонецПроцедуры
