#Область ПрограммныйИнтерфейс

// Дополнительные действия после записи документа Оказание услуг.
//
// Параметры:
//  Объект				 - ДокументОбъект.ОказаниеУслуг	 - документ.
//  СтруктураПараметров	 - Структура - параметры записи.
//
Процедура ОказаниеУслугПослеЗаписи(Объект, СтруктураПараметров) Экспорт
	
	Если СтруктураПараметров.Свойство("ВводОУПоГрупповойЗаявке")
		И Не Объект.ПометкаУдаления
	Тогда
		ЗаявкаОткрыта = Ложь;
		Для Каждого Окно Из ПолучитьОкна() Цикл
			СодержимоеОкна = Окно.ПолучитьСодержимое();
			Если ТипЗнч(СодержимоеОкна) = Тип("ФормаКлиентскогоПриложения")
				И СодержимоеОкна.ИмяФормы = "Документ.Заявка.Форма.ФормаДокументаУпр"
				И СодержимоеОкна.Объект.Ссылка = Объект.ДокументОснование
			Тогда
				ЗаявкаОткрыта = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЗаявкаОткрыта Тогда
			Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.ОказаниеУслуг") Тогда
				Оповестить("ЗаписьОУпоГрупповойЗаявке", 
							Новый Структура("Заявка, Клиент", Объект.ДокументОснование, Объект.Клиент),
							Объект.Ссылка);
			КонецЕсли; 
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Открыть форму выбора клиента в контексте журнала записи.
//
// Параметры:
//  СоздаваемыйОбъект	 - Строка	 - Полное имя типа создаваемого документа.
//  Заявка				 - ДокументСсылка.Заявка	 - заявка.
//  ТекущийКлиент		 - СправочникСсылка.Клиенты	 - клиент.
//  СтандартнаяОбработка - Булево	 - прекращение дальнейшей обработки.
//
Процедура КалендарьПланированияОткрытьФормуВыбораКлиента(СоздаваемыйОбъект, Заявка, ТекущийКлиент, СтандартнаяОбработка) Экспорт

	Если РаботаСКлиентамиПереопределяемый.ЭтоГрупповаяЗаявка(ТекущийКлиент) Тогда 
		ПараметрыФормыДоп = Новый Структура;
		ПараметрыФормыДоп.Вставить("ДокументОснование",Заявка);
		ПараметрыФормыДоп.Вставить("СоздаваемыйОбъект",СоздаваемыйОбъект);
		
		ВыбранныйКлиент = ОткрытьФормуМодально("Документ.Заявка.Форма.ФормаСпискаКлиентов", ПараметрыФормыДоп);
		Если ВыбранныйКлиент = Неопределено Тогда
			СтандартнаяОбработка = Ложь;
		Иначе
			ТекущийКлиент = ВыбранныйКлиент;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Создает документ забора анализов по продажам или оказание услуг по забранным анализам
//
// Параметры:
//  Режим	 - Строка						 - Режим работы формы, "ЗаборПоОплаченным" или "Продажа".
//  Клиент	 - СправочникСсылка.Клиенты		 - Клиент, для которого выполняется заполнение.
//  Анализы	 - Массив						 - Массив структур "Клиент, Номенклатура, Количество", Если значение неопределено,
//  						будет выполнен поиск по всем документам в соответствии с режимом.
//  ЭтаФорма - ФормаКлиентскогоПриложения	 - Ссылка на форму документа, из которого вызвано заполнение.
//
Процедура ВыборатьУслугиКлиентовДляСозданияДокумента(Режим = Неопределено, Клиент = Неопределено, Анализы = Неопределено, 
	ЭтаФорма = Неопределено, ИсключаемыеАнализы = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Режим", Режим);
	Если Клиент <> Неопределено Тогда
		ПараметрыФормы.Вставить("Клиент", Клиент);
	КонецЕсли;
	Если Анализы <> Неопределено Тогда
		ПараметрыФормы.Вставить("Анализы", Анализы);
	КонецЕсли;
	Если ИсключаемыеАнализы <> Неопределено Тогда
		ПараметрыФормы.Вставить("ИсключаемыеАнализы", ИсключаемыеАнализы);
	КонецЕсли;

	ОткрытьФорму("ОбщаяФорма.ВыборУслугДляСозданияДокумента", ПараметрыФормы, ЭтаФорма, Ложь,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Создать продажу по текущему посещению клиента.
//
// Параметры:
//  ЭтаФорма	 - ФормаКлиентскогоПриложения	 - форма вызова.
//  ИмяКоманды	 - Строка	 - команда
//
Процедура СоздатьПродажуПоНачатомуПосещению(ЭтаФорма, ИмяКоманды) Экспорт
	
	ВыборатьУслугиКлиентовДляСозданияДокумента("Продажа", ЭтаФорма.Клиент,,ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти