#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//Добавлено Карсаков
	Если Не РольДоступна("ПолныеПрава") И Не РольДоступна("УправляющийФилиалом") Тогда 
		
		ОтборПоСотруднику = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборПоСотруднику.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник");
		ОтборПоСотруднику.ПравоеЗначение = Пользователи.ТекущийПользователь();
		ОтборПоСотруднику.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	УниверсальныеМеханизмыСервер.ОтчетПриКомпоновкеРезультата(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
