

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	// Изменения Макеев 26-06-2026 (
	// Для оптимизации поиска по номеру телефона
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
			
			СтруктураНомера = КонтактнаяИнформацияКлиентСерверПереопределяемый.НормализоватьСотовыйТелефон(Запись.Представление);
			Запись.омг_НомерТелефонаТолькоЦифры = СтруктураНомера.Номер;
			
		Иначе
			
			Если ЗначениеЗаполнено(Запись.омг_НомерТелефонаТолькоЦифры) Тогда
				Запись.омг_НомерТелефонаТолькоЦифры = "";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти