
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	////////////////////////////////////////////////////
	//// ОМГ
	//
	//ЭтоМessenger = Ложь;
	//ЭтоКлиент = Ложь;
	//Мessenger = Справочники.ВидыКонтактнойИнформации.Мessenger_WZ;
	//Для Каждого Строка Из ЭтотОбъект Цикл
	//	
	//	Если Строка.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда
	//		Строка.Поле12 = СтроковыеФункцииКлиентСервер.ПолучитьЦифрыСтроки(Строка.Представление);		
	//	КонецЕсли;
	//	
	//	Если ТипЗнч(Строка.Объект) = Тип("СправочникСсылка.Клиенты") Тогда
	//		
	//		Если не ЭтоКлиент Тогда
	//			ЭтоКлиент = Истина
	//		КонецЕсли;
	//		
	//		Если Строка.Вид = Мessenger Тогда
	//			УстановитьПривилегированныйРежим(Истина);
	//			ЭтоМessenger = Истина;
	//			ОбьектКлиент = Строка.Объект.ПолучитьОбъект(); 
	//			ОбьектКлиент.омг_Мessenger = Строка.Представление;  
	//			ОбьектКлиент.ОбменДанными.Загрузка = Истина;
	//			ОбьектКлиент.Записать();
	//			УстановитьПривилегированныйРежим(Ложь);
	//		КонецЕсли;	
	//	КонецЕсли;
	//	
	//КонецЦикла; 
	//	
	//// ОМГ
	////////////////////////////////////////////////////
	
КонецПроцедуры

#КонецОбласти