
Функция СоздатьИнициализироватьМассив(Размер, ЗначениеИнициализации = Неопределено) Экспорт
	
	Массив = Новый Массив(Размер);
	Если ЗначениеИнициализации <> Неопределено Тогда 
		Для Сч = 0 По Массив.Количество() - 1 Цикл 
			Массив[Сч] = ЗначениеИнициализации;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

Функция СоздатьИнициализироватьСтроку(Размер, ЗначениеИнициализации = Неопределено) Экспорт
	
	Строка = "";
	Если ЗначениеИнициализации <> Неопределено Тогда 
		Для Сч = 0 По Размер - 1 Цикл 
			Строка = Строка + ЗначениеИнициализации;
		КонецЦикла;
	Иначе
		Для Сч = 0 По Размер - 1 Цикл 
			Строка = Строка + "0";
		КонецЦикла;	
	КонецЕсли;
	
	Возврат Строка;
	
КонецФункции

Функция ЗаменитьСимволВСтрокеПоИндексу(Строка, Индекс, Символ = "") Экспорт 
	
	Возврат Лев(Строка, Индекс - 1) + Символ + Прав(Строка, СтрДлина(Строка) - Индекс);
	
КонецФункции

Функция ПобитовоеИМассив(МассивОперандов) Экспорт
	
	РазмерыМассивов = ПолучитьМаксимальныйМинимальныйРазмерОперандов(МассивОперандов);
	Если РазмерыМассивов = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = СоздатьИнициализироватьМассив(РазмерыМассивов.Макс, Ложь);
	
	Для Сч = 1 По РазмерыМассивов.Мин Цикл
		ТекИндексРезультат = Результат.Количество() - Сч;
		Результат[ТекИндексРезультат] = Истина;
		Для Каждого Операнд Из МассивОперандов Цикл
			Если Не Операнд[Операнд.Количество() - Сч] Тогда 
				Результат[ТекИндексРезультат] = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПобитовоеИлиМассив(МассивОперандов) Экспорт
	
	РазмерыМассивов = ПолучитьМаксимальныйМинимальныйРазмерОперандов(МассивОперандов);
	Если РазмерыМассивов = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = СоздатьИнициализироватьМассив(РазмерыМассивов.Макс, Ложь);
	
	Для Сч = 1 По РазмерыМассивов.Макс Цикл
		ТекИндексРезультат = Результат.Количество() - Сч;
		Результат[ТекИндексРезультат] = Ложь;
		Для Каждого Операнд Из МассивОперандов Цикл
			ТекИндексОперанд = Операнд.Количество() - Сч;
			Если ТекИндексОперанд >= 0 Тогда 
				Если Операнд[ТекИндексОперанд] Тогда 
					Результат[ТекИндексРезультат] = Истина;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПобитовоеИСтрока(МассивОперандов) Экспорт
	
	РазмерыМассивов = ПолучитьМаксимальныйМинимальныйРазмерОперандов(МассивОперандов);
	Если РазмерыМассивов = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = "";
	
	Для Сч = 0 По РазмерыМассивов.Макс - 1 Цикл
		ТекБит = "1";
		Для Каждого Операнд Из МассивОперандов Цикл
			ТекИндексОперанд = СтрДлина(Операнд) - Сч;
			Если ТекИндексОперанд <= 0 Или Сред(Операнд, ТекИндексОперанд, 1) = "0" Тогда 
				ТекБит = "0";
				Прервать;
			КонецЕсли;
			Результат = ТекБит + Результат;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПобитовоеИлиСтрока(МассивОперандов) Экспорт
	
	РазмерыМассивов = ПолучитьМаксимальныйМинимальныйРазмерОперандов(МассивОперандов);
	Если РазмерыМассивов = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = "";
	
	Для Сч = 0 По РазмерыМассивов.Макс - 1 Цикл
		ТекБит = "0";
		Для Каждого Операнд Из МассивОперандов Цикл
			ТекИндексОперанд = СтрДлина(Операнд) - Сч;
			Если ТекИндексОперанд <= 0 И Сред(Операнд, ТекИндексОперанд, 1) = "1" Тогда 
				ТекБит = "1";
				Прервать;
			КонецЕсли;
			Результат = ТекБит + Результат;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьМаксимальныйМинимальныйРазмерОперандов(СписокОперандов) Экспорт
	
	Если СписокОперандов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЭтоСтрока = (ТипЗнч(СписокОперандов[0]) = Тип("Строка"));
	
	РазмерМин = ?(ЭтоСтрока, СтрДлина(СписокОперандов[0]), СписокОперандов[0].Количество());	
	РазмерМакс = 0;
	
	Для Каждого Операнд Из СписокОперандов Цикл
		РазмерМин = Мин(РазмерМин, ?(ЭтоСтрока, СтрДлина(Операнд), Операнд.Количество()));
		РазмерМакс = Макс(РазмерМакс, ?(ЭтоСтрока, СтрДлина(Операнд), Операнд.Количество()));
	КонецЦикла;
	
	Возврат Новый Структура("Мин, Макс", РазмерМин, РазмерМакс);
	
КонецФункции

Функция ПолучитьЭлементыМаски(МассивЭлементов, Маска) Экспорт 
	
	ЭтоСтрока = (ТипЗнч(Маска) = Тип("Строка"));
	
	Результат = Новый Массив;
	
	Если ЭтоСтрока Тогда 
		Для Сч = 0 По СтрДлина(Маска) - 1 Цикл
			Если Сред(Маска, Сч + 1, 1) = "1" Тогда
				Результат.Добавить(МассивЭлементов[Сч]);
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Сч = 0 По Маска.Количество() - 1 Цикл
			Если Маска[Сч] = Истина Тогда 
				Результат.Добавить(МассивЭлементов[Сч]);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
