#Область ПрограммныйИнтерфейс

#Область ОпределениеФормыВвода // Форма ввода по назначению редактируемого поля.

Функция ИмяФормыВвода(КодировкаПоля) Экспорт 
	
	Перем ИмяФормы;
	
	Если ТипЗнч(КодировкаПоля) = Тип("ПеречислениеСсылка.КодировкаПолейЭМД") Тогда
		ИмяФормы = ИмяФормыВнутреннейКодировкиПоля(КодировкаПоля);
	ИначеЕсли ТипЗнч(КодировкаПоля) = Тип("СправочникСсылка.КлассификаторыМинЗдрава") Тогда
		ИмяФормы = ИмяФормыКодировкиПоляПоКлассификатору(КодировкаПоля);
	КонецЕсли;
	
	ПреобразоватьИмяФормыВПолноеИмяФормы(ИмяФормы); // Очищает, если в метаданных нет такой формы.
	
	Возврат ИмяФормы;
	
КонецФункции

Функция КодировкаПоляЭМДИмеетИнтерфейсВвода(КодировкаПоля) Экспорт
	
	Имяформы = ЗначениеЗаполнено(ИмяФормыВвода(КодировкаПоля));
	Возврат ЗначениеЗаполнено(ИмяФормыВвода(КодировкаПоля));
	
КонецФункции

#КонецОбласти

#Область СвязиНазначений

// Связи назначений параметров шаблонов для операции ввода значения параметра приема.
// 
// Возвращаемое значение:
//  Соответствие - где Ключ: СправочникСсылка.КлассификаторыМинЗдрава, а значение - Массив из того же справочника.
//
Функция СвязиНазначенийПараметровДляВвода() Экспорт
	
	СоответствиеСвязей = Новый Соответствие;
	
	// Добавление конкретных случаев связи
	СвязиНазначенийДобавитьСвязь_АртериальноеДавление(СоответствиеСвязей);
	// ...
	
	Возврат СоответствиеСвязей;
	
КонецФункции

#КонецОбласти

#Область ИнфекционныеОтметкиАнамнезаВСтационаре

// Значение по умолчанию для поля "Инфекционные отметки анамнеза в стационаре значение по умолчанию"
//  (для карты 003/у по приказу 530н).
//
// Параметры:
//  ДокументОбъект	 - ДокументСсылка.Прием, СправочникСсылка.МедицинскиеКарты - документ, для которого требуется значение.
//  ШаблонПриема	 - СправочникСсылка.ШаблоныHTML	 - шаблон, в рамках которого требуется значение.
// 
// Возвращаемое значение:
//  Строка.
//
Функция ИнфекционныеОтметкиАнамнезаВСтационаре_ЗначениеПоУмолчанию(ДокументОбъект = Неопределено, ШаблонПриема = Неопределено) Экспорт
	
	ЗначениеПоУмолчанию = "туберкулез: нет;  ВИЧ-инфекции: нет;  вирусные гепатиты: нет;  сифилис: нет;  COVID-19: нет";
	
	// Для не первичного осмотра стационарного больного, а дальнейших осмотров в стационаре более актуально пустое значение по умолчанию.
	ЭтоШаблонОсмотр_ВидМД_341 = Ложь;
	ТребуетсяПустоеЗначение = Ложь;
	Если ТипЗнч(ШаблонПриема) = Тип("СправочникСсылка.ШаблоныHTML") Тогда
		ЭтоШаблонОсмотр_ВидМД_341 = ШаблонПриема.ВидМедицинскойДокументации.УИДЕГИСЗ = 341; // Осмотр врачом стационара.
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("СправочникСсылка.МедицинскиеКарты") Тогда
		ТребуетсяПустоеЗначение = Истина;
	Иначе
		Если ДокументОбъект <> Неопределено Тогда
			
			Шаблоны = Новый Массив;
			
			Попытка
				Для Каждого СтрокаШаблон Из ДокументОбъект.Шаблоны Цикл
					Если ЗначениеЗаполнено(СтрокаШаблон.ШаблонПриема)
						И ЗначениеЗаполнено(СтрокаШаблон.ШаблонПриема.ВидМедицинскойДокументации)
						И СтрокаШаблон.ШаблонПриема.ВидМедицинскойДокументации.УИДЕГИСЗ = 341 // Осмотр врачом стационара.
					Тогда
						ЭтоШаблонОсмотр_ВидМД_341 = Истина;
					КонецЕсли;
				КонецЦикла;
			Исключение
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоШаблонОсмотр_ВидМД_341 Тогда
		ЗначениеПоУмолчанию = "";
	ИначеЕсли ТребуетсяПустоеЗначение Тогда
		ЗначениеПоУмолчанию = СтрЗаменить(ЗначениеПоУмолчанию, "нет","________");
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
	
КонецФункции

#КонецОбласти
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПреобразоватьИмяФормыВПолноеИмяФормы(ИмяФормы);
	
	МетаданныеОбработки = Метаданные.Обработки.ИнтерфейсВводаПолейЭМД;
	
	// Формируем полное имя формы и проверяем, есть ли оно в метаданных конфигурации
	Если ЗначениеЗаполнено(ИмяФормы) Тогда
		ПолноеИмяФормы = МетаданныеОбработки.ПолноеИмя() + ".Форма." + ИмяФормы;
		Если Метаданные.НайтиПоПолномуИмени(ПолноеИмяФормы) <> Неопределено Тогда
			ИмяФормы = ПолноеИмяФормы;
		Иначе
			ИмяФормы = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ОпределениеФормыВвода // Форма ввода по назначению редактируемого поля.

Функция ИмяФормыВнутреннейКодировкиПоля(КодировкаПоля)
	
	Перем ИмяФормы;
	
	ИмяКодировкиПоля = ОбщегоНазначения.ИмяЗначенияПеречисления(КодировкаПоля);
	
	МетаданныеОбработки = Метаданные.Обработки.ИнтерфейсВводаПолейЭМД;
	
	Для Каждого Форма Из МетаданныеОбработки.Формы Цикл
		Если Форма.Имя = ИмяКодировкиПоля Тогда
			ИмяФормы = Форма.Имя;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИмяФормы;
	
КонецФункции

Функция ИмяФормыКодировкиПоляПоКлассификатору(КодировкаПоля)
	
	Перем ИмяФормы;
	
	КодПоля = КодировкаПоля.УИДЕГИСЗ;
	Вид		= КодировкаПоля.ВидКлассификатора;
	
	// Получаем имя формы (не полное) по назначению из классификатора
	Если Вид = Перечисления.ВидыКлассификаторовМинЗдрава.КодируемыеПоляCDAДокументов Тогда
		ИмяФормы = СоответствиеФормПолямПоКлассификатору_КодируемыеПоляCDA().Получить(КодПоля);
	Иначе
		ИмяФормы = СоответствиеФормПолямПоКлассификатору_ВитальныеПараметры().Получить(КодПоля);
	КонецЕсли;	
	
	Возврат ИмяФормы;
	
КонецФункции

Функция СоответствиеФормПолямПоКлассификатору_КодируемыеПоляCDA()
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить(1004, "НаличиеТрансфузийВАнамнезе"); 	// Наличие трансфузий в анамнезе.
	Соответствие.Вставить(8037, "АнатомическаяОбласть");		// Анатомическая локализация.
	Соответствие.Вставить(8007, "ИнфекционныйАнамнез");			// Перенесенное заболевание.
	Соответствие.Вставить(11060,"СведенияОПрививках");			// Сведения о профилактических прививках.
	Соответствие.Вставить(9021, "СведенияОПрививках");			// Проведенные профилактические прививки.
	Соответствие.Вставить(8038, "ВводОрганизацииСАдресом");		// Медицинская организация, в которую направлен пациент.
	Соответствие.Вставить(11015,"ВводОрганизацииСАдресом"); 	// Место, куда направлена выписка.
	
	Возврат Соответствие;
	
КонецФункции

Функция СоответствиеФормПолямПоКлассификатору_ВитальныеПараметры()
	
	Соответствие = Новый Соответствие;
	
	//Соответствие.Вставить(2, "АртериальноеДавление"); // Артериальное давление диастолическое.
	//Соответствие.Вставить(3, "АртериальноеДавление"); // Артериальное давление систолическое.
	
	Возврат Соответствие;
	
КонецФункции

#КонецОбласти

#Область СвязиНазначений

Процедура СвязьНазначенийДобавитьВСоответствиеСвязей(СоответствиеСвязей, НазначениеИсходное, НазначениеЗависимое)
	
	МассивЗависимых = СоответствиеСвязей.Получить(НазначениеИсходное);
	Если МассивЗависимых <> Неопределено Тогда
		МассивЗависимых.Добавить(НазначениеЗависимое);
	Иначе
		МассивЗависимых = ОбщегоНазначенияБИТКлиентСервер.НовыйМассив(НазначениеЗависимое);
		СоответствиеСвязей.Вставить(НазначениеИсходное, МассивЗависимых);
	КонецЕсли;
	
КонецПроцедуры

// Для взаимных равноправных связей между элементами, переданными как массив.
Процедура СвязьНазначенийДобавитьСвязанныхДругДругуВСоответствиеСвязей(СоответствиеСвязей, Назначения)
	
	Для Каждого Элемент1 Из Назначения Цикл
		Для Каждого Элемент2 Из Назначения Цикл
			Если Элемент1 <> Элемент2 Тогда
				СвязьНазначенийДобавитьВСоответствиеСвязей(СоответствиеСвязей, Элемент1, Элемент2)
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
	
Процедура СвязиНазначенийДобавитьСвязь_АртериальноеДавление(СоответствиеСвязей)
	
	ДиастДавление	= ИнтеграцияЕГИСЗВызовСервера.ЭлементКлассификатораПоУИДЕГИСЗ(2, Перечисления.ВидыКлассификаторовМинЗдрава.ВитальныеПараметры);
	СистДавление	= ИнтеграцияЕГИСЗВызовСервера.ЭлементКлассификатораПоУИДЕГИСЗ(3, Перечисления.ВидыКлассификаторовМинЗдрава.ВитальныеПараметры);
	
	Если ЗначениеЗаполнено(ДиастДавление) И ЗначениеЗаполнено(СистДавление) Тогда
		// Добавление равноправных связей.
		Назначения = ОбщегоНазначенияБИТКлиентСервер.НовыйМассив(ДиастДавление, СистДавление);
		СвязьНазначенийДобавитьСвязанныхДругДругуВСоответствиеСвязей(СоответствиеСвязей, Назначения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти