
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда 
		Объект.Прейскурант = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойПрейскурант");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	мсСтрокиКУдалению = Новый Массив;
	Для Каждого стрУслуг из Объект.ОсновныеУслуги Цикл 
		Если стрУслуг.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда 
			мсСтрокиКУдалению.Добавить(стрУслуг);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого элМассива из мсСтрокиКУдалению Цикл 
		Объект.ОсновныеУслуги.Удалить(элМассива); 
	КонецЦикла;

КонецПроцедуры
