#Область ПрограммныйИнтерфейс

// Процедура УстановитьАктивностьПоРегистратору.
//
// Параметры:
//  Регистратор	 - ДокументСсылка	 - документ.
//  Значение	 - Булево			 - значение выполнения.
//
Процедура УстановитьАктивностьПоРегистратору(Регистратор, Значение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтметкиВыполненияДействий.Период,
	               |	ОтметкиВыполненияДействий.Действие,
	               |	ОтметкиВыполненияДействий.ПрохождениеМедОсмотра,
	               |	ОтметкиВыполненияДействий.Выполнено,
	               |	ОтметкиВыполненияДействий.ДокументРегистратор
	               |ИЗ
	               |	РегистрСведений.ОтметкиВыполненияДействий КАК ОтметкиВыполненияДействий
	               |ГДЕ
	               |	ОтметкиВыполненияДействий.ДокументРегистратор = &ДокументРегистратор";
	
	Запрос.УстановитьПараметр("ДокументРегистратор", Регистратор);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Набор = РегистрыСведений.ОтметкиВыполненияДействий.СоздатьНаборЗаписей();
		Набор.Отбор.Период.Установить(Выборка.Период);
		Набор.Отбор.Действие.Установить(Выборка.Действие);
		Набор.Отбор.ПрохождениеМедОсмотра.Установить(Выборка.ПрохождениеМедОсмотра);
		Набор.Прочитать();
		
		Если Набор.Выбран() Тогда
			Запись = Набор[0];
			Запись.АктивностьЗаписи = НЕ Значение;
			Набор.Записать();
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти