
#Область ИнициализацияПриложений

Функция ПриложениеЗагружено(ДокументHTML) Экспорт
	
	Если ДокументHTML = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Если ДокументHTML.defaultView = Неопределено Или ДокументHTML.defaultView.Konva = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ЗагрузитьЗубнуюКартуВПриложении(Элемент, СтрокаJSON) Экспорт
	
	СтрокаПриложения = СтрокаJSON;
	Если ТипЗнч(СтрокаJSON) <> Тип("Строка") Тогда
		СтрокаПриложения = ОбщегоНазначенияКлиентСерверПереопределяемый.СформироватьСтрокуJSON(СтрокаJSON);
	КонецЕсли;
	
	Элемент.Документ.defaultView.init(СтрокаПриложения);
	
КонецПроцедуры

Процедура ОбновитьПриложениеЗубнойКарты(Элемент, СтрокаJSON) Экспорт
	
	СтрокаПриложения = СтрокаJSON;
	Если ТипЗнч(СтрокаJSON) <> Тип("Строка") Тогда
		СтрокаПриложения = ОбщегоНазначенияКлиентСерверПереопределяемый.СформироватьСтрокуJSON(СтрокаJSON);
	КонецЕсли;
	
	Элемент.Документ.defaultView.editCard(СтрокаПриложения);
	
КонецПроцедуры

Процедура ОбновитьСостоянияЗубовПриложения(Элемент, СтруктураАдресЗК) Экспорт
	
	СтруктураJSON = стомЗубнаяКартаМетоды.СформироватьСтруктуруОбновленияСостоянийJSON(СтруктураАдресЗК);
	ОбновитьПриложениеЗубнойКарты(Элемент, СтруктураJSON);
	
КонецПроцедуры

Процедура ОбновитьВариантыЗубовПриложения(Элемент, СтруктураАдресЗК) Экспорт
	
	СтруктураJSON = стомЗубнаяКартаМетоды.СформироватьСтруктуруОбновленияВариантовJSON(СтруктураАдресЗК);
	ОбновитьПриложениеЗубнойКарты(Элемент, СтруктураJSON);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаСобытийОтКомпонент

Процедура ОбработатьСобытиеПриложения(Форма, Элемент, ДанныеСобытия) Экспорт
	
	ПараметрыСобытия = Неопределено;
	Попытка
		ПараметрыСобытия = ПолучитьПараметрыСобытияПриложения(ДанныеСобытия);
	Исключение
	КонецПопытки;
	
	Если ПараметрыСобытия = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПараметрыСобытия.ИмяКоманды = "update" Тогда
		ВыделенныеЗубыСегменты = ОбщегоНазначенияКлиентСерверПереопределяемый.ПрочитатьСтрокуJSON(ПараметрыСобытия.ПараметрыКоманды, Истина);
		Форма.ОбновитьПараметрыПриложения(Элемент, ВыделенныеЗубыСегменты);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПараметрыСобытияПриложения(ДанныеСобытия)
	
	Если ДанныеСобытия = Неопределено Или Не ДанныеСобытия.Свойство("Event") Или 
		ДанныеСобытия.Event = Неопределено
	Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЭтоНеIE = (ТипЗнч(ДанныеСобытия.Event) <> Тип("COMОбъект"));
	Если ЭтоНеIE Тогда
		Если ДанныеСобытия.Event.additionalData = Неопределено Тогда 
			Возврат Неопределено;
		КонецЕсли;
		Возврат Новый Структура("ИмяКоманды, ПараметрыКоманды", НРег(ДанныеСобытия.Event.additionalData.commandName), ДанныеСобытия.Event.additionalData.data);
	Иначе
		Если Не ЗначениеЗаполнено(ДанныеСобытия.Element.ownerDocument.parentWindow.additionalData) Тогда 
			Возврат Неопределено;
		КонецЕсли;
		additionalData = ОбщегоНазначенияКлиентСерверПереопределяемый.ПрочитатьСтрокуJSON(ДанныеСобытия.Element.ownerDocument.parentWindow.additionalData);
		Возврат Новый Структура("ИмяКоманды, ПараметрыКоманды", НРег(additionalData.commandName), additionalData.data);
	КонецЕсли;
	
КонецФункции

Процедура ОбработатьЗагрузкуПриложения(Форма, Элемент, ДанныеЗК = Неопределено) Экспорт 
	
	Если ДанныеЗК = Неопределено Тогда 
		ДанныеЗК = Форма.стомДанныеЗубныхКарт;
		Если ДанныеЗК = Неопределено Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеЗК.ПриложениеЗагружено = ПриложениеЗагружено(Элемент.Документ);	
	
	Если ДанныеЗК.ПриложениеЗагружено Тогда 
		Если ДанныеЗК.СтруктураЗагружена Тогда
			ЗагрузитьЗубнуюКартуВПриложении(Элемент, стомЗубнаяКартаМетоды.СформироватьСтруктуруЗубнойКартыJSON(ДанныеЗК.Адрес, Истина));
		Иначе
			ЗагрузитьЗубнуюКартуВПриложении(Элемент, "");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
