#Область ПрограммныйИнтерфейс

// Формирует таблицу версий для документа приема.
//
// Параметры:
//  ВерсииШаблонов	 - ТаблицаЗначений, ДанныеФормыКоллекция - Таблица версий шаблонов приема.
//  Документ		 - ДокументСсылка.Прием, ДокументОбъект.Прием	 - Прием.
//  Дата			 - Дата	 - Дата версии.
//
Процедура ЗаполнитьТаблицуВерсийШаблонов(ВерсииШаблонов, Документ, Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = Документ.Дата;
	КонецЕсли;	
	
	ВерсииШаблонов.Очистить();
	
	ИспользуетсяВерсионирование = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ИспользоватьВерсионированиеШО");
	
	Если ИспользуетсяВерсионирование Тогда
		мсШаблоныПриема = Новый Массив;
		Для Каждого СтрокаШаблон Из Документ.ШаблоныПриема Цикл
			мсШаблоныПриема.Добавить(СтрокаШаблон.ШаблонПриема);
		КонецЦикла;
		мсВерсии = ВерсионированиеШаблонов.ПолучитьТаблицуВерсийШаблонов(мсШаблоныПриема, Дата, Истина);
		Для Каждого Версия Из мсВерсии Цикл
			ЗаполнитьЗначенияСвойств(ВерсииШаблонов.Добавить(), Версия);
		КонецЦикла;
	Иначе
		Для Каждого СтрокаШаблон Из Документ.ШаблоныПриема Цикл
			НоваяСтрока = ВерсииШаблонов.Добавить();
			НоваяСтрока.ВерсияШаблона = СтрокаШаблон.ШаблонПриема;
			
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "ШаблонОсмотра") Тогда
				НоваяСтрока.ШаблонОсмотра  = СтрокаШаблон.ШаблонПриема;
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрока, "ШаблонПриема") Тогда
				НоваяСтрока.ШаблонПриема  = СтрокаШаблон.ШаблонПриема;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

Функция СформироватьHTMLТекстПечатиОсмотраПолный(Объект, ТаблицаПараметров, ПараметрыТаблицШаблонов, ПланЛеченияРеквизит, ВерсииШаблонов, ДопПараметры) Экспорт
	
	ТекстРазрывСтраницы = РаботаСШаблонамиHTMLКлиентСервер.ПолучитьТекстHTMLРазрывСтраницы(Ложь);
	
	ИгнорироватьТекстПечатиИзТЧ		= ДопПараметры.ИгнорироватьТекстПечатиИзТЧ;
	Колонтитулы						= ДопПараметры.Колонтитулы;
	ТекущийОбъектШаблоны			= ДопПараметры.ТекущийОбъектШаблоны;
	РежимДляКлиента					= ДопПараметры.РежимДляКлиента;
	ДобавлятьШапкуШаблона			= ДопПараметры.ДобавлятьШапкуШаблона;
	ДанныеРедактируемыхЭлементов	= ДопПараметры.ДанныеРедактируемыхЭлементов;
	
	Если Колонтитулы = Неопределено Тогда
		Колонтитулы = Новый Соответствие;
	КонецЕсли;
	
	ДанныеИзображенийПоШаблонам = ДокументыПриемаСервер.СформироватьДанныеИзображенийПоШаблонам(Объект.ШаблоныПриема, ВерсииШаблонов, ДобавлятьШапкуШаблона, Объект.Дата, Объект.Филиал, РежимДляКлиента);
	ТекстыОсмотров = Новый Массив;
	
	Для Каждого СтрокаШаблона Из Объект.ШаблоныПриема Цикл
		
		ИндексШаблона = Объект.ШаблоныПриема.Индекс(СтрокаШаблона);
		
		// Формирование печатного варианта для каждого отдельного шаблона
		Если СтрокаШаблона.ВидШаблона = ПредопределенноеЗначение("Перечисление.ВидыШаблонов.HTMLШаблон")
			И (ИгнорироватьТекстПечатиИзТЧ
				Или ПустаяСтрока(СтрокаШаблона.ТекстДляПечати))
		Тогда
			Попытка
				ДанныеШаблона = Новый Структура("Шаблон, ИдентификаторСтрокиШаблона, ТекстШаблона",
					СтрокаШаблона.ШаблонПриема, СтрокаШаблона.ПолучитьИдентификатор(), СтрокаШаблона.ТекстШаблона);
				
				ДанныеТаблицШаблонов = Новый Структура("ПараметрыТаблицШаблонов, ЭталонныеСтрокиТаблиц", ПараметрыТаблицШаблонов, СтрокаШаблона.ЭталонныеСтрокиТаблиц);
				
				ДанныеСформированногоШаблона = РаботаСШаблонамиHTMLКлиентСервер.СформироватьВерсиюДляПечатиШаблонаОсмотра(Объект, ДанныеШаблона, ТаблицаПараметров,, ПланЛеченияРеквизит,,,ДанныеТаблицШаблонов);
				
				ТекстШаблонаОсмотра = ДанныеСформированногоШаблона.ТекстШаблонаТело;
				Если ТекущийОбъектШаблоны <> Неопределено Тогда
					СтрокаОбъекта = ТекущийОбъектШаблоны[Объект.ШаблоныПриема.Индекс(СтрокаШаблона)];
					Если СтрокаОбъекта.ТекстДляПечати <> ТекстШаблонаОсмотра Тогда
						СтрокаОбъекта.ТекстДляПечати = ТекстШаблонаОсмотра;
					КонецЕсли;
				КонецЕсли;
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
			КонецПопытки;
		Иначе
			ТекстШаблонаОсмотра = РаботаСDOMКлиентСервер.ПолучитьКодТелаHTMLИзКодаДокумента(СтрокаШаблона.ТекстДляПечати);
			Если ДанныеРедактируемыхЭлементов <> Неопределено Тогда
				ТекстШаблонаОсмотра = РаботаСШаблонамиHTMLКлиентСервер.ВставитьДобавленныеИзображенияВТекстHTML(ТекстШаблонаОсмотра, ИндексШаблона, ДанныеРедактируемыхЭлементов.ДобавленныеИзображения, Ложь);
				ТекстШаблонаОсмотра = РаботаСШаблонамиHTMLКлиентСервер.ДобавитьРисункиКартинокВТекстHTML(ТекстШаблонаОсмотра, ИндексШаблона, ДанныеРедактируемыхЭлементов.РисункиКартинок, Ложь);
			КонецЕсли;
		КонецЕсли;
		
		КолонтитулыШаблона = Колонтитулы.Получить(СтрокаШаблона.ШаблонПриема);
		Если КолонтитулыШаблона <> Неопределено Тогда
			ТекстШаблонаОсмотра = РаботаСШаблонамиHTMLКлиентСервер.ДобавитьКолонтитулЭЦПВТекстТела(ТекстШаблонаОсмотра, КолонтитулыШаблона, Истина);
		КонецЕсли;
		
		//ШапкаШаблонаУстановлена = Ложь;
		Если ДобавлятьШапкуШаблона И Не СтрокаШаблона.НеИспользоватьШапкуШаблона Тогда
			ТекстШаблонаОсмотра = РаботаСШаблонамиHTMLКлиентСервер.УстановитьШапкуШаблона(ТекстШаблонаОсмотра, РежимДляКлиента, Объект);
			//ШапкаШаблонаУстановлена = Истина;
		КонецЕсли;
		
		Если ДанныеРедактируемыхЭлементов <> Неопределено Тогда
			ОбработатьИзображенияШаблона(ТекстШаблонаОсмотра, ДанныеРедактируемыхЭлементов, ИндексШаблона, ДанныеИзображенийПоШаблонам);
		КонецЕсли;
		
		Если ТекстыОсмотров.Количество() > 0 Тогда
			Если СтрокаШаблона.ПечатаетсяБезПереходаНаНовуюСтраницу Тогда
				ТекстыОсмотров.Добавить("<br>");
			Иначе
				ТекстыОсмотров.Добавить(ТекстРазрывСтраницы);
			КонецЕсли;
		КонецЕсли;
		
		// Формирование полного печатного варианта
		ТекстыОсмотров.Добавить(РаботаСШаблонамиHTMLКлиентСервер.ПолучитьТекстHTMLШапкаШаблонаПриема(Объект.Дата, Объект.Врач, СтрокаШаблона.ШаблонПриема, Ложь));
		ТекстыОсмотров.Добавить(РаботаСDOMКлиентСервер.ПолучитьКодТелаHTMLИзКодаДокумента(ТекстШаблонаОсмотра));
	КонецЦикла;
	
	ТекстПечатиПриема = СтрСоединить(ТекстыОсмотров, Символы.ПС);
	
	// Исключение из печатной версии участков не_для_клиента или не_для_медкарты, если используется разделение версий.
	Если РежимДляКлиента <> Неопределено Тогда
		ТекстПечатиПриема = РаботаСШаблонамиHTMLКлиентСервер.ТекстШаблонаОсмотраПоРежиму(ТекстПечатиПриема, РежимДляКлиента);
	КонецЕсли;
	
	// Перенос стилей
	ТекстПечатиПриема = РаботаСHTMLКлиентСервер.ПеренестиСтилиИзHeadВТелоДокумента(ТекстПечатиПриема);
	
	// Установить стиль скрываемости в head, т.к. нет смысла сохранять его в печатной версии сохранять
	РаботаСШаблонамиHTMLКлиентСервер.УстановитьСтильСкрываемостиПриПечатиВЗаголовокДокумента(ТекстПечатиПриема);
	
	Возврат РаботаСDOMКлиентСервер.СформироватьПолныйТекстДокументаHTML(ТекстПечатиПриема);
	
КонецФункции

Функция ДополнительныеПараметрыФормированияПолногоОсмотра() Экспорт
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИгнорироватьТекстПечатиИзТЧ",	Ложь);
	ДопПараметры.Вставить("Колонтитулы",					Неопределено);
	ДопПараметры.Вставить("ТекущийОбъектШаблоны",			Неопределено);
	ДопПараметры.Вставить("РежимДляКлиента",				Неопределено);
	ДопПараметры.Вставить("ДобавлятьШапкуШаблона",			Истина);
	ДопПараметры.Вставить("ДанныеРедактируемыхЭлементов",	Неопределено);
	
	Возврат ДопПараметры;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьИзображенияШаблона(ТекстШаблонаОсмотра, ДанныеРедактируемыхЭлементов, ИндексШаблона, ДанныеИзображенийПоШаблонам)
	
	ДанныеРисунков = Новый Соответствие;
	Для Каждого РисунокКартинки Из ДанныеРедактируемыхЭлементов.РисункиКартинок Цикл
		Попытка
			ДанныеРисунков.Вставить(РисунокКартинки.АдресРисунка, Base64Строка(ПолучитьИзВременногоХранилища(РисунокКартинки.АдресРисунка)));
		Исключение КонецПопытки;
	КонецЦикла;
	
	мИзображения = ДанныеИзображенийПоШаблонам.Получить(ИндексШаблона);
	
	Для Каждого ДобавленноеИзображение Из ДанныеРедактируемыхЭлементов.ДобавленныеИзображения.НайтиСтроки(Новый Структура("ИдентификаторСтрокиШаблона", ИндексШаблона)) Цикл
		СтруктураИзображения = Новый Структура("Идентификатор, Расширение, ИзображениеBase64");
		СтруктураИзображения.Идентификатор = Строка(ДобавленноеИзображение.ИдентификаторИзображения);
		СтруктураИзображения.Расширение = ДобавленноеИзображение.Расширение;
		СтруктураИзображения.ИзображениеBase64 = Base64Строка(ПолучитьИзВременногоХранилища(ДобавленноеИзображение.АдресИзображения));
		мИзображения.Добавить(СтруктураИзображения);
	КонецЦикла;
	
	ТекстШаблонаОсмотра = РаботаСШаблонамиHTMLКлиентСервер.КодироватьВДвоичныйКодИзображенияHTMLТекста(ТекстШаблонаОсмотра, мИзображения, ДанныеРисунков);
	
КонецПроцедуры

#КонецОбласти