
&НаКлиенте
Процедура ОтветДа(Команда)
	ЭтаФорма.Закрыть("qr");	
КонецПроцедуры

&НаКлиенте
Процедура ОтветКарта(Команда)
	ЭтаФорма.Закрыть("card");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)    
	
	ПериодПроверки = омг_МедицинскаяДеятельность.омг_ПериодыОповещениеОказанияБезЧека().ПериодПроверки;
	ДатаНачала = НачалоДня(ТекущаяДата() - (60*60*24*ПериодПроверки)); 
	ДатаОкончания = КонецДня(ТекущаяДата());
	ДатаНачалаСтр  =  Формат(ДатаНачала,"ДФ=dd.MM.yyyy");   
	ДатаОкончанияСтр =  Формат(ДатаОкончания,"ДФ=dd.MM.yyyy"); 
	ПараметрыДоп = Новый Структура;
	ПараметрыДоп.Вставить("ДатаНачала",ДатаНачала);
	ПараметрыДоп.Вставить("ДатаОкончания",ДатаОкончания);
	Оповещение = Новый ОписаниеОповещения("ПослеОповещениеОбОказанияхБезЧека",
	ЭтотОбъект,ПараметрыДоп);	
	
	ПоказатьВопрос(Оповещение,
	"У вас имеются документы со статусом ЧЕК НЕ ПРОБИТ за период: " +ДатаНачалаСтр +" - "+ДатаОкончанияСтр + ", проверьте корректность документов. Перейти в отчет Продажи?",
	РежимДиалогаВопрос.ДаНет,
	0, // таймаут в секундах
	КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
	"Проверьте оказания услуг" // (необ.) заголовок
	);   
	
	ЭтаФорма.Элементы.Декорация1.Заголовок = "";  
	
КонецПроцедуры   

&НаКлиенте
Процедура ПослеОповещениеОбОказанияхБезЧека(Результат, Параметры) Экспорт
	
	Если  Результат = КодВозвратаДиалога.Да Тогда 
		ТекПользователь = Пользователи.ТекущийПользователь();
		Отбор = Новый Структура;
		Период = Новый СтандартныйПериод(НачалоДня(Параметры.ДатаНачала), КонецДня(Параметры.ДатаОкончания));
		Отбор.Вставить("Период", Период); 
		Отбор.Вставить("Филиал",УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекПользователь,"ОсновнойФилиал"));
		Отбор.Вставить("омг_ОтветственныйРегистратор",ТекПользователь);
		ИмяФормыТ ="Отчет.Продажи.ФормаОбъекта";
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("КлючВарианта","a8f9299a-d03d-402e-b691-ca9eac4e29fb");
		ПараметрыФормы.Вставить("СформироватьПриОткрытии",Истина);
		ПараметрыФормы.Вставить("Отбор", Отбор); 
		ПараметрыФормы.Вставить("омг_ОтветственныйРегистратор",ТекПользователь);
		ОткрытьФорму(ИмяФормыТ, ПараметрыФормы , Истина);			
		ЭтаФорма.Закрыть(); 
		
	иначе         
		
		ЭтаФорма.Закрыть(); 
		
	КонецЕсли;	
	 
КонецПроцедуры 	