
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВариантовЗубов();
КонецПроцедуры

Процедура ЗаполнитьСписокВариантовЗубов()
	
	СписокВариантовЗубов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	стомВариантыЗубов.Ссылка КАК ВариантЗуба,
	|	ВЫБОР
	|		КОГДА стомВариантыЗубныхКартСписокВариантовЗубов.ВариантЗуба ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Установлен
	|ИЗ
	|	Справочник.стомВариантыЗубов КАК стомВариантыЗубов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.стомВариантыЗубныхКарт.СписокВариантовЗубов КАК стомВариантыЗубныхКартСписокВариантовЗубов
	|		ПО (стомВариантыЗубныхКартСписокВариантовЗубов.ВариантЗуба = стомВариантыЗубов.Ссылка)
	|			И (стомВариантыЗубныхКартСписокВариантовЗубов.Ссылка = &ТекВариант)
	|ГДЕ
	|	НЕ стомВариантыЗубов.ПометкаУдаления";
	Запрос.УстановитьПараметр("ТекВариант", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СписокВариантовЗубов.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ЗаполнитьСписокВариантовЗубовОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокВариантовЗубовОбъекта()
	
	Объект.СписокВариантовЗубов.Очистить();
	Для Каждого СтрокаВариантЗуба Из СписокВариантовЗубов.НайтиСтроки(Новый Структура("Установлен", Истина)) Цикл
		
		ЗаполнитьЗначенияСвойств(Объект.СписокВариантовЗубов.Добавить(), СтрокаВариантЗуба);
		
	КонецЦикла;
	
КонецПроцедуры
