#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сотрудник = Параметры.Сотрудник;
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ИспользоватьОбменСКалендаремGoogle = ОбменСGoogle.ПолучитьЗначениеКонстантыИспользоватьОбменСКалендаремGoogle();
	Если Не ИспользоватьОбменСКалендаремGoogle Тогда
		РаботаСФормамиКлиентСервер.УстановитьВидимостьЭлементаФормы(Элементы, "ГруппаКалендариGoogle", Ложь);
	КонецЕсли;
	КалендариGoogle.Параметры.УстановитьЗначениеПараметра("ВладелецКалендаря", Сотрудник);
	СинхронизацииСотрудника.Параметры.УстановитьЗначениеПараметра("Сотрудник", Сотрудник);
	
	Если РегистрыСведений.СеансовыеДанныеGoogle.СеансовыеДанные(Сотрудник,Перечисления.ОбластиДоступаGoogle.Календарь).Количество() > 0 Тогда
		Элементы.КалендариGoogleУдалитьТекущуюСинхронизациюПользователя.Доступность = Истина;
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Google_Синхронизировать(Команда)
	
	Если Сотрудник.Пустая() Тогда
		Сообщить("Необходимо сначала записать сотрудника!");
	Иначе
		СинхронизироватьНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьНаКлиенте()
	
	Элементы.СинхронизацияДанных.Видимость = Истина;
	ПодключитьОбработчикОжидания("ПродолжитьСинхронизироватьНаКлиенте", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСинхронизироватьНаКлиенте()
	
	ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	ПараметрыОбработчикаОжидания.МаксимальныйИнтервал = 5;
	
	СинхронизироватьНаСервере();           
	Если ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(СеансовыеДанные) Тогда
		НачатьАвторизацию();
	Иначе
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура СинхронизироватьНаСервере()
	
	ОбменСGoogle.ИнициализироватьУзелПланаОбменаДляКалендаряGoogle();
	ОбменСGoogle.ИнициализироватьСеансовыеДанные(
	СеансовыеДанные,
	Сотрудник,
	Перечисления.ОбластиДоступаGoogle.Календарь);
	
	Если ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(СеансовыеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	СеансовыеДанные.Вставить("Пользователь", Сотрудник);
	
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
	УникальныйИдентификатор,
	"ОбменСGoogle.СинхронизироватьGoogleCalendar",
	СеансовыеДанные,,);
	
	ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	
	ПересчитатьЗаявкиGoogleНаСервере(Сотрудник)

КонецПроцедуры

&НаКлиенте
Процедура НачатьАвторизацию()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьРезультатЗапросаТокена", ЭтотОбъект);
	ОткрытьФорму(
	"РегистрСведений.СеансовыеДанныеGoogle.Форма.ЗапросТокена",
	Новый Структура("ОписанияОбластейДоступа, ИДПриложения", ОбменСGoogleКлиентСервер.ОписанияОбластейДоступаКалендарь(), ОбменСGoogle.ИдПриложенияДляНовойСинхронизации()),
	ЭтаФорма,,,,
	ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатЗапросаТокена(Результат, Параметры) Экспорт
	
	СеансовыеДанные = Результат;
	
	Если ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(СеансовыеДанные) Тогда
		Элементы.СинхронизацияДанных.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	СинхронизироватьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Если ОбменСGoogleКлиентСервер.НеЗаполненТокенДоступа(СеансовыеДанные)
		ИЛИ ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 
		Элементы.СинхронизацияДанных.Видимость = Ложь;
		Элементы.КалендариGoogleУдалитьТекущуюСинхронизациюПользователя.Доступность = Истина;
		Элементы.СинхронизацииСотрудника.Обновить();
		Элементы.КалендариGoogle.Обновить();
	Иначе
		ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания(
		"Подключаемый_ПроверитьВыполнениеЗадания",
		ПараметрыОбработчикаОжидания.ТекущийИнтервал,
		Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура Google_ДобавитьКалендарь(Команда)
	СтруктураПараметров = Новый Структура("ВладелецКалендаря", Сотрудник);
	ОткрытьФорму("Справочник.КалендариСотрудников.ФормаОбъекта", СтруктураПараметров, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТекущуюСинхронизациюПользователя(Команда)
	
	Если Вопрос("Вы действительно хотите отвязать аккаунт от сотрудника? 
		|Данное действие не отменить. Все календари будут помечены на удаление, как и заявки", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		УдалитьТекущуюСинхронизациюПользователяНаСервере(Сотрудник);
		Элементы.СинхронизацииСотрудника.Обновить();
		Элементы.КалендариGoogle.Обновить();
		Элементы.КалендариGoogleУдалитьТекущуюСинхронизациюПользователя.Доступность = Ложь;
		
		СеансовыеДанные = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьТекущуюСинхронизациюПользователяНаСервере(СотрудникСсылка)
	
	РегистрыСведений.СеансовыеДанныеGoogle.УдалитьСеансовыеДанные(СотрудникСсылка,Перечисления.ОбластиДоступаGoogle.Календарь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьЗаявкиGoogle(Команда)
	ПересчитатьЗаявкиGoogleНаСервере(Сотрудник);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПересчитатьЗаявкиGoogleНаСервере(СотрудникСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заявка.Ссылка
		|ИЗ
		|	Документ.Заявка КАК Заявка
		|ГДЕ
		|	НЕ Заявка.ПометкаУдаления
		|	И (Заявка.Сотрудник = &Сотрудник
		|			ИЛИ Заявка.Работы.Сотрудник = &Сотрудник)
		|	И Заявка.ДатаНачала >= &ТекущаяДата";
	
	Запрос.УстановитьПараметр("Сотрудник", СотрудникСсылка);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбменСGoogle.ОбменСGoogleРегистрацияЗаявкиПриЗаписи(ВыборкаДетальныеЗаписи.Ссылка,Ложь);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
