#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Пациент") Тогда
		Клиент = Параметры.Пациент;
	КонецЕсли;
	Если Параметры.Свойство("МедицинскаяКарта") Тогда
		МедицинскаяКарта = Параметры.МедицинскаяКарта;
	КонецЕсли;
	Если Параметры.Свойство("Дата") Тогда
		Дата = Параметры.Дата;
	Иначе
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Элементы.МедицинскаяКарта.СписокВыбора.ЗагрузитьЗначения(Стационар.ПолучитьМедКартыСтационара(Клиент, Истина));
	Если Не ЗначениеЗаполнено(МедицинскаяКарта) и Элементы.МедицинскаяКарта.СписокВыбора.Количество()>0 Тогда
		МедицинскаяКарта = Элементы.МедицинскаяКарта.СписокВыбора[0].Значение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МедицинскаяКарта) Тогда
		ВывестиТЛ();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	ВывестиТЛ();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЭлементПриИзменении(Элемент)
		
	Если ЗначениеЗаполнено(МедицинскаяКарта) Тогда
		ВывестиТЛ();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Элементы.МедицинскаяКарта.СписокВыбора.ЗагрузитьЗначения(Стационар.ПолучитьМедКартыСтационара(Клиент, Истина));
	Если Элементы.МедицинскаяКарта.СписокВыбора.Количество() > 0 Тогда
		
		МедицинскаяКарта = Элементы.МедицинскаяКарта.СписокВыбора[0].Значение;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МедицинскаяКарта) Тогда
		ВывестиТЛ();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВывестиТЛ()
	
	Отчеты.ЖурналТрансфузий.Создать().СформироватьОтчет(ТабличныйДокумент, Клиент, МедицинскаяКарта);
	
КонецПроцедуры

#КонецОбласти
