#Область ПрограммныйИнтерфейс

Функция ФайлСуществует(Знач ПутьКФайлу) Экспорт
	
	Файл = Новый Файл(ПутьКФайлу);
	Возврат Файл.Существует();
	
КонецФункции

Функция ЕстьПраваНаИзмененияВКаталоге(Знач ПутьККаталогу) Экспорт
	
	Если Не ФайлСуществует(ПутьККаталогу) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Каталог = Новый Файл(ПутьККаталогу);
	
	Если Не Каталог.ЭтоКаталог() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВложенныйКаталог = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьККаталогу) + Строка(Новый УникальныйИдентификатор);
	
	Попытка
		СоздатьКаталог(ВложенныйКаталог);
		УдалитьФайлы(ВложенныйКаталог);
		
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции

#КонецОбласти