#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Клиент") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Клиент", Параметры.Клиент);
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ТекущийПрием") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ТекущийПрием", Параметры.ТекущийПрием);
		ЗаполняемыйДокумент = Параметры.ТекущийПрием;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ШаблонПриема") Тогда
		ШаблонПриема = Параметры.ШаблонПриема;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
	// Сохраненные настройки формы
	ОчищатьПараметрыБезЗаполнения = РаботаСФормамиСервер.ПолучитьНастройкуФормы(КлючНастроекФормы(), "ОчищатьПараметрыБезЗаполнения", Ложь);
	ОтборТолькоТотЖеШаблон		  = РаботаСФормамиСервер.ПолучитьНастройкуФормы(КлючНастроекФормы(), "ОтборТолькоТотЖеШаблон", Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЭтотЖеШаблон(Команда)
	Элементы.СписокТолькоТотЖеШаблон.Пометка = Не Элементы.СписокТолькоТотЖеШаблон.Пометка;
	Если Элементы.СписокТолькоТотЖеШаблон.Пометка Тогда
		РаботасФормамиКлиент.УстановитьОтборСписка("ШаблонПриема", ШаблонПриема, Список, ВидСравненияКомпоновкиДанных.Равно);
	Иначе
		РаботасФормамиКлиент.СнятьОтборСписка("ШаблонПриема", Список);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда) 
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		СтруктураВозврата = Новый Структура("ПриемОснование, ШаблонОснование", ТекущиеДанные.Ссылка, ТекущиеДанные.ШаблонПриема); 
		СтруктураВозврата.Вставить("ПриемОснование", ТекущиеДанные.Ссылка);
		СтруктураВозврата.Вставить("ШаблонОснование", ТекущиеДанные.НомерСтроки - 1); // Индекс строки шаблона в приёме.
		СтруктураВозврата.Вставить("ОчищатьПараметрыБезЗаполнения", ОчищатьПараметрыБезЗаполнения);
		
		НастройкиФормы = Новый Структура;
		НастройкиФормы.Вставить("ОтборТолькоТотЖеШаблон", Элементы.СписокТолькоТотЖеШаблон.Пометка);
		НастройкиФормы.Вставить("ОчищатьПараметрыБезЗаполнения", ОчищатьПараметрыБезЗаполнения);
		
		РаботаСФормамиСервер.СохранитьНастройкиФормы(НастройкиФормы, КлючНастроекФормы()); 
		
		Закрыть(СтруктураВозврата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Выбрать(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Функция КлючНастроекФормы()
	Возврат "Прием_ВыборПриемаДляЗаполненияШаблона";
КонецФункции

#КонецОбласти