
// Возвращает настройки формирования наименования события google
// 
// Возвращаемое значение:
// Структура  - Свойства: Фамилия, Имя, Отчество, Телефон
//				Значения: Булево. Истина - печатать полностью, Ложь - инициал, Неопределено - не печатать
//
Функция ПолучитьНастройкиФормированияНаименованияСобытияGoogle() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтрокаНастройки = Константы.НастройкиФормированияПредставленияКлиентаGoogle.Получить(); 
	
	Если ТипЗнч(СтрокаНастройки) = Тип("Строка") И ЗначениеЗаполнено(СтрокаНастройки)  Тогда 
		
		Возврат СтрокаНастройки; 
		
	Иначе // Настройки по умолчанию
		
		Возврат "Ф. ИМЯ ОТЧЕСТВО ТЕЛЕФОН"; 
		
	КонецЕсли;
	
КонецФункции