#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Дата = ?(Параметры.Свойство("Дата"), Параметры.Дата, ТекущаяДата());
	Список.Параметры.УстановитьЗначениеПараметра("Дата", Дата);
	
	Регистратор = ?(Параметры.Свойство("Регистратор"), Параметры.Регистратор, Документы.УстановкаУсловийПребывания.ПустаяСсылка());
	Список.Параметры.УстановитьЗначениеПараметра("Регистратор", Регистратор);
	
	Клиент = ?(Параметры.Свойство("Клиент"), Параметры.Клиент, Справочники.Клиенты.ПустаяСсылка());
	Список.Параметры.УстановитьЗначениеПараметра("Клиент", Клиент);
	
	Если Параметры.Свойство("Подразделение") Тогда
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец.Подразделение");
		Отбор.Использование = Истина;
		Отбор.ПравоеЗначение = Параметры.Подразделение;
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	Если Параметры.Свойство("Филиал") Тогда
		Отбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец.Подразделение.Филиал");
		Отбор.Использование = Истина;
		Отбор.ПравоеЗначение = Параметры.Филиал;
		Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	
	БлокироватьВыборЗанятых = Параметры.Свойство("БлокироватьВыборЗанятых");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.Список.ТекущиеДанные.Занято <> 2 И БлокироватьВыборЗанятых Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, "Койка занята или недоступна!");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаСервереБезКонтекста
Функция ПолучитьПодразделение(Койка)
	
	Если ЗначениеЗаполнено(Койка.Владелец) Тогда
		Возврат Койка.Владелец.Подразделение;	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти