
Функция ПолучитьТекстСообщения(Тип, Язык = 0) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ТекстыАвтоматическихСообщений.Тип КАК Тип,
	               |	iga_ТекстыАвтоматическихСообщений.Текст КАК Текст
	               |ИЗ
	               |	РегистрСведений.iga_ТекстыАвтоматическихСообщений КАК iga_ТекстыАвтоматическихСообщений
	               |ГДЕ
	               |	iga_ТекстыАвтоматическихСообщений.Тип = &Тип
	               |	И (iga_ТекстыАвтоматическихСообщений.Язык.Код = &Код
	               |			ИЛИ iga_ТекстыАвтоматическихСообщений.Язык = &Код)";
	Запрос.УстановитьПараметр("Тип", Тип);
	Запрос.УстановитьПараметр("Код", Язык);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Текст;
	Иначе
		
		ИндексПеречисления = Перечисления.iga_ТипыТекстовСообщений.Индекс(Тип);
		
		ТекстПоУмолчанию = Перечисления.iga_ТипыТекстовСообщений.ТекстПоУмолчанию(Тип);
		
		Возврат ТекстПоУмолчанию;
	КонецЕсли;
	
КонецФункции                          

Функция ПолучитьСтрокуСсылки(Идентификатор)
	
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	// Ищем фрагмент Ref="ИмяБазы"
	НачалоИмени = Найти(СтрокаСоединения, "Ref=""") + 5;
	КонецИмени = Найти(Сред(СтрокаСоединения, НачалоИмени), """");
	ИмяБазы = Сред(СтрокаСоединения, НачалоИмени, КонецИмени - 1);
	
	
	Ссылка = "https://1c.divera.kz/" + ИмяБазы + "/hs/int-services/med/image?id=" + Идентификатор;

	Возврат Ссылка;
	
КонецФункции
